{
  "id": "692251cb53dd9d7326d33d41",
  "slug": "accord-project",
  "name": "Accord Project",
  "category": "Programming languages",
  "description": "Open source software for smart legal contracts",
  "image_url": "https://summerofcode.withgoogle.com/media/org/accord-project/1q3vpch01xpsriu9-360.png",
  "img_r2_url": "https://pub-268c3a1efc8b4f8a99115507a760ca14.r2.dev/accord-project.webp",
  "logo_r2_url": null,
  "url": "https://accordproject.org",
  "active_years": [
    2020,
    2021,
    2024,
    2025
  ],
  "first_year": 2020,
  "last_year": 2025,
  "is_currently_active": true,
  "technologies": [
    "javascript",
    "react",
    "compiler",
    "ocaml",
    "coq",
    "python",
    "json",
    "artificial intelligence"
  ],
  "topics": [
    "compilers",
    "ai",
    "legal",
    "smart contracts",
    "blockchain",
    "natural language processing",
    "data modeling",
    "legal technology",
    "contract management",
    "document assembly"
  ],
  "total_projects": 13,
  "stats": {
    "avg_projects_per_appeared_year": 3.25,
    "projects_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": null,
      "year_2019": null,
      "year_2020": 2,
      "year_2021": 3,
      "year_2022": null,
      "year_2023": null,
      "year_2024": 3,
      "year_2025": 5
    },
    "students_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": null,
      "year_2019": null,
      "year_2020": 2,
      "year_2021": 3,
      "year_2022": null,
      "year_2023": null,
      "year_2024": 3,
      "year_2025": 5
    },
    "total_students": 13
  },
  "years": {
    "year_2016": null,
    "year_2017": null,
    "year_2018": null,
    "year_2019": null,
    "year_2020": {
      "num_projects": 2,
      "projects": [
        {
          "code_url": "https://accordproject.org/news/gsoc-2020-cicero-word-add-in/",
          "description": "<p>A Cicero extension for Microsoft Word will enable lawyers to write “Smart Legal Contracts”  directly on the Word document itself. This will extend the usage of Accord Project templates to non-technical users as well.  Thus, greatly expanding the accessibility to technology.</p>\n",
          "difficulty": null,
          "id": "proj_accord-project_2020_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5107817310060544/",
          "proposal_id": null,
          "short_description": "A Cicero extension for Microsoft Word will enable lawyers to write “Smart Legal Contracts”  directly on the Word document itself. This will extend...",
          "slug": "cicero-word-add-in",
          "status": "completed",
          "student_name": "Aman Sharma-1",
          "student_profile": null,
          "tags": [],
          "title": "Cicero Word Add-In"
        },
        {
          "code_url": "https://github.com/accordproject/ergo/pull/777",
          "description": "<p>Implement a new Web Assembly compiler backend for Accord Project's smart contract language (Ergo). This will allow Accord Project users to deploy their contracts to any WASM platform or allow any WASM user to call Accord Project templates.</p>\n",
          "difficulty": null,
          "id": "proj_accord-project_2020_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5212233333735424/",
          "proposal_id": null,
          "short_description": "Implement a new Web Assembly compiler backend for Accord Project's smart contract language (Ergo). This will allow Accord Project users to deploy...",
          "slug": "wasm-support-for-accord-project-templates",
          "status": "completed",
          "student_name": "Patrik Keller",
          "student_profile": null,
          "tags": [
            "web",
            "backend"
          ],
          "title": "WASM support for Accord Project Templates"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2020/organizations/5947521500708864/"
    },
    "year_2021": {
      "num_projects": 3,
      "projects": [
        {
          "code_url": "https://accordproject.org/news/gsoc-2021-ciceromark-ooxml-roundtrip-conversion/",
          "description": "<p>The project aims at dealing with the conversion of <strong>CiceroMark to DOCX (OOXML) and vice versa</strong>. In the first portion, we are gonna improve the add-in by improving the existing features and addition of new features which generally includes the ergo expressions and inline blocks of a template. Apart from these, there will be testing of data to ensure that the correct data is entered into the variable fields to avoid any inconsistency. The second portion involves the conversion of the <strong>OOXML to CiceroMark</strong>. In this, improvements will be made to the OOXML transformer present <a href=\"https://github.com/accordproject/markdown-transform/tree/algoo-ooxml\" target=\"_blank\">here</a>. The current transformer works only for very basic OOXML. We need to extend the functionalities of the transformer to support more ciceromark and commonmark classes like lists, optional, inline, ergo formula blocks. In this way, we will ensure more flexibility and portability with the round trip transformation of the smart clause templates.</p>\n",
          "difficulty": null,
          "id": "proj_accord-project_2021_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6365179587067904/",
          "proposal_id": null,
          "short_description": "The project aims at dealing with the conversion of CiceroMark to DOCX (OOXML) and vice versa. In the first portion, we are gonna improve the add-in...",
          "slug": "ciceromark-ooxml",
          "status": "completed",
          "student_name": "Kushal Kumar",
          "student_profile": null,
          "tags": [
            "ml",
            "ai"
          ],
          "title": "CiceroMark<->OOXML"
        },
        {
          "code_url": "https://github.com/accordproject/labs-cicero-classify",
          "description": "<p>Mapping between the natural language text of a contract and attempting to classify data types such as monetary amounts, dates and legal specific terms such as agreement parties, etc. into cicero variables from the existing model library.</p>\n<p>Therefore, users can export a smart legal contract by natural language contract text.</p>\n<h3>How to do it?</h3>\n<h4>A. Data Mapping using NER by RoBERTa.</h4>\n<p>Build a scaleable NER model by Adapter Transformers based on RoBERTa.</p>\n<p>The model also have Active Learning pipelines. User can define their own custom data type label then upload data and train the Adapter. By doing so, the model will recognize their new tag.</p>\n<h4>B. Suggest about templates by Classification Model</h4>\n<p>When users first upload their natural language contract, NLP model will tell them which smart legal contract template is suitable. So users can use or fine-tune the contract easily.</p>\n<h4>C. Identification contract variables by BERT QA Model</h4>\n<p>Input contract text, NLP model will suggest user which they need to put onto smart legal contract's variables.</p>\n<h4>D. API backend.</h4>\n<p>User can call the NLP model by API. Provide a Swagger UI Documents and plenty of examples.</p>\n<h3>For more detail, please <a href=\"https://github.com/accordproject/labs-cicero-classify\" target=\"_blank\">go to README in the GitHub Repo</a></h3>\n",
          "difficulty": null,
          "id": "proj_accord-project_2021_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5699091228524544/",
          "proposal_id": null,
          "short_description": "Mapping between the natural language text of a contract and attempting to classify data types such as monetary amounts, dates and legal specific...",
          "slug": "automatic-identification-and-classification-of-contract-data-types-with-nlp",
          "status": "completed",
          "student_name": "EasonC13",
          "student_profile": null,
          "tags": [
            "api",
            "ai",
            "ui",
            "backend"
          ],
          "title": "Automatic Identification And Classification of Contract Data Types with NLP"
        },
        {
          "code_url": "https://sanketshevkar.github.io/gsoc-submission/",
          "description": "<p>The project aims at developing a feature wherein the template developers can sign the templates (to authenticate the source) they developed. The contracts derived from the templates can be then signed by the parties involved in the agreement (to authenticate the signatories).</p>\n",
          "difficulty": null,
          "id": "proj_accord-project_2021_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/4719780132552704/",
          "proposal_id": null,
          "short_description": "The project aims at developing a feature wherein the template developers can sign the templates (to authenticate the source) they developed. The...",
          "slug": "signing-template-and-signing-contracts",
          "status": "completed",
          "student_name": "Sanket Shevkar",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Signing Template and Signing Contracts"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2021/organizations/4826533859950592/"
    },
    "year_2022": null,
    "year_2023": null,
    "year_2024": {
      "num_projects": 3,
      "projects": [
        {
          "code_url": "https://accordproject.org/news/gsoc-2024-alias-support-for-concerto",
          "description": "The objective of this project is to provide alias support in concerto language . For example import statement like  \"import {document as d} from Library\"  to be supported by the end of this project. This would allow us to import two models with same name in a single file by aliasing them to different names which is currently not supported in the language. \n\nDoing this would require changes in both the concerto-parser and concerto-runtime . The project requires compiler design and programming language knowledge. The stack used in project is NodeJs and written in typescript. The concerto-parse is written in PEGJS.",
          "difficulty": null,
          "id": "proj_accord-project_2024_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/7ZJTW2PX/",
          "proposal_id": null,
          "short_description": "The objective of this project is to provide alias support in concerto language . For example import statement like \"import {document as d} from...",
          "slug": "alias-support-enhancing-model-flexibility-in-concerto",
          "status": "completed",
          "student_name": "<jaskeerat>",
          "student_profile": null,
          "tags": [
            "typescript",
            "ui"
          ],
          "title": "Alias Support: Enhancing Model Flexibility in Concerto"
        },
        {
          "code_url": "https://accordproject.org/news/gsoc-2024-model-creation-ai-assistant-co-pilot/",
          "description": "The objective of this proposal is to design and implement an in-context AI assistant, named Co-Pilot, tailored for assisting users in creating Concerto models. This AI assistant will be seamlessly integrated into the existing VSCode web-extension, Playground, or other chatbot marketplaces, providing users with intuitive access to AI-driven suggestions and guidance during model creation. Co-Pilot will support multiple foundational AI models, such as OpenAI, Bard, Anthropic, among others, and allow users to configure API keys for their preferred models. Additionally, the proposal aims to engineer LLM prompts effectively to aid users in editing Concerto models and measure the effectiveness of these prompts.",
          "difficulty": null,
          "id": "proj_accord-project_2024_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/BFaXoqVC/",
          "proposal_id": null,
          "short_description": "The objective of this proposal is to design and implement an in-context AI assistant, named Co-Pilot, tailored for assisting users in creating...",
          "slug": "model-creation-ai-assistant-co-pilot-kshitij-pathania",
          "status": "completed",
          "student_name": "Kshitij Pathania",
          "student_profile": null,
          "tags": [
            "web",
            "api",
            "ml",
            "ai",
            "ui"
          ],
          "title": "Model Creation AI Assistant (Co-Pilot): Kshitij Pathania"
        },
        {
          "code_url": "https://accordproject.org/news/gsoc-2024-template-playground-development/",
          "description": "Accord Project Playground: Empowering Developers Through Interactive Learning Problem: The Accord Project offers powerful functionalities for smart legal contracts, but grasping these concepts can be challenging for developers with varying backgrounds. Existing documentation and resources may not provide an engaging and interactive learning experience. Solution: Proposing and developing a user-friendly Accord Project Playground. This web-based platform will provide an interactive environment for developers to experiment with Accord Project features through: Modern UI/UX Design: An intuitive and visually appealing interface that aligns with the Accord Project's branding. Interactive Code Samples: Live code editing and preview capabilities to demonstrate functionalities in a hands-on manner. Integrated Learning Resources: Comprehensive documentation, tutorials, and search functionality for efficient learning. Sample Management: Functionality to save and export user-created Accord Project code (specific format to be determined). Integration of Live Chat-Bot. Open-Source Principles: Adherence to open-source best practices for transparency, collaboration, and maintainability. Deliverables: * A fully functional Accord Project Playground website with interactive learning features. * Comprehensive documentation for the playground itself, including installation, setup, and usage guides. * A well-structured codebase with clear version control and adherence to coding standards. * A thriving contributor's community with a contributor's guide outlining participation procedures. Impact: By creating this Accord Project Playground, I aim to: * Lower the barrier to entry for developers interested in Accord Project technology. * Foster a more engaged and active Accord Project developer community. * Enhance the overall accessibility and user experience of the Accord Project.",
          "difficulty": null,
          "id": "proj_accord-project_2024_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/iY7TZu99/",
          "proposal_id": null,
          "short_description": "Accord Project Playground: Empowering Developers Through Interactive Learning Problem: The Accord Project offers powerful functionalities for smart...",
          "slug": "accord-project-template-playground",
          "status": "completed",
          "student_name": "Vinyl Davyl",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "ui",
            "ux"
          ],
          "title": "ACCORD Project Template Playground"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2024/organizations/accord-project/"
    },
    "year_2025": {
      "num_projects": 5,
      "projects": [
        {
          "code_url": null,
          "description": "Configurable linter for Concerto (used in Accord Project for contract data models) validates syntax and AST against a set of rules, written with using of Spectral framework. Rules ensure best practice for the model by enforce naming conventions (e.g., camel-case scalars), restrict features (e.g., maps), and mandatory fields (e.g. , @Term), Each rule has tests to prove it works and documentation guide to help users. Results show up in Concerto command line or inside Accord’s VS Code plugin. It cuts down manual checks and keeps your code following team/tech rules.\nThe project aims to advance the Concerto modeling language and its tooling by achieving the following goals: (1) ensure the language is feature-complete to compete with top modeling languages globally; (2) ensure seamless integration of the linter with existing Concerto tools without disrupting current workflows; (3) implement a fast and lightweight linter using efficient algorithms and data structures; and (4) design practical rules based on real user challenges, with the ability to toggle rules on/off and verify functionality through comprehensive testing.",
          "difficulty": null,
          "id": "proj_accord-project_2025_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/nXoLhssM",
          "proposal_id": "rMXVO6rj",
          "short_description": "Configurable linter for Concerto (used in Accord Project for contract data models) validates syntax and AST against a set of rules, written with...",
          "slug": "linter-for-concerto",
          "status": "in-progress",
          "student_name": "Ahmed Gaper",
          "student_profile": null,
          "tags": [
            "ml",
            "ai",
            "ui"
          ],
          "title": "Linter for Concerto"
        },
        {
          "code_url": null,
          "description": "The project aims to incorporate AI features into Template Playground to facilitate the creation of Templates and Concerto models. The ability to generate Accord Project Templates from user submitted text will be implemented. Users will be able to chat with their chosen LLM and get an understanding of how the whole ecosystem of Accord Project works in tandem to produce agreements. The editor in Template Playground will be enhanced with the ability of providing AI powered inline suggestions.",
          "difficulty": null,
          "id": "proj_accord-project_2025_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/HN4nACxp",
          "proposal_id": "htGHK2pA",
          "short_description": "The project aims to incorporate AI features into Template Playground to facilitate the creation of Templates and Concerto models. The ability to...",
          "slug": "incorporating-ai-into-template-playground",
          "status": "in-progress",
          "student_name": "Akshat-Batra",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Incorporating AI into Template Playground"
        },
        {
          "code_url": null,
          "description": "Concerto, the core modeling language of the ACCORD PROJECT, is critical for smart legal contracts and domain modeling. This project aims to migrate from the current testing framework mocha to vitest which will enhance the performance, execution time and debugging capabilities. This process can be automated by the combination of vitest-codemod, regex transformations, ai assistance and some manual scripts required for handling complex test cases which cannot be automated.\nHere are the deliverables:\n1. Migration from Mocha, Chai, Sinon to Vitest for all Concerto implementation.\n2. A new Concerto conformance package which will be a standalone validation test package for all Concerto implementations.",
          "difficulty": "advanced",
          "id": "proj_accord-project_2025_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/HXlbSlM3",
          "proposal_id": "Hz1eBvmZ",
          "short_description": "Concerto, the core modeling language of the ACCORD PROJECT, is critical for smart legal contracts and domain modeling. This project aims to migrate...",
          "slug": "specification-conformance-tests",
          "status": "in-progress",
          "student_name": "Anshukumar123975",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Specification Conformance Tests"
        },
        {
          "code_url": null,
          "description": "The goal of this project is to enhance the usability of Decorator Command Set (DCS) data by developing a utility/method to convert verbose, complex JSON formats into a more human readable YAML representation and back again. Currently, it is highly verbose to read, write, and edit DCS JSON files.  The plan is to implement a converter that turns DCS JSON objects into a simple YAML format and back again. The new YAML will be less verbose and more readable, helping people work with DCS better. By the end, a fully integrated converter will be delivered, complete with tests and proper documentation.",
          "difficulty": "advanced",
          "id": "proj_accord-project_2025_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/QXIwAMbZ",
          "proposal_id": "HGOR5VDd",
          "short_description": "The goal of this project is to enhance the usability of Decorator Command Set (DCS) data by developing a utility/method to convert verbose, complex...",
          "slug": "decorator-command-set-json-yaml-converter",
          "status": "in-progress",
          "student_name": "Asmit Phuyal",
          "student_profile": null,
          "tags": [
            "ml",
            "ai"
          ],
          "title": "Decorator Command Set JSON <-> YAML Converter"
        },
        {
          "code_url": null,
          "description": "Template Playground is a web-based tool that allows users to create, edit, and test smart legal contract templates. Currently, the application relies on Ant Design for its UI components, which increases bundle size, and limits customization. This project aims to migrate the entire UI from Ant Design to Tailwind CSS, making the platform more lightweight, efficient, and maintainable.\nAlong with the migration, I propose a new layout design. This new design will be introduced to enhance usability, responsiveness, and overall user experience. The goal is to create a modern, intuitive, and visually appealing interface that improves workflow efficiency for users interacting with contract templates.",
          "difficulty": null,
          "id": "proj_accord-project_2025_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/jxFIqloY",
          "proposal_id": "OVjOmjdl",
          "short_description": "Template Playground is a web-based tool that allows users to create, edit, and test smart legal contract templates. Currently, the application relies...",
          "slug": "migration-of-template-playground-to-use-tailwind-css-playground-redesign",
          "status": "in-progress",
          "student_name": "Mahesh Patil",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "ui"
          ],
          "title": "Migration of Template Playground to use Tailwind CSS & Playground Redesign"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2025/organizations/accord-project"
    }
  },
  "first_time": false,
  "contact": {
    "email": "admin@accordproject.org",
    "guide_url": "https://github.com/accordproject/techdocs/blob/master/CONTRIBUTING.md",
    "ideas_url": "https://github.com/accordproject/techdocs/wiki/Google-Summer-of-Code-2025-Ideas-List",
    "irc_channel": "https://discord.gg/Zm99SKhhtA",
    "mailing_list": null
  },
  "social": {
    "blog": "https://accordproject.org/news",
    "discord": "https://discord.gg/Zm99SKhhtA",
    "facebook": null,
    "github": null,
    "gitlab": null,
    "instagram": null,
    "linkedin": null,
    "mastodon": null,
    "medium": null,
    "reddit": null,
    "slack": null,
    "stackoverflow": null,
    "twitch": null,
    "twitter": "https://twitter.com/accordhq",
    "youtube": null
  },
  "meta": {
    "version": 1,
    "generated_at": "2026-01-25T15:28:52.898Z"
  }
}