{
  "id": "692251cb53dd9d7326d33d42",
  "slug": "aerospaceresearchnet",
  "name": "AerospaceResearch.net",
  "category": "Science and medicine",
  "description": "making space together",
  "image_url": "https://lh3.googleusercontent.com/Cuse4sTixkecf8wRwx4LW93vB8rj1hu6e-cKUrxa_jMrTkLDct_Xhw2nBd0Db6SmwcjMxeGEuN2HG9yp3gkRqXlbLeDdR0NxGJnU07iTeFHJug",
  "img_r2_url": "https://pub-268c3a1efc8b4f8a99115507a760ca14.r2.dev/aerospaceresearchnet.webp",
  "logo_r2_url": null,
  "url": "http://aerospaceresearch.net/",
  "active_years": [
    2017,
    2018,
    2019,
    2020,
    2021
  ],
  "first_year": 2017,
  "last_year": 2021,
  "is_currently_active": false,
  "technologies": [
    "python",
    "c",
    "c++",
    "vhdl",
    "boinc",
    "java",
    "sqlite",
    "raspberry pi",
    "machine learning",
    "sdr"
  ],
  "topics": [
    "distributed computing",
    "space applications",
    "software defined radio",
    "cubesats",
    "simulations",
    "signal processing"
  ],
  "total_projects": 30,
  "stats": {
    "avg_projects_per_appeared_year": 6,
    "projects_by_year": {
      "year_2016": null,
      "year_2017": 6,
      "year_2018": 6,
      "year_2019": 7,
      "year_2020": 5,
      "year_2021": 6,
      "year_2022": null,
      "year_2023": null,
      "year_2024": null,
      "year_2025": null
    },
    "students_by_year": {
      "year_2016": null,
      "year_2017": 6,
      "year_2018": 6,
      "year_2019": 7,
      "year_2020": 5,
      "year_2021": 6,
      "year_2022": null,
      "year_2023": null,
      "year_2024": null,
      "year_2025": null
    },
    "total_students": 29
  },
  "years": {
    "year_2016": null,
    "year_2017": {
      "num_projects": 6,
      "projects": [
        {
          "code_url": "http://aerospaceresearch.net/?p=350",
          "description": "<p>The Universal Space Operations Center, USOC, is an open-source tool that allows a simple and easy creation of a working groundstation to aid space projects. The program structure is divided into three main components:</p>\n<ol>\n<li>Communication software</li>\n<li>Graphical user interface (GUI)</li>\n<li>Controller for interaction between communication software and graphical user interface</li>\n</ol>\n<p>Due to the fact that the functionality of every experiment should be checked before lift-off, a communication software for up- und downlink is required. Based on the input of the user in a configuration file, the GUI and partially also the controllers can be written automatically. In this matter, USOC generates appropriate functionalities within the controllers for individual GUI contents, which can then be adapted manually. Changes in the configuration file are detected, localized and the corresponding GUI structures and controller functionalities are regenerated. If these are manually written functionalities, they are recognized and not overwritten. USOC also brings pre-coded functions, such as communication via serial ports and/or the Iridium satellite network, as well as a three-dimensional visualization of GNSS data.</p>\n",
          "difficulty": "beginner",
          "id": "proj_aerospaceresearchnet_2017_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6437495088611328/",
          "proposal_id": null,
          "short_description": "The Universal Space Operations Center, USOC, is an open-source tool that allows a simple and easy creation of a working groundstation to aid space...",
          "slug": "universal-space-operations-center",
          "status": "completed",
          "student_name": "Victor Hertel",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Universal Space Operations Center"
        },
        {
          "code_url": "https://aerospaceresearch.net/?p=299",
          "description": "<p>This project is directed towards obtaining the Keplerian orbit parameters from the jittery position vector obtained by de-noising and interpolating the data. \nProposal contains a mention of all the work that I have done until now along with a link to a demonstration video of the project.\nAll necessary details have been mentioned and the stated guidelines on the organization website are strictly followed.</p>\n",
          "difficulty": null,
          "id": "proj_aerospaceresearchnet_2017_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6712304007643136/",
          "proposal_id": null,
          "short_description": "This project is directed towards obtaining the Keplerian orbit parameters from the jittery position vector obtained by de-noising and interpolating...",
          "slug": "orbit-position-data-analysis-and-interpolation",
          "status": "completed",
          "student_name": "Nilesh Chaturvedi",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "ui"
          ],
          "title": "Orbit Position Data Analysis and Interpolation"
        },
        {
          "code_url": "https://goo.gl/xLXGsH",
          "description": "<p>This project aims to provide a reliable open-sourced cubesats tracking following different mechanisms and protocols for transmitting signals that too using very low end receiver i.e Software Defined Radio (SDR) and under limited computation power, for which no reliable satellite tracking facilities are provided.</p>\n",
          "difficulty": null,
          "id": "proj_aerospaceresearchnet_2017_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5749327108505600/",
          "proposal_id": null,
          "short_description": "This project aims to provide a reliable open-sourced cubesats tracking following different mechanisms and protocols for transmitting signals that too...",
          "slug": "siqnal-fast-cubesat-tracking-using-iq-stream-data",
          "status": "completed",
          "student_name": "Jay Krishna",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "SiqNAL: Fast CubeSat tracking using IQ stream data"
        },
        {
          "code_url": "https://aerospaceresearch.net/?p=431",
          "description": "<p>VisMa aims to make math simpler for all who are afraid of mathematics. Once the numbers are eliminated from an equation, people fear dealing with maths and hence stop pursuing it or leave it to the experienced. The project will develop a software that aims to break down several type of mathematical problems into simpler and more understandable steps and then solve each of them one by one and reach the answer. The project can be successfully used among the younger generation to teach them complicated mathematical concepts.</p>\n",
          "difficulty": null,
          "id": "proj_aerospaceresearchnet_2017_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6145493683929088/",
          "proposal_id": null,
          "short_description": "VisMa aims to make math simpler for all who are afraid of mathematics. Once the numbers are eliminated from an equation, people fear dealing with...",
          "slug": "visma-a-visual-equation-solver",
          "status": "completed",
          "student_name": "sidkothiyal",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "VisMa – A visual equation solver"
        },
        {
          "code_url": "http://aerospaceresearch.net/?p=326",
          "description": "<p>Iridium is a satellite communication system, previously mainly used for satellite phone calls and remote control and tracking of scientific instruments or trucks. However, recently more and more lightweight modules were introduced to the market which allow for new applications in vehicles such as high-altitude balloons and miniaturised spacecraft.</p>\n<p>The goal is to improve the existing ground station coded for the MIRKA2-RX experiment and improving it to become a flexible and versatile platform that can be easily modified and fitted to the needs of an experiment.\nThe current ground station already features the basic components needed for receiving data via the Iridium satellite but requires a lot of coding and understating of the code to use it in different scenarios. \nThe suggested proposal would heavily focus on making the application useable to a wider audience by featuring config files for the GUI and the data protocols used as well as adding support for 3D visualisation of GPS data.</p>\n",
          "difficulty": null,
          "id": "proj_aerospaceresearchnet_2017_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6152911629320192/",
          "proposal_id": null,
          "short_description": "Iridium is a satellite communication system, previously mainly used for satellite phone calls and remote control and tracking of scientific...",
          "slug": "multi-purpose-ground-station",
          "status": "completed",
          "student_name": "vstarlinger",
          "student_profile": null,
          "tags": [
            "ios",
            "ai",
            "ui"
          ],
          "title": "Multi Purpose Ground Station"
        },
        {
          "code_url": "http://aerospaceresearch.net/?p=332",
          "description": "<p>The project is mainly focused on data analysis for 3d position data of satellite orbits. My work is to receive as an input a huge amount of positioning data perform parsing and cleaning techniques on them if needed and then apply different types of interpolation methods to the data sets. After the major computations the procedure will continue with some visualization of the results. More information are in the final shared draft proposal.</p>\n",
          "difficulty": null,
          "id": "proj_aerospaceresearchnet_2017_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/4841919569985536/",
          "proposal_id": null,
          "short_description": "The project is mainly focused on data analysis for 3d position data of satellite orbits. My work is to receive as an input a huge amount of...",
          "slug": "lone-pseudoranger-orbit-position-data-analysis-and-interpolation-3d",
          "status": "completed",
          "student_name": "Alexandros Kazantzidis",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Lone Pseudoranger: orbit position data analysis and interpolation (3d)"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2017/organizations/6713622831038464/"
    },
    "year_2018": {
      "num_projects": 6,
      "projects": [
        {
          "code_url": "https://aerospaceresearch.net/?p=924",
          "description": "<h3>The Problem</h3>\n<p>The Universal Space Operations Center is a simple and easy-to-use ground station for space projects. It was initially developed to aid students in their space experiments. Since no experiment is the same, there was a need to create an application that adapted to each project’s needs. In it’s current state, the user has to use a configuration file to state what protocols/variables/graphs he is going to use during his experiment. However, the need to change the application’s layout is evident, and the student should not be forced to close the ground station, change the configuration file again, and re-open the application to resume his experiment. This goes against the initial principle of the groundstation.</p>\n<h3>The Solution</h3>\n<p>There needs to be a way for the user to quickly and easily adapt the groundstation to his experiment, without having to worry too much about it. The goal of this project is to implement a set of new features that allow the user to manipulate the Ground Station’s data and layout. In order to accomplish this, I plan on creating a tool that allows the end user to specify exactly how he want his station to look and work.</p>\n",
          "difficulty": "beginner",
          "id": "proj_aerospaceresearchnet_2018_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/6383478224453632/",
          "proposal_id": null,
          "short_description": "The Problem\nThe Universal Space Operations Center is a simple and easy-to-use ground station for space projects. It was initially developed to aid...",
          "slug": "universal-space-operation-center-gui",
          "status": "completed",
          "student_name": "Pedro12909",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Universal Space Operation Center GUI"
        },
        {
          "code_url": "https://aerospaceresearch.net/?p=899",
          "description": "<p>The project is focused on two-line elements that how we can accurately determine satellite orbit using the information wrapped in it and then validating the results with externally available data.</p>\n",
          "difficulty": null,
          "id": "proj_aerospaceresearchnet_2018_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/6415325138518016/",
          "proposal_id": null,
          "short_description": "The project is focused on two-line elements that how we can accurately determine satellite orbit using the information wrapped in it and then...",
          "slug": "implementing-two-line-element-tle-input-output-and-using-it-for-evaluation",
          "status": "completed",
          "student_name": "Aakash Deep",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Implementing Two-Line Element (TLE) Input / Output and using it for evaluation"
        },
        {
          "code_url": "http://aerospaceresearch.net/?p=949",
          "description": "<p>One of the important functions of satellites is to provide us with weather data allowing us to properly plan and be prepared for adverse weather conditions. Major users of such data are fishermen or sailors. They need to know the positions of dangerous storms, hurricanes etc and allow them to move away from them. Generally, the weather images can be downloaded from the internet, but the ships rarely have an internet connection. Hence for this, one of the solutions is that NOAA weather satellites freely send the weather images and data down to earth continuously. This is perfect for us, the users can simply have a simple and cheap RTL-SDR device and capture this freely available weather data. Currently, this is possible, but there are no opensource tools that come with the complete package. Usually, one software is used to capture and demodulate FM and then the decoded audio is fed into the other software to decode the image. This complex procedure needs a human's manual input and the raw IQ file may be lost in the process. This project intends to solve this. The open source tool that will be developed will have all the required functionalities.</p>\n",
          "difficulty": "advanced",
          "id": "proj_aerospaceresearchnet_2018_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/6687330249211904/",
          "proposal_id": null,
          "short_description": "One of the important functions of satellites is to provide us with weather data allowing us to properly plan and be prepared for adverse weather...",
          "slug": "gsoc18-a-dd6-directdemod-decoding-of-automatic-picture-transmission-noaa",
          "status": "completed",
          "student_name": "Vinay C K",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "[gsoc18-a-dd6] DirectDemod: Decoding of Automatic Picture Transmission (NOAA)"
        },
        {
          "code_url": "https://aerospaceresearch.net/?p=929",
          "description": "<p>Enabling orbit determinator to predict orbits using real time data. It will be done using 5 steps:</p>\n<ol>\n<li>Finding a set of Keplerian elements that approximate the orbit well.</li>\n<li>Propagate the state until new observed data is available.</li>\n<li>Fetch new observations.</li>\n<li>Refine the estimate using Kalman filter.</li>\n<li>Repeat steps 2 to 4.</li>\n</ol>\n<p>Also, allowing orbit determinator to output the data in various ways (position, velocity or right ascension, declination or ground track or 3D plot).</p>\n",
          "difficulty": null,
          "id": "proj_aerospaceresearchnet_2018_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5678807906254848/",
          "proposal_id": null,
          "short_description": "Enabling orbit determinator to predict orbits using real time data. It will be done using 5 steps:\n\nFinding a set of Keplerian elements that...",
          "slug": "lone-pseudoranger-orbit-position-data-analysis-and-interpolation-3d",
          "status": "completed",
          "student_name": "Arya Das",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Lone Pseudoranger: Orbit position data analysis and interpolation (3D)"
        },
        {
          "code_url": "https://aerospaceresearch.net/?p=984",
          "description": "<p>As a GSoC project, I will continue the work done on  <em>orbitdeterminator</em>, so that we turn it into a robust, reliable tool, suitable for orbit determination of satellite, spacecraft and Solar System small-bodies. As part of a comprehensible test suite for orbitdeterminator, I will take data from JPL's radar astrometry database as well as Minor Planet Center's optical database in order to test orbitdeterminator output vs known orbits computed from radar and optical observations.</p>\n<p>The specific goals I will pursue during GSoC 2018 are:</p>\n<ul>\n<li>Turn orbitdeterminator into a robust tool for orbit fitting, taking into account relevant physical effects into orbit model (e.g., non-gravitational accelerations).</li>\n<li>Add interpolation features.</li>\n<li>Add a test suite, with varied and meaningful test scenarios, as well as having continuous integration (CI) and code coverage online tools working for the GitHub repo.</li>\n<li>Test orbitdeterminator for Solar System small-bodies such as NEAs, taking raw data from JPL's radar astrometry and Minor Planet Center's optical data, and then comparing output to other solutions for NEAs.</li>\n</ul>\n<p>Bonus:</p>\n<ul>\n<li>Design and implement an elementary multi-sensor multi-target system for the DGSN system.</li>\n</ul>\n",
          "difficulty": null,
          "id": "proj_aerospaceresearchnet_2018_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5574424229052416/",
          "proposal_id": null,
          "short_description": "As a GSoC project, I will continue the work done on  orbitdeterminator, so that we turn it into a robust, reliable tool, suitable for orbit...",
          "slug": "turning-orbitdeterminator-into-a-robust-reliable-tool",
          "status": "completed",
          "student_name": "Jorge Pérez",
          "student_profile": null,
          "tags": [
            "ios",
            "database",
            "ui"
          ],
          "title": "Turning orbitdeterminator into a robust, reliable tool"
        },
        {
          "code_url": "https://8hantanu.github.io/projects/visma",
          "description": "<p><strong>visma - VISualMAth</strong>, an equation solver, which aims at showing the step-by-step solution of a given equation.</p>\n<p>As of now, <strong>visma</strong> is capable of simplifying equations in single variables and solving quadratic roots. The aim is to extend the <strong>visma</strong>’s capabilities to support:</p>\n<ul>\n<li>calculus operations like integration, differentiation (including partial diff.) </li>\n<li>multivariable equation simplification</li>\n<li>solving equations/inequalities and multivariable linear equations</li>\n</ul>\n<p>GUI will be improved and modules will be created to help the user interact with graphs/plots.</p>\n",
          "difficulty": null,
          "id": "proj_aerospaceresearchnet_2018_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/6099516126134272/",
          "proposal_id": null,
          "short_description": "visma - VISualMAth, an equation solver, which aims at showing the step-by-step solution of a given equation.\nAs of now, visma is capable of...",
          "slug": "visma-visualmath",
          "status": "completed",
          "student_name": "Shantanu Mishra",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "visma - VISualMAth"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2018/organizations/5715161717407744/"
    },
    "year_2019": {
      "num_projects": 7,
      "projects": [
        {
          "code_url": "https://aerospaceresearch.net/?p=1812",
          "description": "<p>Optimization of complex systems is one of the biggest challenges in engineering. A system can be considered complex when its consisted of more sub-systems and when nonlinear interactions between its various design parameters and sub-systems are present. Optimizing such systems can be a challenge for human designers who can neither directly identify optimal design points nor manualy investigate a large design space to identify optimal solutions. In order to tackle this problem, algorithmic optimization approaches are required. Genetic algorithms can successfully navigate a large and nonlinear design space but their performance is highly dependent on the selection of various hyper-parameters. At its current form the optimization problem is concerned with the design of an electric propulsion unit for small satellites. This project aims in the development of visualization tools that will aid in better understanding such complex optimization processes. By developing visualization tools for the optimization process and the sub-systems' characteristics the algorithm's performance can be further enhanced and new insights that can prove valuable for human designers can be identified.</p>\n",
          "difficulty": "advanced",
          "id": "proj_aerospaceresearchnet_2019_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/6650127358361600/",
          "proposal_id": null,
          "short_description": "Optimization of complex systems is one of the biggest challenges in engineering. A system can be considered complex when its consisted of more...",
          "slug": "ksat-visualizing-multi-dimensional-evolution-on-system-and-subsystem-level",
          "status": "completed",
          "student_name": "Themistoklis Spanoudis",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Ksat: Visualizing multi-dimensional evolution on system and subsystem level"
        },
        {
          "code_url": "https://aerospaceresearch.net/?p=1765",
          "description": "<p>This project is focused on tracking aircrafts with ADS-B messages. The aim is to make a smooth tracking method when the aircraft fails to report its position to the ground station with multi-level positioning and data fusion.\nThere are a lot of areas on Earth which are still not covered by radar to track aerial activities such has huge ocean masses. This project will lay down a framework in better tracking and monitoring of aircrafts using the distributed ground station network.</p>\n",
          "difficulty": null,
          "id": "proj_aerospaceresearchnet_2019_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5747705790332928/",
          "proposal_id": null,
          "short_description": "This project is focused on tracking aircrafts with ADS-B messages. The aim is to make a smooth tracking method when the aircraft fails to report its...",
          "slug": "decoding-of-adsb-and-multi-lateral-positioning",
          "status": "completed",
          "student_name": "Shoumik Dey",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Decoding of ADSB and Multi-Lateral positioning"
        },
        {
          "code_url": "https://aerospaceresearch.net/?p=1822",
          "description": "<p>I read the work Jorge Perez has done for GSoC 2018(especially for sun orbiting bodies) and I found it fascinating, I would really love to build upon that and finally incorporate it in the OrbitDeterminator web-app plus I want to add some other relevant features and make the software user-friendly. Turning orbitdeterminator into a robust, reliable and customizable tool is the aim of this project.</p>\n",
          "difficulty": null,
          "id": "proj_aerospaceresearchnet_2019_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5044018348556288/",
          "proposal_id": null,
          "short_description": "I read the work Jorge Perez has done for GSoC 2018(especially for sun orbiting bodies) and I found it fascinating, I would really love to build upon...",
          "slug": "orbitdeterminator-community-observation-input-of-many-station-locations",
          "status": "completed",
          "student_name": "Rakshit Bhatt",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "ui"
          ],
          "title": "OrbitDeterminator: Community Observation Input of many station locations."
        },
        {
          "code_url": "https://aerospaceresearch.net/?p=1791",
          "description": "<p>VISual MAth (visma) is an equation solver and visualiser, which can be used to solve complex mathematical equations. It not only solves the equation but also displays step by step approach which is deployed in the solution. It is also capable of plotting 2D and 3D plots. My proposal is to refactor old simplify modules (to include built-in python functions) and adding new modules like Discrete Maths module, higher degree equation solvers, implementing Matrix Module in GUI, adding support for simultaneous equation solvers,  adding integration &amp; derivation modules etc. Also, I will be implementing \"Equation Scanner\" in VisMa as a side project. This would enable the user to input the equation to VisMa by providing an image of the equation. I will also be focussing on improving existing documentation and adding more documentation to the project.</p>\n",
          "difficulty": "advanced",
          "id": "proj_aerospaceresearchnet_2019_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5346225803493376/",
          "proposal_id": null,
          "short_description": "VISual MAth (visma) is an equation solver and visualiser, which can be used to solve complex mathematical equations. It not only solves the equation...",
          "slug": "visual-math-refactoring-old-modules-adding-new-ones",
          "status": "completed",
          "student_name": "Mayank Dhiman",
          "student_profile": null,
          "tags": [
            "python",
            "ui"
          ],
          "title": "VISual MAth: Refactoring Old Modules & Adding New Ones"
        },
        {
          "code_url": "https://github.com/vidhanarya/GSoC2019-Orbitdeterminator/blob/master/README.md",
          "description": "<p>In this project, functionality to take input from a mix of ground stations and observations of different format will be added to OrbitDeterminator. Key features of this project will be:</p>\n<pre><code>- An easy to use interface for the community where the existing methods and algorithms \n  can be visualized\n- A provision for the addition of observation inputs of all formats from a single station\n  or a mix of many stations to OrbitDeterminator\n- Development of standard input and output parameters so as to ensure the conversion of\n  input data to our standard input format and its further processing\n- Cleaning of the current codebase with the ultimate result of a proficient beta release\n  having all the new features incorporated by the end of GSoC 2019\n</code></pre>\n",
          "difficulty": "beginner",
          "id": "proj_aerospaceresearchnet_2019_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/6243038328782848/",
          "proposal_id": null,
          "short_description": "In this project, functionality to take input from a mix of ground stations and observations of different format will be added to OrbitDeterminator....",
          "slug": "orbitdeterminator-community-observation-input-of-many-station-locations",
          "status": "completed",
          "student_name": "Vidhan Arya",
          "student_profile": null,
          "tags": [],
          "title": "OrbitDeterminator: Community Observation Input of Many Station Locations"
        },
        {
          "code_url": "https://aerospaceresearch.net/?p=1704",
          "description": "<p>There are thousands of wheather satellites orbiting the Earth at each moment of time, constantly transmitting APT signals. The problem of efficient processing and understanding this data is of ultimate importance. Current software provides possibility for decoding APT signals received by RTL-SDR receivers, but the task of understanding the extracted data is hard, because an open-source programs for proper visualization of these images do not yet exist. This project aims to create an open-source software to target that issue, so more developers and enthusiasts will receive an efficient tool to help them in their research. The software would provide functionality for creating different types of interactive visualizations of satellite weather images, along with their georeferencing.</p>\n",
          "difficulty": null,
          "id": "proj_aerospaceresearchnet_2019_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/4823831749853184/",
          "proposal_id": null,
          "short_description": "There are thousands of wheather satellites orbiting the Earth at each moment of time, constantly transmitting APT signals. The problem of efficient...",
          "slug": "directdemod-automatic-picture-transmission-noaa-bigimage-and-globe-projection",
          "status": "completed",
          "student_name": "Vladyslav Mokrousov",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "DirectDemod Automatic Picture Transmission (NOAA) – BigImage and Globe Projection"
        },
        {
          "code_url": "https://aerospaceresearch.net/?p=1800",
          "description": "<p>The objectives of this project are to find optimizations in MOLTO-IT trying to reach the best performance due to the hard numerical process that this project does and Create an API using this Matlab module as a service where the users will send a POST request with the necessary inputs, and it will return the necessary information. Such as parameters of orbits, time, fuel consumed, or even graphs, etc. This will allow the team to create a better and more attractive graphical interface without losing the Matlab efficiency. Creating in this way, the possibility to use this service wherever you want such as mobile, web and desktop applications.</p>\n",
          "difficulty": null,
          "id": "proj_aerospaceresearchnet_2019_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5949173310947328/",
          "proposal_id": null,
          "short_description": "The objectives of this project are to find optimizations in MOLTO-IT trying to reach the best performance due to the hard numerical process that this...",
          "slug": "maas-molto-it-as-a-service",
          "status": "completed",
          "student_name": "Brandon Escamilla",
          "student_profile": null,
          "tags": [
            "web",
            "mobile",
            "api"
          ],
          "title": "MaaS (Molto-IT as a Service)"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2019/organizations/5335970445000704/"
    },
    "year_2020": {
      "num_projects": 5,
      "projects": [
        {
          "code_url": "https://git.ksat-stuttgart.de/source/sourceobsw",
          "description": "<h3>GSOC 2020 - Device Handler Development for the SOURCE Project </h3>\n<h3>Introduction</h3>\n<p>I am Robin Mueller, a graduate student in aerospace engineering at the university of Stuttgart.\nI am interested in developing software for the following ideas:</p>\n<ul>\n<li>[gsoc20-k-07] Implementing Device Handlers in the Flight Software</li>\n</ul>\n<h3>Proposal</h3>\n<p>I will develop the various device handlers for the SOURCE project with real hardware. I will communicate with the responsible subsystems and mentors about the requirements and the results.  I will also try to implement Fault Detection Isolation Recovery (FDIR) functionalities and unique space software components like the thermal monitoring and controlling as well. I will try to apply the concepts of virtualization to enable quick testing of devices where applicable. The goal is to create code which \nconforms to the unique space environment and is</p>\n<ul>\n<li>Clean</li>\n<li>Reliable</li>\n<li>Maintainable</li>\n</ul>\n",
          "difficulty": null,
          "id": "proj_aerospaceresearchnet_2020_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5703498638819328/",
          "proposal_id": null,
          "short_description": "GSOC 2020 - Device Handler Development for the SOURCE Project \nIntroduction\nI am Robin Mueller, a graduate student in aerospace engineering at the...",
          "slug": "device-handler-development-for-the-source-project",
          "status": "completed",
          "student_name": "Robin Müller",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Device Handler Development for the SOURCE Project"
        },
        {
          "code_url": "https://aerospaceresearch.net/?p=1942",
          "description": "<p>With increasing popularity in CubeSat technologies, it has gotten ever so important to have low-cost systems that complement the economical and self-reliant nature of today’s cubesats providers. One of the most important parts of an end to end small satellite business is ground-based tracking. Satellite tracking provides valuable information on the whereabouts with the use of large antennas and high power transmitters at the price of expense and lead time.</p>\n<p>It is thus important to use an alternative tracking method, for example, Doppler Tracking. Doppler based orbit determination uses a doppler frequency shift to convert to a distance problem. Then, orbits may be directly fitted to the Doppler data in a trial and error fashion, but a much less laborious way of computing is to differentially correct an initial approximation of the orbit. This way the cost of the tracking system is kept low because equipment needs beyond the essential receiver are small, at a minimum consisting of an amplifier and a variable oscillator.</p>\n<p>So through this project, the goal is to determine the orbit of active satellites using Doppler shift by implementing an algorithm and simulate the final results.</p>\n",
          "difficulty": null,
          "id": "proj_aerospaceresearchnet_2020_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5357240590008320/",
          "proposal_id": null,
          "short_description": "With increasing popularity in CubeSat technologies, it has gotten ever so important to have low-cost systems that complement the economical and...",
          "slug": "orbit-determination-of-continuous-and-sporadic-signals",
          "status": "completed",
          "student_name": "Nikhil Mishra",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "Orbit determination of continuous and sporadic signals."
        },
        {
          "code_url": "https://aerospaceresearch.net/?page_id=2010",
          "description": "<p>The problem of near-Earth environment congestion  has become increasingly important due to the growing number of both active and inactive Resident Space Objects. The U.S. Strategic Command's Joint Space Operations Center processes more that 400.000 measurements daily taken by the Space Surveillance Network that includes a wide range of RF and electro-optical sensors. The catalog information can be augmented by the observations taken not only by high-end designated tracking assets, but also by cost-effective consumer-level sensors. \nWhile lacking high sensitivity, these sensors can still be used to perform uncued Initial Orbit Determination. Recently, in addition to electro-optical sensors, the appearance of low-cost Software-Defined Radios made it possible to deploy low-cost passive radar tracking stations. By using a network of such stations it might render possible to create and maintain an open-source orbiting object catalog. The proposed research is focused on developing software infrastructure to process measurements from multiple ground stations and perform orbit determination from Doppler observations.</p>\n",
          "difficulty": null,
          "id": "proj_aerospaceresearchnet_2020_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/6560599258955776/",
          "proposal_id": null,
          "short_description": "The problem of near-Earth environment congestion  has become increasingly important due to the growing number of both active and inactive Resident...",
          "slug": "doppler-based-orbit-determination-using-network-of-low-cost-ground-stations",
          "status": "completed",
          "student_name": "Andrey Pak",
          "student_profile": null,
          "tags": [
            "ios",
            "ai"
          ],
          "title": "Doppler-based Orbit Determination Using Network of Low-Cost Ground Stations"
        },
        {
          "code_url": "https://aerospaceresearch.net/?p=1947",
          "description": "<p>The present proposal tries to give attention to the CR3BP in its potential applications for Earth-Moon transfers, as well as propose an alternative method to start any general optimization with a tool that has been proven very powerful for the two body problem. The mathematics involved cannot be fully presented in this proposal since although Fourier analysis and the CR3BP both have known properties and may be found easily on the literature, the conjunction has not been proposed or at least the literature does not appear to have it reflected as such.</p>\n<p>In particular, the project will consist on developing briefly the mathematics, adapting the existing structure in MOLTO-3BP suit for the introduction of a FFS-based initial guess production code segment. It would also provide quantitative tools to assess the quality of the guesses and finally an easy visualization with the help of Matlab built-in functions.</p>\n",
          "difficulty": "beginner",
          "id": "proj_aerospaceresearchnet_2020_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5978124384206848/",
          "proposal_id": null,
          "short_description": "The present proposal tries to give attention to the CR3BP in its potential applications for Earth-Moon transfers, as well as propose an alternative...",
          "slug": "finite-fourier-series-approximation-of-low-thrust-lunar-ballistic-trajectories",
          "status": "completed",
          "student_name": "Ginés Salar",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "Finite Fourier series approximation of low-thrust lunar ballistic trajectories"
        },
        {
          "code_url": "https://aerospaceresearch.net/?p=2033‎",
          "description": "<p>The objective of this project is to optimize MOLTO for production purposes due to different reasons related to the users flow and the asynchronous server side tasks. I have found some situations where is difficult to understand what to do if you are not directly involved with the project. It is also difficult to know what to expect when you are running the genetic algorithm. For that reasons, I thought MOLTO needs some changes that I would like to work on during this summer. These changes will be applied in both server side as well as in the client side.</p>\n",
          "difficulty": null,
          "id": "proj_aerospaceresearchnet_2020_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5140424701771776/",
          "proposal_id": null,
          "short_description": "The objective of this project is to optimize MOLTO for production purposes due to different reasons related to the users flow and the asynchronous...",
          "slug": "molto-optimization-for-production-purposes",
          "status": "completed",
          "student_name": "Brandon Escamilla",
          "student_profile": null,
          "tags": [],
          "title": "MOLTO OPTIMIZATION FOR PRODUCTION PURPOSES"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2020/organizations/5720999993016320/"
    },
    "year_2021": {
      "num_projects": 6,
      "projects": [
        {
          "code_url": "https://aerospaceresearch.net/?p=2349",
          "description": "<p>CalibrateSDR is designed to accurately determine the frequency offset of an SDR via an IQ recording sample. Cheaper SDRs use a low-quality crystal oscillator which usually has a large offset from the ideal frequency. Furthermore, that frequency offset will change as the dongle warms up or as the ambient temperature changes. The end result is that any signals received will not be at the correct frequency, and they would drift as the temperature changes. \nCalibrateSDR can be used with almost any SDR to determine the frequency offset. As of now, it uses the synchronization channel symbols from DAB+ digital audio stations to determine the offset. The primary focus of this project is to extend the applicability towards more signal standards, so as to make it helpful for the SDR community. As DAB+ is mainly used in Europe, Signal standards like GSM, LTE, NOAA-Weather Satellites, DVB-T (use their sync pulses within the data) can be used. Currently, it uses the pyrtlsdr package, which makes it work with RTL-SDR. Piping the API to work with other SDRs will also make the project have a wide range of applications in the SDR Community.</p>\n",
          "difficulty": null,
          "id": "proj_aerospaceresearchnet_2021_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6331354941227008/",
          "proposal_id": null,
          "short_description": "CalibrateSDR is designed to accurately determine the frequency offset of an SDR via an IQ recording sample. Cheaper SDRs use a low-quality crystal...",
          "slug": "calibratesdr",
          "status": "completed",
          "student_name": "Jayaraj",
          "student_profile": null,
          "tags": [
            "api",
            "ai"
          ],
          "title": "CalibrateSDR"
        },
        {
          "code_url": "https://aerospaceresearch.net/?p=2372",
          "description": "<p>The goal of this project is to develop a failure detection, isolation and recovery algorithm (FDIR) for a cubesat, but using machine learning and neural networks instead of the more traditional methods.</p>\n",
          "difficulty": null,
          "id": "proj_aerospaceresearchnet_2021_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6171036227207168/",
          "proposal_id": null,
          "short_description": "The goal of this project is to develop a failure detection, isolation and recovery algorithm (FDIR) for a cubesat, but using machine learning and...",
          "slug": "development-of-an-fdir-algorithm-using-neural-networks",
          "status": "completed",
          "student_name": "Rafael Badell",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Development of an FDIR algorithm using Neural networks"
        },
        {
          "code_url": "https://aerospaceresearch.net/?p=2330",
          "description": "<h3>Visualisation of the MOLTO-3BP Incorporating Matlab Python SDK</h3>\n<p>I am aware there are many applicants, thus I sincerely apologize and regret my delay but hope I can be given an assignment/evaluation test.</p>\n<p>I'm applying to the track for the visualisation of the MOLTO-3BP network as I am enrolled to start a graduate program in CS using distributed technology and am interested in the applications of orbital equations and computing problems.</p>\n<p>My motivation lies in my current interest for Backend and Frontend applications as I also work with a company managing their ML algorithms for data prediction in arbitrage contexts as lead analyst and developer for the Full-stack infrastructure to support such volume and structure the visualisation process for qualitative information (as quantitative is given by volume in this case).\nI am now interested in leveraging such skillset to perhaps a more researching-focused world in lieu of an economic speculative industrial motivator.</p>\n<p>I believe the 3BP is very interesting from a theoretical point of view and can be greatly improved with visual filter and newer GUI revamp to its already robust computational engine (orbital eq in the halo numerical model)</p>\n",
          "difficulty": null,
          "id": "proj_aerospaceresearchnet_2021_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5061006694285312/",
          "proposal_id": null,
          "short_description": "Visualisation of the MOLTO-3BP Incorporating Matlab Python SDK\nI am aware there are many applicants, thus I sincerely apologize and regret my delay...",
          "slug": "python-gui-visualisation-for-molto-3bp-engine",
          "status": "completed",
          "student_name": "Mario Robert D'Ambrosio",
          "student_profile": null,
          "tags": [
            "python",
            "ml",
            "ui",
            "frontend",
            "backend"
          ],
          "title": "Python GUI Visualisation for MOLTO-3BP Engine"
        },
        {
          "code_url": "https://aerospaceresearch.net/?p=2347",
          "description": "<p>Calibrate SDR is a tool by AerospaceResearch.net in which we would be adding support of GSM, and DVB-T signals for correcting frequency offset that occurred during SDR operation. Calibrate SDR would provide calibration to the SDR community all around the world if these signals exist there.</p>\n<p>more on Calibrate SDR <a href=\"https://aerospaceresearch.net/?page_id=2111\" target=\"_blank\">blog</a> by Andreas Hornig (my mentor)</p>\n",
          "difficulty": null,
          "id": "proj_aerospaceresearchnet_2021_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6238241459535872/",
          "proposal_id": null,
          "short_description": "Calibrate SDR is a tool by AerospaceResearch.net in which we would be adding support of GSM, and DVB-T signals for correcting frequency offset that...",
          "slug": "calibrate-sdr-enhancement",
          "status": "completed",
          "student_name": "Ayush Singh",
          "student_profile": null,
          "tags": [],
          "title": "Calibrate SDR enhancement"
        },
        {
          "code_url": "https://aerospaceresearch.net/?p=2211",
          "description": "<p>Cubesat are now widespread as affordable tools for teaching and researching for Universities\nand Research Centers. Although they are simple platforms, their complexity can be increased in\na budget. One of the elements that increase the capabilities of cubesats is the incorporation of\nan attitude (and orbit) control system (AOCS). Simulation of the capability of these subsystems\nis the first step to assess the convenience to include such subsystems in a platform.</p>\n",
          "difficulty": "advanced",
          "id": "proj_aerospaceresearchnet_2021_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6491447599038464/",
          "proposal_id": null,
          "short_description": "Cubesat are now widespread as affordable tools for teaching and researching for Universities\nand Research Centers. Although they are simple...",
          "slug": "implementation-of-the-data-analysis-compilation-interface-in-a-satellite-monitoring-simulator",
          "status": "completed",
          "student_name": "R.David Aleman Ramos",
          "student_profile": null,
          "tags": [],
          "title": "Implementation of the data analysis compilation interface in a satellite monitoring simulator"
        },
        {
          "code_url": "https://aerospaceresearch.net/?p=2353",
          "description": "<p>Because of the recent sharp growth of the satellite industry, it is necessary to have free, accessible, open-source software to analyze satellite signals and track them. In order to achieve that, as one of the most essential steps, those applications must calculate the exact centers of the input satellite signals in the frequency domain. My project is initiated to accommodate this requirement. It aims to provide a program that can reliably detect satellite signals and find their exact frequency centers with high precision, thus providing important statistics for signal analyzing and satellite tracking.</p>\n",
          "difficulty": null,
          "id": "proj_aerospaceresearchnet_2021_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6052985896960000/",
          "proposal_id": null,
          "short_description": "Because of the recent sharp growth of the satellite industry, it is necessary to have free, accessible, open-source software to analyze satellite...",
          "slug": "center-of-satellite-signal-in-the-frequency-domain",
          "status": "completed",
          "student_name": "Binh-Minh Tran-Huu",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Center of Satellite Signal in the Frequency Domain"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2021/organizations/4866654592303104/"
    },
    "year_2022": null,
    "year_2023": null,
    "year_2024": null,
    "year_2025": null
  },
  "first_time": false,
  "contact": {
    "email": "gsoc2021@aerospaceresearch.net",
    "guide_url": null,
    "ideas_url": null,
    "irc_channel": "https://aerospaceresearch.zulipchat.com/",
    "mailing_list": "https://lists.shackspace.de/mailman/listinfo/constellation"
  },
  "social": {
    "blog": "http://aerospaceresearch.net",
    "discord": null,
    "facebook": null,
    "github": null,
    "gitlab": null,
    "instagram": null,
    "linkedin": null,
    "mastodon": null,
    "medium": null,
    "reddit": null,
    "slack": null,
    "stackoverflow": null,
    "twitch": null,
    "twitter": "https://twitter.com/ardnnews",
    "youtube": null
  },
  "meta": {
    "version": 1,
    "generated_at": "2026-01-25T15:28:52.901Z"
  }
}