{
  "id": "692251cb53dd9d7326d33d43",
  "slug": "alaska",
  "name": "Alaska",
  "category": "Science and medicine",
  "description": "Many Traditions, One Alaska",
  "image_url": "https://summerofcode.withgoogle.com/media/org/alaska/uuu8lxevgc3jof9c.png",
  "img_r2_url": "https://pub-268c3a1efc8b4f8a99115507a760ca14.r2.dev/alaska.webp",
  "logo_r2_url": null,
  "url": "https://www.uaa.alaska.edu/research",
  "active_years": [
    2024,
    2025
  ],
  "first_year": 2024,
  "last_year": 2025,
  "is_currently_active": true,
  "technologies": [
    "python",
    "mysql",
    "java",
    "matlab",
    "dicom"
  ],
  "topics": [
    "deep learning",
    "neuroscience",
    "radiology",
    "heathcare",
    "Polar Science"
  ],
  "total_projects": 12,
  "stats": {
    "avg_projects_per_appeared_year": 6,
    "projects_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": null,
      "year_2019": null,
      "year_2020": null,
      "year_2021": null,
      "year_2022": null,
      "year_2023": null,
      "year_2024": 4,
      "year_2025": 8
    },
    "students_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": null,
      "year_2019": null,
      "year_2020": null,
      "year_2021": null,
      "year_2022": null,
      "year_2023": null,
      "year_2024": 4,
      "year_2025": 8
    },
    "total_students": 12
  },
  "years": {
    "year_2016": null,
    "year_2017": null,
    "year_2018": null,
    "year_2019": null,
    "year_2020": null,
    "year_2021": null,
    "year_2022": null,
    "year_2023": null,
    "year_2024": {
      "num_projects": 4,
      "projects": [
        {
          "code_url": "https://github.com/KathiraveluLab/L4SBOA",
          "description": "Healthcare is one of the most important needs of man. One of the biggest impediments to healthcare access in parts of the world with huge land mass is accessibility to healthcare. IT has proven provide solutions to healthcare accessibility but that progress is sometimes limited by network ability. Recent researches have point to the ability of L4S(Low Loss, Low Latency and Scalable Throughput) to improve the ability of networks. This project intends evidence the ability of L4S to aid Telehealth. The approach for this project is test L4S on multiple Telehealth workloads and then propose adaptations on Telehealth applications that can improve access to Telehealth over L4S.",
          "difficulty": null,
          "id": "proj_alaska_2024_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/g0nI3Rgc/",
          "proposal_id": null,
          "short_description": "Healthcare is one of the most important needs of man. One of the biggest impediments to healthcare access in parts of the world with huge land mass...",
          "slug": "telehealth-over-l4s",
          "status": "completed",
          "student_name": "Kolawole",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Telehealth over L4S"
        },
        {
          "code_url": "https://github.com/rawann31/GSoC2024-Report/blob/main/README.md",
          "description": "Alaskan communities face the frontline impacts of climate change. Accurately predicting coastal changes is crucial for adaptation, but current methods overlook dynamic factors like declining sea ice and variations in tidal, temperature, and energy wave data. To enhance coastal modeling, more digitized coastlines are needed due to the inefficiency of manual interpretation. The project aims to develop an automated system for extracting coastlines from PlanetLab images by using techniques like Normalized Difference Water Index (NDWI) thresholding and DeepWaterMap algorithms. The main challenge is developing the NDWI index, a method for image labeling for the training data, specifically the thresholding value for the label. While also considering other preprocessing algorithms for atmospheric correction, mosaicking, etc. Additionally, devising a robust validation method that considers temporal variation is crucial. The project aims to have a model that automatically extracts a vectorized coastline representation from PlanetLabs satellite imagery with high accuracy.",
          "difficulty": null,
          "id": "proj_alaska_2024_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/JokAsFio/",
          "proposal_id": null,
          "short_description": "Alaskan communities face the frontline impacts of climate change. Accurately predicting coastal changes is crucial for adaptation, but current...",
          "slug": "automated-coastline-extraction-for-erosion-modeling-in-alaska",
          "status": "completed",
          "student_name": "Rawan Mohammed Elframawy",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Automated coastline extraction for erosion modeling in Alaska."
        },
        {
          "code_url": "https://github.com/KathiraveluLab/AWANTA/tree/dev/modules/emulator",
          "description": "In remote regions (like Alaska) lacking nearby hospitals, accessing healthcare becomes increasingly challenging, underscoring the importance of telehealth services leveraging the internet. However, the convergence of these healthcare deserts with areas lacking internet connectivity presents a critical dilemma, leaving residents vulnerable during emergencies. To address this issue, we propose AWANTA, a software router capable of dynamically adjusting packet scheduling paths in real-time. Utilizing network latency metrics obtained from the RIPE Atlas internet measurement tool, AWANTA aims to optimize connectivity and ensure timely access to telehealth services, mitigating the impact of limited internet access on healthcare delivery in remote regions.",
          "difficulty": null,
          "id": "proj_alaska_2024_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/0GUHhUhb/",
          "proposal_id": null,
          "short_description": "In remote regions (like Alaska) lacking nearby hospitals, accessing healthcare becomes increasingly challenging, underscoring the importance of...",
          "slug": "adaptive-software-defined-wide-area-network-framework-for-telehealth-access-awanta",
          "status": "completed",
          "student_name": "Sai Vamsi",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Adaptive Software-Defined Wide Area Network framework for Telehealth Access (AWANTA)"
        },
        {
          "code_url": "https://github.com/Vikas-Rajpurohit/UAF-GSOC24-WildFire-Research",
          "description": "Forest fires in the boreal regions, particularly in Alaska, result in significant losses, ranging from loss of life to environmental degradation and disruption of essential services. Detecting and tracking these fires swiftly and accurately is crucial for effective rescue operations and resilience planning. This project seeks to develop precise metrics for assessing the severity and intensity of forest fires, enabling better management strategies.\n\nIntroducing a novel approach where video frames are simultaneously passed through two methods: the first method focuses on detecting fire spots and accurately estimating the area of fire spread using bounding boxes and fire pixel analysis. The second method analyzes the direction and speed of the fire spread by calculating optical flow vectors.\nForest rangers will receive actionable insights in real-time, including the area, direction and speed of fire spread, along with the count and location of fire spots, the distance between spots, and alarm functionalities to facilitate quick decision-making. These insights will be geo-referenced using drone flight data, providing accurate coordinates for targeted intervention and containment efforts.\n\nSet of Deliverables:\n- An optimized fire detection model capable of accurately identifying fire spots.\n- Parameters and algorithms for calculating severity based on fire detection data.\n- A comprehensive system for providing real-time actionable insights to forest rangers, enabling them to make informed decisions and respond promptly to forest fire incidents.",
          "difficulty": null,
          "id": "proj_alaska_2024_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/aTdHTFqR/",
          "proposal_id": null,
          "short_description": "Forest fires in the boreal regions, particularly in Alaska, result in significant losses, ranging from loss of life to environmental degradation and...",
          "slug": "forest-fire-tracking-from-aerial-images-and-measuring-its-severityintensity",
          "status": "completed",
          "student_name": "Vikas Rajpurohit",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Forest Fire Tracking from Aerial Images and Measuring its Severity/Intensity."
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2024/organizations/alaska/"
    },
    "year_2025": {
      "num_projects": 8,
      "projects": [
        {
          "code_url": null,
          "description": "This project aims to integrate Logarithmic Number Systems (LNS) into a deep-learning framework, offering an alternative to traditional floating-point arithmetic. LNS simplifies multiplication and division, potentially reducing power consumption and improving efficiency in applications like deep learning, where approximate results are acceptable. However, current deep-learning frameworks, such as PyTorch and TensorFlow, are hardcoded to use floating-point (FP) operations, limiting the adoption of LNS.\n\nWe seek to bridge that gap by developing a system that supports LNS arithmetic while maintaining compatibility with PyTorch. By creating custom layers, optimizers, and benchmarking tools, the project will enable the simulation of LNS arithmetic in FP hardware for neural network training and inference. The expected outcome is a robust, open-source solution to make research and exploration of LNS in deep-learning applications easier, paving the way for future hardware implementations.",
          "difficulty": null,
          "id": "proj_alaska_2025_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/syhxELgs",
          "proposal_id": "M4o1WvbW",
          "short_description": "This project aims to integrate Logarithmic Number Systems (LNS) into a deep-learning framework, offering an alternative to traditional floating-point...",
          "slug": "support-for-logarithmic-number-systems-in-a-deep-learning-framework",
          "status": "in-progress",
          "student_name": "akrentz6",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Support for Logarithmic Number Systems in a Deep-Learning Framework"
        },
        {
          "code_url": null,
          "description": "This project intends to introduce time as a new fourth dimension for uploads, enabling a deeper understanding and analysis of the evolution of marginalised communities and their art forms. By incorporating time (in all its relevant forms), the initiative will facilitate time-based tracking and establish an evolution timeline—a representation capable of narrating its own journey.\r\nThe project further aims to implement advanced metadata structuring and pattern recognition algorithms to reveal the intricate stories behind each image. By integrating time as a critical attribute, researchers and human service professionals will be able to explore and analyse photo collections with greater depth and clarity.",
          "difficulty": "advanced",
          "id": "proj_alaska_2025_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/p7uybuUg",
          "proposal_id": "567tuvB2",
          "short_description": "This project intends to introduce time as a new fourth dimension for uploads, enabling a deeper understanding and analysis of the evolution of...",
          "slug": "time-and-ordering-in-beehive",
          "status": "in-progress",
          "student_name": "Bagwan",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Time and Ordering in Beehive"
        },
        {
          "code_url": null,
          "description": "Metagenomic assembly is essential for understanding microbial communities, but existing tools often struggle with fragmented genomes, misclassified errors, and scalability issues. My goal is to develop a distributed algorithm for error correction and assembly, making it easier to process large and complex metagenomic datasets efficiently.\n\nTo achieve this, I plan to use distributed computing frameworks like Dask to improve scalability, ensuring that even terabyte-scale datasets can be handled smoothly. I also aim to design better error correction techniques to preserve low-abundance species and improve assembly accuracy. Additionally, I want to explore GPU acceleration and machine learning to refine error detection and optimize processing times.\n\nAt the core of my approach is a distributed de Bruijn graph assembly algorithm that constructs graphs from k-mers while clustering and annotating nodes based on coverage, GC content, and paired-end data. Unlike existing tools like Velvet (designed for single-genome assembly) and MetaVelvet (for metagenomic assembly), my method will efficiently break down graphs into species-specific subgraphs, reducing errors and improving the quality of the final assemblies. This will lead to better contig generation, taxonomic classification, and error correction, while also ensuring the method scales well for large datasets.\n\nDeliverables:\n1. A distributed error correction module that improves accuracy while retaining biologically important data.\n2. An optimized assembly pipeline to generate high-quality contigs and scaffolds for taxonomic and functional analysis.\n3. A novel species-aware de Bruijn graph decomposition to improve metagenomic assembly and reduce errors.\n4. Scalability improvements to ensure smooth performance across HPC clusters and cloud platforms.\n5. AI/ML enhancements to improve error correction and sequencing accuracy.\n6. Comprehensive documentation and testing to make the tool easy to use and reproducible.",
          "difficulty": "beginner",
          "id": "proj_alaska_2025_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/7MLG6Q1y",
          "proposal_id": "GaVT5Vua",
          "short_description": "Metagenomic assembly is essential for understanding microbial communities, but existing tools often struggle with fragmented genomes, misclassified...",
          "slug": "developing-distributed-algorithm-for-metagenomic-error-correction-and-assembly",
          "status": "in-progress",
          "student_name": "Gauri Ket",
          "student_profile": null,
          "tags": [
            "ml",
            "ai",
            "cloud",
            "ui"
          ],
          "title": "Developing Distributed Algorithm for Metagenomic Error Correction and Assembly"
        },
        {
          "code_url": null,
          "description": "Beehive aims to be a scalable web application that enables users to capture, upload, and manage images seamlessly while ensuring automation, security, and efficiency. The project will feature a robust UI, a secure backend with role-based access, and cloud deployment with CI/CD integration for smooth updates.\n\nFinal Deliverables:\n- Fully functional web application\n- Secure authentication and role-based access\n- Automated CI/CD & cloud deployment\n- Testing & security validation",
          "difficulty": null,
          "id": "proj_alaska_2025_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/VEikwBq6",
          "proposal_id": "h6qWQxN2",
          "short_description": "Beehive aims to be a scalable web application that enables users to capture, upload, and manage images seamlessly while ensuring automation,...",
          "slug": "beehive-health-metrics-framework-for-behavioral-health-in-alaska",
          "status": "in-progress",
          "student_name": "IshaanxGupta",
          "student_profile": null,
          "tags": [
            "web",
            "ml",
            "ai",
            "cloud",
            "ui"
          ],
          "title": "Beehive:  Health Metrics Framework for Behavioral Health in Alaska."
        },
        {
          "code_url": null,
          "description": "The problem I am trying to solve is less monetary benefits received by the data owners. I am creating a decentralized solution where the data owner can upload his/her dataset and get compensated well whenever people buy the dataset. My proposed architecture is secure as well as scalable. I using 2 smart contracts and thereby making a dual chain architecture for handling dataset and payment.",
          "difficulty": null,
          "id": "proj_alaska_2025_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/0fukgxzJ",
          "proposal_id": "Kk4UEmnf",
          "short_description": "The problem I am trying to solve is less monetary benefits received by the data owners. I am creating a decentralized solution where the data owner...",
          "slug": "bio-block-a-blockchain-based-data-repository-and-payment-portal",
          "status": "in-progress",
          "student_name": "Karthik Sathish",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Bio-Block: A Blockchain-based Data Repository and Payment Portal."
        },
        {
          "code_url": null,
          "description": "The purpose of this project is to build AWANTA, a software virtual router that adapts Internet traffic routing in real time based on network measurements collected by RIPE Atlas.\nThe deliverables are a working virtual router that uses RIPE Atlas data to make dynamic choice of best network paths, documentation, and performance benchmarks. The project will improve Internet connectivity in areas where stable connections are important, such as in geographical locations, by providing a more flexible and efficient routing solution.",
          "difficulty": null,
          "id": "proj_alaska_2025_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/VAxzRsh8",
          "proposal_id": "5zBuGw2D",
          "short_description": "The purpose of this project is to build AWANTA, a software virtual router that adapts Internet traffic routing in real time based on network...",
          "slug": "awanta-a-virtual-router-based-on-ripe-atlas-internet-measurements",
          "status": "in-progress",
          "student_name": "Mohamed Abdullah",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "AWANTA: A Virtual Router based on RIPE Atlas Internet Measurements"
        },
        {
          "code_url": null,
          "description": "Alaskan coastlines are rapidly evolving due to the direct impacts of climate change. Rising sea levels, melting sea ice, and shifting environmental conditions make accurate modeling of coastal changes a pressing need. Current approaches often miss key environmental variables like tidal shifts, temperature variation, and wave energy. Moreover, manual coastline digitization remains time-consuming and inefficient, limiting scalability.\nThe aim of the project is to develop and deliver a highly accurate, automated model that can extract vectorized coastlines directly from PlanetLabs satellite imagery. This will build upon the existing pipeline and model by re-training the water detection (NDWI-based) and segmentation methods to perform well on PlanetLabs’ imagery.\nFurther aims include:\nEnsuring the extraction is robust in challenging conditions such as water shadows, buildings, artifacts, and especially steep, cliff-like coastal areas.\nIntegrating additional data sources if needed, such as SWIR data   \nthe project will also explore the use of auxiliary data sources (Landsat & sentinel) and  elevation data for addition of topographic information, to improve accuracy.\n\nUltimately producing a finished model that can process large amounts of imagery and accurately predict coastline changes over time, which is essential for improving coastal erosion forecasts in Alaska considering the effects of climate change.",
          "difficulty": null,
          "id": "proj_alaska_2025_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/BxxPW8Ec",
          "proposal_id": "92vZvvGp",
          "short_description": "Alaskan coastlines are rapidly evolving due to the direct impacts of climate change. Rising sea levels, melting sea ice, and shifting environmental...",
          "slug": "automated-coastline-extraction-for-erosion-modeling-in-alaska",
          "status": "in-progress",
          "student_name": "Ritika133",
          "student_profile": null,
          "tags": [
            "api",
            "ai",
            "ui",
            "ux"
          ],
          "title": "Automated Coastline Extraction for Erosion modeling in Alaska"
        },
        {
          "code_url": null,
          "description": "Closed-loop peripheral neuromodulation systems, essential for developing\nadaptive therapies like vagus nerve stimulation that can be modularly simulated\nusing the CONTROL-CORE framework. Although CONTROL-CORE currently\nsupports file-based and shared-memory communication, these approaches have\nlimitations about distributed execution, scalability, and latency.\n\nTo overcome these obstacles, this project suggests utilizing ZeroMQ that will\ncontribute as a high-performance messaging library as another means of\ncommunication.",
          "difficulty": null,
          "id": "proj_alaska_2025_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/SRg27gwq",
          "proposal_id": "P88ZkrJs",
          "short_description": "Closed-loop peripheral neuromodulation systems, essential for developing adaptive therapies like vagus nerve stimulation that can be modularly...",
          "slug": "making-zeromq-a-first-class-feature-of-concore",
          "status": "in-progress",
          "student_name": "Saksham Gera",
          "student_profile": null,
          "tags": [
            "api"
          ],
          "title": "Making ZeroMQ A First Class Feature of Concore"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2025/organizations/alaska"
    }
  },
  "first_time": false,
  "contact": {
    "email": null,
    "guide_url": "https://github.com/uaanchorage/GSoC/blob/main/CONTRIBUTOR-GUIDE.md",
    "ideas_url": "https://github.com/uaanchorage/GSoC",
    "irc_channel": null,
    "mailing_list": "https://github.com/uaanchorage/GSoC/discussions"
  },
  "social": {
    "blog": "https://github.com/uaanchorage/GSoC/wiki",
    "discord": null,
    "facebook": null,
    "github": null,
    "gitlab": null,
    "instagram": null,
    "linkedin": null,
    "mastodon": null,
    "medium": null,
    "reddit": null,
    "slack": null,
    "stackoverflow": null,
    "twitch": null,
    "twitter": null,
    "youtube": null
  },
  "meta": {
    "version": 1,
    "generated_at": "2026-01-25T15:28:52.903Z"
  }
}