{
  "id": "692251cc53dd9d7326d33d47",
  "slug": "ankidroid",
  "name": "AnkiDroid",
  "category": "End user applications",
  "description": "AnkiDroid makes remembering things easy",
  "image_url": "https://summerofcode.withgoogle.com/media/org/ankidroid/cxtovrlsuuluttgi-360.png",
  "img_r2_url": "https://pub-268c3a1efc8b4f8a99115507a760ca14.r2.dev/ankidroid.webp",
  "logo_r2_url": null,
  "url": "https://github.com/ankidroid/Anki-Android",
  "active_years": [
    2021,
    2022,
    2024,
    2025
  ],
  "first_year": 2021,
  "last_year": 2025,
  "is_currently_active": true,
  "technologies": [
    "javascript",
    "android",
    "java",
    "gradle",
    "rust",
    "kotlin",
    "mobile"
  ],
  "topics": [
    "education",
    "android",
    "user generated content",
    "flashcard",
    "mobile",
    "Flashcards"
  ],
  "total_projects": 10,
  "stats": {
    "avg_projects_per_appeared_year": 2.5,
    "projects_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": null,
      "year_2019": null,
      "year_2020": null,
      "year_2021": 2,
      "year_2022": 3,
      "year_2023": null,
      "year_2024": 3,
      "year_2025": 2
    },
    "students_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": null,
      "year_2019": null,
      "year_2020": null,
      "year_2021": 2,
      "year_2022": 3,
      "year_2023": null,
      "year_2024": 3,
      "year_2025": 2
    },
    "total_students": 10
  },
  "years": {
    "year_2016": null,
    "year_2017": null,
    "year_2018": null,
    "year_2019": null,
    "year_2020": null,
    "year_2021": {
      "num_projects": 2,
      "projects": [
        {
          "code_url": "https://gist.github.com/ShridharGoel/2eb73b5b4b67c7981f479841361c6942",
          "description": "<p>This project aims to develop and improve the AnkiDroid Android App.</p>\n<p>Here are the list of things which I aim to work on:</p>\n<p><strong>Onboarding for new users</strong></p>\n<p>An onboarding flow will help new users to understand the app and its purpose in a better way. This will contain details about the benefits of flash cards and spaced repetition along with examples on how to use them. We can also make use of tooltips and coach marks at various places throughout the app to provide guidance to new users.</p>\n<p><strong>Loading/uploading shared decks in-app</strong></p>\n<p>Feature to allow users to directly download decks in the app using download link, deck ID or deck name. This will update the current process of downloading the deck and importing it, thus making the app much better since users can easily search for decks using the deck name directly through the app.</p>\n<p><strong>Kotlin migration</strong></p>\n<p>Start the migration of the project to Kotlin. Onboarding and in-app shared decks features would also be developed in Kotlin.</p>\n<p><strong>Others</strong></p>\n<p>Apart from this, I am planning to work on other things which come up during the GSoC period. This can include UI/UX changes as well.</p>\n",
          "difficulty": null,
          "id": "proj_ankidroid_2021_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5701531810136064/",
          "proposal_id": null,
          "short_description": "This project aims to develop and improve the AnkiDroid Android App.\nHere are the list of things which I aim to work on:\nOnboarding for new users\nAn...",
          "slug": "development-of-ankidroid-project",
          "status": "completed",
          "student_name": "Shridhar Goel",
          "student_profile": null,
          "tags": [
            "android",
            "ai",
            "ui",
            "ux"
          ],
          "title": "Development of AnkiDroid project"
        },
        {
          "code_url": "https://docs.google.com/document/d/1OCRR8VVbVNX4WaY3ZRVW_O1KsqBiUU4Lgzha6UFMXe0/edit?usp=sharing",
          "description": "<p>This project aims to migrate the AnkiDroid App to Scoped Storage. It will follow Google's recommended approach. This will involve migrating user data from Legacy Directories to those accessible by Scoped Storage. AnkiDroid's users' collections will be migrated to App-Specific Directories. Media will be stored in their respective Scoped Storage collections. Two migration mechanisms will be developed:</p>\n<ol>\n<li>For targetSdk &lt;= 29: Using WRITE_EXTERNAL_STORAGE permission</li>\n<li>For targetSdk &gt;= 30: Using permission granted by user via System File Picker</li>\n</ol>\n<p>This will ensure the data of users who update at any time will be migrated.</p>\n<p>Moreover, this project aims to support all AnkiDroid features under Scoped Storage. It will ensure support for Import, Sync, AnkiDroidAPI client apps, opting for external storage &amp; preserving data post-uninstallation. Scoped Storage inevitably forced some changes in app behavior like the need for migration itself &amp; user data being deleted upon uninstallation. This project will enable a smooth transition by providing a short introduction to these changes.</p>\n",
          "difficulty": null,
          "id": "proj_ankidroid_2021_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/4622107475968000/",
          "proposal_id": null,
          "short_description": "This project aims to migrate the AnkiDroid App to Scoped Storage. It will follow Google's recommended approach. This will involve migrating user data...",
          "slug": "migrating-to-scoped-storage-by-farjad-ilyas-2021",
          "status": "completed",
          "student_name": "Farjad Ilyas",
          "student_profile": null,
          "tags": [
            "api",
            "ai"
          ],
          "title": "\"Migrating to Scoped Storage\" By Farjad Ilyas, 2021"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2021/organizations/5687189203058688/"
    },
    "year_2022": {
      "num_projects": 3,
      "projects": [
        {
          "code_url": "https://gist.github.com/viciousAegis/602a64c47d2a1594bbf6e0647b5bd039",
          "description": "The Card Browser is an integral part of the AnkiDroid ecosystem, and through this project, my aim is to port more functionality from Anki Desktop to it in order to offer a closer-to-desktop experience, as well as to improve the UX offered for the Card Browser to make it more intuitive and accessible for users. As improvements, I plan to deliver the following:\n\nAdd a Sidebar, which contains filtering options the same way as it appears for Anki Desktop.\n\nSwitch between showing Notes and Cards in the browser. This feature is to be ported from Anki Desktop. \n\nImplementing RecyclerView instead of ListView for displaying Cards/Notes, and moving to a “Single Column, Two Rows” (SCTR) layout for Cards.\n\nImplement export of selected Cards from the Browser directly.",
          "difficulty": null,
          "id": "proj_ankidroid_2022_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/Szuxr74f/",
          "proposal_id": null,
          "short_description": "The Card Browser is an integral part of the AnkiDroid ecosystem, and through this project, my aim is to port more functionality from Anki Desktop to...",
          "slug": "improve-card-browser",
          "status": "completed",
          "student_name": "Akshit Sinha",
          "student_profile": null,
          "tags": [
            "ai",
            "ui",
            "ux"
          ],
          "title": "Improve Card Browser"
        },
        {
          "code_url": "https://gist.github.com/BrayanDSO/82c713050e8af049489a6ed7db2b5515",
          "description": "My proposal has 2 subprojects associated to improve the app: CSV Importer and Improve Preferences UI/UX.\n \nCSV files are a very useful way to organize and create a bulk of flashcards. \nIt allows any person without coding knowledge to create decks based on a spreadsheet file easily. Additionally, it makes deck collaboration easier on online platforms like Google Sheets. This is very significant to the growing number of phone users and education institutions using Chromebooks. To solve it, it will be created some CSV importing screens, including a CSV preview, alongside integrating it with the importing backend code.\n\nAnkiDroid preferences allow the user to customize their learning experience and app settings. Due to its large number and lack of organization, it has been a big source of complaints from the users. Also, it is underly tested, with part of the code not updated in years and some deprecations.\nThe main goal of this project is to help users tweak their learning experience with ease by improving the preferences UI and UX. To do it, I will create new categories, add a search bar and icons, update the code and build some tests",
          "difficulty": null,
          "id": "proj_ankidroid_2022_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/C9pmMeIt/",
          "proposal_id": null,
          "short_description": "My proposal has 2 subprojects associated to improve the app: CSV Importer and Improve Preferences UI/UX. CSV files are a very useful way to organize...",
          "slug": "csv-importer-and-improve-preferences-uiux",
          "status": "completed",
          "student_name": "Brayan Oliveira",
          "student_profile": null,
          "tags": [
            "ai",
            "ui",
            "ux",
            "backend"
          ],
          "title": "CSV Importer and Improve Preferences UI/UX"
        },
        {
          "code_url": "https://medium.com/@divyanshdxn/divyansh-kushwahas-gsoc-2022-report-a5ab871db6ed",
          "description": "The proposal focuses on migrating the project from the use of deprecated AsyncTask to Kotlin coroutines. Coroutines are a great way of handling background operations. Since AnkiDroid is already migrating to Kotlin, I think it is time to migrate the codebase to using Coroutines as well.",
          "difficulty": null,
          "id": "proj_ankidroid_2022_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/XLPJsm8o/",
          "proposal_id": null,
          "short_description": "The proposal focuses on migrating the project from the use of deprecated AsyncTask to Kotlin coroutines. Coroutines are a great way of handling...",
          "slug": "migrate-asynctask-to-kotlin-coroutines",
          "status": "completed",
          "student_name": "Divyansh Kushwaha",
          "student_profile": null,
          "tags": [],
          "title": "Migrate AsyncTask to Kotlin Coroutines"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2022/organizations/ankidroid/"
    },
    "year_2023": null,
    "year_2024": {
      "num_projects": 3,
      "projects": [
        {
          "code_url": "https://github.com/criticalAY/GSoC-Report/blob/main/README.md",
          "description": "My proposal comprises two subprojects aimed at enhancing the app: the Instant Note Editor and enhancements to the Multimedia UI/UX.\nCloze deletion are widely used in AnkiDroid but adding a Cloze-type note while we are reading a pdf/surfing internet takes multiple steps and time consuming. With the Instant Note Editor, users will be able to effortlessly add a Cloze-type note in half the time it currently takes without actually opening the app but a dialog. Here the user will be able to share selected text and instantly turn a word to cloze just by single taping it.\nAnkiDroid allows user to add media to the cards via multimedia attachment option but the steps required in the process are sometimes misleading and the code of the activity is tightly coupled making it difficult to maintain, this project will decouple the UI and its logic and improvise the UX. Finally resulting in a smooth media attachment process with much better UI/UX",
          "difficulty": null,
          "id": "proj_ankidroid_2024_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/HHr5HsjN/",
          "proposal_id": null,
          "short_description": "My proposal comprises two subprojects aimed at enhancing the app: the Instant Note Editor and enhancements to the Multimedia UI/UX. Cloze deletion...",
          "slug": "instant-add-note-editor-multimedia-uiux",
          "status": "completed",
          "student_name": "criticalAY - Ashish Yadav",
          "student_profile": null,
          "tags": [
            "api",
            "ai",
            "ui",
            "ux"
          ],
          "title": "Instant Add Note Editor & Multimedia UI/UX"
        },
        {
          "code_url": "https://github.com/SanjaySargam/GSoC-Report/blob/main/README.md",
          "description": "This proposal focuses on enhancing the user experience of AnkiDroid on larger devices like tablets and Chromebooks. The project aims to improve usability, readability, and overall aesthetics, ensuring AnkiDroid remains intuitive and efficient across various devices. Specific tasks include converting the DeckPicker screen to feature a unified menu, highlighting selected preference settings, integrating the NoteEditor into the CardBrowser, implementing a Previewer within the CardTemplateEditor, adding mouse support, and introducing keyboard shortcuts for efficient navigation and interaction. Throughout the proposal, a strong emphasis is placed on user-centric design and usability enhancements to elevate the overall AnkiDroid experience on tablets and Chromebooks.",
          "difficulty": null,
          "id": "proj_ankidroid_2024_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/8VnbDJ2l/",
          "proposal_id": null,
          "short_description": "This proposal focuses on enhancing the user experience of AnkiDroid on larger devices like tablets and Chromebooks. The project aims to improve...",
          "slug": "tablet-chromebook-ui",
          "status": "completed",
          "student_name": "Sanjay Sargam",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Tablet & Chromebook UI"
        },
        {
          "code_url": "https://github.com/xenonnn4w/GSoC-Report/blob/main/README.md",
          "description": "Ankidroid currently lack convenient access to key study management features directly from their device's home screen. This inefficiency hampers user engagement and productivity.  As improvements, I plan to address these challenges by implementing widgets for Ankidroid, focusing on three key areas: Deck Analysis, Card Analysis, and Cards Due. These widgets will provide users with quick access to vital study metrics and functionalities, improving their study management experience. The solution involves designing intuitive and visually appealing widgets consistent with Ankidroid's UI/UX guidelines and integrating them seamlessly into the app.",
          "difficulty": null,
          "id": "proj_ankidroid_2024_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/w1n3pqnM/",
          "proposal_id": null,
          "short_description": "Ankidroid currently lack convenient access to key study management features directly from their device's home screen. This inefficiency hampers user...",
          "slug": "additional-widgets",
          "status": "completed",
          "student_name": "Snowiee",
          "student_profile": null,
          "tags": [
            "ml",
            "ui",
            "ux"
          ],
          "title": "Additional Widgets"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2024/organizations/ankidroid/"
    },
    "year_2025": {
      "num_projects": 2,
      "projects": [
        {
          "code_url": null,
          "description": "Currently, reminders and notifications in AnkiDroid are entirely broken. This proposal aims to completely overhaul the system, in accordance with the Project Ideas list created by the organization. A new EditNotifiations activity that can be reused at the deck and app-wide levels will be created with Preferences Datastore used for data storage. I propose both single and persistent notifications via AlarmManager and PeriodicWorkReuqest as well as a Duolingo-inspired front-preview feature.\n\nPlanned deliverables:\n1.  Be able to create deck-specific reminders which fire once per day \n2.  Be able to view reminders in a specific deck \n3.  Be able to view reminders app-wide on a single screen \n4.  Be able to receive notifications in a timely manner \n5.  Be able to edit the time a reminder is sent at \n6.  Be able to delete reminders \n7.  Be able to ask the user for notification permissions \n8.  Be able to create global, app-wide notifications \n9.  Be able to view previews of cards in notifications \n10.  Be able to create persistent notifications that have a defined start and end \n11.  Be able to modify special options for notifications, such as including subdecks when counting cards for the card trigger threshold",
          "difficulty": null,
          "id": "proj_ankidroid_2025_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/hM59fHT8",
          "proposal_id": "95iCYRQc",
          "short_description": "Currently, reminders and notifications in AnkiDroid are entirely broken. This proposal aims to completely overhaul the system, in accordance with the...",
          "slug": "eric-li-review-reminders-gsoc-2025",
          "status": "in-progress",
          "student_name": "ericli3690 (Eric Li)",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Eric Li - Review Reminders - GSoC 2025"
        },
        {
          "code_url": null,
          "description": "AnkiDroid was initially designed for Android mobile phones. Over the years, Android has come to tablets and Chromebooks, but our UI has continued to be designed around the mobile phone.\r\nI plan to do this by implementing the following:\r\n1. Resizable layouts for multi pane screens\r\n2. Making a x-large note editor with previewer side by side\r\n3. Shortcut Hints\r\n4. Mouse Improvements\r\n5. Optional Extensions",
          "difficulty": null,
          "id": "proj_ankidroid_2025_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/pctRgn1E",
          "proposal_id": "nuTmVr0n",
          "short_description": "AnkiDroid was initially designed for Android mobile phones. Over the years, Android has come to tablets and Chromebooks, but our UI has continued to...",
          "slug": "tablet-chromebook-ui",
          "status": "in-progress",
          "student_name": "Hari Srinivasan",
          "student_profile": null,
          "tags": [
            "android",
            "mobile",
            "ui"
          ],
          "title": "Tablet & Chromebook UI"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2025/organizations/ankidroid"
    }
  },
  "first_time": false,
  "contact": {
    "email": null,
    "guide_url": "https://github.com/ankidroid/Anki-Android/wiki/Google-Summer-of-Code",
    "ideas_url": "https://docs.google.com/document/d/1Va6IWEYcWTkK4KDtyoFxtOKzpdcYe54GdrVpuMcFvlI/edit?usp=sharing",
    "irc_channel": "https://discord.gg/qjzcRTx",
    "mailing_list": "https://groups.google.com/forum/#!forum/anki-android"
  },
  "social": {
    "blog": null,
    "discord": "https://discord.gg/qjzcRTx",
    "facebook": null,
    "github": "https://github.com/ankidroid/Anki-Android",
    "gitlab": null,
    "instagram": null,
    "linkedin": null,
    "mastodon": null,
    "medium": null,
    "reddit": null,
    "slack": null,
    "stackoverflow": null,
    "twitch": null,
    "twitter": "https://twitter.com/ankidroid",
    "youtube": null
  },
  "meta": {
    "version": 1,
    "generated_at": "2026-01-25T15:28:52.909Z"
  }
}