{
  "id": "692251cc53dd9d7326d33d49",
  "slug": "apertium",
  "name": "Apertium",
  "category": "Science and medicine",
  "description": "A free/open-source machine translation platform",
  "image_url": "https://summerofcode.withgoogle.com/media/org/apertium/bonpbccfuafpa634-360.png",
  "img_r2_url": "https://pub-268c3a1efc8b4f8a99115507a760ca14.r2.dev/apertium.webp",
  "logo_r2_url": null,
  "url": "https://apertium.org/",
  "active_years": [
    2016,
    2017,
    2018,
    2019,
    2020,
    2021,
    2023,
    2024
  ],
  "first_year": 2016,
  "last_year": 2024,
  "is_currently_active": false,
  "technologies": [
    "python",
    "perl",
    "c++",
    "xml",
    "finite-state technologies",
    "nlp",
    "fsts",
    "bash",
    "javascript"
  ],
  "topics": [
    "natural language processing",
    "machine translation",
    "computer-aided translation",
    "morphological analysis",
    "human language technologies",
    "lesser-resourced languages",
    "language technology",
    "grammar",
    "less-resourced languages",
    "less-resources languages"
  ],
  "total_projects": 67,
  "stats": {
    "avg_projects_per_appeared_year": 8.38,
    "projects_by_year": {
      "year_2016": 11,
      "year_2017": 10,
      "year_2018": 11,
      "year_2019": 10,
      "year_2020": 7,
      "year_2021": 10,
      "year_2022": null,
      "year_2023": 5,
      "year_2024": 3,
      "year_2025": null
    },
    "students_by_year": {
      "year_2016": 11,
      "year_2017": 10,
      "year_2018": 11,
      "year_2019": 10,
      "year_2020": 7,
      "year_2021": 10,
      "year_2022": null,
      "year_2023": 5,
      "year_2024": 3,
      "year_2025": null
    },
    "total_students": 61
  },
  "years": {
    "year_2016": {
      "num_projects": 11,
      "projects": [
        {
          "code_url": "http://wiki.apertium.org/wiki/GSOC%2716_Kira%27s_results._Apertium_website_improvements",
          "description": "<p>New features provide benefits both to Apertium users and Apertium team.\nApertium website users will get the improved tool which provides a new dictionary lookup mode which is the second important feature after translation itself.\nThe feedback feature is important to Apertium team. Apertium team will be able to know more about Apertium from users and the tool obtains more testing from people who don't have technical background.\nBoth the feedback page and reliability visualization make the site more user-friendly thus it will grow to one of the coolest online translation tools.</p>\n",
          "difficulty": null,
          "id": "proj_apertium_2016_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5652720409116672/",
          "proposal_id": null,
          "short_description": "New features provide benefits both to Apertium users and Apertium team.\nApertium website users will get the improved tool which provides a new...",
          "slug": "apertium-website-improvements",
          "status": "completed",
          "student_name": "Kira",
          "student_profile": null,
          "tags": [
            "web",
            "ai"
          ],
          "title": "Apertium website improvements"
        },
        {
          "code_url": "http://wiki.apertium.org/wiki/Frankier/GSOC_2016_submission",
          "description": "<p>Many less resourced languages don’t have a tagged corpus or only have a small amount of poorly tagged material. In such cases unsupervised learning is a great first step beyond simply picking a random tag or the most frequent form according to some corpus statistics. The way CG is currently combined with the tagger works reasonably well empirically but is actually somewhat unsound in terms of the theory of operation of the tagger (words are identified by different ambiguity classes during training and tagging). For my first task, I will implement new ways of combining them both during in tagging and during tagger training .</p>\n<p>For my second task I will implement an averaged perception POS tagger based on the one in the Python module nltk. This will have some level of configurability in terms of word features (ie can choose to look at suffixes or prefixes of different lengths) to accommodate different types of languages. Another requirement will be to work (not necessarily very well) with little or no configuration (which means eventually not using the coarse tags of the other taggers).</p>\n",
          "difficulty": null,
          "id": "proj_apertium_2016_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5669287574372352/",
          "proposal_id": null,
          "short_description": "Many less resourced languages don’t have a tagged corpus or only have a small amount of poorly tagged material. In such cases unsupervised learning...",
          "slug": "investigation-of-new-ways-to-combining-constraint-grammar-and-apertium-tagger-a-new-averaged-perception-based-tagger",
          "status": "completed",
          "student_name": "frankier",
          "student_profile": null,
          "tags": [
            "python",
            "ai",
            "ui"
          ],
          "title": "Investigation of new ways to combining Constraint-grammar and apertium-tagger & a new averaged perception based tagger"
        },
        {
          "code_url": "https://apertium.projectjj.com/gsoc2016/gfro3d.html",
          "description": "<p>The project I intend to carry out is the creation of a MT engine for the language pair Italian-Sardinian based on the Apertium platform. As pointed out above, MT is crucial for the survival of minoritised languages. Apertium, having lead the development of RBMT engines in the last years, provides an excellent framework for language pairs of the same linguistic family without the need of linguistic corpora. The experience of Apertium with several minoritised languages such as Occitan, Asturian or Maltese proofs that such a project is viable.\nGoogle and Apertium would benefit from this project, not only because it would contribute to open-source software and minority languages, but especially because it would have a great impact in the Sardinian society, since at present there is no MT system for the Sardinian language, neither by Google nor by Apertium.</p>\n",
          "difficulty": null,
          "id": "proj_apertium_2016_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/6136890327564288/",
          "proposal_id": null,
          "short_description": "The project I intend to carry out is the creation of a MT engine for the language pair Italian-Sardinian based on the Apertium platform. As pointed...",
          "slug": "sardu-abbarra-vivu",
          "status": "completed",
          "student_name": "gianfro",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Sardu, abbarra vivu!"
        },
        {
          "code_url": "http://wiki.apertium.org/wiki/Kurmanji_and_English/Final_report",
          "description": "<p>I propose to work on the Kurmanji-English language pair, with the aim of improving it to the state of the art level, in terms of coverage and accuracy.</p>\n",
          "difficulty": null,
          "id": "proj_apertium_2016_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5069737520267264/",
          "proposal_id": null,
          "short_description": "I propose to work on the Kurmanji-English language pair, with the aim of improving it to the state of the art level, in terms of coverage and...",
          "slug": "kurmanji-kurdish-english-mt",
          "status": "completed",
          "student_name": "mgokirmak",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Kurmanji (Kurdish)-English MT"
        },
        {
          "code_url": "http://wiki.apertium.org/wiki/Polish_and_Russian/Project_description#Description_of_the_main_package_components",
          "description": "<p>Currently the pol-rus language pair is in the beginning state (in the incubator). There are very few words in the bilingual dictionary and no rules. The pol dictionary also does not have enough words. My goal is to fill the dictionaries, make as many rules as I'll be able to and bring it near to the release quality.</p>\n",
          "difficulty": null,
          "id": "proj_apertium_2016_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5122107398684672/",
          "proposal_id": null,
          "short_description": "Currently the pol-rus language pair is in the beginning state (in the incubator). There are very few words in the bilingual dictionary and no rules....",
          "slug": "project-adopting-a-language-pair",
          "status": "completed",
          "student_name": "Maria Sheyanova",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Project: Adopting a language pair"
        },
        {
          "code_url": "http://wiki.apertium.org/wiki/User:Aidana/Proposal/Working_plan#Report_of_GSoC_project",
          "description": "<p>These days the translating text automatically by using machine translation is very important, because it helps people from whole world to understand and get information in foreign language very quickly and easy. I want to improve Kazakh-English machine translation(MT) system on Apertium, because: resources could be used for another language pairs, where the Kazakh is source language; English speakers, who are interested in Kazakh culture could use it to understand Kazakh texts, songs and news. My mother language is Kazakh and I fluently speak English, and I am already familiar with Apertium system: I started to build Kazakh-English MT system in 2014. Therefore, I am planning to rise quality of translation by expanding dictionaries, cleaning testoc and writing more rules.</p>\n",
          "difficulty": "beginner",
          "id": "proj_apertium_2016_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/4744168530247680/",
          "proposal_id": null,
          "short_description": "These days the translating text automatically by using machine translation is very important, because it helps people from whole world to understand...",
          "slug": "adopt-an-unreleased-kazakh-english-language-pair",
          "status": "completed",
          "student_name": "Aidana",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Adopt an unreleased Kazakh-English language pair"
        },
        {
          "code_url": "https://gitlab.com/jpsinghgoud/apertium-lint/commits/master",
          "description": "<p>My draft proposal for the Lint for Apertium project.</p>\n",
          "difficulty": null,
          "id": "proj_apertium_2016_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/4902239969738752/",
          "proposal_id": null,
          "short_description": "My draft proposal for the Lint for Apertium project.",
          "slug": "lint-for-apertium",
          "status": "completed",
          "student_name": "Jaipal",
          "student_profile": null,
          "tags": [],
          "title": "Lint For Apertium"
        },
        {
          "code_url": "https://apertium.projectjj.com/gsoc2016/junzayy.html",
          "description": "<p>Our current format handling is brittle, requiring transfer rules to explicitly deal with blanks, and some times inevitably outputting them in the wrong order. This project is to do blank-handling automatically, by treating some blanks as \"glued to words\" (e.g. italics, emphasis), and others as paragraph-level blanks.</p>\n",
          "difficulty": null,
          "id": "proj_apertium_2016_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5791376851599360/",
          "proposal_id": null,
          "short_description": "Our current format handling is brittle, requiring transfer rules to explicitly deal with blanks, and some times inevitably outputting them in the...",
          "slug": "automatic-blank-handling",
          "status": "completed",
          "student_name": "Junaid Ali",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "Automatic Blank Handling"
        },
        {
          "code_url": "http://wiki.apertium.org/wiki/Siciliano_y_castellano/Informe_final",
          "description": "<p>The project goal is to create a machine translation package for Sicilian-Spanish language pair on the base of Apertium’s machine translation system. This project is using the existing Apertium’s Spanish dictionary in order to build a package with two monolingual dictionaries for Spanish and Sicilian languages and a bilingual package for Spanish-Sicilian equivalents and translation rules.</p>\n<p>So, the project flow is the following:</p>\n<ul>\n<li>building a monolingual package for Sicilian,</li>\n<li>creating a bilingual Spanish-Sicilian equivalents dictionary,</li>\n<li>writing lexical decision rules and transfer rules for these languages,</li>\n<li>and collecting a parallel corpus for final evaluation. </li>\n</ul>\n<p>As a result, the final coverage of monolingual Sicilian package must be more than 90% of Sicilian Wikipedia corpus, and the evaluation on the parallel corpus must be error-free. First of all, this Sicilian dictionary has good prospects to become a base for new Apertium language pairs. Second,  automatic translation based on the developed package could be useful for Wikipedia users: Apertium's machine translation for Sicilian could help to translate more articles for the growing Sicilian Wikipedia.</p>\n",
          "difficulty": null,
          "id": "proj_apertium_2016_009",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5883995808071680/",
          "proposal_id": null,
          "short_description": "The project goal is to create a machine translation package for Sicilian-Spanish language pair on the base of Apertium’s machine translation system....",
          "slug": "machine-translation-for-sicilian-spanish-language-pair",
          "status": "completed",
          "student_name": "Uliana Sentsova",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Machine Translation for Sicilian-Spanish Language Pair"
        },
        {
          "code_url": "http://wiki.apertium.org/wiki/Belarusian_and_Russian/Final_report",
          "description": "<p>I propose to create Belarusian-Russian language pair.</p>\n",
          "difficulty": null,
          "id": "proj_apertium_2016_010",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5954603862458368/",
          "proposal_id": null,
          "short_description": "I propose to create Belarusian-Russian language pair.",
          "slug": "new-belarusian-russian-language-pair",
          "status": "completed",
          "student_name": "kvld",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "New Belarusian-Russian language pair"
        },
        {
          "code_url": "http://wiki.apertium.org/wiki/Weighted_transfer_rules_at_GSoC_2016",
          "description": "<p>The idea of the task is to implement a mechanism of resolving transfer rule conflicts using previously obtained rule weights. The tool for obtaining the weights is to be implemented as well.</p>\n<p>Currently, transfer rules have to be devised with no possibility of conflicts, and that limits the system's capabilities, because ambiguity is an essential part of any natural language, and that fact should be reflected by the rules. Introducing of weighted rules would have a positive impact on both how the transfer rules represent the language pair and the quality of the resulting translation.</p>\n<p>The deliverables will be as follows:</p>\n<ol>\n<li>Standalone training script to calculate the weights given the corpus and the rules.</li>\n<li>The code in C++ integrated into Apertium to choose the rules given the weights.</li>\n</ol>\n",
          "difficulty": null,
          "id": "proj_apertium_2016_011",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5976116011466752/",
          "proposal_id": null,
          "short_description": "The idea of the task is to implement a mechanism of resolving transfer rule conflicts using previously obtained rule weights. The tool for obtaining...",
          "slug": "apertium-weighted-transfer-rules",
          "status": "completed",
          "student_name": "tiefling-cat",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Apertium Weighted Transfer Rules"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2016/organizations/5377487227846656/"
    },
    "year_2017": {
      "num_projects": 10,
      "projects": [
        {
          "code_url": "http://wiki.apertium.org/wiki/UD_annotatrix/UD_annotatrix_at_GSoC_2017",
          "description": "<p>The aim of my project is to create an easy-to-use, quick and interactive interface tool for UD annotation based on the existing Apertium project. The tool should work both online and offline and allow a user to edit the annotation in both graphical and text modes. (However, in case, it turns out that it is hard to implement an interface with this functionality based on what there already is, it is possible to write it from scratch, using some appropriate framework.)</p>\n",
          "difficulty": "beginner",
          "id": "proj_apertium_2017_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5408319187451904/",
          "proposal_id": null,
          "short_description": "The aim of my project is to create an easy-to-use, quick and interactive interface tool for UD annotation based on the existing Apertium project. The...",
          "slug": "ud-annotatrix",
          "status": "completed",
          "student_name": "maryszmary",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "UD-annotatrix"
        },
        {
          "code_url": "http://wiki.apertium.org/wiki/Shallow_syntactic_function_labeller",
          "description": "<p>In many pairs it is useful to know in addition to the morphological tags of a word, syntactic function tags in order to make an adequate translation.</p>\n<p>The shallow syntactic function labeller is a tool which takes a string in Apertium stream format, parses it into a\nsequence of morphological tags and gives it to a classifier. The classifier is a seq2seq model trained on prepared datasets, which were made from parsed syntax-labelled corpora (for instance, UD-treebanks).</p>\n<p>The dataset for an encoder contains sequences of morphological tags, the dataset for a decoder contains sequences of labels, in both cases one sequence is a one sentence. The classifier analyzes the given sequence of morphological tags, gives a sequence of labels as an output and the labeller applies these labels to the original string.</p>\n<p>So, in the end of the work there will be:</p>\n<ol>\n<li>The labeller itself, which parses the string, restores a model for a needed language from a file, gives a sequence of tags to the model, gets a sequence of labels as an output and applies these labels to the original string</li>\n<li>Files with trained models, which are saved in a suitable format (it could be, for example, JSON)</li>\n</ol>\n",
          "difficulty": null,
          "id": "proj_apertium_2017_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5054841768378368/",
          "proposal_id": null,
          "short_description": "In many pairs it is useful to know in addition to the morphological tags of a word, syntactic function tags in order to make an adequate translation....",
          "slug": "implementing-a-shallow-syntactic-function-labeller",
          "status": "completed",
          "student_name": "Anna Kondratjeva",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Implementing a shallow syntactic function labeller"
        },
        {
          "code_url": "http://wiki.apertium.org/wiki/User:SilentFlame/updatedPipeline",
          "description": "<p>Our current handling of formatting/markup (HTML, odt, docx, latex) is brittle, requiring transfer rules to explicitly deal with blanks (e.g. markup), and sometimes inevitably outputting them in the wrong order. This project is to implement automatic blank-handling, by treating some blanks as \"glued to words\" (e.g. italics, emphasis), and others as paragraph-level blanks.</p>\n",
          "difficulty": null,
          "id": "proj_apertium_2017_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5549278403493888/",
          "proposal_id": null,
          "short_description": "Our current handling of formatting/markup (HTML, odt, docx, latex) is brittle, requiring transfer rules to explicitly deal with blanks (e.g. markup),...",
          "slug": "automatic-blank-handeling",
          "status": "completed",
          "student_name": "Vinay Singh",
          "student_profile": null,
          "tags": [
            "ml",
            "ui"
          ],
          "title": "Automatic blank handeling"
        },
        {
          "code_url": "https://apertium.projectjj.com/gsoc2017/lylax47.html",
          "description": "<p>I plan to assist in the development of the Czech to Russian language pair in order to bring the Czech to Russian translation capabilities to release state.</p>\n",
          "difficulty": null,
          "id": "proj_apertium_2017_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/4620540983640064/",
          "proposal_id": null,
          "short_description": "I plan to assist in the development of the Czech to Russian language pair in order to bring the Czech to Russian translation capabilities to release...",
          "slug": "development-of-the-czech-to-russian-language-pair",
          "status": "completed",
          "student_name": "lylax47",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Development of the Czech to Russian Language Pair"
        },
        {
          "code_url": "http://wiki.apertium.org/wiki/User:Mono/GSoC_2017",
          "description": "<p>Apertium is a free/open-source platform for rule-based machine translation and language technology which is aimed providing support for lesser-resourced and marginalized languages. The current web interface for this platform is already pretty awesome. However, it still lacks some features such as Dictionary lookup, autocomplete, dropdowns and a lot more that would make this platform even more convenient for the users to use and thus make it even more awesome. This project aims to implement many such features and integrate many such functionalities into the existing web platform thus justifying the title of the project - Improvements to the Apertium Website Interface.</p>\n",
          "difficulty": null,
          "id": "proj_apertium_2017_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/4620792373444608/",
          "proposal_id": null,
          "short_description": "Apertium is a free/open-source platform for rule-based machine translation and language technology which is aimed providing support for...",
          "slug": "improvements-to-the-apertium-website-interface",
          "status": "completed",
          "student_name": "mono",
          "student_profile": null,
          "tags": [
            "web",
            "ai"
          ],
          "title": "Improvements to the Apertium Website Interface"
        },
        {
          "code_url": "http://wiki.apertium.org/wiki/Crimean_Tatar_and_Turkish/GSoC_Report",
          "description": "<p>Creating a new rule based translation pair between Crimean Tatar and Turkish. This involves disambiguation, transfer and lexical selection.</p>\n",
          "difficulty": null,
          "id": "proj_apertium_2017_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/4632948204634112/",
          "proposal_id": null,
          "short_description": "Creating a new rule based translation pair between Crimean Tatar and Turkish. This involves disambiguation, transfer and lexical selection.",
          "slug": "crimean-tatar-turkish-mt",
          "status": "completed",
          "student_name": "Memduh Gökırmak",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Crimean Tatar-Turkish MT"
        },
        {
          "code_url": "http://wiki.apertium.org/wiki/Lsx_module/report2017",
          "description": "<p>Discontiguous multiwords are multi-word expressions that are separated by something in the middle (e.g. \"take the garbage out\") . Apertium currently doesn’t offer support for discontinuous multiwords, and this is a source of many unfortunate translation errors. My plan is to improve the multiwords processor into being able to recognize sentences with discontiguous multiwords and then reorder the structure to place the whole phrasal verb together before entering bilingual dictionary lookup.</p>\n",
          "difficulty": null,
          "id": "proj_apertium_2017_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/4690909727817728/",
          "proposal_id": null,
          "short_description": "Discontiguous multiwords are multi-word expressions that are separated by something in the middle (e.g. \"take the garbage out\") . Apertium currently...",
          "slug": "discontiguous-multiwords",
          "status": "completed",
          "student_name": "Irene Tang",
          "student_profile": null,
          "tags": [],
          "title": "Discontiguous Multiwords"
        },
        {
          "code_url": "https://github.com/BasilisAndr/chkchn",
          "description": "<p>Chukchi is a language with rich and complicated morphology and incorporation.\nBy now morphological parsers using regular expressions were not able to handle it properly. The platforms themselves were not very user-friendly (no documentation whatsoever). \nHFST offers more possibilities than regular expressions for both analysing and constructing forms of Chukchi.\nApertium is, on the one hand, a platform that uses HFST, and on the other hand, a community that is interested in minor languages. \nChukchi is a minority language in Russia that needs a transducer-based morphological parser -- seems like a perfect match.</p>\n",
          "difficulty": null,
          "id": "proj_apertium_2017_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/4736366453719040/",
          "proposal_id": null,
          "short_description": "Chukchi is a language with rich and complicated morphology and incorporation.\nBy now morphological parsers using regular expressions were not able to...",
          "slug": "chukchi-morphological-analyser-using-hfst",
          "status": "completed",
          "student_name": "Vasilisa Andriyanets",
          "student_profile": null,
          "tags": [],
          "title": "Chukchi morphological analyser using HFST"
        },
        {
          "code_url": "http://wiki.apertium.org/wiki/Apertium_cat-srd_and_ita-srd/GSoC_2017",
          "description": "<p>Catalan to Sardinian (apertium-cat-srd):\nThe project has already started and currently the bidix is in the Staging section. The Catalan language is definitely the one that has the most resources in the Apertium platform. The cat-srd bidix has 2645 words with a trimmed coverage of 77.7% and a Wer rate of 34.8%: my goal is to bring coverage up to 86,5% and WER to 15%. The work that I think I can make concerns the increased coverage in bidix,  work on transfer rules lexical selection.</p>\n<p>Apertium Italian to Sardinian (apertium ita-srd):\nLast year, thanks to Google Summer of Code program, the first Italian-Sardinian translator was released, apertium ita-srd. The project was a success.\nAs for apertium ita&gt; srd the goal is to focus on transfer rules: through the structural differences highlighted by the completion of pending tests, this time srd&gt;it requires the construction of new transfer rules that allow to solve problems like enclitics and proclítics (Sardinian there are words that have 3 enclitics and Italian 2, superlatives and NP possessive), lexical selection and morphological disambiguation.</p>\n",
          "difficulty": null,
          "id": "proj_apertium_2017_009",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6499295909904384/",
          "proposal_id": null,
          "short_description": "Catalan to Sardinian (apertium-cat-srd):\nThe project has already started and currently the bidix is in the Staging section. The Catalan language is...",
          "slug": "proposal-apertium-cat-srd-and-ita-srd",
          "status": "completed",
          "student_name": "Gianfranco Fronteddu",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "“Proposal apertium cat-srd and ita-srd”"
        },
        {
          "code_url": "http://wiki.apertium.org/wiki/English_and_Catalan/GSOC_2017",
          "description": "<p>Apertium currently has an English-Catalan language pair in trunk, but there is a lot of room for improvement. One of the existing problems is the use of monodixes not shared with other languages, which makes future development more difficult. The main goal of this proposal is to bring the unreleased eng-cat language pair (which uses shared monodixes) to the same level as the release en-ca language pair in order to get rid of the old pair. In addition, coverage and error rates will be improved by expanding the bidix and adding new transfer and lexical selection rules. The proposal is focused on EN&gt;CA machine translation, but some work will be done to improve the translated texts in the opposite direction.</p>\n",
          "difficulty": null,
          "id": "proj_apertium_2017_010",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5930868531003392/",
          "proposal_id": null,
          "short_description": "Apertium currently has an English-Catalan language pair in trunk, but there is a lot of room for improvement. One of the existing problems is the use...",
          "slug": "adopting-english-catalan-language-pair-to-bring-it-close-to-state-of-the-art-quality",
          "status": "completed",
          "student_name": "Marc Riera Irigoyen",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Adopting English-Catalan language pair to bring it close to state-of-the-art quality"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2017/organizations/6618812501721088/"
    },
    "year_2018": {
      "num_projects": 11,
      "projects": [
        {
          "code_url": "http://wiki.apertium.org/wiki/User:Capsot/GSOC_2018_Occitan_French",
          "description": "<p>I intend to work on a French-Occitan translation pair in order to provide a new translator, which will be useful first to the Occitan community but also to the French people willing to learn more about the Occitan culture and language. It will address more specifically the Occitan Wikipedia users so they can add, work, and improve new articles with a greater ease and speed.</p>\n",
          "difficulty": null,
          "id": "proj_apertium_2018_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5664530495438848/",
          "proposal_id": null,
          "short_description": "I intend to work on a French-Occitan translation pair in order to provide a new translator, which will be useful first to the Occitan community but...",
          "slug": "fra-ocioci-fra-translator",
          "status": "completed",
          "student_name": "Claude Balaguer",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Fra-oci/oci-fra translator"
        },
        {
          "code_url": "http://wiki.apertium.org/wiki/User:Anakuznetsova/GSOC_2018_Guarani_Spanish",
          "description": "<p>Guarani is one of the most widely spread indigenous languages of southern South America. It is spoken by 6 million people in Paraguay (where it is one of the official languages), Brazil, Argentina and Bolivia. Guarani translators are present online, but there is no rule-based translator with morphological analysis, which could be more plausible than translators made from Spanish/Portuguese - Guarani parallel corpora. So I believe we can improve the quality of translation by applying rule-based model.</p>\n",
          "difficulty": null,
          "id": "proj_apertium_2018_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5434804640153600/",
          "proposal_id": null,
          "short_description": "Guarani is one of the most widely spread indigenous languages of southern South America. It is spoken by 6 million people in Paraguay (where it is...",
          "slug": "adoption-of-guarani-spanish-pair",
          "status": "completed",
          "student_name": "Anastasia Kuznetsova",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Adoption of Guarani - Spanish pair"
        },
        {
          "code_url": "http://wiki.apertium.org/wiki/Apertium-kan-mar",
          "description": "<p>I am adding a new language pair (Kannda-Marathi) to Apertium.</p>\n",
          "difficulty": null,
          "id": "proj_apertium_2018_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/6243685763121152/",
          "proposal_id": null,
          "short_description": "I am adding a new language pair (Kannda-Marathi) to Apertium.",
          "slug": "kannada-marathi-language-translation",
          "status": "completed",
          "student_name": "Vidyadheesha D N",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Kannada-Marathi language translation"
        },
        {
          "code_url": "http://wiki.apertium.org/wiki/Kazakh_and_Sakha/GSoC2018_report",
          "description": "<p>I would like to develop Apertium translation pair for Kazakh and Sakha languages. It would benefit society in whole by keeping diversity supporting vulnerable languages, in particular Sakha. There is no any machine translation system which translates to/from Sakha as far as I know. Creating language pair where one language is Sakha would greatly support Sakha language leading to further development of Sakha language machine translation.</p>\n",
          "difficulty": null,
          "id": "proj_apertium_2018_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/4877442304966656/",
          "proposal_id": null,
          "short_description": "I would like to develop Apertium translation pair for Kazakh and Sakha languages. It would benefit society in whole by keeping diversity supporting...",
          "slug": "apertium-translation-pair-for-kazakh-and-sakha",
          "status": "completed",
          "student_name": "Sardana Ivanova",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Apertium translation pair for Kazakh and Sakha"
        },
        {
          "code_url": "https://github.com/dkbrz/GSoC_2018_final",
          "description": "<p>Graph representation is very promising because it represents a philosophical model of a metalanguage knowledge. Knowing several languages, I know that it could be hard to recall some rare word and it is easier to translate from French to English and only then to Russian - because I forgot the word-pair between Russian and French. This graph representation works just like my memory: we cannot recall what is this word from L1 in L2. Hmm, we know L1-L3 and L3-L2. Oh, that's the link we need. Now we know L1-L3 word-pair. So, as we work on <strong><em> natural</em></strong> language processing, let's use <strong><em>natural</em></strong> instruments and systems as well.</p>\n<p>The main benefit of this project is reducing human labor and automatization of part of the dictionary development.</p>\n<ol>\n<li>Finding lacunae in created dictionary</li>\n<li>Dictionary enrichment based on algorithm that offer variants and evaluation of these variants.</li>\n<li>A potential base for creating new pairs.</li>\n</ol>\n<p>List of main ideas:</p>\n<ol>\n<li>Classes to create the most appropriate type of information</li>\n<li>Work with subraphs (connectivity components) to reduce the complexity of calculations</li>\n<li>Filtration algorithms</li>\n<li>Vectorization to increase efficiency</li>\n<li>Develope different metrics to reach quality of translation</li>\n</ol>\n",
          "difficulty": "advanced",
          "id": "proj_apertium_2018_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/4905772915884032/",
          "proposal_id": null,
          "short_description": "Graph representation is very promising because it represents a philosophical model of a metalanguage knowledge. Knowing several languages, I know...",
          "slug": "bilingual-dictionary-enrichment-via-graph-completion",
          "status": "completed",
          "student_name": "Evgenii Glazunov",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Bilingual dictionary enrichment via graph completion"
        },
        {
          "code_url": "http://wiki.apertium.org/wiki/Romanian_and_Catalan/GSOC_2018",
          "description": "<p>Currently there are no machine translation systems offering direct translation between Romanian and Catalan available to the general public. English is commonly used as a pivot language, and the results are sometimes worse than what could be achievable with direct translation, because the two languages have a lot of common (both being Romance languages). In addition, many of Apertium's pairs (including an alpha Romanian-Catalan pair) have not been upgraded to current project standards, which makes present and future development or updated harder.</p>\n<p>This proposal covers the creation of a ready-for-release direct Romanian-Catalan pair from existing linguistic data and documentation, as well as the upgrade and general cleanup of several other Apertium pairs.</p>\n",
          "difficulty": null,
          "id": "proj_apertium_2018_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/4939485456367616/",
          "proposal_id": null,
          "short_description": "Currently there are no machine translation systems offering direct translation between Romanian and Catalan available to the general public. English...",
          "slug": "adopting-the-unreleased-romanian-catalan-pair-and-upgrading-other-pairs-to-the-monolingual-module-system",
          "status": "completed",
          "student_name": "Marc Riera Irigoyen",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Adopting the unreleased Romanian-Catalan pair and upgrading other pairs to the monolingual module system"
        },
        {
          "code_url": "http://wiki.apertium.org/wiki/Uighur_and_Turkish/GSoC2018_report",
          "description": "<p>An MT for the closely related Turkic languages, Uyghur of the Karluk branch and Turkish of the Oghuz branch.</p>\n",
          "difficulty": null,
          "id": "proj_apertium_2018_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5988796768190464/",
          "proposal_id": null,
          "short_description": "An MT for the closely related Turkic languages, Uyghur of the Karluk branch and Turkish of the Oghuz branch.",
          "slug": "uyghur-turkish-mt",
          "status": "completed",
          "student_name": "Oğuz",
          "student_profile": null,
          "tags": [],
          "title": "Uyghur-Turkish MT"
        },
        {
          "code_url": "http://wiki.apertium.org/wiki/Automatic_postediting_at_GSoC_2018",
          "description": "<p>The purpose of this proposal is to create a toolbox for automatic improvement of lexical component of a language pair. This toolbox might become a great way of improving language pairs by filling gaps in dictionaries and reducing the amount of human work at the same time. Even the released Apertium pairs are not perfect and sometimes do mistakes that can be easily fixed.</p>\n<p>The idea is to mine existing machine translation postediting data in Mediawiki Content Translation, extract a set of potential postediting operators and then study and turn these operators into information that can be inserted in Apertium language pair (in form of monodix/bidix entries, lexical selection rules, transfer rules and so on).</p>\n",
          "difficulty": null,
          "id": "proj_apertium_2018_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5991569840668672/",
          "proposal_id": null,
          "short_description": "The purpose of this proposal is to create a toolbox for automatic improvement of lexical component of a language pair. This toolbox might become a...",
          "slug": "improving-language-pairs-by-mining-mediawiki-content-translation-postedits",
          "status": "completed",
          "student_name": "Anna Kondratjeva",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Improving language pairs by mining MediaWiki Content Translation postedits"
        },
        {
          "code_url": "http://wiki.apertium.org/wiki/Tatar_and_Bashkir/GSOC_2018",
          "description": "<p>The tat-bak language pair already exists in Apertium, but is now in the nursery state. The aim of my project is to develop this language pair,  fill the dictionaries, add rules and significantly improve the quality of translations.</p>\n",
          "difficulty": null,
          "id": "proj_apertium_2018_009",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5173252473225216/",
          "proposal_id": null,
          "short_description": "The tat-bak language pair already exists in Apertium, but is now in the nursery state. The aim of my project is to develop this language pair,  fill...",
          "slug": "tatar-and-bashkir-developing-a-language-pair",
          "status": "completed",
          "student_name": "Anna Zueva",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Tatar and Bashkir: developing a language pair"
        },
        {
          "code_url": "http://wiki.apertium.org/wiki/User:Techievena/GSoC_2018_Work_Product_Submission",
          "description": "<p>The aim of this project is to implement the support for morphographemics and weights in the lttoolbox transducer. The proposal focuses on extending lttoolbox to perform the complex morphological transformations and weight based analyses currently done in HFST and writing a module that translates the current HFST format to the new lttoolbox format.</p>\n",
          "difficulty": "advanced",
          "id": "proj_apertium_2018_010",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5193083880734720/",
          "proposal_id": null,
          "short_description": "The aim of this project is to implement the support for morphographemics and weights in the lttoolbox transducer. The proposal focuses on extending...",
          "slug": "extend-lttoolbox-to-have-the-power-of-hfst",
          "status": "completed",
          "student_name": "Abinash Senapati",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Extend lttoolbox to have the power of HFST"
        },
        {
          "code_url": "https://gist.github.com/keggsmurph21/4cce74eb0542373417b2e0366ab9394d",
          "description": "<p>This project aims to extend the functionality of the <strong>UD Annotatrix</strong> tool.  This tool allows researchers to annotate universal dependency trees right in the browser.</p>\n",
          "difficulty": null,
          "id": "proj_apertium_2018_011",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5199294671880192/",
          "proposal_id": null,
          "short_description": "This project aims to extend the functionality of the UD Annotatrix tool.  This tool allows researchers to annotate universal dependency trees right...",
          "slug": "ud-annotatrix",
          "status": "completed",
          "student_name": "kmurphy4",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "UD-Annotatrix"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2018/organizations/5754587369701376/"
    },
    "year_2019": {
      "num_projects": 10,
      "projects": [
        {
          "code_url": "https://github.com/apertium/apertium-recursive",
          "description": "<p>Build a GLR parser-generator as an alternative to the current chunking system to better support long-distance phrasal reordering.</p>\n",
          "difficulty": null,
          "id": "proj_apertium_2019_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/6746718069063680/",
          "proposal_id": null,
          "short_description": "Build a GLR parser-generator as an alternative to the current chunking system to better support long-distance phrasal reordering.",
          "slug": "recursive-transfer",
          "status": "completed",
          "student_name": "Daniel Swanson",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "Recursive Transfer"
        },
        {
          "code_url": "http://wiki.apertium.org/wiki/User:Khannatanmai/GSoC2019Report",
          "description": "<p>Anaphora resolution is the problem of resolving references to earlier items in the discourse. This most commonly appears as pronoun resolution where we need to identify the antecedent in the source context. Apertium works with resource-poor languages and the information available isn’t as linguistically complex as parse trees. Hence there is a need for a tool which resolves anaphora using simple linguistic information.</p>\n<p>Instead of the current system, which chooses a default male for pronoun resolution, this tool will use linguistic features to assign saliency scores to the possible antecedents. The highest scored antecedent is picked for possessive, reflexive, zero pronouns and long-distance relations like agreement in adjectives. This formalism is language agnostic and the features make use of only POS tags and basic gender and number information. I will test it on Spanish, Catalan, English, Russian, French, etc.</p>\n<p>When implemented, this tool will increase the fluency and intelligibility of the Apertium Translation Output of any pair it is used with. It has several interesting future prospects, such as using language specific linguistic features, and general coreference resolution.</p>\n",
          "difficulty": "advanced",
          "id": "proj_apertium_2019_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5434868157120512/",
          "proposal_id": null,
          "short_description": "Anaphora resolution is the problem of resolving references to earlier items in the discourse. This most commonly appears as pronoun resolution where...",
          "slug": "anaphora-resolution",
          "status": "completed",
          "student_name": "Tanmai Khanna",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Anaphora Resolution"
        },
        {
          "code_url": "http://wiki.apertium.org/wiki/User:Qareken/GSoC2019Report",
          "description": "<p>In this project I am going to create a new translation pair between Uzbek and Qaraqalpaq.  There is no other single translator between these two languages, but there is a need for machine translation between the languages.  I expect to be able to develop a high-quality system because of the similarities between the languages, my knowledge of both, and my experience in the past of creating an app that comprises the largest Russian-Karakalpak and Karakalpak-English dictionaries.  It is my hope that this project will open new ways for Karakalpak language to connect with other languages as well.</p>\n",
          "difficulty": null,
          "id": "proj_apertium_2019_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/6137485212516352/",
          "proposal_id": null,
          "short_description": "In this project I am going to create a new translation pair between Uzbek and Qaraqalpaq.  There is no other single translator between these two...",
          "slug": "develop-a-releasable-uzbek-qaraqalpaq-translation-pair",
          "status": "completed",
          "student_name": "Sharapat Kalabaev",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Develop a releasable Uzbek-Qaraqalpaq translation pair"
        },
        {
          "code_url": "https://github.com/aboelhamd/Weighted-transfer-rules-module",
          "description": "<p>Ambiguous patterns are ones that more than one transfer rule could be applied to. Apertium resolves this ambiguity by applying the left-to-right longest match (LRLM) rule, and that is not adequate with all the word/s that follow that pattern/s.\nTo improve this resolution, a new module was introduced to assign weights to these transfer rules for the word/s that follow the ambiguous pattern, and this is done by training a corpus to generate maximum entropy models (models with weighted rules), then these models are used to choose the best (highest weighted) transfer rule to apply.</p>\n<p>The weighted transfer rules module was built to apply only chunker transfer rules (patterns of words). And this project is to improve it by modify some of the methods used and then to extend it to be applied to interchunk and postchunk transfer rules (patterns of chunks) too.</p>\n",
          "difficulty": null,
          "id": "proj_apertium_2019_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5067352637440000/",
          "proposal_id": null,
          "short_description": "Ambiguous patterns are ones that more than one transfer rule could be applied to. Apertium resolves this ambiguity by applying the left-to-right...",
          "slug": "improveextend-weighted-transfer-rules-module",
          "status": "completed",
          "student_name": "Aboelhamd Aly",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Improve/Extend weighted transfer rules module"
        },
        {
          "code_url": "http://wiki.apertium.org/wiki/Turkic_MT_Improvements_GSoC2019_report",
          "description": "<p>Refining four Turkic MTs: uig-tur, kyr-tur, uzb-tur and tat-tur</p>\n",
          "difficulty": null,
          "id": "proj_apertium_2019_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5106764196872192/",
          "proposal_id": null,
          "short_description": "Refining four Turkic MTs: uig-tur, kyr-tur, uzb-tur and tat-tur",
          "slug": "turkic-mt-improvements",
          "status": "completed",
          "student_name": "Oğuz",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "Turkic MT improvements"
        },
        {
          "code_url": "http://wiki.apertium.org/wiki/User:Vaydheesh/GSoC2019Report",
          "description": "<p>Apertium is a free/open-source rule-based machine translation platform implemented in C++. Right now, the project is calling Apertium binaries as subprocess. I would work on creating a CPython Extension module to expose underlying C++ interface in a Pythonic API, with a fallback method to subprocess implementation. Utilizing the shared library overhead caused due to subprocess calls would reduce. The project can be installed across various platforms by executing <code>pip install apertium</code>. The ease of access should also increase the Apertium's User Base.</p>\n",
          "difficulty": null,
          "id": "proj_apertium_2019_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5239196560654336/",
          "proposal_id": null,
          "short_description": "Apertium is a free/open-source rule-based machine translation platform implemented in C++. Right now, the project is calling Apertium binaries as...",
          "slug": "python-apilibrary-for-apertium",
          "status": "completed",
          "student_name": "vaydheesh",
          "student_profile": null,
          "tags": [
            "python",
            "api"
          ],
          "title": "Python API/library for Apertium"
        },
        {
          "code_url": "http://wiki.apertium.org/wiki/User:Eden/GSoC2019Report",
          "description": "<p>An ‘English-Lingala’ language pair using Apertium rule-based machine translation system.</p>\n",
          "difficulty": null,
          "id": "proj_apertium_2019_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/4582884889853952/",
          "proposal_id": null,
          "short_description": "An ‘English-Lingala’ language pair using Apertium rule-based machine translation system.",
          "slug": "english-lingala-language-pair",
          "status": "completed",
          "student_name": "Eden-Grace Muamba",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "English-Lingala language pair"
        },
        {
          "code_url": "https://github.com/apertium/apertium-weighting-tools",
          "description": "<p>Finite state automata/ transducers are currently used in lots of application including machine translation.\nOne of the most challenging parts of developing models based on transducers is how to weight the edges so that finally a certain path is favored over the other.</p>\n<p>The obvious technique is to build a manually annotated corpus, use it to estimate probabilities and then apply these estimates to the edges as weights.However, building a large annotated corpus is in most cases a tiresome job.\nTherefore, the project aims at generating these weights using only a set of raw corpora based on unsupervised techniques.</p>\n",
          "difficulty": null,
          "id": "proj_apertium_2019_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5982561396850688/",
          "proposal_id": null,
          "short_description": "Finite state automata/ transducers are currently used in lots of application including machine translation.\nOne of the most challenging parts of...",
          "slug": "unsupervised-weighting-of-automata",
          "status": "completed",
          "student_name": "Amr Keleg",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Unsupervised weighting of automata"
        },
        {
          "code_url": "https://gist.github.com/yaskevich/237f4900e34902c8ceba0c7a3af00cb4",
          "description": "<p>Bug fixes and feature implementations for Annotatrix tool</p>\n",
          "difficulty": null,
          "id": "proj_apertium_2019_009",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5173615497052160/",
          "proposal_id": null,
          "short_description": "Bug fixes and feature implementations for Annotatrix tool",
          "slug": "improvement-of-annotatrix-project",
          "status": "completed",
          "student_name": "Alyaxey Yaskevich",
          "student_profile": null,
          "tags": [],
          "title": "Improvement of Annotatrix project"
        },
        {
          "code_url": "https://apertium.projectjj.com/gsoc2019/hectoralos.html",
          "description": "<p>In this project there are two major goals: 1) improving the existing translators from Italian to Catalan, from Portuguese to Catalan and from Catalan to Portuguese, obtaining a WER below 15% and a Wikipedia coverage above 91%; and 2) developing a translator from Catalan to Italian with a WER below 15% and a Wikipedia coverage above 91%.</p>\n",
          "difficulty": null,
          "id": "proj_apertium_2019_010",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5184755836911616/",
          "proposal_id": null,
          "short_description": "In this project there are two major goals: 1) improving the existing translators from Italian to Catalan, from Portuguese to Catalan and from Catalan...",
          "slug": "improving-the-catalan-italian-and-catalan-portuguese-language-pairs",
          "status": "completed",
          "student_name": "Hèctor Alòs Font",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Improving the Catalan-Italian and Catalan-Portuguese language pairs"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2019/organizations/5281228587008000/"
    },
    "year_2020": {
      "num_projects": 7,
      "projects": [
        {
          "code_url": "https://github.com/shash42/ApertiumBidixGen",
          "description": "<p>A crucial step in developing a language pair is writing its bilingual dictionary, which maps a lemma X in language A to a lemma Y in language B if X and Y have the same meaning and lexical analysis.</p>\n<p>Apertium’s existing dataset has appreciable amounts of data, which can be visualized in a graph-like structure, previously done in the Apertium RDF project (Jorge Gracia et al., 2016). In essence, each \n pair is visualized as a ‘vertex’ on a graph, with an ‘edge’ between vertices that exist as a translation on Apertium. By exploring this graph, new translations can be inferred. In particular, bilingual dictionaries can be generated for any two languages that do not have an existing language pair but independently exist on Apertium.</p>\n<p>It is notable that polysemy diminishes the use of a simple transitive relation. Apertium’s existing “Crossdics” tool follows this model.</p>\n<p>My proposal will build upon the cycle density algorithm (M. Villegas et al., 2016) that defines confidence metrics in inferred edges based on cycle density. The underlying concept is that a cycle in the graph increases the confidence that vertices on the cycle are valid translation pairs.</p>\n",
          "difficulty": null,
          "id": "proj_apertium_2020_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/6579391720587264/",
          "proposal_id": null,
          "short_description": "A crucial step in developing a language pair is writing its bilingual dictionary, which maps a lemma X in language A to a lemma Y in language B if X...",
          "slug": "bilingual-dictionary-discovery-via-graph-exploration",
          "status": "completed",
          "student_name": "Shashwat Goel",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Bilingual Dictionary Discovery via Graph Exploration"
        },
        {
          "code_url": "https://wiki.apertium.org/wiki/User:Pmodi/GSOC_2020_proposal:_Hindi-Punjabi/progress",
          "description": "<p>I plan on developing the Hindi-Punjabi language pair in both directions i.e. hin-pan and pan-hin. This'll involve improving the monolingual dictionaries for both languages, the hin-pan bilingual dictionary and writing suitable transfer rules to bring this pair to a releasable state.</p>\n",
          "difficulty": null,
          "id": "proj_apertium_2020_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/6209442061746176/",
          "proposal_id": null,
          "short_description": "I plan on developing the Hindi-Punjabi language pair in both directions i.e. hin-pan and pan-hin. This'll involve improving the monolingual...",
          "slug": "adopt-an-unreleased-language-pair-hindi-punjabi",
          "status": "completed",
          "student_name": "Priyank Modi",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Adopt an unreleased language pair : Hindi-Punjabi"
        },
        {
          "code_url": "https://wiki.apertium.org/wiki/User:Elmurod1202/GSoC2020_Final_Report",
          "description": "<p>Creating the State-of-the-art HFST-based Morphological Analayser for Uzbek language, contributing on the Karakapak and Uyghur Morphological analaysers. Furthermore, Bringing Uzbek-Karakalpak language pair to a reliable state. Contributing to other language pairs: Uzbek-Kazakh, Uzbek-Kyrgyz, Uzbek-Turkish as well as Uzbek-Uyghur.</p>\n",
          "difficulty": null,
          "id": "proj_apertium_2020_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/6213388935364608/",
          "proposal_id": null,
          "short_description": "Creating the State-of-the-art HFST-based Morphological Analayser for Uzbek language, contributing on the Karakapak and Uyghur Morphological...",
          "slug": "state-of-the-art-morphological-analayser-for-uzbek-language-and-improved-language-pairs-uz-kk-uz-ky-uz-tr",
          "status": "completed",
          "student_name": "Elmurod Kuriyozov",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "State-of-the-art Morphological Analayser for Uzbek language and improved language pairs uz-kk, uz-ky, uz-tr."
        },
        {
          "code_url": "https://apertium.projectjj.com/gsoc2020/hectoralos.html",
          "description": "<p>I propose to create a bidirectional French-Arpitan translator. Arpitan (often called Franco-Provençal) is an endangered and heavily under-resourced Gallo-Romance language spoken in parts of France, Switzerland and Italy. This would be the first translator for it. A big issue is the lack of a language standard that has clear majority support. I choose the ORB standard because it is one of the three most widely used and is the only one that attempts to be supra-dialectical.</p>\n",
          "difficulty": null,
          "id": "proj_apertium_2020_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/6217740206997504/",
          "proposal_id": null,
          "short_description": "I propose to create a bidirectional French-Arpitan translator. Arpitan (often called Franco-Provençal) is an endangered and heavily under-resourced...",
          "slug": "adopting-the-french-arpitan-language-pair",
          "status": "completed",
          "student_name": "Hèctor Alòs Font",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Adopting the French-Arpitan language pair"
        },
        {
          "code_url": "https://apertium.projectjj.com/gsoc2020/MambetniyazovAmir.html",
          "description": "<p>In this project I am going to create a new language pair uzb-kaa. Last year I have helped with translations to GSoC 2019 student,as I am native speaker of Karakalpak language, who was working on this pair.Therefore by helping the student I understood the project. \nIt would an extraordinary assistance to holders of Karakalpak language, moreover, according to UNESCO, karakalpak language is regarded as vulnerable. The explanation behind this phenomenon is that the scarcity and unexplored status of Karakalpak language, thus, great efforts should be directed to this language. Major stakeholders of the project are native karakalpak people as there will be vast opportunity to explore world knowledge conveniently.</p>\n",
          "difficulty": null,
          "id": "proj_apertium_2020_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/4815970624864256/",
          "proposal_id": null,
          "short_description": "In this project I am going to create a new language pair uzb-kaa. Last year I have helped with translations to GSoC 2019 student,as I am native...",
          "slug": "adopting-an-unreleased-language-pair-of-uzb-kaa",
          "status": "completed",
          "student_name": "Amirniyaz Mambetniyazov",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Adopting an unreleased language pair of Uzb-> Kaa"
        },
        {
          "code_url": "https://www.khalidalnajjar.com/verdd-dictionary-editing-tool/",
          "description": "<p>This proposal is targeted to the task named \"A Web Interface to expanding dictionary lemmas integrate with GitLab/GitHub\". As I have already conducted a great deal of work on a dictionary editing interface (named Ve'rdd), my goal would be to integrate my system better with Apertium. This will require implementing new Aperium specific data fields and information structures, but more importantly developing a synchronization feature. Advanced users will prefer using XMLs directly, but non-technical users will need a user interface. For this reason, I would propose a Git based integration, where Git versioning and conflict management can be exploited to keep both ends of the system, the GUI and the XML, in sync to ensure that all editors have the most up-to-date version available at all times.</p>\n",
          "difficulty": "advanced",
          "id": "proj_apertium_2020_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/4927046397984768/",
          "proposal_id": null,
          "short_description": "This proposal is targeted to the task named \"A Web Interface to expanding dictionary lemmas integrate with GitLab/GitHub\". As I have already...",
          "slug": "extending-verdd-for-apertium-needs",
          "status": "completed",
          "student_name": "Khalid Alnajjar",
          "student_profile": null,
          "tags": [
            "web",
            "ml",
            "ai",
            "ui"
          ],
          "title": "Extending Ve’rdd for Apertium Needs"
        },
        {
          "code_url": "https://wiki.apertium.org/wiki/User:Khannatanmai/GSoC2020_Final_Report",
          "description": "<p>Markup handling has been a problem in Apertium for a long time. It was done using superblanks that encapsulate markup information inside them during the translation process. This works well to protect the formatting of the document. However, languages represent information differently and during translation, words/phrases move around, get deleted, split, merge, etc. The markup information on the words needs to stick with the words, otherwise we end up with erroneous markup in the translation, which is what happened:</p>\n<pre><code>Spanish Input: &lt;i&gt;El perro&lt;/i&gt; &lt;b&gt;blanco&lt;/b&gt;\nEnglish Output: &lt;i&gt;The white&lt;/i&gt; &lt;b&gt;dog&lt;/b&gt;\n</code></pre>\n<p>As part of this project, a new kind of blank was proposed - <strong>a wordbound blank.</strong> It contains any information that needs to stay attached to a word/phrase during the translation process. After modifying most modules in the pipeline to work with these wblanks, writing new de/reformatters, and adding markup in wblanks, the translation we have:</p>\n<pre><code>Spanish Input: &lt;i&gt;El perro&lt;/i&gt; &lt;b&gt;blanco&lt;/b&gt;\nEnglish Output: &lt;i&gt;The&lt;/i&gt; &lt;b&gt;white&lt;/b&gt; &lt;i&gt;dog&lt;/i&gt;\n</code></pre>\n<p>It should prove immensely useful for users of Apertium MT system to translate html or any formatted documents such as odt, docx, pptx.</p>\n",
          "difficulty": null,
          "id": "proj_apertium_2020_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5160743990722560/",
          "proposal_id": null,
          "short_description": "Markup handling has been a problem in Apertium for a long time. It was done using superblanks that encapsulate markup information inside them during...",
          "slug": "modifying-the-apertium-stream-format-and-solving-the-markup-reordering-problem-using-wordbound-blanks",
          "status": "completed",
          "student_name": "Tanmai Khanna",
          "student_profile": null,
          "tags": [
            "ml",
            "ai"
          ],
          "title": "Modifying the apertium stream format and solving the markup reordering problem using wordbound blanks"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2020/organizations/6269334810263552/"
    },
    "year_2021": {
      "num_projects": 10,
      "projects": [
        {
          "code_url": "https://apertium.projectjj.com/gsoc2021/gourab337.html",
          "description": "<p>In this project, I aim to create a hin-ben repository in Apertium that also includes the task of creating/expanding the transfer rules, creating the lexical selection rules, adding several thousand (in the range of 15,000 - 20,000) words in the hin-ben bidix. I also aim to test the translator on real texts to fine-tune the translator and presenting a finished translator with a WER of less than 25%, ready for publication, at the end of the project. I will also properly document the above mentioned deliverables.</p>\n<p>Apertium is a free and open source project. The resources generated by this project will be generally available, not just for use as a translator. There has already been some work on this language pair, but it is unfinished. This project will generate a deliverable that will be a functional machine translator. This will not only make Apertium a functional Bengali morphological analyser/generator, which can be used for other language pairs, but will also give visibility to this fact by creating a functional translator based on Bengali.</p>\n",
          "difficulty": null,
          "id": "proj_apertium_2021_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6423608859033600/",
          "proposal_id": null,
          "short_description": "In this project, I aim to create a hin-ben repository in Apertium that also includes the task of creating/expanding the transfer rules, creating the...",
          "slug": "adopting-the-hindi-bengali-language-pair-unreleased-language-pair",
          "status": "completed",
          "student_name": "Gourab Chakraborty",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Adopting the Hindi-Bengali language pair (unreleased language pair)."
        },
        {
          "code_url": "https://gist.github.com/OverPoweredDev/8bb198c15af03e78b809199fc0b3ccc6",
          "description": "<p>My project has been to develop the Apertium Browser Plugin.</p>\n<p>The previous <a href=\"https://wiki.apertium.org/wiki/Geriaoueg\" target=\"_blank\">Geriaoueg</a> plugin is out of date, with the <a href=\"http://elx.dlsi.ua.es/geriaoueg/\" target=\"_blank\">official link</a> given in the wiki being unreachable and the <a href=\"https://github.com/vigneshv59/geriaoueg-chrome\" target=\"_blank\">2014 version on GitHub</a> being completely unusable on both Firefox and Chrome.</p>\n<p>The extension I've made has 4 main functionalities:</p>\n<ul>\n<li>Translating a word or phrase that the user hovers on on a website</li>\n<li>Translating between an existing language pair in the extension pop-up</li>\n<li>Translating an entire webpage at a time</li>\n<li>Display a hover-on gist for a word, by giving a context-based translation</li>\n</ul>\n",
          "difficulty": null,
          "id": "proj_apertium_2021_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5646788425416704/",
          "proposal_id": null,
          "short_description": "My project has been to develop the Apertium Browser Plugin.\nThe previous Geriaoueg plugin is out of date, with the official link given in the wiki...",
          "slug": "apertium-browser-plugin",
          "status": "completed",
          "student_name": "Omkar Prabhune",
          "student_profile": null,
          "tags": [
            "web",
            "ai"
          ],
          "title": "Apertium Browser Plugin"
        },
        {
          "code_url": "https://apertium.projectjj.com/gsoc2021/pandeyanuradha.html",
          "description": "<p>I plan on developing the Bhojpur-Hindi language pair in both directions i.e. bho-hin and hin-bho.  This will involve building a monolingual dictionary for bho and the bho-hin bilingual dictionary. The next step would be morphological disambiguation and writing suitable transfer rules to bring this pair to a releasable state.</p>\n",
          "difficulty": null,
          "id": "proj_apertium_2021_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5623885411647488/",
          "proposal_id": null,
          "short_description": "I plan on developing the Bhojpur-Hindi language pair in both directions i.e. bho-hin and hin-bho.  This will involve building a monolingual...",
          "slug": "adopt-an-unreleased-language-pair-hindi-bhojpuri",
          "status": "completed",
          "student_name": "Anuradha Pandey",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Adopt an unreleased language pair, Hindi-Bhojpuri"
        },
        {
          "code_url": "https://github.com/kamush901/apertium-kaz-uzb",
          "description": "<p>Having seen the benefits of the open-source Rule-Based Machine Translation platform - Apertium as an alternative to other free/commercial online translator systems, especially for many low-resource language pairs, I decided to contribute to the platform by extending the list of language pairs my native language - Uzbek has so far. \nBeing a master student in philology, and having some experience in the creation of language resources, I would like to propose to implement new language pair: Kazakh - Uzbek for Apertium, as these two languages are both low-resource Turkic languages that are official languages of two respective Central Asian countries with so many economical and cultural relationships. But this language pair still lacks an open-source machine translation system. \nMy proposal is to fill this gap as much as possible during this GSoC2021 program. \nSince Uzbek and Kazakh languages from the same language family, they are closely related in terms of grammar, word order and similarity in vocabulary, so I will try to make a bidirectional translation, with a more focus on Kazakh -&gt; Uzbek side, as Uzbek is my native language and I possess very basic knowledge in Kazakh.</p>\n",
          "difficulty": null,
          "id": "proj_apertium_2021_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6186906601127936/",
          "proposal_id": null,
          "short_description": "Having seen the benefits of the open-source Rule-Based Machine Translation platform - Apertium as an alternative to other free/commercial online...",
          "slug": "implementing-new-language-pair-kazakh-uzbek",
          "status": "completed",
          "student_name": "Kamush",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Implementing new language pair: Kazakh - Uzbek"
        },
        {
          "code_url": "https://wiki.apertium.org/wiki/User:Ifeanyi/GSoC2021_Final_Report",
          "description": "<p>• Creating a high-accuracy morphological analyser for Ibo by contributing to the currently existing one;\n  • Increasing WER on the eng-ibo pair (goal: below 30%);\n  • Increasing naïve coverage of the eng-ibo pair (goal of up to 90%)</p>\n",
          "difficulty": null,
          "id": "proj_apertium_2021_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6102427949858816/",
          "proposal_id": null,
          "short_description": "• Creating a high-accuracy morphological analyser for Ibo by contributing to the currently existing one;\n  • Increasing WER on the eng-ibo pair...",
          "slug": "ideas-for-google-summer-of-codemorphological-analyser",
          "status": "completed",
          "student_name": "Okonkwo Ifeanyichukwu",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Ideas for Google Summer of Code/Morphological analyser"
        },
        {
          "code_url": "https://github.com/vivekvardhanadepu/apertium-lexical-training",
          "description": "<p>The procedure for lexical selection training is a bit messy, with various scripts involved that require lots of manual tweaking, and many third party tools to be installed.\nThe goal of this task is to make the training procedure as streamlined and user-friendly as possible</p>\n",
          "difficulty": null,
          "id": "proj_apertium_2021_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5769288543109120/",
          "proposal_id": null,
          "short_description": "The procedure for lexical selection training is a bit messy, with various scripts involved that require lots of manual tweaking, and many third party...",
          "slug": "user-friendly-lexical-training",
          "status": "completed",
          "student_name": "naan_dhaan",
          "student_profile": null,
          "tags": [
            "ml",
            "ai",
            "ui"
          ],
          "title": "User friendly lexical training"
        },
        {
          "code_url": "https://apertium.projectjj.com/gsoc2021/mr-martian.html",
          "description": "<p>3 mostly unrelated smaller projects that all happen to start with \"uni\": UNIcode, UNIt testing, and UNIversal dependencies transfer (the latter being for fun and I might not get that far).</p>\n",
          "difficulty": null,
          "id": "proj_apertium_2021_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5875785646211072/",
          "proposal_id": null,
          "short_description": "3 mostly unrelated smaller projects that all happen to start with \"uni\": UNIcode, UNIt testing, and UNIversal dependencies transfer (the latter being...",
          "slug": "unipertium",
          "status": "completed",
          "student_name": "Daniel Swanson",
          "student_profile": null,
          "tags": [],
          "title": "Unipertium"
        },
        {
          "code_url": "https://wiki.apertium.org/wiki/User:Ruthenian8/GSOC_2021_progress_report",
          "description": "<p>Bagvalal is an endangered typologically rare Caucasian language from the Nakh-Daghestanian family. Its conservation and study are constrained by the lack of sufficient NLP-tools that can be used to process field data. My proposal is to develop an fst-powered morphological analyzer for Bagvalal using all the available grammatical and lexical information. In the future this project can allow Apertium to support morphological analysis for multiple Nakh-Daghestanian languages and develop corresponding language pairs.</p>\n",
          "difficulty": null,
          "id": "proj_apertium_2021_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5945059475718144/",
          "proposal_id": null,
          "short_description": "Bagvalal is an endangered typologically rare Caucasian language from the Nakh-Daghestanian family. Its conservation and study are constrained by the...",
          "slug": "a-morphological-analyzer-for-bagvalal",
          "status": "completed",
          "student_name": "Daniil Ignatiev",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "A morphological analyzer for Bagvalal"
        },
        {
          "code_url": "https://timo.rantakaulio.github.io/gsoc2021.html",
          "description": "<p>The three languages that this application targets are closely related Balto-Finnic languages spoken in geographical proximity to one another. Finnish is a large majority language with very advanced NLP infrastructure, whereas Olonets-Karelian and Karelian represent two orthographies in this Eastern Finnic dialect continuum. Both Olonets-Karelian and Karelian have written use and linguistic resources, such as Universal Dependencies treebanks, but the resource landscape is still very scarce. One of the current infrastructure problems is the imbalance: some languages and language pairs are much better covered than others. The proposed application aims to bring three closely related language pairs to comparable levels in bilingual dictionary coverage.</p>\n",
          "difficulty": "advanced",
          "id": "proj_apertium_2021_009",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6266611396247552/",
          "proposal_id": null,
          "short_description": "The three languages that this application targets are closely related Balto-Finnic languages spoken in geographical proximity to one another. Finnish...",
          "slug": "finnish-olonets-karelian-and-karelian-lexicon-development",
          "status": "completed",
          "student_name": "Timo Rantakaulio",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Finnish, Olonets-Karelian and Karelian lexicon development"
        },
        {
          "code_url": "https://apertium.projectjj.com/gsoc2021/Zigfruid.html",
          "description": "<p>In this project I'm going to continue developing translation pair Uzb-Kaa languages. In the list of different pairs of Turkic languages, I analyzed that it is hard to find translators in these languages, so I think that the development of translation of these languages ​​leads to improvement. I hope that, I will help to continue translation pair between these languages and it will be useful for all.</p>\n",
          "difficulty": null,
          "id": "proj_apertium_2021_010",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5185890921480192/",
          "proposal_id": null,
          "short_description": "In this project I'm going to continue developing translation pair Uzb-Kaa languages. In the list of different pairs of Turkic languages, I analyzed...",
          "slug": "develop-a-prototype-mt-system-for-a-strategic-language-pair-uzb-kaa",
          "status": "completed",
          "student_name": "Azamat Akimniyazov",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Develop a prototype MT system for a strategic language pair uzb->kaa"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2021/organizations/5702681049432064/"
    },
    "year_2022": null,
    "year_2023": {
      "num_projects": 5,
      "projects": [
        {
          "code_url": "https://ahmedsiam.com/gsoc-2023-report-internationalization-of-apertium-tools",
          "description": "This project aims to internationalize Apertium tools so that they can be localized easily to other languages, which makes usage of Apertium tools easier for non-English users. I have done this by building and using a library that wraps ICU4C, which supports Unicode and internationalization.",
          "difficulty": null,
          "id": "proj_apertium_2023_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/0lVWglOx",
          "proposal_id": "4LDm73yo",
          "short_description": "This project aims to internationalize Apertium tools so that they can be localized easily to other languages, which makes usage of Apertium tools...",
          "slug": "internationalization-of-apertium-tools",
          "status": "completed",
          "student_name": "Ahmed Siam",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Internationalization of Apertium Tools"
        },
        {
          "code_url": "https://apertium.projectjj.com/gsoc2023/aconeil.html",
          "description": "This proposal aims to leverage the language documentation data compiled by linguists in popular fieldwork software tools for extraction of morphological data that can be integrated into the Apertium platform. While linguists are able to build elaborate descriptions of a language, including detailed morphological analysis, using software tools such as FLEx and TLex, this data is seldom used in the generation of computational tools for languages. Data from FLEx and TLex can be exported in XML format and this data can then be used to extract information that can be used in the creation of a monolingual dictionary in Apertium, such as head words, parts of speech, morphological segmentation, and more depending on the information detailed by the linguist(s) working on the data.",
          "difficulty": null,
          "id": "proj_apertium_2023_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/RhokBhsw",
          "proposal_id": "Lu4aEAa7",
          "short_description": "This proposal aims to leverage the language documentation data compiled by linguists in popular fieldwork software tools for extraction of...",
          "slug": "leveraging-morphological-data-from-linguistic-software-tools-for-computational-resource-generation",
          "status": "completed",
          "student_name": "Alex O'Neil",
          "student_profile": null,
          "tags": [
            "ml",
            "ai",
            "ui"
          ],
          "title": "Leveraging Morphological Data from Linguistic Software Tools for Computational Resource Generation"
        },
        {
          "code_url": "https://docs.google.com/document/d/1yxQH6hk-_fjIM9U0fx14OcezMwBUcIlM2WC-AM8O5Y8/edit?usp=sharing",
          "description": "Investigating the suitable tokenizer for east/south Asian languages which usually do not use spaces and implementing it. Besides, improving Japanese-related files.",
          "difficulty": null,
          "id": "proj_apertium_2023_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/dkiuHPRc",
          "proposal_id": "1pEy4sF0",
          "short_description": "Investigating the suitable tokenizer for east/south Asian languages which usually do not use spaces and implementing it. Besides, improving...",
          "slug": "tokenization-for-spaceless-orthographies-in-japanese",
          "status": "completed",
          "student_name": "Eiji Miyamoto",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "Tokenization for spaceless orthographies in Japanese"
        },
        {
          "code_url": "https://docs.google.com/document/d/1dBNZUT_qHMM1y3gSf8GvZUh4wBSUIrl4k4PvvOaV3Y8/edit#heading=h.wdi8pv1ki3o1",
          "description": "I will be working on creating a morphological dictionary for Kumaoni language and then use it for implementing a morphological analyzer. \nThere are very few digital texts on Kumaoni language and no digital dictionary for it is available.",
          "difficulty": null,
          "id": "proj_apertium_2023_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/ivKtj51T",
          "proposal_id": "iAIZmU2h",
          "short_description": "I will be working on creating a morphological dictionary for Kumaoni language and then use it for implementing a morphological analyzer. There are...",
          "slug": "develop-a-morphological-analyser",
          "status": "completed",
          "student_name": "Natasha Singh",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Develop a morphological analyser"
        },
        {
          "code_url": "https://github.com/apertium/apertium-azz-nhi",
          "description": "My idea is to develop a language pair for Highland Puebla Nahuatl (`azz`) and Western Sierra Puebla Nahuatl (`nhi`). Both are endangered variants of Nahuatl (`nah`, but different branches), and are in contact where they are spoken. `azz` is a higher-resource language with publications and government materials, whereas `nhi` is substantially more endangered with only some short stories available. There are monolingual repositories for both, so I'm interested in developing the bilingual dictionaries and transfer rules. This would really nice to have, especially since speakers of both languages often live in the same or neighboring areas, and there is interest in being able to translate materials from one variant to another.",
          "difficulty": null,
          "id": "proj_apertium_2023_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/tREcCymk",
          "proposal_id": "pHFJkzWR",
          "short_description": "My idea is to develop a language pair for Highland Puebla Nahuatl (`azz`) and Western Sierra Puebla Nahuatl (`nhi`). Both are endangered variants of...",
          "slug": "develop-a-language-pair-for-highland-puebla-nahuatl-azz-and-western-sierra-puebla-nahuatl-nhi",
          "status": "completed",
          "student_name": "Robert Pugh",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Develop a language pair for Highland Puebla Nahuatl (azz) and Western Sierra Puebla Nahuatl (nhi)"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2023/organizations/apertium"
    },
    "year_2024": {
      "num_projects": 3,
      "projects": [
        {
          "code_url": "https://github.com/gs-chaitanya/retratosv2",
          "description": "The aim is to construct bidirectional dictionaries for a language pair, given a pair of parallel corpora - i.e., the same content in two different languages using a single script that does the job for the user in a single step, unlike the current method that requires multiple steps to do the job. The final deliverable is a Python script that does the job in one step.",
          "difficulty": null,
          "id": "proj_apertium_2024_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/C1NBt9vM/",
          "proposal_id": null,
          "short_description": "The aim is to construct bidirectional dictionaries for a language pair, given a pair of parallel corpora - i.e., the same content in two different...",
          "slug": "dictionary-induction-from-parallel-corpora",
          "status": "completed",
          "student_name": "Chaitanya Gambali",
          "student_profile": null,
          "tags": [
            "python",
            "ai",
            "ui"
          ],
          "title": "Dictionary Induction from Parallel Corpora"
        },
        {
          "code_url": "https://gist.github.com/PedroManicardi/12f6a58035f5b7ee9307c872453902f6",
          "description": "This project aims to add the Capitalization Handling Module for the es-pt language pair, as well as to create more rules expanding the tool. After that, capitalization will be moved to monolingual modules to improve system performance.\nAs deliveries, will be done: 1. Uptate the language pair with the tool/ 2. Expansion in capitalization restoration/ 3. Documentation explaining how to use/ 3. Sets of tests ensuring the efficiency and opetarion of the capitalization handling module.",
          "difficulty": null,
          "id": "proj_apertium_2024_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/PT6XzpgA/",
          "proposal_id": null,
          "short_description": "This project aims to add the Capitalization Handling Module for the es-pt language pair, as well as to create more rules expanding the tool. After...",
          "slug": "capitalization-handling-module-for-es-pt",
          "status": "completed",
          "student_name": "Pedro Manicardi",
          "student_profile": null,
          "tags": [
            "api",
            "ai"
          ],
          "title": "Capitalization Handling Module for es-pt"
        },
        {
          "code_url": "https://gist.github.com/satti-hari-krishna-reddy/ce373976d09dd4ac2e48df0547e171cc",
          "description": "Developing a spell-checking interface for Apertium's web tools to enhance user experience and accessibility. The project aims to update the existing interface, integrate Voikko and Libvoikko support, and improve error detection and correction across multiple languages",
          "difficulty": null,
          "id": "proj_apertium_2024_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/G8zS5pjT/",
          "proposal_id": null,
          "short_description": "Developing a spell-checking interface for Apertium's web tools to enhance user experience and accessibility. The project aims to update the existing...",
          "slug": "spell-checking-interface-for-apertiums-web-tools",
          "status": "completed",
          "student_name": "Hari Krishna Reddy",
          "student_profile": null,
          "tags": [
            "web",
            "ai"
          ],
          "title": "Spell-Checking Interface for Apertium's Web Tools"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2024/organizations/apertium/"
    },
    "year_2025": null
  },
  "first_time": false,
  "contact": {
    "email": "apertium-contact@lists.sourceforge.net",
    "guide_url": null,
    "ideas_url": null,
    "irc_channel": "https://wiki.apertium.org/wiki/IRC",
    "mailing_list": "apertium-stuff@lists.sourceforge.net"
  },
  "social": {
    "blog": null,
    "discord": null,
    "facebook": null,
    "github": null,
    "gitlab": null,
    "instagram": null,
    "linkedin": null,
    "mastodon": null,
    "medium": null,
    "reddit": null,
    "slack": null,
    "stackoverflow": null,
    "twitch": null,
    "twitter": null,
    "youtube": null
  },
  "meta": {
    "version": 1,
    "generated_at": "2026-01-25T15:28:52.919Z"
  }
}