{
  "id": "692251cc53dd9d7326d33d4e",
  "slug": "asyncapi",
  "name": "AsyncAPI",
  "category": "Programming languages",
  "description": "Building the future of Event-Driven Architectures",
  "image_url": "https://summerofcode.withgoogle.com/media/org/asyncapi/gmnlfvngjaqxjxio.png",
  "img_r2_url": "https://pub-268c3a1efc8b4f8a99115507a760ca14.r2.dev/asyncapi.webp",
  "logo_r2_url": null,
  "url": "https://www.asyncapi.com/",
  "active_years": [
    2024,
    2025
  ],
  "first_year": 2024,
  "last_year": 2025,
  "is_currently_active": true,
  "technologies": [
    "javascript",
    "java",
    "go",
    "typescript",
    "RAML"
  ],
  "topics": [
    "web",
    "api",
    "cloud",
    "Architectures"
  ],
  "total_projects": 15,
  "stats": {
    "avg_projects_per_appeared_year": 7.5,
    "projects_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": null,
      "year_2019": null,
      "year_2020": null,
      "year_2021": null,
      "year_2022": null,
      "year_2023": null,
      "year_2024": 8,
      "year_2025": 7
    },
    "students_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": null,
      "year_2019": null,
      "year_2020": null,
      "year_2021": null,
      "year_2022": null,
      "year_2023": null,
      "year_2024": 8,
      "year_2025": 7
    },
    "total_students": 15
  },
  "years": {
    "year_2016": null,
    "year_2017": null,
    "year_2018": null,
    "year_2019": null,
    "year_2020": null,
    "year_2021": null,
    "year_2022": null,
    "year_2023": null,
    "year_2024": {
      "num_projects": 8,
      "projects": [
        {
          "code_url": "https://gist.github.com/vishvamsinh28/d4cdb7170d03c3de3a99c55e9ac737cd",
          "description": "The AsyncAPI project, focused on enhancing event-driven architectures, requires stable and reliable website components, particularly the scripts used in its website. This proposal seeks to strengthen script stability through a robust unit testing and CI/CD pipeline, ensuring contributions are well-tested to reduce regressions and improve website reliability. The approach involves researching suitable JavaScript testing frameworks, followed by integrating the chosen solution into the AsyncAPI codebase with comprehensive test cases for all scripts. The project employs Jest for unit testing, utilizing its parallel execution and code coverage capabilities, and organizes test files in a structured tests folder for consistency. A CI/CD workflow using GitHub Actions will trigger tests on code changes, helping to catch regressions early. Key deliverables include fully developed unit tests for the specified folder, integration of the testing framework and CI/CD pipeline.",
          "difficulty": null,
          "id": "proj_asyncapi_2024_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/8UtMfDDl/",
          "proposal_id": null,
          "short_description": "The AsyncAPI project, focused on enhancing event-driven architectures, requires stable and reliable website components, particularly the scripts used...",
          "slug": "script-stability-enhancement-for-asyncapi-website",
          "status": "completed",
          "student_name": "Vishvamsinh Vaghela",
          "student_profile": null,
          "tags": [
            "java",
            "javascript",
            "web",
            "api",
            "ui"
          ],
          "title": "Script Stability Enhancement for AsyncAPI Website"
        },
        {
          "code_url": "https://medium.com/@yiquxiao/building-an-autofix-feature-for-asyncapi-in-spectral-my-journey-through-google-summer-of-code-2024-95e01ea79992",
          "description": "I propose to enhance the AsyncAPI Preview and Spectral VS Code extension by adding an autofix feature for common Spectral linting errors. This project aims to improve developer efficiency by automating error corrections within AsyncAPI documents. Using VS Code’s APIs, the feature will identify errors, consult a detailed ruleset for applicable fixes, and apply these corrections directly in the editor.\n\nKey Deliverables:\n**Implementation of the Autofix Feature**\nAutomatically corrects predefined linting errors detected by Spectral\n**Development of a Comprehensive Ruleset**\nOutlines eligible errors for autofix with specific fix logic.\n**User Experience Enhancements**\nEnsures modifications are precise, affecting only relevant lines to prevent structural errors.\n**Unit Testing for Each Fix Function** \nEnsures the reliability and accuracy of autofixes through comprehensive unit tests, covering all scenarios to catch potential issues early.",
          "difficulty": null,
          "id": "proj_asyncapi_2024_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/p5XN9YUk/",
          "proposal_id": null,
          "short_description": "I propose to enhance the AsyncAPI Preview and Spectral VS Code extension by adding an autofix feature for common Spectral linting errors. This...",
          "slug": "autofix-for-spectral-linting-errors-vs-code-extension",
          "status": "completed",
          "student_name": "Esther Xiao",
          "student_profile": null,
          "tags": [
            "ios",
            "api",
            "ai"
          ],
          "title": "Autofix for Spectral Linting Errors: VS Code Extension"
        },
        {
          "code_url": "https://github.com/orgs/asyncapi/projects/50",
          "description": "My interest in AsyncAPI was sparked by my admiration for the technical ingenuity behind Netflix's ability to provide flawless video streaming services globally. As a Master's student studying Data Science and Computer Science at the University of Pennsylvania, I am eager to explore the intricacies of event-driven architectures further, particularly by deepening my contributions to the AsyncAPI community. \n\nMy ambition is to transition from a role of simply contributing code to assuming the responsibilities of a project maintainer for the AsyncAPI Generator, a key instrument for facilitating documentation and code generation based on the AsyncAPI specification. This commitment aims to not just contribute technically but also to foster community engagement and ensure the longevity of the project. In this new role as a maintainer, I plan to review and improve documentation, handle incoming requests, engage in community discourse, assist new contributors, and spearhead the implementation of innovative features, complete with testing. Additionally, I will document my path to becoming a maintainer, the challenges faced, and the insights gained, culminating in a roadmap for future maintainers. This endeavor is not only a testament to my commitment to enhancing the AsyncAPI project but also an opportunity to contribute to the sustainability and enrichment of the broader open-source community. Leveraging my technical skills, demonstrated in a recent project that achieved a 20% performance increase using React.js and Redux, and my proactive participation in AsyncAPI discussions and enhancements, I am prepared to undertake this significant shift.",
          "difficulty": null,
          "id": "proj_asyncapi_2024_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/KtMVbc3b/",
          "proposal_id": null,
          "short_description": "My interest in AsyncAPI was sparked by my admiration for the technical ingenuity behind Netflix's ability to provide flawless video streaming...",
          "slug": "elevating-asyncapi-from-contributor-to-maintainer-a-pathway-to-innovation-and-community-growth",
          "status": "completed",
          "student_name": "Yuan Yuan",
          "student_profile": null,
          "tags": [
            "react",
            "api",
            "ai",
            "ui",
            "ux"
          ],
          "title": "Elevating AsyncAPI: From Contributor to Maintainer A Pathway to Innovation and Community Growth"
        },
        {
          "code_url": "https://github.com/orgs/asyncapi/projects/50/views/1",
          "description": "This is a project to take maintenership of the \"asyncapi/generator\" repository.\nThe proposal invloves the working for \nDefining potential enhancements as GitHub issues\nActively triaging incoming requests and bug fixes\nResolving bugs or providing guidance to others\nShifting focus from creating code to reviewing it at the pull request level\nOccasionally writing documentation\nWriting test\nAnd yes, sometimes coding new features",
          "difficulty": null,
          "id": "proj_asyncapi_2024_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/YKJePVfS/",
          "proposal_id": null,
          "short_description": "This is a project to take maintenership of the \"asyncapi/generator\" repository. The proposal invloves the working for Defining potential enhancements...",
          "slug": "asyncapi-generator-maintainership",
          "status": "completed",
          "student_name": "Mintu Gogoi",
          "student_profile": null,
          "tags": [
            "api",
            "ai",
            "ui"
          ],
          "title": "AsyncAPI Generator Maintainership"
        },
        {
          "code_url": "https://docs.google.com/document/d/1SNQFVXVGIHGP_SOa7iAgSfRkMsugaEjvbRYE016M91k/edit?usp=sharing",
          "description": "The project lies under Postman and AsyncAPI, which is an open-source organisation that is developing an ecosystem around Event Driven Architecture of API's. Essentially transforming the way we interact with API's and giving a new look to the standard REST API that is the industry standard. To support this they have various project under their belt. To promote these and spread awareness about them and the dev's to interact with each other. AsyncAPI plans on the AsyncAPI Conf on Tour 2024, which will utilise this project.",
          "difficulty": null,
          "id": "proj_asyncapi_2024_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/ss5N4XGF/",
          "proposal_id": null,
          "short_description": "The project lies under Postman and AsyncAPI, which is an open-source organisation that is developing an ecosystem around Event Driven Architecture of...",
          "slug": "asynapi-conference-website-maintainence",
          "status": "completed",
          "student_name": "Ashmit Jagtap",
          "student_profile": null,
          "tags": [
            "web",
            "api",
            "ai"
          ],
          "title": "AsynAPI: Conference Website Maintainence"
        },
        {
          "code_url": "https://gist.github.com/nikhilkalburgi/c20a2d01c162eb899519eee1696ed679",
          "description": "This project aims to improve how Asyncapi objects are visualized in AsyncAPI by introducing a new preview feature. By combining Markdown and MermaidJS Class Diagrams, and flowcharts, users can seamlessly integrate with AsyncAPI schema and Avro (.avsc) files, creating dynamic and interactive representations of object structures. The project focuses on building clear class diagrams, and flowcharts with MermaidJS, connecting entities with channels, schemas, and operations, and providing additional info for a visually intuitive understanding of message payloads in AsyncAPI.\n\nI have planned to take the following action points to accomplish this goal:\n\n1.\tSet up the project by installing all necessary dependencies and organizing the structure.\n2.\tDevelop a new Preview Panel resembling the HTML rendering panel in asyncapi-react standalone.\n3.\tIntegrate a components folder to facilitate markdown generation for all asyncapi objects, including mermaid diagrams.\n4.\tImplement mermaid support for diagrams and utilize EJS as a template.\n5.\tIntroduce a tool for converting HTML to Markdown, such as turndown, to enable export functionality. Additionally, I plan to incorporate flowcharts, Class Diagrams, and display relationships among AsyncAPI specifications objects.\n\nA fully-fledged Preview Panel of Markdown for VS-Code will become the outcome of this project.",
          "difficulty": null,
          "id": "proj_asyncapi_2024_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/pinRCdss/",
          "proposal_id": null,
          "short_description": "This project aims to improve how Asyncapi objects are visualized in AsyncAPI by introducing a new preview feature. By combining Markdown and...",
          "slug": "asyncapi-enhanced-preview-option-with-markdown-and-mermaidjs-diagrams",
          "status": "completed",
          "student_name": "Nikhil Kalburgi",
          "student_profile": null,
          "tags": [
            "react",
            "api",
            "ml",
            "ai",
            "ui"
          ],
          "title": "AsyncAPI: Enhanced Preview Option with Markdown and MermaidJS Diagrams"
        },
        {
          "code_url": "https://engineeringwithashmit.hashnode.dev/wrapping-up-gsoc-2024",
          "description": "AsyncAPI is an open-source initiative that seeks to improve the current state of Event-Driven Architecture (EDA). It has a set of tools for documentation, code and model generation, event management, etc. which helps to easily build and maintain EDA. The AsyncAPI Website is the primary source of information for users and developers. \n\nCurrently, the website lacks visual consistency, repeated elements lack consistency in design, and duplicate styling is used for similar visual styles. This makes the codebase and design non-modular.  Existing UI patterns are undocumented which results in miscommunication and re-inventing the wheel instead of building new features.\n\nThe goal of this project is to develop a comprehensive UI Kit that can enhance the existing design, and streamline the development process to simplify the creation and management of cohesive elements in the website. This website UI Kit will help in preventing the process of rebuilding similar components.",
          "difficulty": null,
          "id": "proj_asyncapi_2024_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/S49Gon9W/",
          "proposal_id": null,
          "short_description": "AsyncAPI is an open-source initiative that seeks to improve the current state of Event-Driven Architecture (EDA). It has a set of tools for...",
          "slug": "asyncapi-website-ui-kit-development",
          "status": "completed",
          "student_name": "Ashmit JaiSarita Gupta",
          "student_profile": null,
          "tags": [
            "web",
            "api",
            "ml",
            "ai",
            "ui"
          ],
          "title": "AsyncAPI Website UI Kit Development"
        },
        {
          "code_url": "https://gist.github.com/helios2003/854724092a2bfd20e96982e8a152dbd5",
          "description": "To implement a custom-made preview system that dynamically generates previews when the links of an AsyncAPI Studio document are shared on social platforms such as Twitter, Whatsapp, Slack, Discord, etc. The preview should dynamically fetch and display the document's content, providing users with a richer and more interactive experience directly within their social platform of choice. This approach ensures that the preview always reflects the most up-to-date information from the AsyncAPI document, rather than relying on a static image or hard-coded content enriching the user experience.",
          "difficulty": null,
          "id": "proj_asyncapi_2024_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/AJcg3hZ5/",
          "proposal_id": null,
          "short_description": "To implement a custom-made preview system that dynamically generates previews when the links of an AsyncAPI Studio document are shared on social...",
          "slug": "dynamic-open-graph-preview-for-asyncapi-studio",
          "status": "completed",
          "student_name": "Ankit Dash",
          "student_profile": null,
          "tags": [
            "api"
          ],
          "title": "Dynamic Open Graph Preview for AsyncAPI Studio"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2024/organizations/asyncapi/"
    },
    "year_2025": {
      "num_projects": 7,
      "projects": [
        {
          "code_url": null,
          "description": "The is a project to take maintenership of the \"asyncapi/generator\" repository. The focus is on developing maintainer skills by handling issue triaging, bug fixes, PR reviews, writing tests, improving documentation, helping newcomers to contribute and guiding the project's long-term growth. The mentorship provides a deep understanding of open-source maintenance, making it a valuable opportunity for career growth and industry experience.",
          "difficulty": null,
          "id": "proj_asyncapi_2025_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/MsWQPcNn",
          "proposal_id": "qt8BcFe0",
          "short_description": "The is a project to take maintenership of the \"asyncapi/generator\" repository. The focus is on developing maintainer skills by handling issue...",
          "slug": "asyncapi-generator-maintainership",
          "status": "in-progress",
          "student_name": "Adi Boghawala",
          "student_profile": null,
          "tags": [
            "api",
            "ai",
            "ui"
          ],
          "title": "AsyncAPI Generator Maintainership"
        },
        {
          "code_url": null,
          "description": "AsyncAPI currently lacks comprehensive end-to-end (E2E) testing, making it difficult to ensure that critical user flows remain functional across updates. Without automated testing, regressions can go unnoticed, potentially affecting critical user flows. This project aims to  implement robust E2E testing suite. We will identify critical user workflows, develop automated , and integrate them with GitHub Actions to enable continuous testing with every pull request. By ensuring that core functionalities are thoroughly tested, we can improve reliability, reduce manual QA efforts, and enhance the overall developer experience.",
          "difficulty": null,
          "id": "proj_asyncapi_2025_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/ZohGWe1F",
          "proposal_id": "JuoydM7y",
          "short_description": "AsyncAPI currently lacks comprehensive end-to-end (E2E) testing, making it difficult to ensure that critical user flows remain functional across...",
          "slug": "implement-e2e-ui-tests-for-the-website-critical-flows",
          "status": "in-progress",
          "student_name": "Anushka Sharan",
          "student_profile": null,
          "tags": [
            "web",
            "api",
            "ai",
            "ui"
          ],
          "title": "Implement E2E UI tests for the website critical flows"
        },
        {
          "code_url": null,
          "description": "It focuses on maintaining and improving the AsyncAPI VS Code extension to ensure stability, better usability, and full support for the latest AsyncAPI specifications. The work includes modernizing the codebase, adding real-time linting and validation, improving the document preview experience, automating release workflows, and enhancing contributor documentation. The goal is to deliver a well-documented, user-friendly, and production-ready extension that improves the overall developer experience.",
          "difficulty": null,
          "id": "proj_asyncapi_2025_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/4l304KrX",
          "proposal_id": "zbidsT1N",
          "short_description": "It focuses on maintaining and improving the AsyncAPI VS Code extension to ensure stability, better usability, and full support for the latest...",
          "slug": "vs-code-extension-maintainership",
          "status": "in-progress",
          "student_name": "Ruchi Pakhle",
          "student_profile": null,
          "tags": [
            "api",
            "ai"
          ],
          "title": "VS Code Extension Maintainership"
        },
        {
          "code_url": null,
          "description": "The proposal involves a detailed explanation about how I will tackle the projects tasks. The major tasks are the scripts refactoring, integration and GitHub Actions setup. I have mentioned everything with examples, illustrations and demos.",
          "difficulty": null,
          "id": "proj_asyncapi_2025_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/Z37G7QFl",
          "proposal_id": "VAvk94yO",
          "short_description": "The proposal involves a detailed explanation about how I will tackle the projects tasks. The major tasks are the scripts refactoring, integration and...",
          "slug": "add-npm-folder-for-the-scripts-and-add-integration-tests-for-this-folder",
          "status": "in-progress",
          "student_name": "Sagar Kori",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Add npm folder for the scripts and add integration tests for this folder"
        },
        {
          "code_url": null,
          "description": "The website lacks visual consistency, accessibility features, and a dark mode—critical elements for enhancing the experience of developers and engaging contributing organizations. To address this, I will follow a two-phase approach: first, planning and designing UI components and layouts.; second, implementing these designs using React.js, Next.js, TypeScript, and Tailwind CSS v4.0. Deliverables include a responsive, accessible interface, reusable component system, robust dark mode support, and performance-optimized code.",
          "difficulty": null,
          "id": "proj_asyncapi_2025_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/dVEjdU4X",
          "proposal_id": "DANyatjF",
          "short_description": "The website lacks visual consistency, accessibility features, and a dark mode—critical elements for enhancing the experience of developers and...",
          "slug": "redesign-the-asyncapi-website-and-implement-dark-theme",
          "status": "in-progress",
          "student_name": "Shriya Chauhan",
          "student_profile": null,
          "tags": [
            "react",
            "typescript",
            "web",
            "api",
            "ai"
          ],
          "title": "Redesign the AsyncAPI Website and Implement Dark Theme"
        },
        {
          "code_url": null,
          "description": "AsyncAPI is an open-source initiative that seeks to improve the current state of Event-Driven Architecture (EDA). It has a set of tools for documentation, code and model generation, event management, etc. which helps to easily build and maintain EDA. A template is a project that specifies the generation process output by using the AsyncAPI generator and is the main way developers can benefit from AsyncAPI tool generations. This project aims to extend AsyncAPI suite of community maintained, production ready templates by developing and maintaining a new fully functional Java + Quarkus template for generating asynchronous applications using AsyncAPI’s generator repository. Quarkus, known for its Kubernetes-native capabilities and fast startup times, is an ideal framework for building modern event-driven microservices. This project aims to simplify the development of asynchronous services in Java by generating code and documentation for developers looking to use EDAs in a cloud-native application. Furthermore, this template will be one of the first templates developed inside the AsyncAPI’s generator repository. Allowing developers to test changes locally in the generator repository, making the development easier and reducing the number of workarounds in the template codes. Separation of templates from the generator repo can causes an issue for both maintainers and developers, since template developers sometimes need to do workarounds to address generator issues they encounter during development. This project will start the improved way of developing and maintaining templates for the AsyncAPI initiative. Key deliverables include: dynamic code generation from AsyncAPI specs using the React engine with integrated Kafka support, extensions support for AMQP and MQTT protocols, and a Kubernetes CRD integration.",
          "difficulty": null,
          "id": "proj_asyncapi_2025_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/qDs74iei",
          "proposal_id": "zHuBK2rI",
          "short_description": "AsyncAPI is an open-source initiative that seeks to improve the current state of Event-Driven Architecture (EDA). It has a set of tools for...",
          "slug": "extending-asyncapis-generator-java-templates-with-quarkus",
          "status": "in-progress",
          "student_name": "Shuaib Salad",
          "student_profile": null,
          "tags": [
            "react",
            "java",
            "api",
            "ai",
            "kubernetes"
          ],
          "title": "Extending AsyncAPI's Generator Java Templates with Quarkus"
        },
        {
          "code_url": null,
          "description": "AsyncAPI Conference Website is an essential part of the AsyncAPI Community, it serves as the gateway for the Conference Speakers, Participant and the community member to view the upcoming conferences and participate within it . As the conference website grows, there is a need to enhance the conference website repository in terms of reusability and maintainability for future growth. The goal of this project is to develop a comprehensive UI Kit that can enhance the existing design, and streamline the development process to simplify the creation and management of cohesive elements in the website. This UI Kit will help in preventing the process of rebuilding similar components.",
          "difficulty": null,
          "id": "proj_asyncapi_2025_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/juAST6cE",
          "proposal_id": "760L3LOM",
          "short_description": "AsyncAPI Conference Website is an essential part of the AsyncAPI Community, it serves as the gateway for the Conference Speakers, Participant and the...",
          "slug": "asyncapi-conference-website-ui-kit-development",
          "status": "in-progress",
          "student_name": "Tenzin Delek",
          "student_profile": null,
          "tags": [
            "web",
            "api",
            "ml",
            "ai",
            "ui"
          ],
          "title": "AsyncAPI Conference Website UI Kit Development"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2025/organizations/asyncapi"
    }
  },
  "first_time": false,
  "contact": {
    "email": null,
    "guide_url": "https://github.com/asyncapi/community/blob/master/CONTRIBUTING.md",
    "ideas_url": "https://github.com/asyncapi/community/blob/master/mentorship/summerofcode/2025/asyncapi-gsoc-ideas-page.md",
    "irc_channel": "https://asyncapi.com/slack-invite",
    "mailing_list": null
  },
  "social": {
    "blog": null,
    "discord": null,
    "facebook": null,
    "github": null,
    "gitlab": null,
    "instagram": null,
    "linkedin": null,
    "mastodon": null,
    "medium": null,
    "reddit": null,
    "slack": null,
    "stackoverflow": null,
    "twitch": null,
    "twitter": "https://twitter.com/AsyncAPISpec",
    "youtube": null
  },
  "meta": {
    "version": 1,
    "generated_at": "2026-01-25T15:28:52.938Z"
  }
}