{
  "id": "692251ce53dd9d7326d33d60",
  "slug": "c2si",
  "name": "C2SI",
  "category": "Security",
  "description": "C2SI develops FOSS softwares for everyone!!!",
  "image_url": "https://summerofcode.withgoogle.com/media/org/c2si/35pwh3uirrpdctn8.png",
  "img_r2_url": "https://pub-268c3a1efc8b4f8a99115507a760ca14.r2.dev/c2si.webp",
  "logo_r2_url": null,
  "url": "https://c2si.org/",
  "active_years": [
    2024
  ],
  "first_year": 2024,
  "last_year": 2024,
  "is_currently_active": false,
  "technologies": [
    "python",
    "java",
    "go",
    "node.js",
    "tensorflow"
  ],
  "topics": [
    "security",
    "cloud",
    "ai",
    "mobile",
    "software"
  ],
  "total_projects": 12,
  "stats": {
    "avg_projects_per_appeared_year": 12,
    "projects_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": null,
      "year_2019": null,
      "year_2020": null,
      "year_2021": null,
      "year_2022": null,
      "year_2023": null,
      "year_2024": 12,
      "year_2025": null
    },
    "students_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": null,
      "year_2019": null,
      "year_2020": null,
      "year_2021": null,
      "year_2022": null,
      "year_2023": null,
      "year_2024": 12,
      "year_2025": null
    },
    "total_students": 12
  },
  "years": {
    "year_2016": null,
    "year_2017": null,
    "year_2018": null,
    "year_2019": null,
    "year_2020": null,
    "year_2021": null,
    "year_2022": null,
    "year_2023": null,
    "year_2024": {
      "num_projects": 12,
      "projects": [
        {
          "code_url": "https://github.com/c2siorg/GSoC/blob/master/GSoC-2024/02-Arun-Kumar-Gilla-WebiU-c2siorg-website.md",
          "description": "To address this, I propose creating a dynamic organization\r\nwebsite that automatically fetches project information from GitHub repositories.\r\nCurrent State of the Problem: Manual data entry processes are time-consuming\r\nand prone to errors. This affects the accuracy and timeliness of project\r\ninformation displayed on the organization's website.",
          "difficulty": null,
          "id": "proj_c2si_2024_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/aqdFveGO/",
          "proposal_id": null,
          "short_description": "To address this, I propose creating a dynamic organization website that automatically fetches project information from GitHub repositories. Current...",
          "slug": "webiu-c2siorg-website",
          "status": "completed",
          "student_name": "Arun Kumar Gilla",
          "student_profile": null,
          "tags": [
            "web"
          ],
          "title": "WebiU – c2siorg website"
        },
        {
          "code_url": "https://github.com/c2siorg/GSoC/blob/master/GSoC-2024/03-Debrup-Paul-knowledge-graph-based-retrieval-and-explanation-APIs-for-code-and-text-modalities-in-documentation.md",
          "description": "In this project, I will be building Knowledge Graph of codes and text modalities from documentation using noe4j, LLms, and langchain. The Knowledge Graph will used for efficient retrieval and explanation. It will help in overcoming the problem of hallucination and the accuracy of the task, all these will be wrapped inside streamlit UI and Flask API.",
          "difficulty": null,
          "id": "proj_c2si_2024_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/jf5D7VwU/",
          "proposal_id": null,
          "short_description": "In this project, I will be building Knowledge Graph of codes and text modalities from documentation using noe4j, LLms, and langchain. The Knowledge...",
          "slug": "knowledge-graph-based-retrieval-and-explanation-apis-for-code-and-text-modalities-in-documentation",
          "status": "completed",
          "student_name": "Debrup Paul",
          "student_profile": null,
          "tags": [
            "api",
            "ml",
            "ai",
            "ui"
          ],
          "title": "knowledge graph based retrieval and explanation APIs for code and text modalities in documentation."
        },
        {
          "code_url": "https://github.com/c2siorg/GSoC/blob/master/GSoC-2024/10-Saatwik-Vasishtha-TensorMap.md",
          "description": "This year's goal aims to enhance the TensorMap web application by addressing technical challenges and introducing functionalities to improve usability and efficiency. Key issues, such as dependency management and server-side complexity, will be tackled by Dockerizing the backend for easier deployment. Fixing the neural architecture design workflow will also be the main focus of this year's contribution. New features planned to be introduced into the project include support for image datasets with Convolutional Neural Networks (CNNs), addition of linear regression models for regression tasks, and dataset preprocessing for a better user experience. Finally, documentation on introducing new nodes for future contributors and users along with improved testing coverage for client-side reliability will also be implemented.",
          "difficulty": "advanced",
          "id": "proj_c2si_2024_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/rKXxuFox/",
          "proposal_id": null,
          "short_description": "This year's goal aims to enhance the TensorMap web application by addressing technical challenges and introducing functionalities to improve...",
          "slug": "tensormap",
          "status": "completed",
          "student_name": "Saatwik Vasishtha",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "docker",
            "backend"
          ],
          "title": "TensorMap"
        },
        {
          "code_url": "https://github.com/c2siorg/GSoC/blob/master/GSoC-2024/05-emsdv-WebFL-WebGPU-for-Federated-Learning.md",
          "description": "Federated Learning (FL) is a machine learning (ML) approach that allows models to be trained collaboratively and distributedly without sharing individual data points. WebGPU, a modern web standard and API, provides low-level, high-performance access to a device's GPU through web browsers. It aims to enable developers to create complex graphical applications and experiences on the web by utilizing modern GPU hardware for efficient graphics rendering. Due to their extensive usage and customized optimizations, current Federated Learning (FL) systems frequently concentrate on certain device types, such as smartphones or Internet of Things (IoT) devices. Nevertheless, FL's adaptability to other device kinds may be limited by this device-centric optimization, necessitating substantial coding and redesign work to modify FL systems for diverse device types. Because developers wind up building different and fragmented codebases for each device, this method violates software engineering principles of code reusability, making maintenance more difficult and impeding the effective deployment of FL. In this proposal, a novel WebGPU based federated learning network for heterogeneous device network is proposed. The proposal aims to deliver a working federated learning system supported by web browsers along with additional features.",
          "difficulty": "advanced",
          "id": "proj_c2si_2024_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/l7SskZNS/",
          "proposal_id": null,
          "short_description": "Federated Learning (FL) is a machine learning (ML) approach that allows models to be trained collaboratively and distributedly without sharing...",
          "slug": "webfl-webgpu-for-federated-learning",
          "status": "completed",
          "student_name": "emsdv",
          "student_profile": null,
          "tags": [
            "web",
            "api",
            "ml",
            "ai",
            "ui"
          ],
          "title": "WebFL - WebGPU for Federated Learning"
        },
        {
          "code_url": "https://gist.github.com/hardik1408/26a31a236268b59ea56bd03bfc415b25",
          "description": "As open-source Large Language Models (LLMs) continue to gain popularity, their usability in projects like ours is increasingly evident. In this project, our goal is to develop a CyberSecurity News API tailored for automated bots on social media platforms, leveraging the capabilities of LLMs. This cutting-edge Flask-based API offers seamless access to the latest cybersecurity and hacker news. Users can effortlessly retrieve news articles using specific keywords or without, streamlining the information acquisition process. Additionally, we aim to transition from closed LLMs to open-source ones, enhancing accessibility and transparency. To facilitate widespread testing, we'll also create a small UI for the API, allowing a larger audience to experience its functionality firsthand.",
          "difficulty": null,
          "id": "proj_c2si_2024_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/7kZ0ugFR/",
          "proposal_id": null,
          "short_description": "As open-source Large Language Models (LLMs) continue to gain popularity, their usability in projects like ours is increasingly evident. In this...",
          "slug": "b0bot-cybersecurity-news-api",
          "status": "completed",
          "student_name": "Hardik Jindal",
          "student_profile": null,
          "tags": [
            "api",
            "ml",
            "ai",
            "ui"
          ],
          "title": "B0Bot - CyberSecurity News API"
        },
        {
          "code_url": "https://medium.com/@utkarshraj1306/google-summer-of-code24-with-c2siorg-abaa7a32564f",
          "description": "This proposal involves creating a visually appealing and intuitive website made specifically for C2SI. Essential features include displaying detailed project information such as tech stack, issue count, contributors, forks, and stars, as well as showcasing individual contributor contributions. User authentication will enable personalized views, allowing users to see their own contributions upon logging in. Admin functionality will be provided for managing project visibility settings. Backend development will employ APIs to facilitate communication between frontend and backend systems, utilizing the GitHub API for project details and integrating databases for efficient storage and retrieval of project and contributor data. Comprehensive documentation will be generated to guide future contributors, ensuring clarity and ease of understanding for newcomers to the project.",
          "difficulty": null,
          "id": "proj_c2si_2024_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/bPKMA3rT/",
          "proposal_id": null,
          "short_description": "This proposal involves creating a visually appealing and intuitive website made specifically for C2SI. Essential features include displaying detailed...",
          "slug": "webiu-20-c2siorgscore-lab-website",
          "status": "completed",
          "student_name": "utkarsh_raj_13",
          "student_profile": null,
          "tags": [
            "web",
            "api",
            "ai",
            "database",
            "ui"
          ],
          "title": "WebiU 2.0 :- c2siorg/SCoRe Lab website"
        },
        {
          "code_url": "https://github.com/c2siorg/GSoC/blob/master/GSoC-2024/12-Umang-Singh-DataLoom.md",
          "description": "The Problem -\r\n\r\nModern data analysis and manipulation tasks require robust and intuitive tools that can handle large volumes of data efficiently. Despite the powerful capabilities of the pandas library in Python for data manipulation, there's a significant barrier to entry for those without extensive programming experience. This project aims to bridge that gap by developing a web-based Graphical User Interface (GUI) that leverages pandas for data wrangling, making it accessible to a wider audience.\r\n\r\nAddressing the Issue -\r\n\r\nThe project aims to create a web-based platform that provides a user-friendly interface for performing complex data manipulation tasks using pandas without the need for in-depth programming knowledge. This will democratize access to powerful data analysis tools, empowering users to perform their tasks more efficiently.\r\n\r\nDeliverables -\r\n\r\n● Web-based GUI: A fully functional web application that allows users to interact with pandas functionalities through a graphical interface.\r\n● User Authentication System: Secure login/logout functionality to ensure that users can safely access and manipulate their data.\r\n● Data Upload and Download: Users will be able to upload datasets in various formats\r\n(CSV, Excel) and download manipulated data.\r\n● Data Manipulation Tools: Implementation of GUI elements to perform common data\r\nmanipulation tasks such as filtering, sorting, and joining datasets.\r\n● Real-time Data Preview: Feature allowing users to see the effects of their manipulations in real-time before finalizing their changes.\r\n● User Workspaces: Personalized workspaces where users can save their datasets and\r\nmanipulation scripts for future access.\r\n● Documentation: Comprehensive guides and examples on how to use the platform for various data wrangling tasks",
          "difficulty": "advanced",
          "id": "proj_c2si_2024_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/W3beyj9s/",
          "proposal_id": null,
          "short_description": "The Problem - Modern data analysis and manipulation tasks require robust and intuitive tools that can handle large volumes of data efficiently....",
          "slug": "dataloom",
          "status": "completed",
          "student_name": "Umang  Singh",
          "student_profile": null,
          "tags": [
            "python",
            "web",
            "ai",
            "ui"
          ],
          "title": "DataLoom"
        },
        {
          "code_url": "https://github.com/lokeshwar777/Codelabz",
          "description": "CodeLabz is a platform where the users can engage with online tutorials and the organizations can create tutorials for the users. Currently Codelabz is lacking critical features such as a like/dislike system, complete tutorial pages, a notification system and  a robust search mechanism. The proposal aims to deploy the initial working version of CodeLabz, addressing critical deficiencies and enhancing user engagement, content discoverability, and platform usability.",
          "difficulty": null,
          "id": "proj_c2si_2024_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/DqAwlznt/",
          "proposal_id": null,
          "short_description": "CodeLabz is a platform where the users can engage with online tutorials and the organizations can create tutorials for the users. Currently Codelabz...",
          "slug": "codelabz-deploy-the-first-working-version-of-the-site",
          "status": "completed",
          "student_name": "Mallepally Lokeshwar Reddy",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "CodeLabz - Deploy the first working version of the site."
        },
        {
          "code_url": "https://github.com/c2siorg/GSoC/blob/master/GSoC-2024/07-Joy-Zawadi-Bug-Connector-Proposal.md",
          "description": "The proposal describes an initiative to create a public dataset using publically available Common Vulnerabilities and Exposures (CVE) information. The major purpose is to compile complete data points from multiple sources, add to the dataset, and make it publicly available. The proposal identifies obstacles in correlating commit IDs to CVEs and proposes using timing analysis, NLP approaches, and real-time monitoring to address these issues. The project is separated into two stages: collecting data for existing commits and CVEs and making the system real-time. The implementation strategy involves data collection, correlation algorithm creation, integration of NLP techniques and offline LLM models, and real-time system installation. The deliverables include a comprehensive CVE dataset, correlation techniques, NLP integration, and a real-time monitoring system.",
          "difficulty": null,
          "id": "proj_c2si_2024_009",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/rmFUzLkp/",
          "proposal_id": null,
          "short_description": "The proposal describes an initiative to create a public dataset using publically available Common Vulnerabilities and Exposures (CVE) information....",
          "slug": "bug-connector-proposal",
          "status": "completed",
          "student_name": "Joy Zawadi",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Bug Connector Proposal"
        },
        {
          "code_url": "https://github.com/c2siorg/GSoC/blob/master/GSoC-2024/04-Don-SkamSheild-Spam-Scam-Detector-for-Mobile-Devices.md",
          "description": "Users often encounter calls, SMS messages, and links across various mobile platforms, including browsers, social media, and messaging apps. However, when doubts arise regarding the legitimacy of these communications, such as suspicions of phishing attacks or the presence of malicious links, users currently lack a dedicated platform for submitting and reviewing such content. This absence of a centralized platform leaves users vulnerable to potential threats, as they lack a reliable mechanism to report and verify suspicious communications. Consequently, there is a pressing need for the development of a dedicated platform where users can submit calls, SMS messages, and links for review by trusted authorities or community members. Such a platform would empower users to proactively address security concerns, enhance collective awareness of potential threats, and contribute to the creation of a safer digital environment for all mobile users. \n\nTo address this pressing issue, we propose the development of a comprehensive mobile application equipped with automatic detection capabilities tailored to identify and mitigate spams and scams. In addition to its automated features, the application empowers users to manually contribute instances of suspicious content encountered on diverse platforms, fostering a community-driven approach to combating online fraud. Complementing the mobile app, a dedicated web application will cater to administrative users, providing them with the tools and resources needed to conduct thorough reviews of reported instances. Through a systematic review process, pertinent information about identified spams and scams will be meticulously documented and stored in a secure database, facilitating further analysis and informing future detection strategies.",
          "difficulty": null,
          "id": "proj_c2si_2024_010",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/9gHu616G/",
          "proposal_id": null,
          "short_description": "Users often encounter calls, SMS messages, and links across various mobile platforms, including browsers, social media, and messaging apps. However,...",
          "slug": "skamsheild-spam-scam-detector-for-mobile-devices",
          "status": "completed",
          "student_name": "Don",
          "student_profile": null,
          "tags": [
            "web",
            "mobile",
            "ai",
            "database",
            "ui"
          ],
          "title": "SkamSheild: Spam, Scam Detector for Mobile Devices"
        },
        {
          "code_url": "https://github.com/c2siorg/RustCloud",
          "description": "RustCloud is a rust library which hides the difference between different APIs provided by varied cloud providers (AWS, GCP, Azure etc.) and allows you to manage different cloud resources through a unified and easy to use API.",
          "difficulty": "beginner",
          "id": "proj_c2si_2024_011",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/i6WhP1wc/",
          "proposal_id": null,
          "short_description": "RustCloud is a rust library which hides the difference between different APIs provided by varied cloud providers (AWS, GCP, Azure etc.) and allows...",
          "slug": "rustcloud",
          "status": "completed",
          "student_name": "Partik Singh",
          "student_profile": null,
          "tags": [
            "api",
            "cloud"
          ],
          "title": "RustCloud"
        },
        {
          "code_url": "https://medium.com/@shubhmehta942/google-summer-of-code24-with-c2siorg-282bb8c6ac0a",
          "description": "The issue is to address the usability and accessibility limitations of GDB by developing a\nuser interface (UI) utilizing React. This UI will leverage the GDB Python API to create a\ngraphical dashboard that streamlines the debugging process. By providing a more\nintuitive and visually interactive interface that aims to enhance the debugging\nexperience for developers, making it easier to execute commands, examine program\nstate, and control operations within GDB. It contains features such as starting/stopping\nprogram execution, inspecting variables, registers, and memory, and a log or console\nview for command output and error messages.",
          "difficulty": null,
          "id": "proj_c2si_2024_012",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/WrwfJdvR/",
          "proposal_id": null,
          "short_description": "The issue is to address the usability and accessibility limitations of GDB by developing a user interface (UI) utilizing React. This UI will leverage...",
          "slug": "gdb-ui",
          "status": "completed",
          "student_name": "Shubh Mehta197",
          "student_profile": null,
          "tags": [
            "react",
            "python",
            "api",
            "ml",
            "ai"
          ],
          "title": "GDB UI"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2024/organizations/c2si/"
    },
    "year_2025": null
  },
  "first_time": false,
  "contact": {
    "email": "gsoc@c2si.org",
    "guide_url": null,
    "ideas_url": null,
    "irc_channel": "https://join.slack.com/t/c2si-org/shared_invite/zt-2c4enytwh-ONEWumBjZC5hbUOAmBDP8A",
    "mailing_list": "https://groups.google.com/g/c2si-community"
  },
  "social": {
    "blog": "https://blog.c2si.org",
    "discord": null,
    "facebook": null,
    "github": null,
    "gitlab": null,
    "instagram": null,
    "linkedin": null,
    "mastodon": null,
    "medium": null,
    "reddit": null,
    "slack": "https://join.slack.com/t/c2si-org/shared_invite/zt-2c4enytwh-ONEWumBjZC5hbUOAmBDP8A",
    "stackoverflow": null,
    "twitch": null,
    "twitter": "https://twitter.com/c2si_org",
    "youtube": null
  },
  "meta": {
    "version": 1,
    "generated_at": "2026-01-25T15:28:52.971Z"
  }
}