{
  "id": "692251ed53dd9d7326d33f0a",
  "slug": "camicroscope",
  "name": "caMicroscope",
  "category": "Science and medicine",
  "description": "Toolkit for cancer imaging research",
  "image_url": "https://summerofcode.withgoogle.com/media/org/camicroscope/gnuvwzgnlt6gpjwy-360.png",
  "img_r2_url": "https://pub-268c3a1efc8b4f8a99115507a760ca14.r2.dev/camicroscope.webp",
  "logo_r2_url": null,
  "url": "https://camicroscope.github.io",
  "active_years": [
    2020,
    2021,
    2023,
    2024
  ],
  "first_year": 2020,
  "last_year": 2024,
  "is_currently_active": false,
  "technologies": [
    "python",
    "javascript",
    "java",
    "tensorflow",
    "medical imaging",
    "mongodb",
    "opencv",
    "node.js"
  ],
  "topics": [
    "cloud",
    "distributed systems",
    "science and medicine",
    "precision medicine",
    "data integration",
    "machine learning",
    "data visualization",
    "image analysis",
    "AI/ML",
    "microscopy",
    "dicom pathology"
  ],
  "total_projects": 13,
  "stats": {
    "avg_projects_per_appeared_year": 3.25,
    "projects_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": null,
      "year_2019": null,
      "year_2020": 2,
      "year_2021": 5,
      "year_2022": null,
      "year_2023": 3,
      "year_2024": 3,
      "year_2025": null
    },
    "students_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": null,
      "year_2019": null,
      "year_2020": 2,
      "year_2021": 5,
      "year_2022": null,
      "year_2023": 3,
      "year_2024": 3,
      "year_2025": null
    },
    "total_students": 13
  },
  "years": {
    "year_2016": null,
    "year_2017": null,
    "year_2018": null,
    "year_2019": null,
    "year_2020": {
      "num_projects": 2,
      "projects": [
        {
          "code_url": "https://gist.github.com/akhil-rana/ab5d5280728629865b4578f672fe69d4",
          "description": "<p>caMicroscope is a tool to view, annotate, and analyse biomedical images. The goal of this project is to make an algorithm development workbench where user can create and train their own ML model (CNN) within caMicroscope itself. The user will be given the option to select the training data from the preexisting data in caMicroscope (Labeling Tool) or custom data. Then the user will design the algorithm from scratch using an interactive UI. All these tasks are to be performed within the web browser or a web-server using TensorFlow.js.</p>\n",
          "difficulty": null,
          "id": "proj_camicroscope_2020_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/6656365486931968/",
          "proposal_id": null,
          "short_description": "caMicroscope is a tool to view, annotate, and analyse biomedical images. The goal of this project is to make an algorithm development workbench where...",
          "slug": "pathology-algorithm-development-workbench",
          "status": "completed",
          "student_name": "Akhil Rana",
          "student_profile": null,
          "tags": [
            "web",
            "ml",
            "ai",
            "ui"
          ],
          "title": "Pathology Algorithm Development Workbench"
        },
        {
          "code_url": "https://medium.com/@roychoudhury.archit/gsoc20-with-camicroscope-698d4155e721",
          "description": "<p>At present caMicroscope has many features like marking up images, running machine learning models on individual images, getting the predictions and downloading the image parts . The aim of the project is to extend these features and add new ones such as letting the users fetch regions of interest automatically and store them along with their labels , supporting a wider range of models and\nhaving a feature for normalization of histological stains / synthetic data generation of cancer tissue images .</p>\n",
          "difficulty": null,
          "id": "proj_camicroscope_2020_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5112252769763328/",
          "proposal_id": null,
          "short_description": "At present caMicroscope has many features like marking up images, running machine learning models on individual images, getting the predictions and...",
          "slug": "cancer-region-of-interest-extraction-and-extending-features",
          "status": "completed",
          "student_name": "Archit Roychoudhury",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Cancer Region of Interest Extraction and Extending Features"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2020/organizations/5978557471260672/"
    },
    "year_2021": {
      "num_projects": 5,
      "projects": [
        {
          "code_url": "https://medium.com/@vedant.nandoskar/gsoc-21-looking-back-and-wrapping-up-dbc44200a148",
          "description": "<p>This project aims to develop a feature for Real Time Collaboration on the caMicroscope Slide Viewer which would give users the ability to work together in real time.</p>\n",
          "difficulty": null,
          "id": "proj_camicroscope_2021_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6434317655343104/",
          "proposal_id": null,
          "short_description": "This project aims to develop a feature for Real Time Collaboration on the caMicroscope Slide Viewer which would give users the ability to work...",
          "slug": "real-time-collaborative-pathology",
          "status": "completed",
          "student_name": "Vedant Nandoskar",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Real Time Collaborative Pathology"
        },
        {
          "code_url": "https://gist.github.com/Hemansh31/9230c0b10aafeb2e4712cac6d55c97b7",
          "description": "<p>Often, it's useful for users to compare different results on an image. To facilitate this, caMicrocope supports viewing the same image with different results, such as heatmaps, segmentations, and annotations, in a coordinated fashion. Since adjacent tissue slice images are usually quite similar, it can be useful to have a similar coordination between different images. This project focuses on creating a tool to allow a user to do this. The two different tissue samples may be differently situated in their images, and may require a user to change scale, position, and rotation to sync up the two images.</p>\n",
          "difficulty": null,
          "id": "proj_camicroscope_2021_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6739192553406464/",
          "proposal_id": null,
          "short_description": "Often, it's useful for users to compare different results on an image. To facilitate this, caMicrocope supports viewing the same image with different...",
          "slug": "cross-slide-coordinated-viewing",
          "status": "completed",
          "student_name": "Hemansh Khaneja",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "Cross-Slide Coordinated Viewing"
        },
        {
          "code_url": "https://github.com/YashKumarVerma/gsoc",
          "description": "<p>Currently, caMicroscope uses attribute-based access control, which does not clearly represent the notion of authorization in users and faces performance issues as the database calls are not cached.</p>\n<p>This proposal details the implementation of a Role-Based Access Control mechanism, along with an admin panel implemented as a web interface to facilitate configuring the same after deployments. This would ensure a robust method to protect critical resources and data points, and streamline the process of operating with multiple stakeholders. Along with RBAC, to solve the problem of slow database queries that severely impact application performance, a unique method to implement a cache layer that allows minimal chances in the existing codebases has also been described.</p>\n",
          "difficulty": null,
          "id": "proj_camicroscope_2021_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5096749412122624/",
          "proposal_id": null,
          "short_description": "Currently, caMicroscope uses attribute-based access control, which does not clearly represent the notion of authorization in users and faces...",
          "slug": "rbac-authorization-with-cache-implementation-using-higher-order-functions",
          "status": "completed",
          "student_name": "Yash Kumar Verma",
          "student_profile": null,
          "tags": [
            "web",
            "ml",
            "ai",
            "database"
          ],
          "title": "RBAC Authorization with Cache Implementation using higher order functions"
        },
        {
          "code_url": "https://rohanmallick711.medium.com/gsoc21-with-camicroscope-smartpens-bc192ff07612",
          "description": "<p>This project would involve adapting pathology annotation tools to prefer following edges in the base image when close and also add other smart techniques that will make it look perfect.</p>\n<p>With the current technology, it is possible to aid the process of annotation with computers. This tool will help the user to draw almost 100% accurate drawing/ annotation free-hand with the help of CV (namely, Canny Edge Detection and other algorithms). This feature is similar to the magnetic lasso option in Photoshop.</p>\n<p>This project would also extend other annotation related facilities.</p>\n",
          "difficulty": null,
          "id": "proj_camicroscope_2021_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/4537684592164864/",
          "proposal_id": null,
          "short_description": "This project would involve adapting pathology annotation tools to prefer following edges in the base image when close and also add other smart...",
          "slug": "smart-pens",
          "status": "completed",
          "student_name": "Rohan Mallick",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Smart Pens"
        },
        {
          "code_url": "https://gist.github.com/peddivarshith/847e3deb985e197cbd48af2f933137f7",
          "description": "<p>eeDAP is an evaluation environment for Digital and Analog Pathology. The software has two modes one for digital WSI image evaluation and other for realtime comparison of analog image and digital WSI image. The key features or process of the eeDAP have to be developed such as the registration of the digital and analog images. The registration is done by the study administrator to get the relation between WSI image coordinates and x-y stage coordinates.\nThis project aims to develop the interface to do the local registration and global registration and compute the transformation bias. This will be incorporated with the existing camicroscope code base and added as a plug-in to control the microscope stage movement and lens selection so that comparative analysis of digital WSI image and real-time microscopic image of the same sample is possible.</p>\n",
          "difficulty": null,
          "id": "proj_camicroscope_2021_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5982617152782336/",
          "proposal_id": null,
          "short_description": "eeDAP is an evaluation environment for Digital and Analog Pathology. The software has two modes one for digital WSI image evaluation and other for...",
          "slug": "integrate-an-optical-microscope-with-a-camera-and-motorized-stage-collaboration-with-fda",
          "status": "completed",
          "student_name": "Peddi Sai Varshith",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Integrate an optical microscope with a camera and motorized stage - Collaboration with FDA"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2021/organizations/5372385280131072/"
    },
    "year_2022": null,
    "year_2023": {
      "num_projects": 3,
      "projects": [
        {
          "code_url": "https://gist.github.com/CGDogan/f6e720357d503c506c02199ae8947be1",
          "description": "My project goal was to add DICOM file support to caMicroscope, a Whole Slide Image viewer. The viewer backend (OpenSlide) didn't support DICOM, so we needed a second backend. Surprisingly, before the coding period started, OpenSlide did get DICOM file support and this gave me the opportunity to tackle the bigger challenge of integrating BioFormats into caMicroscope. This would be extraordinary, as BioFormats is a Java library with no C wrappers available online.\n\nI started by refactoring caMicroscope code to use a single base Dockerfile which compiled OpenSlide. Then I made a Java wrapper and prepared its corresponding C caller. For this, I had chosen GraalVM C API, but once I found out about its level of performance and its requirement to achieve high code covergage first (for metadata collection), I rewrote it for Java JNI. To make it available to the two derivatives of our base image, I refactored this to be a separate project. We also needed to make this available to our Python image metadata server, so I wrote a wrapper in Python using cffi.",
          "difficulty": null,
          "id": "proj_camicroscope_2023_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/k6l72ZaB",
          "proposal_id": "D8diFRyZ",
          "short_description": "My project goal was to add DICOM file support to caMicroscope, a Whole Slide Image viewer. The viewer backend (OpenSlide) didn't support DICOM, so we...",
          "slug": "dicom-bioformats",
          "status": "completed",
          "student_name": "cgdogan",
          "student_profile": null,
          "tags": [
            "python",
            "java",
            "api",
            "ai",
            "docker"
          ],
          "title": "DICOM & BioFormats"
        },
        {
          "code_url": "https://github.com/BryanGsep/ML-Training-Assistant-Final-Report",
          "description": "To improve pathology data collection, caMicroscope has added specific tools for assisting with annotations and classifications. However, these tools require a pretrained model and the training workflow is difficult to use. The machine learning training assistant project aims to consolidate and improve the training workflow while also enhancing the user experience. This project may involve adding a microservice to enable training on a server and runtime analysis to determine the most useful information at a given time.",
          "difficulty": null,
          "id": "proj_camicroscope_2023_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/jV0ik9bp",
          "proposal_id": "eJ6UHieZ",
          "short_description": "To improve pathology data collection, caMicroscope has added specific tools for assisting with annotations and classifications. However, these tools...",
          "slug": "machine-learning-training-assistant",
          "status": "completed",
          "student_name": "Dung Do Tien",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Machine Learning Training Assistant"
        },
        {
          "code_url": null,
          "description": "This project aims to add support for Multi-Channel Imaging in caMicroscope, a platform used for visualizing and analyzing medical imaging data. Currently, the platform only supports datasets with a spatial representation for up to three channels. This project aims to create a function that can take in numerical data in CSV format with an arbitrary number of channels and select three fields to assign to red, green, and blue channels to generate an image. This project will allow Researchers and Deep Learning partitioners to make sense of higher-dimensional data and improve their analysis of medical imaging data.",
          "difficulty": null,
          "id": "proj_camicroscope_2023_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/xPesw9Cb",
          "proposal_id": "FStsLPUT",
          "short_description": "This project aims to add support for Multi-Channel Imaging in caMicroscope, a platform used for visualizing and analyzing medical imaging data....",
          "slug": "multi-channel-imaging-support",
          "status": null,
          "student_name": "Tarun Jain",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Multi-channel Imaging Support"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2023/organizations/camicroscope"
    },
    "year_2024": {
      "num_projects": 3,
      "projects": [
        {
          "code_url": "https://docs.google.com/presentation/d/1iWJBiMc3b-E6qb95HwuZfcpSu6SHB2L9xQRYnY2tIFQ/edit?usp=sharing",
          "description": "Develop a web application within caMicroscope to enable users to visually triage multiple slides, adding annotations such as quality scores or re-scanning flags. This project aims to enhance dataset quality by providing an intuitive means for rapid slide assessment.",
          "difficulty": null,
          "id": "proj_camicroscope_2024_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/D5zEXFI1/",
          "proposal_id": null,
          "short_description": "Develop a web application within caMicroscope to enable users to visually triage multiple slides, adding annotations such as quality scores or...",
          "slug": "quality-triage-via-image-visualization-and-annotation",
          "status": "completed",
          "student_name": "Qianqian Zhou",
          "student_profile": null,
          "tags": [
            "web",
            "api",
            "ai",
            "ui"
          ],
          "title": "Quality Triage via Image Visualization and Annotation"
        },
        {
          "code_url": "https://gist.github.com/YukaUU/fe7d0ff2f36584431ffd7336659d65b5",
          "description": "Many pathologists use caMicroscope to annotate WSI cases in their daily work. How pathologists annotate the slide and the different behaviors that different pathologists work on the same slide are very important. Currently, caMicroscope shows some basic Synopsis and Annotations information in the Slide Information Details modal and  the center position, zoom level of the user view.The purpose of this project is to track and collect logs of annotations made by pathologists on a slide, visualize these data on a dashboard(or in other clear ways),  and can share the results in a report format. This enables pathologists to know how other pathologists annotate the same slide.",
          "difficulty": null,
          "id": "proj_camicroscope_2024_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/ifTWS4l5/",
          "proposal_id": null,
          "short_description": "Many pathologists use caMicroscope to annotate WSI cases in their daily work. How pathologists annotate the slide and the different behaviors that...",
          "slug": "pathologist-annotation-behavior-report",
          "status": "completed",
          "student_name": "Yuka Usui",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Pathologist Annotation Behavior Report"
        },
        {
          "code_url": "https://github.com/tkurc/wsi_classification_gsoc2024",
          "description": "The aim of this project is to focus on patch-level classification tasks within the domain of whole slide tissue images. The approach involves utilizing pre-trained models as encoders and applying them to the task of patch-level classification. By leveraging pre-trained models, readily available on platforms like Hugging Face, aim to expedite the development process while maintaining high performance. The ultimate objective of the project is to integrate these pre-trained models into caMicroscope, providing users with a convenient tool for downloading and training models tailored to their specific tasks.\n\nDeliverables:\n- A documented method for training a classification model using a pre-trained or foundation model.\n- Implementation of this method as a set of software components.\n- Integration of the components with caMicroscope.",
          "difficulty": null,
          "id": "proj_camicroscope_2024_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/SJdaGYb3/",
          "proposal_id": null,
          "short_description": "The aim of this project is to focus on patch-level classification tasks within the domain of whole slide tissue images. The approach involves...",
          "slug": "image-classification-using-foundation-models",
          "status": "completed",
          "student_name": "Shakib Khan",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Image Classification using Foundation Models"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2024/organizations/camicroscope/"
    },
    "year_2025": null
  },
  "first_time": false,
  "contact": {
    "email": "camicroscope-gsoc@googlegroups.com",
    "guide_url": null,
    "ideas_url": null,
    "irc_channel": "http://bit.ly/camicroscope",
    "mailing_list": "https://github.com/camicroscope/GSOC/discussions"
  },
  "social": {
    "blog": "https://camicroscope.github.io/community",
    "discord": null,
    "facebook": null,
    "github": null,
    "gitlab": null,
    "instagram": null,
    "linkedin": null,
    "mastodon": null,
    "medium": null,
    "reddit": null,
    "slack": null,
    "stackoverflow": null,
    "twitch": null,
    "twitter": null,
    "youtube": null
  },
  "meta": {
    "version": 1,
    "generated_at": "2026-01-25T15:28:54.513Z"
  }
}