{
  "id": "692251cf53dd9d7326d33d70",
  "slug": "canadian-centre-for-computational-genomics",
  "name": "Canadian Centre for Computational Genomics",
  "category": "Science and medicine",
  "description": "Analytical solutions for Next-Generation Sequencing data",
  "image_url": "https://lh3.googleusercontent.com/hXX62uOn8pUlexFTn2Er3l4zM9wSRNIQlIBIzMVDUKcvzO1q_3nxncfItwGxYsKSVOVzR1n0zoZ4JpDGPGlHJQi00q8YVsU",
  "img_r2_url": "https://pub-268c3a1efc8b4f8a99115507a760ca14.r2.dev/canadian-centre-for-computational-genomics.webp",
  "logo_r2_url": null,
  "url": "http://computationalgenomics.ca/",
  "active_years": [
    2016,
    2018,
    2019,
    2020
  ],
  "first_year": 2016,
  "last_year": 2020,
  "is_currently_active": false,
  "technologies": [
    "python",
    "javascript",
    "sql",
    "git",
    "r-project",
    "perl",
    "r",
    "bash",
    "awk",
    "react",
    "node.js"
  ],
  "topics": [
    "visualization",
    "genomics",
    "bioinformatics",
    "statistics",
    "population genetics",
    "data science",
    "next-generation sequencing",
    "web",
    "science",
    "web development"
  ],
  "total_projects": 15,
  "stats": {
    "avg_projects_per_appeared_year": 3.75,
    "projects_by_year": {
      "year_2016": 3,
      "year_2017": null,
      "year_2018": 3,
      "year_2019": 4,
      "year_2020": 5,
      "year_2021": null,
      "year_2022": null,
      "year_2023": null,
      "year_2024": null,
      "year_2025": null
    },
    "students_by_year": {
      "year_2016": 3,
      "year_2017": null,
      "year_2018": 3,
      "year_2019": 4,
      "year_2020": 5,
      "year_2021": null,
      "year_2022": null,
      "year_2023": null,
      "year_2024": null,
      "year_2025": null
    },
    "total_students": 14
  },
  "years": {
    "year_2016": {
      "num_projects": 3,
      "projects": [
        {
          "code_url": "https://docs.google.com/document/d/1yoOaCmXKc6AXuhj5Gsmu7PxdYdz8O6kqrRd3Z6kaKYM/edit?usp=sharing",
          "description": "<p>The goal of this project is to implement additional steps in the tumor_pair pipeline in order to integrate Structural Variant detection in the analysis. Tools like Lumpy,Delly,SCoNEs and PopSV would be integrated as part of this project to extend the tumor_pair pipeline to include analysis of Structural variants like deletions, tandem duplications, inversions and translocations and also the estimation of Copy Number variation.</p>\n",
          "difficulty": null,
          "id": "proj_canadian-centre-for-_2016_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5100032340525056/",
          "proposal_id": null,
          "short_description": "The goal of this project is to implement additional steps in the tumor_pair pipeline in order to integrate Structural Variant detection in the...",
          "slug": "integrate-structural-variants-calls-in-the-tumor_pair-pipeline-from-mugqic-pipeline",
          "status": "completed",
          "student_name": "Tushar Dubey",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Integrate structural variants calls in the tumor_pair pipeline from MUGQIC Pipeline"
        },
        {
          "code_url": "https://gist.github.com/wlong799/2734e30df249bb088fca09d03198b730",
          "description": "<p>Interpreting genomic data largely relies on simulation software. One important family of software simulates population-level diversity over the course of evolution as a function of selection and demography. The ∂a∂i open-source package, developed by Ryan Gutenkunst (<a href=\"http://gutengroup.mcb.arizona.edu\" target=\"_blank\">http://gutengroup.mcb.arizona.edu</a>), is the leading software in the field, but is limited when handling large datasets.</p>\n<p>This project aims to overhaul the computational engine of the ∂a∂i software by implementing a recently developed approach for solving partial differential equations. The project will use ∂a∂i's interface and code-base, but introduce a new spectrum simulation engine. Using a moment-based approach will improve performance and reduce numerical uncertainty, offering the genetics community with a general-purpose simulation tool that can address larger and more complex datasets than previously possible.</p>\n<p>A prototype version of the computational engine is already running. The goal of this project will be to optimize the engine and embed it efficiently in the existing code-base.</p>\n",
          "difficulty": "advanced",
          "id": "proj_canadian-centre-for-_2016_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5538756002054144/",
          "proposal_id": null,
          "short_description": "Interpreting genomic data largely relies on simulation software. One important family of software simulates population-level diversity over the...",
          "slug": "improved-tools-for-genetic-diversity-modelling",
          "status": "completed",
          "student_name": "wlong799",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Improved Tools for Genetic Diversity Modelling"
        },
        {
          "code_url": "http://abstatic.github.io/gsoc-final.html",
          "description": "<p>SegAnnDb  (Segmentation Annotation Database) is a web app, which helps researchers analyze a chromosome profile for copy number alterations in genes. Many studies have found that copy number variations are linked to diseases like - cancer, tumors, Alzheimers etc. Study and analysis of CNVs is an active area of research in bioinformatics.</p>\n<p>SegAnnDB allows users to upload a profile and then annotate it on basis of <code>loss</code>, <code>gain</code>, <code>deletion</code>, and <code>amplification</code>  Various profiles are stored in the webapp and researchers can work with them. SegAnnDB provides most accurate results when compared to other applications.  It uses concepts of machine learning and data analysis to arrive at most accurate models.</p>\n<p>The aim of this project is to add various significant features into SegAnnDB , some of these will be -</p>\n<ul>\n<li>Test Suite</li>\n<li>Permissions System on profiles</li>\n<li>Replace large PNGs by sub regions of chromosome</li>\n<li>Faster Deletion of profiles</li>\n<li>Sharing of annotations </li>\n<li>Safe cleaning of generate log files</li>\n<li>Packaging it as docker container</li>\n</ul>\n<p>This project will greatly improve collaboration on SegAnnDB, it will also make its development easier and more people will start using it in their research and analysis.</p>\n",
          "difficulty": null,
          "id": "proj_canadian-centre-for-_2016_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/6010805925445632/",
          "proposal_id": null,
          "short_description": "SegAnnDb  (Segmentation Annotation Database) is a web app, which helps researchers analyze a chromosome profile for copy number alterations in genes....",
          "slug": "improving-seganndb-genomic-segmentation-app",
          "status": "completed",
          "student_name": "abstatic",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "database",
            "docker",
            "ui"
          ],
          "title": "Improving SegAnnDB genomic segmentation app"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2016/organizations/5630110493310976/"
    },
    "year_2017": null,
    "year_2018": {
      "num_projects": 3,
      "projects": [
        {
          "code_url": "https://medium.com/alans-gsoc-blog/work-product-a1080d175160",
          "description": "<p>This project will expand the public accessibility of SegAnnDB as well as work on providing integrations with the UCSC Genome Browser and Galaxy.</p>\n",
          "difficulty": null,
          "id": "proj_canadian-centre-for-_2018_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5108068090118144/",
          "proposal_id": null,
          "short_description": "This project will expand the public accessibility of SegAnnDB as well as work on providing integrations with the UCSC Genome Browser and Galaxy.",
          "slug": "providing-public-accessibility-for-seganndb",
          "status": "completed",
          "student_name": "Alan Williams",
          "student_profile": null,
          "tags": [],
          "title": "Providing Public Accessibility for SegAnnDB"
        },
        {
          "code_url": "https://bitbucket.org/snippets/RuijianSZ/MeLa8r/moments-google-summer-of-code-2018",
          "description": "<p>The goal of the summer project is to revise the current implementation so that it can compute large frequency spectra efficiently. As a result, various inference can be carried on huge sample sizes at a reasonable computation cost. The idea is to track a small subset of entries in the full frequency spectrum and interpolate to recover the full AFS to proceed with integration for larger sample sizes. The key problem is how to recover the frequency spectrum accurately, so several experiments would be carried out to tune parameters and implementations. Also, a framework is expected to be developed for balancing the trade off between computational complexity and data recovery accuracy, that is, deciding which kind of data should be computed with approximation and which should be computed directly.</p>\n",
          "difficulty": "advanced",
          "id": "proj_canadian-centre-for-_2018_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5948458435346432/",
          "proposal_id": null,
          "short_description": "The goal of the summer project is to revise the current implementation so that it can compute large frequency spectra efficiently. As a result,...",
          "slug": "efficient-frequency-spectrum-computation-over-large-sample-sizes",
          "status": "completed",
          "student_name": "Ruijian An",
          "student_profile": null,
          "tags": [],
          "title": "Efficient frequency spectrum computation over large sample sizes"
        },
        {
          "code_url": "https://github.com/arjun23496/GSOC-2018/blob/master/Tutorial.ipynb",
          "description": "<p>The problem of population genetics can be viewed as a stochastic process. The aim of the project is to understand the reverse transition dynamics of the system conditioned on the end position. In order to understand the feasibility of using reinforcement learning to the problem, agents are tested against stochastic processes that resemble population genetics. Practical evidence is validated to provide a sanity check on the feasibility of deployment of such a method in practice in large-scale problems of population genetics.</p>\n",
          "difficulty": null,
          "id": "proj_canadian-centre-for-_2018_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5187247892594688/",
          "proposal_id": null,
          "short_description": "The problem of population genetics can be viewed as a stochastic process. The aim of the project is to understand the reverse transition dynamics of...",
          "slug": "population-genetics-simulation-and-modeling-using-reinforcement-learning",
          "status": "completed",
          "student_name": "Arjun Karuvally",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Population genetics simulation and modeling using reinforcement learning"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2018/organizations/5194176413040640/"
    },
    "year_2019": {
      "num_projects": 4,
      "projects": [
        {
          "code_url": "https://bitbucket.org/snippets/madhavvats/eA8nA7",
          "description": "<p>Genpipes is a set of software pipelines designed for genomic analysis. There are currently seven different pipelines and three more are in the development phase. These pipelines consist of several steps (10-40). Therefore keeping track of which step was executed, what functionality did it provide, at what time it was executed, whether it failed or succeeded can be a cumbersome task.\nThe project consists of an integrated system that automatically builds a flowchart of the steps executed by the user. This would be a user-friendly add-on to the software as having a flowchart of the steps executed would help in the analysis and understanding of the process performed.</p>\n",
          "difficulty": null,
          "id": "proj_canadian-centre-for-_2019_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5737956432674816/",
          "proposal_id": null,
          "short_description": "Genpipes is a set of software pipelines designed for genomic analysis. There are currently seven different pipelines and three more are in the...",
          "slug": "flowchart-creator-for-genpipes",
          "status": "completed",
          "student_name": "Madhav Vats",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Flowchart creator for GenPipes"
        },
        {
          "code_url": "https://github.com/pranavtharoor/micm-project-match",
          "description": "<p>The main objective of McGill initiative in Computational Medicine (MiCM) is to deliver inter-disciplinary research programs and empower the use of Big Data in health research and health care delivery. One of the ways MiCM aims to achieve this objective is to strengthen collaborative research by sharing and transferring knowledge within the community.</p>\n<p>In order to realize the potential of Computational Medicine at McGill University, there is a need to better connect researchers in life sciences and clinical domains with researchers and students in the data sciences (e.g., statistics, bioinformatics, medical informatics, computer science, epidemiology). The former has interesting datasets and questions, while the latter can apply or develop quantitative methods to look for solutions to these questions.</p>\n<p>To facilitate this type of matchmaking, this project works on a database-driven, lightweight web application, with the purpose of matching McGill research data projects, with masters and doctoral students seeking looking for interesting projects to analyze.</p>\n",
          "difficulty": null,
          "id": "proj_canadian-centre-for-_2019_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/6479427641278464/",
          "proposal_id": null,
          "short_description": "The main objective of McGill initiative in Computational Medicine (MiCM) is to deliver inter-disciplinary research programs and empower the use of...",
          "slug": "micm-project-match",
          "status": "completed",
          "student_name": "Pranav Tharoor",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "database"
          ],
          "title": "MiCM Project Match"
        },
        {
          "code_url": "https://github.com/kokyriakidis/batchtoolscc",
          "description": "<p>In this project we will work on the new CC systems (Beluga, Graham, Cedar, Niagara) and potentially mp2 trying to automate the setup of things like the account ID, meaningful default resources limits specific to each system, etc., in order to have zero configuration work done by users before being able to submit jobs. We will also work on creating some built-in safeguards against system abuse by novice users when they use this package. Documentation and tutorials will be easy to read and to understand and will be created at the same time the code is created in order to avoid delays in the delivery of the package. There will be use-case integration with PopSV, a package that could integrate this extension in order to demonstrate how easier this makes life for users of PopSV on CC systems. Time permits, we could potentially provide another software that could benefit from this e.g. SCones.</p>\n",
          "difficulty": "beginner",
          "id": "proj_canadian-centre-for-_2019_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/6532285921230848/",
          "proposal_id": null,
          "short_description": "In this project we will work on the new CC systems (Beluga, Graham, Cedar, Niagara) and potentially mp2 trying to automate the setup of things like...",
          "slug": "batchtools-for-compute-canada",
          "status": "completed",
          "student_name": "Konstantinos Kyriakidis",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Batchtools for Compute Canada"
        },
        {
          "code_url": "https://github.com/jiahuanglin/GSoC2019",
          "description": "<p>There has been a recent surge in the development of open-source computational methods for simulating human evolution and analyzing human genome data. These provide many new opportunities for genomic research, but the integration of these different resources is currently poor. In particular, turning models of human history into evolutionary models is notoriously time-consuming and bug-prone, and it requires knowledge of the specifics of each simulation tool. The major goals of this project are to develop a library of widely used historical models that integrate across multiple simulation tools, and to develop more robust and user-friendly model specification tools to automate the workflow of genomic and evolutionary analyses.</p>\n",
          "difficulty": null,
          "id": "proj_canadian-centre-for-_2019_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5823211852267520/",
          "proposal_id": null,
          "short_description": "There has been a recent surge in the development of open-source computational methods for simulating human evolution and analyzing human genome data....",
          "slug": "human-history-and-genome-evolution-project-proposal",
          "status": "completed",
          "student_name": "Jiahuang Lin",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "Human history and genome evolution project proposal"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2019/organizations/5152322794029056/"
    },
    "year_2020": {
      "num_projects": 5,
      "projects": [
        {
          "code_url": "https://gist.github.com/hmharshit/22663905ca08ed79e0a053ae773f45d6",
          "description": "<p>The Canadian Common CV (CCV) is a tool that allows Canadian researchers to input their resume in a standardized format. It is used by multiple organizations such as granting agencies, federal, provincial and academic institutions. The tool enables users to output results in an XML document, that can be used in external applications.</p>\n<p>The main objective is to build an application that can ingest, store and query data from the CCV and show the results in a dashboard. The Web Application will be developed in line with a well documented, tested feature list, able to work across on all browsers.</p>\n",
          "difficulty": null,
          "id": "proj_canadian-centre-for-_2020_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/6406033418747904/",
          "proposal_id": null,
          "short_description": "The Canadian Common CV (CCV) is a tool that allows Canadian researchers to input their resume in a standardized format. It is used by multiple...",
          "slug": "ingesting-the-canadian-common-cv",
          "status": "completed",
          "student_name": "Harshit Maheshwari",
          "student_profile": null,
          "tags": [
            "web",
            "ml",
            "ai",
            "ui"
          ],
          "title": "Ingesting the Canadian Common CV"
        },
        {
          "code_url": "https://gist.github.com/arshul/2ec6271f2f80a67db08fdb5de3d18e27",
          "description": "<p>DevOps for GenPipes would create an automatic deployment of the GenPipes project in the cloud using Terraform. It would support multiple cloud platforms such as AWS, GCP, OpenStack Cloud etc.</p>\n",
          "difficulty": null,
          "id": "proj_canadian-centre-for-_2020_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/6602025191604224/",
          "proposal_id": null,
          "short_description": "DevOps for GenPipes would create an automatic deployment of the GenPipes project in the cloud using Terraform. It would support multiple cloud...",
          "slug": "devops-for-genpipes",
          "status": "completed",
          "student_name": "Mohd Arshul Mansoori",
          "student_profile": null,
          "tags": [
            "cloud"
          ],
          "title": "DevOps for GenPipes"
        },
        {
          "code_url": "https://docs.google.com/document/d/e/2PACX-1vTtTOMd8SRMk1E_PBjZDz7oTux2O11ZvAzTjVBYLk3tl9RXpEXMkRy-cmA3UqYN8-y8vx2y0Q8mMWzb/pub",
          "description": "<p>The objective of the problem arises from the reconstruction of gene genealogies problem - from a given genotypes of sequence data from contemporary individuals and an extended pedigree of genealogical relationships among them we have to decide and be very clear about what we should consider to be nodes information in genealogy tree according to kinds of dependencies among these nodes which should be considered to be edges of the tree. \nThis project will focus on the development of novel algorithms for advanced reconstruction of the gene genealogy by performing inference on graphical models, specifically, implementing the greedy approach and loopy belief propagation algorithm on the succinct tree sequences.\nThe implemented algorithms would undoubtedly be of use to integrate into the existing tskit and msprime libraries.</p>\n",
          "difficulty": "advanced",
          "id": "proj_canadian-centre-for-_2020_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5471532320555008/",
          "proposal_id": null,
          "short_description": "The objective of the problem arises from the reconstruction of gene genealogies problem - from a given genotypes of sequence data from contemporary...",
          "slug": "large-scale-modeling-of-genetic-data",
          "status": "completed",
          "student_name": "Andjela Todorovic",
          "student_profile": null,
          "tags": [],
          "title": "Large-scale modeling of genetic data"
        },
        {
          "code_url": "https://bitbucket.org/kokyriakidis/genpipes/src/nanopore_rnaseq/pipelines/nanopore_rnaseq/",
          "description": "<p>The majority of contemporary genomics and transcriptomics research is carried out using short-read technology such as the output of Illumina sequencers. However, newer long-read technologies such as PacBio and Oxford Nanopore (ONT) are becoming more prevalent due to the advantages they offer over short reads. The main advantage of long reads is that they span a much larger portion of the genome or transcriptome, making it easier to detect events such as structural variants or isoforms. As more researchers begin to take advantage of long reads, GenPipes needs to evolve and support long-read technology in its main pipelines.\n    The objective of this project is to create a new RNA-seq pipeline (rnaseq_longreads), that supports long-read inputs. The new pipeline will be created based on the current versions of the RNA-seq pipeline, with the addition of the minimap2 aligner as well as StringTie v2 and Ballgown for generating transcript counts.\n    In addition to implementing a long-read RNA-seq pipeline within the GenPipes framework, short-read RNA-seq pipeline will also be updated to utilize StringTie2 and both pipelines will be tested to ensure that they are working properly.</p>\n",
          "difficulty": null,
          "id": "proj_canadian-centre-for-_2020_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/6257578411032576/",
          "proposal_id": null,
          "short_description": "The majority of contemporary genomics and transcriptomics research is carried out using short-read technology such as the output of Illumina...",
          "slug": "development-of-a-long-read-nanopore-rna-seq-pipeline-in-genpipes",
          "status": "completed",
          "student_name": "Konstantinos Kyriakidis",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Development of a Long-read Nanopore RNA-seq pipeline in GenPipes"
        },
        {
          "code_url": "https://github.com/abotiamnot/c3g_fin/tree/master/module_helpers",
          "description": "<p>GenPipes is an important tool by C3G. GenPipes contains a suite of different software. The software contained in the suite is continuously updated but there is no method as of now to automatically update the software catalog which is available on the C3G Website. The goal of the project is to develop a pipeline to automate the updating of the software stack, while also adding some more metadata which would be relevant to the software.</p>\n",
          "difficulty": null,
          "id": "proj_canadian-centre-for-_2020_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/6501188956061696/",
          "proposal_id": null,
          "short_description": "GenPipes is an important tool by C3G. GenPipes contains a suite of different software. The software contained in the suite is continuously updated...",
          "slug": "automatic-update-of-the-c3g-software-stack-catalog",
          "status": "completed",
          "student_name": "Moonshroom",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "ui"
          ],
          "title": "Automatic update of the C3G software stack catalog"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2020/organizations/5106421244362752/"
    },
    "year_2021": null,
    "year_2022": null,
    "year_2023": null,
    "year_2024": null,
    "year_2025": null
  },
  "first_time": false,
  "contact": {
    "email": "gsoc@computationalgenomics.ca",
    "guide_url": null,
    "ideas_url": null,
    "irc_channel": null,
    "mailing_list": "https://bitbucket.org/mugqic/gsoc_2020/src/master/mailing_list.md"
  },
  "social": {
    "blog": "https://groups.google.com/forum/#!forum/mugqic_pipelines",
    "discord": null,
    "facebook": null,
    "github": null,
    "gitlab": null,
    "instagram": null,
    "linkedin": null,
    "mastodon": null,
    "medium": null,
    "reddit": null,
    "slack": null,
    "stackoverflow": null,
    "twitch": null,
    "twitter": "https://twitter.com/C3Genomics",
    "youtube": null
  },
  "meta": {
    "version": 1,
    "generated_at": "2026-01-25T15:28:53.000Z"
  }
}