{
  "id": "692251ce53dd9d7326d33d67",
  "slug": "chaoss",
  "name": "CHAOSS",
  "category": "Data",
  "description": "Community Health Analytics Open Source Software",
  "image_url": "https://summerofcode.withgoogle.com/media/org/chaoss/omnpzqtoqzjmesi7-360.png",
  "img_r2_url": "https://pub-268c3a1efc8b4f8a99115507a760ca14.r2.dev/chaoss.webp",
  "logo_r2_url": null,
  "url": "https://chaoss.community",
  "active_years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2025
  ],
  "first_year": 2018,
  "last_year": 2025,
  "is_currently_active": true,
  "technologies": [
    "javascript",
    "python 3",
    "python",
    "mysql",
    "jupyter",
    "elasicsearch",
    "elasticsearch",
    "kibana",
    "elk",
    "vue",
    "nltk",
    "fossology",
    "postgresql",
    "machine learning",
    "airflow",
    "metrics"
  ],
  "topics": [
    "visualization",
    "machine learning",
    "data visualization",
    "metrics",
    "health",
    "community",
    "sustainability",
    "analytics",
    "community health",
    "dependencies",
    "diversity and inclusion",
    "Diversity Equity and Inclusion",
    "open source software metrics",
    "software sustainability",
    "community building",
    "security and software bill of materials"
  ],
  "total_projects": 29,
  "stats": {
    "avg_projects_per_appeared_year": 4.83,
    "projects_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": 2,
      "year_2019": 4,
      "year_2020": 9,
      "year_2021": 6,
      "year_2022": 5,
      "year_2023": null,
      "year_2024": null,
      "year_2025": 3
    },
    "students_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": 2,
      "year_2019": 4,
      "year_2020": 9,
      "year_2021": 6,
      "year_2022": 5,
      "year_2023": null,
      "year_2024": null,
      "year_2025": 3
    },
    "total_students": 28
  },
  "years": {
    "year_2016": null,
    "year_2017": null,
    "year_2018": {
      "num_projects": 2,
      "projects": [
        {
          "code_url": "https://kmn5409.github.io/keanu-nichols/gsoc/2018/08/10/gsoc-Week-14.html",
          "description": "<p>Writing Python code to query GrimoireLab Elastisearch databases and obtain from it the metrics relevant for the report. Possible technologies to achieve this aim include Python Pandas.</p>\n",
          "difficulty": null,
          "id": "proj_chaoss_2018_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/6518865190191104/",
          "proposal_id": null,
          "short_description": "Writing Python code to query GrimoireLab Elastisearch databases and obtain from it the metrics relevant for the report. Possible technologies to...",
          "slug": "reporting-of-chaoss-metrics",
          "status": "completed",
          "student_name": "Keanu Nichols",
          "student_profile": null,
          "tags": [
            "python",
            "ai",
            "database"
          ],
          "title": "Reporting of CHAOSS Metrics"
        },
        {
          "code_url": "https://aswanipranjal.github.io/posts/week-14/",
          "description": "<p>The Manuscripts project, which is a part of the Grimoire Toolset, helps us in analysing repositories and projects by creating a report based on predefined Metrics which give an overview of the project.\nThe infrastructure of the current report generation system needs to be updated so that the users can spend less time on figuring out the hows and can focus on the functionality.\nThe aim of this project is to extend the capabilities of the Manuscripts project so that it covers almost all the Metrics that can be calculated using the different data sources. At the end of this project, we will have a bigger and better reporting system.</p>\n",
          "difficulty": null,
          "id": "proj_chaoss_2018_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5756915711737856/",
          "proposal_id": null,
          "short_description": "The Manuscripts project, which is a part of the Grimoire Toolset, helps us in analysing repositories and projects by creating a report based on...",
          "slug": "reporting-of-chaoss-metrics-refactoring-the-existing-code-and-extending-the-capabilities-of-the-manuscripts-project",
          "status": "completed",
          "student_name": "Pranjal Aswani",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Reporting of CHAOSS Metrics: Refactoring the existing code and extending the capabilities of the Manuscripts Project"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2018/organizations/5116840829255680/"
    },
    "year_2019": {
      "num_projects": 4,
      "projects": [
        {
          "code_url": "https://blog.bing0ne.com/p/gsoc-final/",
          "description": "<p>The project aims are to implement Risk metrics and other metrics within the Growth-Maturity-Decline CHAOSS metrics and use cases using Augur, focusing on what we have unearthed as the open source community manager use case.</p>\n",
          "difficulty": null,
          "id": "proj_chaoss_2019_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/6646571444207616/",
          "proposal_id": null,
          "short_description": "The project aims are to implement Risk metrics and other metrics within the Growth-Maturity-Decline CHAOSS metrics and use cases using Augur,...",
          "slug": "build-chaoss-risk-and-growth-maturity-and-decline-metrics-in-augur",
          "status": "completed",
          "student_name": "Bingwen Ma",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Build CHAOSS Risk and Growth Maturity and Decline Metrics in Augur"
        },
        {
          "code_url": "https://inishchith.github.io/blog/2019/08/coding-period-3-11.html",
          "description": "<p>Graal produces analysis related to code complexity, quality, dependencies, vulnerability and licensing and the data produced conforms to the ones that can be processed by GrimoireLab. \nI will mainly be focusing on:</p>\n<ul>\n<li>Adding support of source code related metrics to Grimoirelab with the help of analysis data produced by Graal. </li>\n<li>Adapting Grimoirelab toolchain to be able to execute Graal and process the data produced by it.</li>\n<li>Writing appropriate unit tests for additional backends, their corresponding supporting connectors, and methods.</li>\n<li>Producing analytics related to proposed and calculated metrics* ( described below )</li>\n<li>Adding documentation related to additional features and improvements in existing ones.</li>\n</ul>\n<p>Out of all the five backends provided by Graal, CoCom (Code Complexity) covers a vast majority of the popular languages and CoLic (Code License) supported by NOMOS &amp; ScanCode helps us fetch license &amp; copyright related information from software development repositories and is language independent. Addition of metrics related to these two backends during GSoC period could be applied to a wide range of projects in the future.</p>\n",
          "difficulty": "advanced",
          "id": "proj_chaoss_2019_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5400999387201536/",
          "proposal_id": null,
          "short_description": "Graal produces analysis related to code complexity, quality, dependencies, vulnerability and licensing and the data produced conforms to the ones...",
          "slug": "support-of-source-code-related-metrics",
          "status": "completed",
          "student_name": "Nishchith K Shetty",
          "student_profile": null,
          "tags": [
            "ai",
            "backend"
          ],
          "title": "Support of Source Code Related Metrics"
        },
        {
          "code_url": "https://polaris000.github.io/blog/final_report",
          "description": "<p>The aim of this project is to create reference implementations and tests, primarily for the metrics defined by the Evolution Working Group, but also for the other working groups. This will be done by analyzing the data retrieved by Perceval from various sources using jupyter notebooks, pandas and matplotlib.</p>\n",
          "difficulty": null,
          "id": "proj_chaoss_2019_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/4788572886925312/",
          "proposal_id": null,
          "short_description": "The aim of this project is to create reference implementations and tests, primarily for the metrics defined by the Evolution Working Group, but also...",
          "slug": "implementing-chaoss-metrics-with-perceval",
          "status": "completed",
          "student_name": "Aniruddha Karajgi",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Implementing CHAOSS Metrics with Perceval"
        },
        {
          "code_url": "https://github.com/parthsharma2/gsoc-2019",
          "description": "<p>Augur is fully functional prototyping web stack for CHAOSS metrics. It provides structured data mined from git repositories using a plugin architecture that incorporates other open source metrics projects like Facade and FOSSology. The main aim of this project is to extend Augur’s functionality by implementing Risk and Growth-Maturity-Decline CHAOSS metrics and use cases with a focus on the open source community manager use case. \nThis project, with a focus on the community manager use case, will allow open source community managers to leverage Risk and Growth-Maturity-Decline metrics to better manage their communities and projects.</p>\n",
          "difficulty": null,
          "id": "proj_chaoss_2019_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5952207168471040/",
          "proposal_id": null,
          "short_description": "Augur is fully functional prototyping web stack for CHAOSS metrics. It provides structured data mined from git repositories using a plugin...",
          "slug": "build-chaoss-risk-and-growth-maturity-and-decline-metrics-in-augur",
          "status": "completed",
          "student_name": "Parth Sharma",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "ui"
          ],
          "title": "Build CHAOSS Risk and Growth Maturity and Decline Metrics in Augur"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2019/organizations/6603033897598976/"
    },
    "year_2020": {
      "num_projects": 9,
      "projects": [
        {
          "code_url": "https://gist.github.com/abhinavbajpai2012/710f2acc609c09e389a42fe2870df105",
          "description": "<p>The project aims to develop a <strong>Gitlab collection worker closely tied up with the Github collection worker using mapper files</strong> to bind the intended attributes of their API responses and the Augur schema. Gitlab worker holds the responsibility to fetch progressive data related to Issues, Commits, Merge Requests etc from GitLab using python-gitlab API on which metrics could be generated. Additional modules like <strong>Data Setter</strong> module and <strong>Schema moderator</strong> would be implemented to work as a common channel for both the workers to push the collected API response into the Augur Database or to change the Augur schema by <strong>editing the mapper files</strong>. Data Setter module will additionally hold the responsibility of implementing the duplicate management mechanism.</p>\n",
          "difficulty": null,
          "id": "proj_chaoss_2020_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5515047721238528/",
          "proposal_id": null,
          "short_description": "The project aims to develop a Gitlab collection worker closely tied up with the Github collection worker using mapper files to bind the intended...",
          "slug": "implementing-gitlab-data-collection-worker-and-mapper-to-bind-the-responses-of-gitlab-api-github-api-the-augur-schema",
          "status": "completed",
          "student_name": "Abhinav Bajpai",
          "student_profile": null,
          "tags": [
            "python",
            "api",
            "ai",
            "database"
          ],
          "title": "Implementing GitLab Data Collection Worker and Mapper to bind the responses of GitLab API, Github API & the Augur schema"
        },
        {
          "code_url": "https://gist.github.com/sarit-adh/e608d6824ef7eefb1245f8438dd60fc8",
          "description": "<p>Open-source software development is a collaborative effort that requires decentralized decision making from different developers and maintainers. In order to measure the progress of the project, It is important to quantify the code changes across time. CHAOSS provides analytics and metrics to help open source communities measure the impact of the developer’s work on the project and the impact of the project on the community. Augur is a prototyped implementation of the CHAOSS Project on open source software metrics which systematically integrates data from several open-source repositories, issue trackers, mailing lists, etc. Anamoly detection is a common data science strategy of finding extreme data points (outliers), whose features differ vastly from other normal data points. From an open-source software development perspective, it detects unusual surges and drops in development activities like code-commits, pull-requests, etc. This project aims to identify the different types of anomalies that are available from trace data and deliver a personalized notification to the user using several machine learning techniques.</p>\n",
          "difficulty": null,
          "id": "proj_chaoss_2020_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5310055743750144/",
          "proposal_id": null,
          "short_description": "Open-source software development is a collaborative effort that requires decentralized decision making from different developers and maintainers. In...",
          "slug": "machine-learning-for-anomaly-detection-in-open-source-communities",
          "status": "completed",
          "student_name": "Sarit Adhikari",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Machine Learning for Anomaly Detection in Open Source Communities"
        },
        {
          "code_url": "https://github.com/tianyichow/augur-community-reports/tree/network-analysis/network_analysis",
          "description": "<p>Augur is a software that collect data for a list of given repositories and provide a variety of CHAOSS metrics to provides open source health and sustainability metrics.Then users can empirically investigate and uncover useful insights for software engineering, such as understanding the collaborative pattern.</p>\n<p>In the current stage, Augur is unable to mining the repositories to generate the co-editing information in the open source software development. This project idea is about to develop this kind of functions to enhance the Augur project. It will end up with a new data worker and analysis tool for fine-grained co-editing network which opens up a massive new source of high-resolution data on human collaboration patterns.</p>\n<p>Then I would like to establish the Augur server to mining and monitor the open source ecosystem (with 10000+ repositories or more). The collaboration networks and social trace data of all contributors in the open source ecosystem will be evaluated in terms of social network analysis. It will play a vital role in achieving Augur's goal towards analysis of open source organizations health as well as the goal of the CHAOSS project towards diversity and inclusion.</p>\n",
          "difficulty": null,
          "id": "proj_chaoss_2020_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5556345006194688/",
          "proposal_id": null,
          "short_description": "Augur is a software that collect data for a list of given repositories and provide a variety of CHAOSS metrics to provides open source health and...",
          "slug": "large-social-network-analysis-and-anomaly-detection-with-augur",
          "status": "completed",
          "student_name": "Tianyi Zhou",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Large Social Network Analysis and Anomaly Detection with Augur"
        },
        {
          "code_url": "https://gist.github.com/ria18405/b379eb00a4f87bfb98df5530e0f551dd",
          "description": "<p>Implementing Social Currency Metric System (SCMS) will be a huge milestone in providing a better and holistic view of project health in the open-source community. By adding social currency in the metric, we will be able to quantitatively measure the value of community interactions to accurately gauge “reputation” of a community.</p>\n",
          "difficulty": null,
          "id": "proj_chaoss_2020_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/6478870728933376/",
          "proposal_id": null,
          "short_description": "Implementing Social Currency Metric System (SCMS) will be a huge milestone in providing a better and holistic view of project health in the...",
          "slug": "social-currency-metric-system",
          "status": "completed",
          "student_name": "Ria Gupta",
          "student_profile": null,
          "tags": [],
          "title": "Social Currency Metric System"
        },
        {
          "code_url": "https://gist.github.com/mrsaicharan1/75e53c6843e539e1fc03937f0e254d0d",
          "description": "<p>The primary goal of this project is to congregate data pertaining to GitLab issues, commits, merge requests amongst other entities &amp; store it into the unified data model ecosystem of Augur. The project will use a task queue, a broker and worker instances to process the information at scale.\nMetrics for sustainability &amp;. overall project health will be built upon the information stored in the unified model. This project also aims at increasing the overall test coverage of the project. Ergo, Unit &amp; Integration tests for data collection workers would be implemented to ensure data consistency.</p>\n",
          "difficulty": null,
          "id": "proj_chaoss_2020_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/6512121090670592/",
          "proposal_id": null,
          "short_description": "The primary goal of this project is to congregate data pertaining to GitLab issues, commits, merge requests amongst other entities & store it into...",
          "slug": "implementation-of-gitlab-data-collection-worker-test-coverage-improvement",
          "status": "completed",
          "student_name": "Saicharan Reddy",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Implementation of GitLab Data Collection Worker & Test Coverage Improvement"
        },
        {
          "code_url": "https://vchrombie.github.io/blog/gsoc-final-report",
          "description": "<p>GrimoireLab is a powerful open-source platform that provides support for monitoring and in-depth analysis of software projects. It produces a rich set of dashboards, which can be easily inspected by decision-makers to help them understand the evolution and health of their projects. Despite the large set of dashboards available in GrimoireLab, comparing projects between each other is not straightforward since it requires navigating and drilling down the data in different dashboards.</p>\n<p>Prosoul is a web application that empowers decision-makers with the means to create and manage their own quality models, which are useful means to evaluate and compare software projects. This project idea is about supporting the definition of Quality Models using GrimoireLab data and Prosoul.</p>\n<p>The main aim of the project is to design an approach to shape the GrimoireLab data in a format that can easily be consumed by Prosoul and implement it on the data obtained from a few data sources like git, github and mailing list repositories to obtain simple quality models.</p>\n",
          "difficulty": null,
          "id": "proj_chaoss_2020_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/6524989651550208/",
          "proposal_id": null,
          "short_description": "GrimoireLab is a powerful open-source platform that provides support for monitoring and in-depth analysis of software projects. It produces a rich...",
          "slug": "creating-quality-models-using-grimoirelab-and-chaoss-metrics",
          "status": "completed",
          "student_name": "vchrombie",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "ui"
          ],
          "title": "Creating Quality models using GrimoireLab and CHAOSS metrics"
        },
        {
          "code_url": "https://github.com/pratikmishra356/GSOC-2020-Augur",
          "description": "<p>This project will play one of the most vital roles in achieving Augur's goal towards analysis of open source organisation health.It will not only provide visualisation but also offer useful Insights that will help users to find the reason behind  anomalous activities or anomalous period.</p>\n",
          "difficulty": null,
          "id": "proj_chaoss_2020_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5947135322750976/",
          "proposal_id": null,
          "short_description": "This project will play one of the most vital roles in achieving Augur's goal towards analysis of open source organisation health.It will not only...",
          "slug": "machine-learning-for-anomaly-detection-in-open-source-communities",
          "status": "completed",
          "student_name": "Pratik Mishra",
          "student_profile": null,
          "tags": [],
          "title": "Machine Learning for Anomaly Detection in Open Source Communities"
        },
        {
          "code_url": "https://gist.github.com/aksh555/8dd970b4baa7aa01aa8486dda7186ae0",
          "description": "<p>Augur is a Flask based prototyping web stack for CHAOSS metrics. It provides structured data mined from various sources like git repositories, mailing lists and issue trackers using a plugin architecture incorporating other open-source metrics projects like Facade and FOSSology. Augur enables users to keep track of the activities happening across the repositories they care about and compare their performance. The main goals of this project are to detect anomalies in various metrics in the open-source community and notify the community managers at the earliest; providing API endpoints for the required metrics, and a customized dashboard to visualize these metrics through charts. The completion of this project would result in a customized dashboard for every user, providing real-time statistics of the anomalous activities happening across their repositories.</p>\n",
          "difficulty": null,
          "id": "proj_chaoss_2020_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/6266324608614400/",
          "proposal_id": null,
          "short_description": "Augur is a Flask based prototyping web stack for CHAOSS metrics. It provides structured data mined from various sources like git repositories,...",
          "slug": "machine-learning-for-anomaly-detection-in-open-source-communities",
          "status": "completed",
          "student_name": "Akshara P",
          "student_profile": null,
          "tags": [
            "web",
            "api",
            "ai",
            "ui"
          ],
          "title": "Machine Learning for Anomaly Detection in Open Source Communities"
        },
        {
          "code_url": "https://gist.github.com/bistaastha/204157113ac0e65c60e25fc0d5b2c834",
          "description": "<p>CHAOSS Diversity and Inclusion Badging program aims to encourage projects and events to obtain badges for good diversity and inclusion practices. This project will be about building a GitHub based workflow for CHAOSS D&amp;I Badging program.</p>\n<p>This project would extend the existing CHAOSS Badging work and implement an Open Peer review process. Also, the project would focus on integrating GitHub based workflow bots.</p>\n",
          "difficulty": null,
          "id": "proj_chaoss_2020_009",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5160792611094528/",
          "proposal_id": null,
          "short_description": "CHAOSS Diversity and Inclusion Badging program aims to encourage projects and events to obtain badges for good diversity and inclusion practices....",
          "slug": "build-workflow-process-for-chaoss-di-badging-project",
          "status": "completed",
          "student_name": "bistaastha",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Build Workflow process for CHAOSS D&I Badging Project"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2020/organizations/6232321151205376/"
    },
    "year_2021": {
      "num_projects": 6,
      "projects": [
        {
          "code_url": "https://github.com/Dhruv-Sachdev1313/GSoC-2021-CHAOSS",
          "description": "<p>This project is aimed at developing a shared data resource to identify various dependencies for Open Source Software, using some of the existing tools to analyze dependencies and map them to know if there are Direct, Transitive, and Circular Dependencies. This project deals with code-level dependencies and not infrastructure-based dependencies like OS or database. This project is implemented using augur which is a software suite for collecting and measuring structured data about free and open-source software (FOSS) communities.</p>\n",
          "difficulty": null,
          "id": "proj_chaoss_2021_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6711432569159680/",
          "proposal_id": null,
          "short_description": "This project is aimed at developing a shared data resource to identify various dependencies for Open Source Software, using some of the existing...",
          "slug": "develop-a-shared-data-resource-focused-on-dependencies-risks-and-vulnerabilities-in-open-source-software",
          "status": "completed",
          "student_name": "Dhruv Sachdev",
          "student_profile": null,
          "tags": [
            "ai",
            "database",
            "ui"
          ],
          "title": "Develop a Shared Data Resource Focused on Dependencies, Risks and Vulnerabilities in Open Source Software"
        },
        {
          "code_url": "https://k-a-rashmi04.medium.com/extend-data-model-and-user-interface-to-capture-better-information-about-contributors-a95f8e0a9a7e",
          "description": "<p>Grimoirelab is an open-source toolset for software development analytics. Grimoirelab provides a set of tools to collect, analyze and visualize software development metrics from a variety of sources like Git, Jira, Confluence, Slack, etc. In order to manage the identities of people across these different sources, Grimoirelab developed Sorting Hat. Sorting Hat manages the identities of people and related metadata.</p>\n<p>As part of the metadata collected around identities, Sorting Hat stores organizational information such as the name and domains related to the organization. This project aims to add to this information by extending the existing Organization model to capture the internal structure of organizations such as departments, sub-organizations, and teams. This will help in annotating the identity information more meaningfully.</p>\n",
          "difficulty": null,
          "id": "proj_chaoss_2021_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5275752542502912/",
          "proposal_id": null,
          "short_description": "Grimoirelab is an open-source toolset for software development analytics. Grimoirelab provides a set of tools to collect, analyze and visualize...",
          "slug": "sorting-hat-extend-data-model-and-user-interface-to-capture-better-information-about-contributors",
          "status": "completed",
          "student_name": "Rashmi K A",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Sorting Hat - Extend data model and user interface to capture better information about contributors"
        },
        {
          "code_url": "https://gist.github.com/yash2002109/887c3e68ff3ff222f941402ceb7bf0dc",
          "description": "<p>CHAOSS metrics have been defined to provide an in-depth view into the various features of an open-source project. The metrics are also a key input to help organizations strategically invest their resources.</p>\n<p>The main aim of the project is to understand the metrics release process, propose process improvements and automate the release process of these metrics.</p>\n<p>In addition to the original English version of these metrics, these metrics are also translated into different languages to help communities across the globe understand and benefit from them.</p>\n<p>By the end of this project, there would be complete automation in the process of generation of reports for the metrics and their translations</p>\n",
          "difficulty": null,
          "id": "proj_chaoss_2021_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/4626981861195776/",
          "proposal_id": null,
          "short_description": "CHAOSS metrics have been defined to provide an in-depth view into the various features of an open-source project. The metrics are also a key input to...",
          "slug": "automate-metrics-release-and-process-improvement",
          "status": "completed",
          "student_name": "Yash Prakash",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Automate Metrics Release and Process Improvement"
        },
        {
          "code_url": "https://github.com/anujlamoria/GSOC-2021-Final-Report",
          "description": "<p>The aim of this project is to generalize, and make available a PyPy distributable Python package the core functionality currently within the Augur contributor worker, and envisioned as the next phase of the Augur contributor worker.The main goal of this project is Automatically identify Contributor Aliases (emails, platform user accounts) to Increase Parsimony of Statistics and Metrics With Privacy Enhancement\nI would be focusing on the Augur and developing useful risk-prediction analysis tools and visualization modules. The main work in this project are as follows: \nConstruct an API Accessible Graph Database for identifying and mapping contributors who use multiple email addresses within a platform, and identifiers across platforms.\nImplement methods to manage this information.\nIntegrate this information into clearer, more parsimonious CHAOSS metrics.\nAutomate the management of contributor changes over time\nEnable analysis at the project level that obscures or anonymizes individual developer identity</p>\n",
          "difficulty": null,
          "id": "proj_chaoss_2021_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/4740412618571776/",
          "proposal_id": null,
          "short_description": "The aim of this project is to generalize, and make available a PyPy distributable Python package the core functionality currently within the Augur...",
          "slug": "automatically-identify-contributor-aliases",
          "status": "completed",
          "student_name": "Anuj Lamoria",
          "student_profile": null,
          "tags": [
            "python",
            "api",
            "ai",
            "database"
          ],
          "title": "Automatically identify Contributor Aliases"
        },
        {
          "code_url": "https://medium.com/@yeminggood/gsoc2021-final-report-7feedac481e0",
          "description": "<p>My project aims to define a new similarity measure metric based on social coding semantics underlying the open source trace data to enrich the ability of Augur. The heterogeneous information network schema and network embedding techniques are introduced to capture the latent similarity information between repositories. This project will end up with some new computational models to transform those information into computable representation vectors with respect to every repository.</p>\n",
          "difficulty": null,
          "id": "proj_chaoss_2021_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/4918176382451712/",
          "proposal_id": null,
          "short_description": "My project aims to define a new similarity measure metric based on social coding semantics underlying the open source trace data to enrich the...",
          "slug": "yeming-gus-gsoc-proposal-for-chaoss",
          "status": "completed",
          "student_name": "Yeming Gu",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Yeming Gu's GSoC proposal for CHAOSS"
        },
        {
          "code_url": "https://gist.github.com/ritik-malik/5a1a48bb966892824d7da31fc12ede50",
          "description": "<p>Improving the metric release process and fully automating will not only save time, but it will also help us to define a central structure for the current as well as upcoming WGs/metrics. Keeping in mind the ever evolving CHAOSS, the process would be scalable and flexible enough for easy tweaking in future. The quality and the impression of the PDF would also be on equal priority.</p>\n",
          "difficulty": "beginner",
          "id": "proj_chaoss_2021_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5185057429389312/",
          "proposal_id": null,
          "short_description": "Improving the metric release process and fully automating will not only save time, but it will also help us to define a central structure for the...",
          "slug": "automate-metrics-release-and-process-improvement",
          "status": "completed",
          "student_name": "Ritik Malik",
          "student_profile": null,
          "tags": [],
          "title": "Automate Metrics Release and Process Improvement"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2021/organizations/5959947107434496/"
    },
    "year_2022": {
      "num_projects": 5,
      "projects": [
        {
          "code_url": "https://gist.github.com/yash-yp/50e9487c48801dcf875adc4c190aa274",
          "description": "The CHAOSS Project’s website is an invaluable resource for newbies and core project members alike. Since the CHAOSS Project has grown in size over the years, one can wonder if the current design is too overwhelming. There is a need to reduce the burden of information from various individual sources.\n\nThe website, community handbook, documentation for initiative and software are all separate pieces of information that may be difficult to link together.\n\nThe knowledge base project is thus, critical to establishing a centralized platform for information sharing.",
          "difficulty": null,
          "id": "proj_chaoss_2022_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/wYwovEnP/",
          "proposal_id": null,
          "short_description": "The CHAOSS Project’s website is an invaluable resource for newbies and core project members alike. Since the CHAOSS Project has grown in size over...",
          "slug": "build-knowledgebase-application-on-chaoss-website",
          "status": "completed",
          "student_name": "Yash Prakash",
          "student_profile": null,
          "tags": [
            "web",
            "ui"
          ],
          "title": "Build Knowledgebase Application on CHAOSS Website"
        },
        {
          "code_url": "https://github.com/badging/badging-bot/tree/enock-kasaadha-gsoc",
          "description": "Currently, the bot and its deployed instance are not able to favour collaborative continuous development and integration. The bot also is not extensive enough in automation that looks obvious to the situation it is trying to solve. This proposal encompasses ways this bot will be upgraded to support local development by numerous developers, add the ability to test code locally before pushing changes and also add the assign algorithm depending on parameters around the reviewers.",
          "difficulty": null,
          "id": "proj_chaoss_2022_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/f7x3RQug/",
          "proposal_id": null,
          "short_description": "Currently, the bot and its deployed instance are not able to favour collaborative continuous development and integration. The bot also is not...",
          "slug": "bot-cicd-and-assign-algorithm",
          "status": "completed",
          "student_name": "Kaxada",
          "student_profile": null,
          "tags": [],
          "title": "Bot CI/CD and assign algorithm"
        },
        {
          "code_url": "https://github.com/mabelbot/metrics-models/wiki",
          "description": "The CHAOSS community develops metrics, practices, and software for measuring open source software community health and sustainability. Augur and Grimoirelab are two powerful open source community health analytics projects supporting the CHAOSS mission. In particular, each has implementation of select metrics based on an expanding set of implementation-agnostic metric definitions associated with various focus areas.\n\nThe CHAOSS Metrics Model Working group defines metric models, which integrate multiple CHAOSS metrics in a way that makes it easy for end users such as community managers to get a more comprehensive measure of an open source community. Currently, Conversion Rate can be defined as a metric or metric model. It measures the rates at which new contributors to an open source project move through the \"contributor funnel\" toward sustained contribution and/or community maintainership. There is no implementation of the Conversion Rate metric or metric model in CHAOSS software yet.\n\nThis project aims to build a novel implementation of Conversion Rate as a metric model that is based on a minimum number of atomic metrics and has maximum reuse of existing implemented metrics as well as common metric model calculation code supporting all types of conversion rates. A simple config file based UI for entering parameters and filters by the users is all it takes to run the metric model. \n\nNew metrics will be implemented first in Jupyter Notebook as reference code and can later migrate into Grimoirelab backend (for sharing with future new metric models or reports) along with data collection and enrichment extensions. The Metric Model calculation code and methods, and a common visualization interface will be also implemented in Jupyter Notebook, followed by a deployment with OpenSearch Dashboards visualization.",
          "difficulty": "beginner",
          "id": "proj_chaoss_2022_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/0dSXth1I/",
          "proposal_id": null,
          "short_description": "The CHAOSS community develops metrics, practices, and software for measuring open source software community health and sustainability. Augur and...",
          "slug": "a-novel-implementation-of-conversion-rate-metric-model-in-chaoss-software",
          "status": "completed",
          "student_name": "Mabel F",
          "student_profile": null,
          "tags": [
            "ai",
            "ui",
            "backend"
          ],
          "title": "A Novel Implementation of Conversion Rate Metric Model in CHAOSS Software"
        },
        {
          "code_url": "https://github.com/RamyaKappagantu/gsoc22_chaoss-final-report/blob/main/README.md",
          "description": "Augur is a Python library, REST server and Flask web application which is used to collect free and open source data and provide meaningful insights around it. The data is collected across various sources like open source repos, mailing lists and other communication systems. Augur uses categorised workers to collect specific data.\nCurrently CHAOSS provides metrics by dividing them into working groups. Few of such metrics are frequency of contributions, types of contributions, time frame between opening and closing a pull request, diversity and inclusion, leadership, efficiency and effectiveness of mentorship programs.\nThis project will play an important role in analysing the open source community health. It provides an efficient way to compute and visualise the metrics through an API. Using this API will provide a more accessible way to understand and visualise various metrics.\nDeliverables:\n1. Create an API for visualising the metrics provided by various machine learning workers and improve their performance.\n2. Work on implementing new metrics within the augur machine learning workers and test the performance of newly added metrics with the optimised model to see if the optimised model works for new metrics added.\n3. Work on augur_view to provide a customised and accessible dashboard to the user.",
          "difficulty": null,
          "id": "proj_chaoss_2022_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/vKBmFbCP/",
          "proposal_id": null,
          "short_description": "Augur is a Python library, REST server and Flask web application which is used to collect free and open source data and provide meaningful insights...",
          "slug": "machine-learning-based-community-health-and-communication",
          "status": "completed",
          "student_name": "Ramya Kappagantu",
          "student_profile": null,
          "tags": [
            "python",
            "web",
            "api",
            "ai"
          ],
          "title": "Machine Learning based Community Health and Communication"
        },
        {
          "code_url": "https://github.com/Priya730/GSoC22/blob/main/README.md",
          "description": "The aim of the project is to build login and access for users. Augur is a software suite for collecting and measuring structured data about free and open-source software (FOSS) communities. \nThe project will help the users to login using CLI and API. The project aims at creating login feature for users. This is implemented as CLI subcommands and through an API. Using these, user will be added to the database. With login functionality, the user experience will be improved. The project focused to add and improve access and authorisation functionalities for hosted version of augur (augur_view). As a future development, the new version of Augur- augur-new, will make it possible to install a single instance for CHAOSS Community members to leverage for initial experimentation with CHAOSS metrics.",
          "difficulty": null,
          "id": "proj_chaoss_2022_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/YNXT2TFX/",
          "proposal_id": null,
          "short_description": "The aim of the project is to build login and access for users. Augur is a software suite for collecting and measuring structured data about free and...",
          "slug": "build-access-and-entitlements-into-a-hosted-version-of-augur",
          "status": "completed",
          "student_name": "Priya Srivastava",
          "student_profile": null,
          "tags": [
            "api",
            "ai",
            "database",
            "ui"
          ],
          "title": "Build Access and Entitlements into a Hosted Version of Augur"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2022/organizations/chaoss/"
    },
    "year_2023": null,
    "year_2024": null,
    "year_2025": {
      "num_projects": 3,
      "projects": [
        {
          "code_url": null,
          "description": "Open-source projects tend to struggle with retaining contributors after the initial involvement. In this project, a Conversion Rate Metric is proposed for measuring how well newcomers convert into frequent contributors. From these patterns of conversion, communities can enhance onboarding, interaction, and overall contributor experience.\nThe metric will be applied on the CHAOSS/Augur platform, utilizing its infrastructure for data collection and analysis. A stable data pipeline developed using Python and SQL will retrieve contributor activity data from Git repositories and issue trackers. Conversion criteria (e.g., D0 → D1 → D2) will be defined to allow for consistent and meaningful measurement.\nThe project will provide:\n1. A conversion rate metric that can be tailored to various needs and incorporated into Augur\n2. An automated pipeline for data collection and processing\n3. A dashboard with visualizations of conversion trends, cohort analysis, and contributor activity\n4. Comprehensive testing on real-world repositories to ensure accuracy\n5. Documentation and onboarding materials for maintainers\n\nThrough giving open-source communities a means to track and analyze contributor conversion, this project will enable data-driven community development and healthier contributor ecosystems. It continues the efforts of CHAOSS to advance contributor metrics and offer actionable insights to maintainers.",
          "difficulty": null,
          "id": "proj_chaoss_2025_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/rY6dHSn4",
          "proposal_id": "hwD6NLBO",
          "short_description": "Open-source projects tend to struggle with retaining contributors after the initial involvement. In this project, a Conversion Rate Metric is...",
          "slug": "implement-conversion-rate-metric-in-chaoss-software",
          "status": "in-progress",
          "student_name": "Akshat Baranwal",
          "student_profile": null,
          "tags": [
            "python",
            "ai"
          ],
          "title": "Implement Conversion Rate Metric In Chaoss Software"
        },
        {
          "code_url": null,
          "description": "The conversion rate metric is primarily aimed at identifying how new community members become more sustained contributors over time. However, the conversion rate metric can also help understand the changing roles of contributors, how a community is growing or declining, and paths to maintainership within an open source community.",
          "difficulty": null,
          "id": "proj_chaoss_2025_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/5mr4NeCs",
          "proposal_id": "Zgibo8zp",
          "short_description": "The conversion rate metric is primarily aimed at identifying how new community members become more sustained contributors over time. However, the...",
          "slug": "implement-conversion-rate-metric-in-chaoss-software",
          "status": "in-progress",
          "student_name": "Asish Kumar",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Implement Conversion Rate Metric in CHAOSS Software"
        },
        {
          "code_url": null,
          "description": "This project aims to improve the robustness and flexibility of topic modeling in the CHAOSS Augur platform by enhancing its clustering_worker component. Currently, Augur relies on a static number of LDA topics, lacks model versioning, and does not support retraining based on data drift.\r\n\r\nTo address these issues, this project will:\r\n\r\nIntroduce dynamic topic number estimation via Gensim’s HDP model.\r\n\r\nImplement model versioning with model_id and timestamp support.\r\n\r\nRecord model metadata including hyperparameters and coherence scores.\r\n\r\nAdd automatic parameter tuning using coherence-based grid search.\r\n\r\nDetect data drift and trigger model retraining accordingly.\r\n\r\nExport rich visual outputs such as pyLDAvis and wordcloud images.\r\n\r\nDeliverables include upgraded database schema, a refactored topic modeling pipeline, metadata tables, Jupyter demo notebooks, and HTML visualizations for CHAOSS dashboards. These changes will make Augur’s insight engine more adaptive, interpretable, and future-proof.",
          "difficulty": null,
          "id": "proj_chaoss_2025_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/WEvhcxii",
          "proposal_id": "3m9orwrK",
          "short_description": "This project aims to improve the robustness and flexibility of topic modeling in the CHAOSS Augur platform by enhancing its clustering_worker...",
          "slug": "enhance-conversational-topic-modelling-capabilities-in-chaoss-software",
          "status": "in-progress",
          "student_name": "Jiahong Lin",
          "student_profile": null,
          "tags": [
            "ml",
            "ai",
            "database",
            "cloud"
          ],
          "title": "Enhance Conversational Topic Modelling Capabilities in CHAOSS Software"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2025/organizations/chaoss"
    }
  },
  "first_time": false,
  "contact": {
    "email": "gsoc@goggins.com",
    "guide_url": "https://github.com/chaoss/augur/blob/main/gsoc-interest.md",
    "ideas_url": "https://github.com/chaoss/augur/blob/main/gsoc-interest.md",
    "irc_channel": "https://join.slack.com/t/chaoss-workspace/shared_invite/zt-289zxh6tu-3oQaFlutPFY039MjKpnWcA",
    "mailing_list": "chaoss@lists.linuxfoundation.org"
  },
  "social": {
    "blog": "https://chaoss.community/blog",
    "discord": null,
    "facebook": null,
    "github": null,
    "gitlab": null,
    "instagram": null,
    "linkedin": null,
    "mastodon": null,
    "medium": null,
    "reddit": null,
    "slack": "https://join.slack.com/t/chaoss-workspace/shared_invite/zt-289zxh6tu-3oQaFlutPFY039MjKpnWcA",
    "stackoverflow": null,
    "twitch": null,
    "twitter": "https://twitter.com/chaossproj",
    "youtube": null
  },
  "meta": {
    "version": 1,
    "generated_at": "2026-01-25T15:28:52.986Z"
  }
}