{
  "id": "692251d053dd9d7326d33d7d",
  "slug": "civicrm",
  "name": "CiviCRM",
  "category": "End user applications",
  "description": "Growing and sustaining relationships",
  "image_url": "https://lh3.googleusercontent.com/eHaSpnLTGYKc5cdRm7xyCei3-mdlOXkiwlJlX8Z-qgnlT0ii6CmKs6KoP7HlLNAXRT9xJvC4gVPmWtVvokPZlh4E0InYVW1dojWfoC9YHRuA1A",
  "img_r2_url": "https://pub-268c3a1efc8b4f8a99115507a760ca14.r2.dev/civicrm.webp",
  "logo_r2_url": null,
  "url": "https://civicrm.org",
  "active_years": [
    2016,
    2018,
    2019,
    2020,
    2021
  ],
  "first_year": 2016,
  "last_year": 2021,
  "is_currently_active": false,
  "technologies": [
    "mysql",
    "javascript",
    "php",
    "angularjs",
    "d3js",
    "d3.js",
    "angular"
  ],
  "topics": [
    "crm",
    "civic technology",
    "fundraising",
    "events management",
    "membership management",
    "civil society",
    "contacts&calendar sync",
    "nonprofits",
    "nonprofit"
  ],
  "total_projects": 22,
  "stats": {
    "avg_projects_per_appeared_year": 4.4,
    "projects_by_year": {
      "year_2016": 8,
      "year_2017": null,
      "year_2018": 4,
      "year_2019": 2,
      "year_2020": 4,
      "year_2021": 4,
      "year_2022": null,
      "year_2023": null,
      "year_2024": null,
      "year_2025": null
    },
    "students_by_year": {
      "year_2016": 8,
      "year_2017": null,
      "year_2018": 4,
      "year_2019": 2,
      "year_2020": 4,
      "year_2021": 4,
      "year_2022": null,
      "year_2023": null,
      "year_2024": null,
      "year_2025": null
    },
    "total_students": 20
  },
  "years": {
    "year_2016": {
      "num_projects": 8,
      "projects": [
        {
          "code_url": "https://civicrm.org/blog/ypranay/introducing-civirebux-native-report-building-extension-for-civicrm",
          "description": "<p><strong>CiviREBUX</strong> is an native CiviCRM extension for drafting custom Contribution and Membership reports via a drag-n-drop interface. <strong>CiviREBUX</strong> combines powerful visualization and transformation techniques which gives the users the full capabilities of modern browsers and the freedom to design the right elements for their reports. <strong>CiviREBUX</strong> also supports saving and loading of report templates for later use. It works well with all the 3 CiviCRM-supported CMS - Wordpress, Drupal and Joomla, hence native.</p>\n<p><strong>CiviREBUX</strong> integrates seamlessly within the CiviCRM Dashboard and goes live seconds after installing the extension. <strong>CiviREBUX</strong> is a mix of the most popular desktop-based spreadsheet software and fast browser applications, essentially, <em>a spreadsheet software running on your browser</em>.</p>\n",
          "difficulty": null,
          "id": "proj_civicrm_2016_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/6595368154300416/",
          "proposal_id": null,
          "short_description": "CiviREBUX is an native CiviCRM extension for drafting custom Contribution and Membership reports via a drag-n-drop interface. CiviREBUX combines...",
          "slug": "civirebux-report-building-extension-for-civicrm",
          "status": "completed",
          "student_name": "Pranay Yadav",
          "student_profile": null,
          "tags": [
            "ml",
            "ui",
            "ux"
          ],
          "title": "CiviREBUX: Report Building Extension for CiviCRM"
        },
        {
          "code_url": "https://github.com/AdamHillier/com.webaccessglobal.module.civimobile/wiki/GSOC-Project:-final-wrap-up",
          "description": "<p>The current release is more than three years old, so the extension has languished somewhat. There are several issues in the outstanding implementation (such as a buggy contact search capability) and the design is fairly dated.</p>\n<p>I would seek to work with the current extension to:</p>\n<ul>\n<li>First, identify and fix existing issues and bugs;</li>\n<li>Then, improve the design to modernise it and make it more attractive;</li>\n<li>And finally, implement new features such as contribution management</li>\n</ul>\n<p>with the goal of releasing an updated version which is more user-friendly and more capable than the current one.</p>\n",
          "difficulty": null,
          "id": "proj_civicrm_2016_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5743754254221312/",
          "proposal_id": null,
          "short_description": "The current release is more than three years old, so the extension has languished somewhat. There are several issues in the outstanding...",
          "slug": "work-to-improve-and-expand-civimobile",
          "status": "completed",
          "student_name": "ahillier",
          "student_profile": null,
          "tags": [
            "mobile",
            "ai",
            "ui"
          ],
          "title": "Work to improve and expand CiviMobile"
        },
        {
          "code_url": "https://adikare.github.io/org.civicrm.genericsync/",
          "description": "<p>CiviCRM already has integration with many email marketing services like MailChimp, Constant Contact, Google Apps. However all of them have different workflows and interfaces. The goal of this project is to create a framework which will enable us to use the functionalities provided by different email marketing services in a unified manner. The project primarily focuses on synchronizing contact information. The main aspect of the project is to synchronize the mailing list and the groups of different external services. Whenever some changes are made through a certain service, these changes will then be reflected in real time in the CiviCRM account associated with it. The objectives of this project will certainly  help the users to save a lot of time and effort as they can truly focus on the best offerings of all the services and not be exposed with intricacies associated with it.</p>\n",
          "difficulty": null,
          "id": "proj_civicrm_2016_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/4975806048632832/",
          "proposal_id": null,
          "short_description": "CiviCRM already has integration with many email marketing services like MailChimp, Constant Contact, Google Apps. However all of them have different...",
          "slug": "synchronization-framework",
          "status": "completed",
          "student_name": "AdityaK",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Synchronization Framework"
        },
        {
          "code_url": "https://github.com/MounaAnnavarapu/Cividroid-2.0-Dashlets",
          "description": "<p>My perception for the next evolution of Cividroid revolves around the concept of ‘Dashlets’. During my frequent visit to the CiviCRM Dashboard on the demo set-up, I find that, it gives a holistic view of many of the crucial data one would want to see from their CiviCRM installation. Since they’re mostly powered by CiviReports, there is an opportunity to derive a lot of new Dashlets. Introducing Dashlets into Cividroid sounds very natural and they will feel just like home on Android which itself has a concept of ‘widgets’.</p>\n",
          "difficulty": null,
          "id": "proj_civicrm_2016_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5352655605989376/",
          "proposal_id": null,
          "short_description": "My perception for the next evolution of Cividroid revolves around the concept of ‘Dashlets’. During my frequent visit to the CiviCRM Dashboard on the...",
          "slug": "cividroid-20",
          "status": "completed",
          "student_name": "Mouna A",
          "student_profile": null,
          "tags": [
            "android"
          ],
          "title": "Cividroid 2.0"
        },
        {
          "code_url": "https://wiki.civicrm.org/confluence/display/CRM/Responsive+Email+Layout",
          "description": "<p>Majority of people use emails to communicate over the internet and with more more mobile devices coming in different sizes, there is a basic need to make the emails support these different devices. While text emails, work fine on these different sized devices, brilliant looking html based emails suffers, sometime making it impossible to be read on mobile devices.\nEmails are also the main medium to connect the organization and the participants in CiviCRM.. The project I would like to work on will be “Responsive Layout for Emails” that would include  making emails more reliable and readable over different devices by providing a simplified and responsive layouts for email. Considering the situation of current world, 50% of emails open occurs on mobile device and 70% of people delete emails instantly which do not timely render. The main aim of the project would be to let people read emails sent through CiviCRM properly on all of their devices.\nAlso, I would like to propose a more systematic and consistent email mechanism for system generated emails. This will allow end-users to align system emails to the brand of their organization.</p>\n",
          "difficulty": "medium",
          "id": "proj_civicrm_2016_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/4623169906278400/",
          "proposal_id": null,
          "short_description": "Majority of people use emails to communicate over the internet and with more more mobile devices coming in different sizes, there is a basic need to...",
          "slug": "responsive-email-layout",
          "status": "completed",
          "student_name": "Anjali Ujjainia",
          "student_profile": null,
          "tags": [
            "mobile",
            "ml",
            "ai"
          ],
          "title": "Responsive Email Layout"
        },
        {
          "code_url": "https://github.com/siddharthg/org.civicrm.civisocial",
          "description": "<p>The sheer number of social media users has been increasing exponentially along with social media websites. Day by day, Social Media is integrating deeper with people's lives. Social Media Integration with CiviCRM will allow users to quickly login securely to the website without the hassle of remembering another extra password and provide access to features such as event registration and petition signing quicker. On the other hand, organizations using CiviCRM can have their different events, campaigns and petitions promoted and publicized in different social media platforms and analyze how people react to them all at one place. Social Media Integration with CiviCRM will boost the exposure of CiviCRM as a platform and make it even easier for people to connect.</p>\n",
          "difficulty": null,
          "id": "proj_civicrm_2016_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5781292268388352/",
          "proposal_id": null,
          "short_description": "The sheer number of social media users has been increasing exponentially along with social media websites. Day by day, Social Media is integrating...",
          "slug": "social-media-integration-with-civicrm",
          "status": "completed",
          "student_name": "rajbdilip",
          "student_profile": null,
          "tags": [
            "react",
            "web",
            "ai",
            "ui"
          ],
          "title": "Social Media Integration with CiviCRM"
        },
        {
          "code_url": "https://wiki.civicrm.org/confluence/display/CRMDOC/Example+2%3A+Integrating+CiviCRM+and+Zapier%3A+User+Story+1",
          "description": "<p>This project was written in aim of participation in the Gsoc 2016, This proposal explains how to integrate CiviCRM with Zapier an integration platform for all sort of applications which now could be communicating together. The document also proposes an API which will intend do a two-way mechanism to enable the same triggers and action on Zapier to be replicated on CiviCRM.</p>\n",
          "difficulty": null,
          "id": "proj_civicrm_2016_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5942583859609600/",
          "proposal_id": null,
          "short_description": "This project was written in aim of participation in the Gsoc 2016, This proposal explains how to integrate CiviCRM with Zapier an integration...",
          "slug": "integrating-civicrm-with-zapier",
          "status": "completed",
          "student_name": "merci mukwe",
          "student_profile": null,
          "tags": [
            "api",
            "ai"
          ],
          "title": "Integrating CiviCRM with Zapier"
        },
        {
          "code_url": "https://github.com/saurabhbatra96/com.saurabhbatra96.civiimport#comsaurabhbatra96civiimport",
          "description": "<h3>Import from Google Sheets</h3>\n<p>I'm Saurabh Batra, a sophomore student at IIT Guwahati, India. I've been actively contributing to Civi since October 2015 and my main point of contact and mentor has been Eileen McNaughton. The project I'm interested in developing for GSoC 2016 is <a href=\"https://wiki.civicrm.org/confluence/display/CRM/Google+Summer+of+Code+-+2016#GoogleSummerofCode-2016-ImportfromGoogles/sheet\" target=\"_blank\">the one Eileen proposed</a>.</p>\n<h5>The main objective here is to replace the data-source of the consisting import code with a generic, interface-based package (<code>ddeboer/data-import</code>) in order to:</h5>\n<ul>\n<li>Add more source formats which can be imported.</li>\n<li>Make the code more manageable.</li>\n</ul>\n<h5>The secondary objectives are:</h5>\n<ul>\n<li>Integrate import from Google sheets to the database.</li>\n<li>Provide an Angular form on top for on-the-go validation.</li>\n</ul>\n",
          "difficulty": null,
          "id": "proj_civicrm_2016_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5158058154000384/",
          "proposal_id": null,
          "short_description": "Import from Google Sheets\nI'm Saurabh Batra, a sophomore student at IIT Guwahati, India. I've been actively contributing to Civi since October 2015...",
          "slug": "import-from-google-sheets",
          "status": "completed",
          "student_name": "Saurabh",
          "student_profile": null,
          "tags": [
            "angular",
            "ai",
            "database"
          ],
          "title": "Import from Google Sheets"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2016/organizations/4866334043144192/"
    },
    "year_2017": null,
    "year_2018": {
      "num_projects": 4,
      "projects": [
        {
          "code_url": "https://github.com/4ndygu/civicrm_osdi",
          "description": "<p>The Open Supporter Data Interface is a set of API standards which aims to define a common interface for interoperability between progressive and nonprofit organizations. Currently, there is no reliable CiviCRM extension that allows organizations to implement the OSDI API across the platform. This project will create an extension that allows organizations to easily import data from external endpoints which are compliant with the OSDI API.</p>\n<p>Organizations would be able to supply an endpoint URL and an APIKEY through this extension when importing contacts, people, events, allowing them to quickly pass data between heterogeneous sources. Additionally, this project consists of an OSDI library that empowers developers to easily access OSDI-compliant datasource and read existing database data in OSDI-compliant JSON format.</p>\n<p>CiviCRM has multiple import functions in extensions and core functions that allow users to import csvs of volunteers, people, events, contacts, etc. This project would also add options to import data through the provided extension.</p>\n",
          "difficulty": null,
          "id": "proj_civicrm_2018_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/4670134031482880/",
          "proposal_id": null,
          "short_description": "The Open Supporter Data Interface is a set of API standards which aims to define a common interface for interoperability between progressive and...",
          "slug": "open-supporter-data-integration-for-civicrm",
          "status": "completed",
          "student_name": "Andy Gu",
          "student_profile": null,
          "tags": [
            "api",
            "ai",
            "database",
            "ui"
          ],
          "title": "Open Supporter Data Integration for CiviCRM"
        },
        {
          "code_url": "https://github.com/saurabhbatra96/wmf-fraud-pipeline",
          "description": "<p>Detailed version: <a href=\"https://lab.civicrm.org/community-team/gsoc2018/issues/2\" target=\"_blank\">https://lab.civicrm.org/community-team/gsoc2018/issues/2</a></p>\n<p><strong>Synopsis</strong></p>\n<p>The project aims to build a new open-source fraud detection system for WMF. The 2 major steps involved are:</p>\n<pre><code>* experimenting with various anomaly detection techniques to figure out which one provides a required balance of precision (% of detected frauds which are actually fraudulent) and recall (% of all frauds detected);\n* providing the technique as an independent web service to WMF (like ORES) which can entertain requests to ascertain the authenticity of transactions.\n</code></pre>\n<p><strong>Stretch Goals</strong></p>\n<pre><code>* The web service uses the feedback from its decisions (new correct detection/wrong detection corrected by a human) to train the underlying model, improving its accuracy in the future.\n* Use something like LIME to provide a justification as to why our classifier chose to mark a transaction as fraud.\n* CiviCRM extension to interface directly with the web service.\n</code></pre>\n",
          "difficulty": null,
          "id": "proj_civicrm_2018_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/4872534902177792/",
          "proposal_id": null,
          "short_description": "Detailed version: https://lab.civicrm.org/community-team/gsoc2018/issues/2\nSynopsis\nThe project aims to build a new open-source fraud detection...",
          "slug": "machine-learning-for-fraud-detection",
          "status": "completed",
          "student_name": "Saurabh Batra",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "ui"
          ],
          "title": "Machine Learning for Fraud Detection"
        },
        {
          "code_url": "https://gist.github.com/tiotsop01/11c506e9bc60648e2f3eaae71916d00b",
          "description": "<p>As with many open-source web applications, installing CiviCRM can be difficult – it requires installing/configuring a series of related services (Linux, MySQL, Apache, an email service, and a CMS). A popular solution to this problem is to distribute pre-built virtual machine templates (\"appliances\" or \"boxes\"). This is where Docker come to the rescue! It provides a uniform way of building and running containers for any required services, making sure that the application performs the same regardless of the target environment.</p>\n",
          "difficulty": null,
          "id": "proj_civicrm_2018_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5756033834156032/",
          "proposal_id": null,
          "short_description": "As with many open-source web applications, installing CiviCRM can be difficult – it requires installing/configuring a series of related services...",
          "slug": "virtual-machine-templates-appliancesboxes-making-civicrm-cloud-native-and-docker-friendly",
          "status": "completed",
          "student_name": "tiotsop",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "docker",
            "cloud",
            "ui"
          ],
          "title": "Virtual Machine Templates (Appliances/Boxes) - Making CiviCRM Cloud Native and Docker Friendly"
        },
        {
          "code_url": "https://docs.google.com/document/d/1agofzGauL8n6HqtgBoNtdksfiv_8Eu6ATVfqA0A_zVo/edit?usp=sharing",
          "description": "<p>CiviCRM is a great CRM for the needs of many non-profits, such as the NLG. A friend of mine suggested that CiviCRM has many features that campaign staff would use for political campaigns. He suggested two things that CiviCRM lacks that keep it from being competitive with other CRMs  like NGPVan or NationBuilder:</p>\n<ul>\n<li>the ability to \"cut turf\" (i.e., select groups of contacts on a map to be assigned to a canvasser)</li>\n<li>integration with a mobile canvassing app to allow canvassers to add information to CiviCRM contact fields.</li>\n</ul>\n<p>This summer, I would like to work towards both of these goals. I think that the first goal --- making a \"turf cutting\" extension for CiviCRM using Leaflet --- is a good baseline goal for the summer. I have a prototype that communicates with CiviCRM using the REST APIs, so it's in reach.</p>\n<p>The second goal --- integration with a mobile canvassing app --- is a stretch, but worth working towards too. I've been rewriting the open-source canvassing app, Field The Bern, to be independent of Bernie infrastructure, and think it's a great candidate for CiviCRM integration. If time permits, I'd like to work on a CiviCRM extension to integrate with phones running Field the Bern.</p>\n",
          "difficulty": null,
          "id": "proj_civicrm_2018_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5766862319124480/",
          "proposal_id": null,
          "short_description": "CiviCRM is a great CRM for the needs of many non-profits, such as the NLG. A friend of mine suggested that CiviCRM has many features that campaign...",
          "slug": "civicrm-extensions-for-political-campaigns",
          "status": "completed",
          "student_name": "Alexander Sludds",
          "student_profile": null,
          "tags": [
            "mobile",
            "api",
            "ai",
            "ui"
          ],
          "title": "CiviCRM Extensions for Political Campaigns"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2018/organizations/4828166816268288/"
    },
    "year_2019": {
      "num_projects": 2,
      "projects": [
        {
          "code_url": "https://gist.github.com/prondubuisi/5f2ac383046a403b10fe773547e76951",
          "description": "<p>This project aims at integrating Vimeo’s <a href=\"https://github.com/vimeo/psalm\" target=\"_blank\">Psalm</a> into the CiviCRM Jenkins toolchain for static analysis purposes. This project will also work on improving Code coverage report generation for CiviCRM. Both static analysis and improved code  test coverage reports will make for better quality assurance benchmarks for CiviCRM.</p>\n",
          "difficulty": null,
          "id": "proj_civicrm_2019_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/6004390752681984/",
          "proposal_id": null,
          "short_description": "This project aims at integrating Vimeo’s Psalm into the CiviCRM Jenkins toolchain for static analysis purposes. This project will also work on...",
          "slug": "static-code-analysis-integration-and-phpunit-code-coverage-report-improvements-for-civicrm",
          "status": "completed",
          "student_name": "Ndubuisi Onyemenam",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Static Code Analysis Integration and PHPUnit code coverage report Improvements for CiviCRM"
        },
        {
          "code_url": "https://civicrm.org/blog/sarvesh21/gsoc-final-evaluation",
          "description": "<p>The Data processor Extension (created by Jaap) provides a user interface to create custom search screens and custom APIs. It saves time by removing the need for  writing custom searches and custom APIs. Searches are compatible across different entities available across CiviCRM. Hence it is a handy tool for system administrator. My work over the GSOC period was to extend the functionality of the Data processor and add more features to the extension.</p>\n",
          "difficulty": null,
          "id": "proj_civicrm_2019_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5200595407863808/",
          "proposal_id": null,
          "short_description": "The Data processor Extension (created by Jaap) provides a user interface to create custom search screens and custom APIs. It saves time by removing...",
          "slug": "data-processor-enhancement",
          "status": "completed",
          "student_name": "Sarvesh Mehta",
          "student_profile": null,
          "tags": [
            "api",
            "ai"
          ],
          "title": "Data Processor Enhancement"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2019/organizations/4799145083142144/"
    },
    "year_2020": {
      "num_projects": 4,
      "projects": [
        {
          "code_url": "https://civicrm.org/blog/kartik1000/probots-and-gitlab-github-integration-final-phase-completion",
          "description": "<p>The Project is based on automating the workflow on CiviCRM-core using GitHub probots and node-gitlab. It also deals in integrating GitHub codebase and GitLab Issues of CiviCRM.</p>\n",
          "difficulty": null,
          "id": "proj_civicrm_2020_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5501949916479488/",
          "proposal_id": null,
          "short_description": "The Project is based on automating the workflow on CiviCRM-core using GitHub probots and node-gitlab. It also deals in integrating GitHub codebase...",
          "slug": "probots-and-gitlab-to-github-integration",
          "status": "completed",
          "student_name": "Kartik Kathuria",
          "student_profile": null,
          "tags": [],
          "title": "Probots and GitLab to GitHub Integration"
        },
        {
          "code_url": "https://medium.com/@ash15.sulaiman/gsoc-2020-with-civicrm-integrating-civicrm-with-libreoffice-63f1ac674864",
          "description": "<p>The project aim is to develop an extension to integrate CiviCRM with LibreOffice/Collabora Office</p>\n",
          "difficulty": null,
          "id": "proj_civicrm_2020_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5292093519429632/",
          "proposal_id": null,
          "short_description": "The project aim is to develop an extension to integrate CiviCRM with LibreOffice/Collabora Office",
          "slug": "linking-civicrm-with-libreoffice-collabora-office",
          "status": "completed",
          "student_name": "Asha Sulaiman",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Linking CiviCRM with LibreOffice / Collabora Office"
        },
        {
          "code_url": "https://civicrm.org/blog/sarvesh21/gsoc-project-outlook365-extension-0",
          "description": "<p>The aim of this project is to deliver a plugin for outlook 365 so that users of\noutlook 365 can send e-mails to contacts in civicrm.</p>\n",
          "difficulty": null,
          "id": "proj_civicrm_2020_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/6234630803423232/",
          "proposal_id": null,
          "short_description": "The aim of this project is to deliver a plugin for outlook 365 so that users of\noutlook 365 can send e-mails to contacts in civicrm.",
          "slug": "outlook-365-plugin-to-integrate-civicrm-in-the-outlook-addressbook",
          "status": "completed",
          "student_name": "Sarvesh Mehta",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Outlook 365 plugin to integrate CiviCRM in the outlook addressbook"
        },
        {
          "code_url": "https://gist.github.com/PratikDevlekar/ab63f74e85dcf635fe6f3d51e35df0a4",
          "description": "<p>This project aims to revolutionize the way we engage and interact with other members through email templates. This project will work on giving the prerequisite to the extension through which the user can make trouble-free customization on templates, and it also focuses on enhancing the design of the pre-defined templates.</p>\n",
          "difficulty": null,
          "id": "proj_civicrm_2020_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5787229596680192/",
          "proposal_id": null,
          "short_description": "This project aims to revolutionize the way we engage and interact with other members through email templates. This project will work on giving the...",
          "slug": "enhancing-transactional-email-templates-and-giving-a-solid-foundation-to-the-extension",
          "status": "completed",
          "student_name": "Pratik Devlekar",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Enhancing Transactional Email Templates And Giving A Solid Foundation To The Extension."
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2020/organizations/4923749205278720/"
    },
    "year_2021": {
      "num_projects": 4,
      "projects": [
        {
          "code_url": "https://lab.civicrm.org/jenniline/activity-cull-GSOC-2021",
          "description": "<p>This project is to build a dashboard that will deliver features to enable an admin handle activities. It will offer  filterable Pivot Table of Activity,  and also  provide meachinism for the admin to select an Activity Type and date period and delete the Activities including any related data in the log tables (if used).</p>\n",
          "difficulty": null,
          "id": "proj_civicrm_2021_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6688419362635776/",
          "proposal_id": null,
          "short_description": "This project is to build a dashboard that will deliver features to enable an admin handle activities. It will offer  filterable Pivot Table of...",
          "slug": "activity-cull",
          "status": "completed",
          "student_name": "Jenniline Ebai",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "Activity Cull"
        },
        {
          "code_url": "https://civicrm.org/blog/asha/gsoc-2021-integrate-spoke-peer-peer-texting-civicrm",
          "description": "<p>The project aim is to create an Extension that will synchronize CiviCRM with an instance of the open source peer-to-peer texting platform/project, Spoke.</p>\n",
          "difficulty": null,
          "id": "proj_civicrm_2021_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5452848975839232/",
          "proposal_id": null,
          "short_description": "The project aim is to create an Extension that will synchronize CiviCRM with an instance of the open source peer-to-peer texting platform/project,...",
          "slug": "integrate-spoke-peer-to-peer-texting",
          "status": "completed",
          "student_name": "Asha Sulaiman",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Integrate Spoke Peer-to-Peer Texting"
        },
        {
          "code_url": "https://lab.civicrm.org/extensions/grapesjsmjml",
          "description": "<p>The idea behind the project is to develop an extension for CiviCRM implementing MJML / GrapeJS for making &amp; sending responsive email newsletters using CiviCRM. This would help user to build newsletters more easily by dragging &amp; dropping approach of  responsive web components. Further this extension will help user of CiviCRM to reach more clients through email marketing.</p>\n",
          "difficulty": null,
          "id": "proj_civicrm_2021_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/4695053066305536/",
          "proposal_id": null,
          "short_description": "The idea behind the project is to develop an extension for CiviCRM implementing MJML / GrapeJS for making & sending responsive email newsletters...",
          "slug": "integrate-mjml-grapejs-newsletters",
          "status": "completed",
          "student_name": "Utpalendu Barman",
          "student_profile": null,
          "tags": [
            "web",
            "ml",
            "ai",
            "ui"
          ],
          "title": "Integrate MJML / GrapeJS Newsletters"
        },
        {
          "code_url": "https://github.com/Christophenkoa/Gsoc-2021-CiviCRM/blob/main/README.md",
          "description": "<p>New extension which allows user to pay membership fees through their local currency.</p>\n",
          "difficulty": null,
          "id": "proj_civicrm_2021_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/4715979757584384/",
          "proposal_id": null,
          "short_description": "New extension which allows user to pay membership fees through their local currency.",
          "slug": "multi-currency-memberships",
          "status": "completed",
          "student_name": "Nkoa Christophe",
          "student_profile": null,
          "tags": [],
          "title": "Multi currency memberships"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2021/organizations/5667013157978112/"
    },
    "year_2022": null,
    "year_2023": null,
    "year_2024": null,
    "year_2025": null
  },
  "first_time": false,
  "contact": {
    "email": "info@civicrm.org",
    "guide_url": null,
    "ideas_url": null,
    "irc_channel": "https://chat.civicrm.org",
    "mailing_list": "https://lists.civicrm.org/lists/"
  },
  "social": {
    "blog": "https://civicrm.org/blog",
    "discord": null,
    "facebook": null,
    "github": null,
    "gitlab": null,
    "instagram": null,
    "linkedin": null,
    "mastodon": null,
    "medium": null,
    "reddit": null,
    "slack": null,
    "stackoverflow": null,
    "twitch": null,
    "twitter": "https://twitter.com/civicrm",
    "youtube": null
  },
  "meta": {
    "version": 1,
    "generated_at": "2026-01-25T15:28:53.020Z"
  }
}