{
  "id": "692251ce53dd9d7326d33d6a",
  "slug": "cmu-sphinx",
  "name": "CMU Sphinx",
  "category": "Media",
  "description": "Fast, Accurate, Flexible Open Source Speech Recognition",
  "image_url": "https://lh3.googleusercontent.com/_vu_qb7x-5e-HEFLBfIEDvYIVrZoePvwECpa2n5RAJqTUIeOt_vrF8-i9wdz6z-owZ7ikHDuv2ab_BhAjWFUAuS3ogWhNQ",
  "img_r2_url": "https://pub-268c3a1efc8b4f8a99115507a760ca14.r2.dev/cmu-sphinx.webp",
  "logo_r2_url": null,
  "url": "http://cmusphinx.sourceforge.net/",
  "active_years": [
    2017
  ],
  "first_year": 2017,
  "last_year": 2017,
  "is_currently_active": false,
  "technologies": [
    "c",
    "python",
    "javascript",
    "cross-platform",
    "hidden markov models"
  ],
  "topics": [
    "education",
    "real time",
    "user interface",
    "speech recognition",
    "pronunciation"
  ],
  "total_projects": 11,
  "stats": {
    "avg_projects_per_appeared_year": 11,
    "projects_by_year": {
      "year_2016": null,
      "year_2017": 11,
      "year_2018": null,
      "year_2019": null,
      "year_2020": null,
      "year_2021": null,
      "year_2022": null,
      "year_2023": null,
      "year_2024": null,
      "year_2025": null
    },
    "students_by_year": {
      "year_2016": null,
      "year_2017": 11,
      "year_2018": null,
      "year_2019": null,
      "year_2020": null,
      "year_2021": null,
      "year_2022": null,
      "year_2023": null,
      "year_2024": null,
      "year_2025": null
    },
    "total_students": 11
  },
  "years": {
    "year_2016": null,
    "year_2017": {
      "num_projects": 11,
      "projects": [
        {
          "code_url": "https://github.com/SND96/twine-stories",
          "description": "<p>This proposal is for the implementation of Computer-Aided Language Learning from the browser using Pocketsphinx.js. Using Twee/Twine as the question format, users will complete voice-based assignments based on courses which will be integrated with Moodle and Wikiversity. The user's motivation and effort levels will be monitored and a system which monitors these parameter and keep both of them at an optimum level will be integrated with the assignments. Based on these parameters, hints will be given or with held so that the user progresses better.  A community feature will be implemented which will facilitate the formation of peer-learning groups (This can also be in the form of a very basic version of an online role-playing game). Amazon Mturk will be used for the collection of transcription data.</p>\n",
          "difficulty": null,
          "id": "proj_cmu-sphinx_2017_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6604809566158848/",
          "proposal_id": null,
          "short_description": "This proposal is for the implementation of Computer-Aided Language Learning from the browser using Pocketsphinx.js. Using Twee/Twine as the question...",
          "slug": "general-computer-assisted-learning-including-speaking-skills",
          "status": "completed",
          "student_name": "Sahith Dambekodi",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "General Computer-Assisted Learning including Speaking Skills"
        },
        {
          "code_url": "https://abuccts.blogspot.com/2017/08/gsoc-2017-with-cmusphinx-post-12-final.html",
          "description": "<p>This <em>Collect Pronunciation Dictionaries from Wiktionary</em> project aims to expand pronunciation dictionaries in CMUSphinx for new words and multiple languages from Wikimedia Foundation projects. Current Sphinx dictionaries only support limited words and languages, which is difficult to meet the needs of applications, so expanding dictionaries in Sphinx is an urgent need. It's critical to reuse existing pronunciation dictionaries to improve system performance, support new words appeared recently and more languages. A valuable pronunciation source is Wiktionary, which is a multilingual, web-based project to create a free content dictionary of all words in all languages. Although Wiktionary contains pronunciations for many words and multiple languages in a standard format like IPA, it’s not easy to parse those pronunciations from sources in different page formats and convert phonemes in different languages to one common format like CMUBET which can be used by Sphinx. This project will solve those problems and form at least 10 pronunciation dictionaries which will be tested on several ASR benchmarks for Sphinx.</p>\n",
          "difficulty": "beginner",
          "id": "proj_cmu-sphinx_2017_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5423139777413120/",
          "proposal_id": null,
          "short_description": "This Collect Pronunciation Dictionaries from Wiktionary project aims to expand pronunciation dictionaries in CMUSphinx for new words and multiple...",
          "slug": "collect-pronunciation-dictionaries-from-wiktionary",
          "status": "completed",
          "student_name": "Yifan Xiong",
          "student_profile": null,
          "tags": [
            "web",
            "ai"
          ],
          "title": "Collect Pronunciation Dictionaries from Wiktionary"
        },
        {
          "code_url": "https://github.com/cmusphinx/deepsphinx",
          "description": "<p>Automatic speech recognition systems are traditionally based on Hidden Markov models(HMMs) as it had given the best results in the past. However due to recent advances in neural networks,  recurrent neural network(RNN) models have became competitive and surpassed HMMs in speech recognition task. RNN models also have the advantage of being used in an end-to-end model and don't require extensive hand engineering of features like HMM. In this project I aim to implement a LSTM(Long Short Term Memory) based model as based on state of the art research and make it easily available using PocketSphinx like API.</p>\n",
          "difficulty": null,
          "id": "proj_cmu-sphinx_2017_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6159566949580800/",
          "proposal_id": null,
          "short_description": "Automatic speech recognition systems are traditionally based on Hidden Markov models(HMMs) as it had given the best results in the past. However due...",
          "slug": "large-vocabulary-continuous-speech-recognition-using-rnns",
          "status": "completed",
          "student_name": "Vishal Agrawal",
          "student_profile": null,
          "tags": [
            "api",
            "ai",
            "ui"
          ],
          "title": "Large Vocabulary Continuous Speech Recognition using RNNs"
        },
        {
          "code_url": "https://github.com/saurabhima/gsoc_LEADERBOARD",
          "description": "<p>The project scope includes designing a web based leader board module for CMU Sphinx which would include details of top ranking people, models, training methods, data collection methodologies, proposals, benefactors, vocabulary, languages, fund raising methods, etc.</p>\n<p>This project would be a Python Flask based REST Web solution with inbuilt authentication which would provide users to update and view details of top performers in the above mentioned categories.</p>\n",
          "difficulty": null,
          "id": "proj_cmu-sphinx_2017_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5273302327099392/",
          "proposal_id": null,
          "short_description": "The project scope includes designing a web based leader board module for CMU Sphinx which would include details of top ranking people, models,...",
          "slug": "leaderboard-population-sorting-and-column-maintenance",
          "status": "completed",
          "student_name": "S SINGH",
          "student_profile": null,
          "tags": [
            "python",
            "web",
            "ai",
            "ui"
          ],
          "title": "Leaderboard Population, Sorting, and Column Maintenance"
        },
        {
          "code_url": "https://github.com/akreal/diphones",
          "description": "<p>The goal of this project is to extend PocketSphinx so that it can calculate and provide alignments and acoustic scores for diphones similarly to how it already does for phonemes. This will help with learner analytics and adaptive instruction for pronunciation evaluation, assessment, and remediation, and can increase speech recognition accuracy and speech recognition system generality. Moreover, diphones may be helpful for new acoustic models, and can inform the construction of different kinds of language models.</p>\n",
          "difficulty": null,
          "id": "proj_cmu-sphinx_2017_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6207651658596352/",
          "proposal_id": null,
          "short_description": "The goal of this project is to extend PocketSphinx so that it can calculate and provide alignments and acoustic scores for diphones similarly to how...",
          "slug": "diphone-alignment-and-acoustic-scores",
          "status": "completed",
          "student_name": "Pavel Denisov",
          "student_profile": null,
          "tags": [],
          "title": "Diphone alignment and acoustic scores"
        },
        {
          "code_url": "https://github.com/vagrawal/gsoc-progress/blob/master/mshah1/GSOC.ipynb",
          "description": "<p>In the past decade Deep Neural Networks (DNNs) have been be demonstrated to excel to wide range of learning tasks, including speech recognition. More recently, robust DNN-based speech recognition techniques have been developed that have been adopted by all major commercial systems including those from Google and Amazon. In such a setting, the GMM-HMM based speech recognition framework used by Sphinx is severely outdated and requires an upgrade to perform at par with the state-of-the-art systems.</p>\n<p>I propose a two-tiered approach for acoustic scoring that uses concepts from Convolutional Neural Networks (CNNs) for feature extraction and Gate Recurrent Units (GRU) for acoustic modelling. The first level consists of convolutional filters and pooling layers that produce convolutional features from each audio frame. The second level consists of a single GRU-based DNN that estimates the output probabilities for each HMM. The optimal state sequence can then be found using Viterbi decoding. Over the course of the project this setup will be optimised by experimenting with different structural parameters for the DNNs as well as different learning techniques.</p>\n",
          "difficulty": null,
          "id": "proj_cmu-sphinx_2017_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6254753893842944/",
          "proposal_id": null,
          "short_description": "In the past decade Deep Neural Networks (DNNs) have been be demonstrated to excel to wide range of learning tasks, including speech recognition. More...",
          "slug": "dnns-for-sphinx",
          "status": "completed",
          "student_name": "Muhammad Shah",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "DNNs for Sphinx"
        },
        {
          "code_url": "https://github.com/habdullah/pocketsphinx",
          "description": "<p>CMUsphinx is a fast and flexible open source speech recognition toolkit. Currently it uses GMM acoustic models and it gives reasonable accuracy. This project is geared towards incorporating a state of the art MLP-HMM model into sphinx, substantially decreasing the error rates. A ResNet with MLPs instead of convolution networks will be trained and tested on TEDLIUM corpus.The aim is to achieve best-in-category accuracy in recognition of Ted talks.This project will bring CMUsphinx at par with other powerful speech toolkits like KALDI and will help Sphinx users worldwide get better accuracy in their ASR projects.</p>\n",
          "difficulty": null,
          "id": "proj_cmu-sphinx_2017_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/4676203759796224/",
          "proposal_id": null,
          "short_description": "CMUsphinx is a fast and flexible open source speech recognition toolkit. Currently it uses GMM acoustic models and it gives reasonable accuracy. This...",
          "slug": "mlp-incorporation-in-sphinx",
          "status": "completed",
          "student_name": "Hammad Abdullah",
          "student_profile": null,
          "tags": [
            "ml",
            "ai"
          ],
          "title": "MLP incorporation in Sphinx"
        },
        {
          "code_url": "https://brijmohan.github.io/iremedy/single_line.html",
          "description": "<p>The proposed framework will implement a user interface capable of collecting audio signal from microphone corresponding to a prompted text and perform a comprehensive speech analysis to produce a report of mispronounced segments of speech in the collected audio. Audio collection is performed asynchronously through web workers in browsers or flash actionscript as a fallback. The collected audio is parallely decoded using multiple grammars within pocketsphinx framework and standardized acoustic scores for each decoded unit is compared across grammars to evaluate the pronunciation. These grammars form the core contribution of this project wherein they act as a panel of native and non-native transcriptionists or recognition models predicting the output as intelligible to each of them.</p>\n",
          "difficulty": null,
          "id": "proj_cmu-sphinx_2017_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6114169682132992/",
          "proposal_id": null,
          "short_description": "The proposed framework will implement a user interface capable of collecting audio signal from microphone corresponding to a prompted text and...",
          "slug": "pronunciation-intelligibility-remediation-with-pocketsphinxjs",
          "status": "completed",
          "student_name": "Brij",
          "student_profile": null,
          "tags": [
            "web"
          ],
          "title": "Pronunciation Intelligibility Remediation with Pocketsphinx.js"
        },
        {
          "code_url": "https://github.com/rrajasek95/gsoc_LEADERBOARD",
          "description": "<p>The aim of this project is to write support code for obtaining accurate transcriptions, exemplar\npronunciations, and phonetic and part-of-speech labeling.</p>\n<p>One of the important concerns in Natural Language Processing is the availability of gold\nstandard information such as transcripts of speech, part-of-speech tagged sentences, word\npronunciation examples etc., which aid in training and evaluating the performance of\nspeech and text processing algorithms. This requires extensive collection, processing and\nvalidation of information from a variety of sources.</p>\n<p>The data needs to be normalized across these sources, evaluated based on quality,\nquantity and other metrics. This requires a structured system which allows for the data\ncollection and management tasks to be done effectively. This is especially important to\nCMU Sphinx contributors who require such data for their work, such as training and\nevaluating their speech and text models.</p>\n<p>The project involves the integration of a Flask and SQLite based leaderboard web\napplication with a transcription record system into a broader data aggregation and\nprocessing framework for the aforementioned tasks.</p>\n",
          "difficulty": null,
          "id": "proj_cmu-sphinx_2017_009",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/4880814793818112/",
          "proposal_id": null,
          "short_description": "The aim of this project is to write support code for obtaining accurate transcriptions, exemplar\npronunciations, and phonetic and part-of-speech...",
          "slug": "transcriber-qualification",
          "status": "completed",
          "student_name": "Rishi Rajasekaran",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "ui"
          ],
          "title": "Transcriber Qualification"
        },
        {
          "code_url": "https://mritunjaygoutam1.wordpress.com/",
          "description": "<p>As mention in the title, it is a 3D animation model of the motor control of speech production. Our long range goal is to implement the model completely and test it exhaustively, in the belief that doing so will significantly advance our understanding of speech motor control. The model is designed to have properties that are as faithful as possible to data from speakers– including measures of brain function, speech motor control mechanisms,physiolog, an atom, biomechanics, and acoustics.</p>\n",
          "difficulty": null,
          "id": "proj_cmu-sphinx_2017_010",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5816809634660352/",
          "proposal_id": null,
          "short_description": "As mention in the title, it is a 3D animation model of the motor control of speech production. Our long range goal is to implement the model...",
          "slug": "javascript-simulation-of-the-brains-motor-control-of-vocal-tract-gsoc-2017-proposal",
          "status": "completed",
          "student_name": "Mritunjay Goutam",
          "student_profile": null,
          "tags": [
            "java",
            "javascript",
            "ai"
          ],
          "title": "Javascript simulation of the brain’s motor control of vocal tract-GSoC 2017 proposal"
        },
        {
          "code_url": "https://medium.com/@PankajB96/gsoc-a-joruney-just-started-53d6b8b68931",
          "description": "<p>ROS has support for pocketsphinx, but it is very initial stage. So, this project aims to update the ROS package for pocketsphinx with a full-scale support for the recent features and updates. Also, the current package makes use of many external dependencies for its proper functioning. This leads to a lot of complexities in the installation process and in maintaining the codebase. So, another motivation for this project is to get rid of as many of the external dependencies as possible and maintain a proper documentation for the new package. The existing codebase does not have a proper wiki or documentation, neither for the developers, nor for the end-users. And ROS is all about flexible usability. So, this project would also strive to provide a concise, clear and up-to-date documentation of the entire package.</p>\n",
          "difficulty": "advanced",
          "id": "proj_cmu-sphinx_2017_011",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5980098251456512/",
          "proposal_id": null,
          "short_description": "ROS has support for pocketsphinx, but it is very initial stage. So, this project aims to update the ROS package for pocketsphinx with a full-scale...",
          "slug": "ros-integration-for-pocketsphinx",
          "status": "completed",
          "student_name": "Pankaj Baranwal",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "ROS Integration for pocketsphinx"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2017/organizations/5510422639673344/"
    },
    "year_2018": null,
    "year_2019": null,
    "year_2020": null,
    "year_2021": null,
    "year_2022": null,
    "year_2023": null,
    "year_2024": null,
    "year_2025": null
  },
  "first_time": false,
  "contact": {
    "email": "cmusphinx-gsoc@lists.sourceforge.net",
    "guide_url": null,
    "ideas_url": null,
    "irc_channel": "http://cmusphinx.sourceforge.net/wiki/communicate",
    "mailing_list": "https://sourceforge.net/p/cmusphinx/mailman/"
  },
  "social": {
    "blog": "http://cmusphinx.sourceforge.net/",
    "discord": null,
    "facebook": null,
    "github": null,
    "gitlab": null,
    "instagram": null,
    "linkedin": null,
    "mastodon": null,
    "medium": null,
    "reddit": null,
    "slack": null,
    "stackoverflow": null,
    "twitch": null,
    "twitter": null,
    "youtube": null
  },
  "meta": {
    "version": 1,
    "generated_at": "2026-01-25T15:28:52.990Z"
  }
}