{
  "id": "692251d153dd9d7326d33d87",
  "slug": "creative-commons",
  "name": "Creative Commons",
  "category": "Web",
  "description": "Nonprofit building a global digital commons.",
  "image_url": "https://summerofcode.withgoogle.com/media/org/creative-commons/jvj0y3czaagpnhvz-360.png",
  "img_r2_url": "https://pub-268c3a1efc8b4f8a99115507a760ca14.r2.dev/creative-commons.webp",
  "logo_r2_url": null,
  "url": "https://opensource.creativecommons.org/",
  "active_years": [
    2019,
    2020,
    2023,
    2024
  ],
  "first_year": 2019,
  "last_year": 2024,
  "is_currently_active": false,
  "technologies": [
    "python",
    "postgresql",
    "javascript",
    "elasticsearch",
    "wordpress",
    "django",
    "vue.js",
    "php",
    "css"
  ],
  "topics": [
    "web",
    "nonprofit",
    "copyleft",
    "creative commons",
    "legal",
    "nonprofits"
  ],
  "total_projects": 14,
  "stats": {
    "avg_projects_per_appeared_year": 3.5,
    "projects_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": null,
      "year_2019": 5,
      "year_2020": 5,
      "year_2021": null,
      "year_2022": null,
      "year_2023": 1,
      "year_2024": 3,
      "year_2025": null
    },
    "students_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": null,
      "year_2019": 5,
      "year_2020": 5,
      "year_2021": null,
      "year_2022": null,
      "year_2023": 1,
      "year_2024": 3,
      "year_2025": null
    },
    "total_students": 14
  },
  "years": {
    "year_2016": null,
    "year_2017": null,
    "year_2018": null,
    "year_2019": {
      "num_projects": 5,
      "projects": [
        {
          "code_url": "https://github.com/creativecommons/ccsearch-browser-extension",
          "description": "<p>This project aims to create a plugin for other platforms to help Creative Commons users. Since freedom is given on choosing the platform and tools, I will create a Cross-browser extension to help users</p>\n<ul>\n<li>Search and filter CC-licensed content.</li>\n<li>Easily attribute the content.</li>\n<li>Have a personalized experience by setting custom settings and defaults.</li>\n<li>Bookmark images for later.</li>\n<li>Export and import bookmarks.</li>\n<li>Sync bookmarks and custom settings.</li>\n</ul>\n<p>This, along with an intuitive and human-friendly UI, would result in more personal interaction of users around the world with Creative Commons and its mission of maximizing digital creativity, sharing and innovation.</p>\n",
          "difficulty": null,
          "id": "proj_creative-commons_2019_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/6193964636438528/",
          "proposal_id": null,
          "short_description": "This project aims to create a plugin for other platforms to help Creative Commons users. Since freedom is given on choosing the platform and tools, I...",
          "slug": "browser-extension-for-creative-commons",
          "status": "completed",
          "student_name": "makkoncept",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Browser Extension for Creative Commons"
        },
        {
          "code_url": "https://opensource.creativecommons.org/blog/entries/cc-chooser-lastweek/",
          "description": "<p>The process of licensing a creative work can be very confusing. What license is right for me? How do I formally license my work? How do I help people attribute me when my work is used? The Creative Commons license chooser aims to answer these questions, but because of a lack of readability and informational clutter, the existing chooser tool falls short, and most likely creates more questions than it answers. My proposal aims to address these issues, and make the process of finding and using Creative Commons licenses easy.</p>\n",
          "difficulty": "beginner",
          "id": "proj_creative-commons_2019_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/4784447168184320/",
          "proposal_id": null,
          "short_description": "The process of licensing a creative work can be very confusing. What license is right for me? How do I formally license my work? How do I help people...",
          "slug": "human-centered-education-of-cc-licenses",
          "status": "completed",
          "student_name": "Ari Madian",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Human Centered Education of CC Licenses"
        },
        {
          "code_url": "https://opensource.creativecommons.org/blog/entries/vocabulary-so-long/",
          "description": "<p>CC Vocabulary is a design system, a collection of UI components, available both as CSS stylesheets and minified JS, as well as Vue components, that make it easy to develop Creative Commons apps and services while ensuring a cohesive experience and appearance across CC projects.</p>\n<p>CC Vocabulary would make it easy for designers to design and prototype mockups, developers to develop evolving standards-compliant code that covers a large number of use-cases out-of-the-box and users to navigate a more consistently familiar CC web presence.</p>\n<p>CC Search is a Creative Commons application that allows users to search for images (and soon, other content) and provides one-click attribution and licensing information, making it effortless and unambiguous to use and extend creative works from other artists.</p>\n<p>The revamped CC Search would provide a more streamlined experience, making the site mobile-responsive, modernised and smoother to use. The website would also be the pilot project to use the new CC Vocabulary components, enabling faster development and a more consistent look and feel.</p>\n",
          "difficulty": "beginner",
          "id": "proj_creative-commons_2019_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/4863495437287424/",
          "proposal_id": null,
          "short_description": "CC Vocabulary is a design system, a collection of UI components, available both as CSS stylesheets and minified JS, as well as Vue components, that...",
          "slug": "cc-vocabulary-and-cc-search",
          "status": "completed",
          "student_name": "Dhruv Bhanushali",
          "student_profile": null,
          "tags": [
            "vue",
            "web",
            "mobile",
            "ml",
            "ai"
          ],
          "title": "CC Vocabulary and CC Search"
        },
        {
          "code_url": "https://gist.github.com/ahmadbilaldev/ebddbee32cc469dc9c08c3f403f0b9cd",
          "description": "<p>The Creative Commons plugin for WordPress is due for an update for over two years. I plan to rebuild the plugin from scratch with WordPress Coding standards in mind. This optimization will come in the forms of both standards compliant code and documentation.</p>\n<h3>Proposed Features</h3>\n<ul>\n<li>Creative Commons Gutenberg Blocks.</li>\n<li>WordPress Coding Standards compliant code.</li>\n<li>WordPress Documentation Standards compliant inline code docs.</li>\n<li>CC Licensing of Images uploaded by a user to help make licensing clear.</li>\n<li>Custom license page templates for each CC license and page generator.</li>\n<li>New documentation site hosted with Netlify built with Gatsby.js, JAMstack.</li>\n</ul>\n<h3>Results</h3>\n<p>With the above-mentioned features, the plugin will be functional and a user installing CC WordPress plugin will be able to add the Creative Commons Licenses to images, content, or even generate License pages that can help explain licensing of the entire site's content. Moreover, with a new documentation site, we'll be able to bring in more community contributors to the project.</p>\n",
          "difficulty": null,
          "id": "proj_creative-commons_2019_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5814275317170176/",
          "proposal_id": null,
          "short_description": "The Creative Commons plugin for WordPress is due for an update for over two years. I plan to rebuild the plugin from scratch with WordPress Coding...",
          "slug": "revamp-of-cc-wordpress-plugin",
          "status": "completed",
          "student_name": "Ahmad Bilal",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Revamp of CC WordPress Plugin"
        },
        {
          "code_url": "https://github.com/creativecommons/cccatalog-dataviz",
          "description": "<p>There is no larger compendium of shared human knowledge and creativity than the Commons, including over 1.4 billion digital works available under CC tools. Creative Commons has released the “CC Search” project.  Being able to access visualizations of all the indexed content is a good way for the community (and CC) to see how much data has been indexed and find and explore relationships between CC-licensed content on the web. The challenge is then, to create visualizations of all the data that is stored in the Creative Commons catalog (over 250 million works and growing) and show how they link to each other</p>\n",
          "difficulty": null,
          "id": "proj_creative-commons_2019_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5941954410446848/",
          "proposal_id": null,
          "short_description": "There is no larger compendium of shared human knowledge and creativity than the Commons, including over 1.4 billion digital works available under CC...",
          "slug": "creative-commons-visualize-cc-catalog-data",
          "status": "completed",
          "student_name": "María Belen Guaranda",
          "student_profile": null,
          "tags": [
            "web",
            "ai"
          ],
          "title": "Creative Commons-Visualize CC Catalog data"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2019/organizations/5500455663173632/"
    },
    "year_2020": {
      "num_projects": 5,
      "projects": [
        {
          "code_url": "https://opensource.creativecommons.org/blog/entries/cc-catalog-wrapping-gsoc20/",
          "description": "<p>Adding new Api's to the workflow, to improve the breadth of cc-search. Implementing the provider scripts and add test suite for each api . Also change existing scripts in common crawl to api based crawl.</p>\n",
          "difficulty": null,
          "id": "proj_creative-commons_2020_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5671844729847808/",
          "proposal_id": null,
          "short_description": "Adding new Api's to the workflow, to improve the breadth of cc-search. Implementing the provider scripts and add test suite for each api . Also...",
          "slug": "add-provider-api-scripts",
          "status": "completed",
          "student_name": "K S Srinidhi Krishna",
          "student_profile": null,
          "tags": [
            "api",
            "ui"
          ],
          "title": "Add provider API scripts"
        },
        {
          "code_url": "http://opensource.creativecommons.org/blog/entries/overview-of-the-gsoc-2020-project/",
          "description": "<p>Provide support for retrieving image information from selected providers through their public APIs to increase the material available  via  CC Search and the CC Catalog API.</p>\n",
          "difficulty": null,
          "id": "proj_creative-commons_2020_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5432326651117568/",
          "proposal_id": null,
          "short_description": "Provide support for retrieving image information from selected providers through their public APIs to increase the material available  via  CC Search...",
          "slug": "add-provider-api-scripts-to-cc-catalog",
          "status": "completed",
          "student_name": "Charini Nanayakkara",
          "student_profile": null,
          "tags": [
            "api",
            "ai"
          ],
          "title": "Add Provider API Scripts to CC Catalog"
        },
        {
          "code_url": "https://opensource.creativecommons.org/blog/entries/cc-search-extension-wrapping-up-gsoc-2020/",
          "description": "<p>Since the release of CC Search Browser extension, it has garnered a good number of users. But, the extension still does not have sufficient features and capability to be used as a daily driver in the workflow of the users and therefore most of them use it as a temporary plugin to search for CC-licensed images. My main aim would be to transform the extension to become competent enough to contribute to the user's workflow and be an important part of their toolkit. I will do that by adding new features in addition to other enhancements and improvements to the extension.</p>\n",
          "difficulty": null,
          "id": "proj_creative-commons_2020_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5086769688608768/",
          "proposal_id": null,
          "short_description": "Since the release of CC Search Browser extension, it has garnered a good number of users. But, the extension still does not have sufficient features...",
          "slug": "improvements-to-cc-search-browser-extension",
          "status": "completed",
          "student_name": "Mayank Nader",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Improvements to CC Search Browser Extension"
        },
        {
          "code_url": "https://github.com/creativecommons/cccatalog-dataviz/",
          "description": "<p>The CC catalog data visualization or linked commons is a web application which finds and explores relationships between creative commons licensed content on the web.</p>\n<p>Being able to access visualizations of all the indexed content is a good way for the community (and CC) to see how much data has been indexed and find and explore relationships between CC-licensed content on the web. The data is enormous and includes more than millions of digital works.</p>\n<p>Rendering this big data in the browser is a big challenge. The idea is to design efficient filtering methods and other structures, to divide the enormous data into smaller chunks.</p>\n<p>The revamped Linked Commons will have a modernized user interface, would provide a more sleek experience, and will allow users to explore a graph cluster more efficiently.</p>\n",
          "difficulty": null,
          "id": "proj_creative-commons_2020_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5087489028521984/",
          "proposal_id": null,
          "short_description": "The CC catalog data visualization or linked commons is a web application which finds and explores relationships between creative commons licensed...",
          "slug": "add-filtering-by-node-to-the-linked-commons",
          "status": "completed",
          "student_name": "Subham Sahu",
          "student_profile": null,
          "tags": [
            "web"
          ],
          "title": "Add filtering by node to the Linked Commons"
        },
        {
          "code_url": "https://opensource.creativecommons.org/blog/entries/cc-search-accessibility-and-internationalization/",
          "description": "<p>The CC Search website is a tool that is available to everyone on the internet, but its accessibility is quite low. The reasons for its low accessibility are varied in nature which affects different sections of people. Due to this reduced accessibility, it is not possible for everyone to completely utilize all the features that cc search provides and thus it becomes imperative to fix this issue. The final deliverable of this project will be a highly accessible website which everyone on the web can access from any device or region and which fully accommodates every visitor to enable them to utilize the search to its fullest.</p>\n",
          "difficulty": null,
          "id": "proj_creative-commons_2020_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5131639379722240/",
          "proposal_id": null,
          "short_description": "The CC Search website is a tool that is available to everyone on the internet, but its accessibility is quite low. The reasons for its low...",
          "slug": "improve-cc-search-accessibility",
          "status": "completed",
          "student_name": "AyanChoudhary",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "ui"
          ],
          "title": "Improve CC Search Accessibility"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2020/organizations/5450793232105472/"
    },
    "year_2021": null,
    "year_2022": null,
    "year_2023": {
      "num_projects": 1,
      "projects": [
        {
          "code_url": "https://github.com/0saurabh0/GSoC-23-Report",
          "description": "The Creative Commons (CC) legal tools are composed of three parts: a legal code, a deed written in simple language, and a machine-readable layer. Unfortunately, the machine-readable layer has not been updated in some time and contains unresolved issues. To address this, the task at hand is to extend the CC Legal Tools App to generate deterministic RDF/XML files for all of the legal tools. This will bring the machine-readable layer up to date with current specifications and ensure that the legal tools are well-organized and consistent, also the end result will be an improved user experience and a more reliable and efficient system for those utilizing the CC legal tools.",
          "difficulty": null,
          "id": "proj_creative-commons_2023_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/9m8Ttuvo",
          "proposal_id": "sc2G1UFO",
          "short_description": "The Creative Commons (CC) legal tools are composed of three parts: a legal code, a deed written in simple language, and a machine-readable layer....",
          "slug": "cc-legal-tools-machine-readable-layer",
          "status": "completed",
          "student_name": "Saurabh K",
          "student_profile": null,
          "tags": [
            "ml",
            "ai"
          ],
          "title": "CC LEGAL TOOLS: MACHINE READABLE LAYER"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2023/organizations/creative-commons"
    },
    "year_2024": {
      "num_projects": 3,
      "projects": [
        {
          "code_url": "https://github.com/naishasinha/GSoC-2024-Final",
          "description": "Quantifying the Commons — an initiative emerging from the UC Berkeley Data Science Discovery Program — aims to quantify the frequency of open domain and CC license usage for future accessibility and analysis purposes. To date, previous advancements have not included automation or combined reporting, which are crucial for minimizing human error and ensuring timely updates — especially when engaging with substantial streams of data. Therefore, the primary objective of this project is to develop automation software for data collection, processing, and report generation, ensuring that the Quantifying reports are consistently updated and never more than three months out-of-date.",
          "difficulty": null,
          "id": "proj_creative-commons_2024_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/vvuGqMLQ/",
          "proposal_id": null,
          "short_description": "Quantifying the Commons — an initiative emerging from the UC Berkeley Data Science Discovery Program — aims to quantify the frequency of open domain...",
          "slug": "automating-quantifying-the-commons",
          "status": "completed",
          "student_name": "Naisha Sinha",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Automating Quantifying the Commons"
        },
        {
          "code_url": "https://github.com/Murdock9803/GSoC-24-Doc/blob/main/README.md#google-summer-of-code-2024---final-report",
          "description": "The goal of this GSOC program is to modernize the CC Resource Archive website by implementing a comprehensive visual overhaul to align with current Creative Commons aesthetics and functionality standards. Utilizing the Internal Design System (Vocabulary), the project aims to upgrade the visual design, implement semantic, accessible, and standards-compliant HTML, CSS, and JavaScript, and improve user experience (UX) for resource submission while ensuring site stability on GitHub Pages. Through these efforts and solid documentation, the revamped Resources Archive will meet modern standards, enhance usability, and facilitate maintainability for both users and developers.",
          "difficulty": null,
          "id": "proj_creative-commons_2024_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/ZIhUmKRN/",
          "proposal_id": null,
          "short_description": "The goal of this GSOC program is to modernize the CC Resource Archive website by implementing a comprehensive visual overhaul to align with current...",
          "slug": "modernize-cc-resource-archive",
          "status": "completed",
          "student_name": "Ayush Sahu (Murdock9803)",
          "student_profile": null,
          "tags": [
            "java",
            "javascript",
            "web",
            "ml",
            "ai"
          ],
          "title": "Modernize CC Resource Archive"
        },
        {
          "code_url": "https://docs.google.com/document/d/1JFrtGkIsy61hjZH7Rs8wj7jdtftI7R_-gmYNWnVGH9A/edit?usp=sharing",
          "description": "One of the most important workflows for developing software is having a proper development environment. This project aims to create a set of Ansible playbooks and Docker containers to allow developers to easily run a local environment that closely mimics the software that Creative Commons runs in production.",
          "difficulty": null,
          "id": "proj_creative-commons_2024_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/1imypzrR/",
          "proposal_id": null,
          "short_description": "One of the most important workflows for developing software is having a proper development environment. This project aims to create a set of Ansible...",
          "slug": "create-local-ansible-dev-environment-using-docker",
          "status": "completed",
          "student_name": "amandayclee",
          "student_profile": null,
          "tags": [
            "ai",
            "docker"
          ],
          "title": "Create Local Ansible Dev Environment Using Docker"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2024/organizations/creative-commons/"
    },
    "year_2025": null
  },
  "first_time": false,
  "contact": {
    "email": null,
    "guide_url": null,
    "ideas_url": null,
    "irc_channel": "https://opensource.creativecommons.org/community/",
    "mailing_list": "https://opensource.creativecommons.org/community/"
  },
  "social": {
    "blog": "https://opensource.creativecommons.org/blog/entries/",
    "discord": null,
    "facebook": null,
    "github": null,
    "gitlab": null,
    "instagram": null,
    "linkedin": null,
    "mastodon": null,
    "medium": null,
    "reddit": null,
    "slack": null,
    "stackoverflow": null,
    "twitch": null,
    "twitter": "https://twitter.com/cc_opensource",
    "youtube": null
  },
  "meta": {
    "version": 1,
    "generated_at": "2026-01-25T15:28:53.033Z"
  }
}