{
  "id": "692251d153dd9d7326d33d88",
  "slug": "cuneiform-digital-library-initiative-cdli",
  "name": "Cuneiform Digital Library Initiative (CDLI)",
  "category": "Science and medicine",
  "description": "Curating humanity's oldest written sources",
  "image_url": "https://summerofcode.withgoogle.com/media/org/cuneiform-digital-library-initiative-cdli/rljrqtuzc0jxkpcp-360.png",
  "img_r2_url": "https://pub-268c3a1efc8b4f8a99115507a760ca14.r2.dev/cuneiform-digital-library-initiative-cdli.webp",
  "logo_r2_url": null,
  "url": "https://cdli.ucla.edu",
  "active_years": [
    2018,
    2019,
    2020,
    2021,
    2022
  ],
  "first_year": 2018,
  "last_year": 2022,
  "is_currently_active": false,
  "technologies": [
    "python",
    "mariadb",
    "rdf",
    "php",
    "nltk",
    "mysql",
    "java",
    "html",
    "css",
    "python 3",
    "javascript",
    "docker",
    "SCSS"
  ],
  "topics": [
    "natural language processing",
    "semantic web",
    "machine translation",
    "information retrieval",
    "linguistics",
    "computer vision",
    "data processing pipeline",
    "nlp",
    "lod",
    "data-collection",
    "computational linguistics",
    "data visualization",
    "web portal",
    "data processing",
    "digitization",
    "cultural heritage",
    "History",
    "culture"
  ],
  "total_projects": 30,
  "stats": {
    "avg_projects_per_appeared_year": 6,
    "projects_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": 2,
      "year_2019": 5,
      "year_2020": 9,
      "year_2021": 7,
      "year_2022": 7,
      "year_2023": null,
      "year_2024": null,
      "year_2025": null
    },
    "students_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": 2,
      "year_2019": 5,
      "year_2020": 9,
      "year_2021": 7,
      "year_2022": 7,
      "year_2023": null,
      "year_2024": null,
      "year_2025": null
    },
    "total_students": 29
  },
  "years": {
    "year_2016": null,
    "year_2017": null,
    "year_2018": {
      "num_projects": 2,
      "projects": [
        {
          "code_url": "https://github.com/cdli-gh/Semantic-Role-Labeler",
          "description": "<p>Semantic role labeling (SRL) is a task in Natural Language Processing which helps in detecting the semantic arguments of the predicate/s of a sentence, and then classifies them into various pre-defined semantic categories thus assigning a semantic role to the syntactic constituents.</p>\n<p>The larger goal of the project is to develop a supervised semantic role labeling system for Sumerian, a Mesopotamian language spoken in the 3rd millennium B.C.</p>\n<p>Advancing in this direction, we propose to first use projections of English annotations onto Sumerian thus creating gold-standard SRL Sumerian data for the research community to use. We will then evaluate our system using existing architectures available for semantic role labeling with the projected SRL data. The final system also involves the production of word embeddings for Sumerian which can be documented and used for improving other downstream tasks like POS tagging, dependency parsing, etc. The developed SRL system will have many potential applications, viz. in the fields of document summarization, machine translation and also towards a better abstract semantic representation of the originally sparse textual data.</p>\n",
          "difficulty": null,
          "id": "proj_cuneiform-digital-li_2018_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/6336913732534272/",
          "proposal_id": null,
          "short_description": "Semantic role labeling (SRL) is a task in Natural Language Processing which helps in detecting the semantic arguments of the predicate/s of a...",
          "slug": "towards-building-the-first-semantic-role-labeling-system-for-sumerian",
          "status": "completed",
          "student_name": "Bakhtiyar Syed",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Towards building the first Semantic Role Labeling system for Sumerian"
        },
        {
          "code_url": "https://github.com/cdli-gh/database-schema/blob/master/README.md",
          "description": "<p>The Cuneiform Digital Library Initiative (CDLI) aims to collect, maintain and make available images, text, and metadata of all artifacts inscribed with the cuneiform script. Lots of temporal information can be gathered from cuneiform artifacts, from the dating of the object to specific dates at which events happened in the text. In concert with the ongoing rewrite of the CDLI codebase (“CDLI Framework update”), this project will result in the extension and improvement of the current data model for temporal information, by structuring the data in a new, richer model which will enable the full utilization of relationship among these data. The new structure will be exploited so artifacts can be searched and displayed based on this temporal information and in a granular manner.</p>\n",
          "difficulty": null,
          "id": "proj_cuneiform-digital-li_2018_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5158695151337472/",
          "proposal_id": null,
          "short_description": "The Cuneiform Digital Library Initiative (CDLI) aims to collect, maintain and make available images, text, and metadata of all artifacts inscribed...",
          "slug": "granular-temporal-data-management",
          "status": "completed",
          "student_name": "Sameer Sengar",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Granular Temporal Data Management"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2018/organizations/4794601982394368/"
    },
    "year_2019": {
      "num_projects": 5,
      "projects": [
        {
          "code_url": "https://github.com/cdli-gh/Framework/wiki/CDLI-Multi-Layer-Annotation-Query-Tool",
          "description": "<p>Currently, there is no tool available to integrate into a website that has the capacity to query through multiple layers of linguistic annotations like morphology, syntax and  semantics annotations. Also, the data has to be queried from RDF format which is flexible and will help integrate into a linked open data toolbox for computation. A tool named ANNIS already exists to query through multiple layers of annotations but it has some limitations which have to be overcome. Also, the tool must have a query language which must be easy to use for non-professionals. It must also highlight the results in the retrieved document which resulted in the retrieval of the document. The tool must also return data in a format that allows for easy integration into any website.</p>\n",
          "difficulty": "beginner",
          "id": "proj_cuneiform-digital-li_2019_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/6692203190026240/",
          "proposal_id": null,
          "short_description": "Currently, there is no tool available to integrate into a website that has the capacity to query through multiple layers of linguistic annotations...",
          "slug": "multiple-layer-annotations-querying",
          "status": "completed",
          "student_name": "Sagar Sagar",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "ui"
          ],
          "title": "Multiple Layer Annotations Querying"
        },
        {
          "code_url": "https://github.com/cdli-gh/Framework/wiki/CDLI-Search-Results-Visualizations",
          "description": "<p>CDLI has rich geographical and temporal data at its disposal. Currently, this information is not fully utilized. Although the data schema is being improved, there are significant challenges in exploiting the new relationships available.</p>\n<p>The proposed idea is to develop beautiful interactive visualizations of the search results using D3.js which will be displayed on the revamped website of  Cuneiform Digital Library Initiative(CDLI) i.e.,<a href=\"https://cdli.ucla.edu/\" target=\"_blank\">https://cdli.ucla.edu/</a>. Altogether, a total of 5 different types of visualization will be developed and the one closest to the search filters will be displayed inside the Visualize tab, along with a dropdown option to toggle between different visualizations. Further, the developed visualizations will be made taking care of accessibility for differently abled users and device screen sizes.</p>\n",
          "difficulty": null,
          "id": "proj_cuneiform-digital-li_2019_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5069701397348352/",
          "proposal_id": null,
          "short_description": "CDLI has rich geographical and temporal data at its disposal. Currently, this information is not fully utilized. Although the data schema is being...",
          "slug": "cdli-search-results-visualizations",
          "status": "completed",
          "student_name": "Amaan Iqbal",
          "student_profile": null,
          "tags": [
            "web",
            "ai"
          ],
          "title": "CDLI - Search Results Visualizations"
        },
        {
          "code_url": "https://github.com/rillian/2019-gsoc/blob/ed65a8e/README.md",
          "description": "<p>I am writing an export tool for the CDLI dataset so it can be used with the <a href=\"https://github.com/scaife-viewer/\" target=\"_blank\">Scaife</a> viewer. The tool will need to convert the native AFT markup used by CDLI to the Text Encoding Initiative (<a href=\"https://www.tei-c.org/release/doc/tei-p5-doc/en/html/\" target=\"_blank\">TEI</a>) XML schema used by <a href=\"https://scaife.perseus.org/\" target=\"_blank\">Perseus</a>, and generate corresponding Canonical Text Services annotations for each source.</p>\n<p>This will improve the accessibility of the CDLI corpus by making it available to the larger community of tools developed for TEI analysis and provide a newer, more powerful, option for accessing the CDLI corpus online.</p>\n",
          "difficulty": null,
          "id": "proj_cuneiform-digital-li_2019_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/6056318652121088/",
          "proposal_id": null,
          "short_description": "I am writing an export tool for the CDLI dataset so it can be used with the Scaife viewer. The tool will need to convert the native AFT markup used...",
          "slug": "tei-export-for-the-cdli-corpus",
          "status": "completed",
          "student_name": "rillian",
          "student_profile": null,
          "tags": [
            "ml",
            "ai"
          ],
          "title": "TEI Export for the CDLI Corpus"
        },
        {
          "code_url": "https://github.com/cdli-gh/Framework/wiki/Neural-Machine-Translation-for-Sumerian-and-English",
          "description": "<p>The project aims to build a machine translation model that can convert Sumerian (Language used around 2000 BC) to English Language using Neural Networks. The model should be bidirectional i.e It should convert Sumerian to English as well as English to Sumerian. Neural Machine Translation (NMT) is a new and highly active approach, which has shown promising results for machine translation task.\nI would like to use Basic Encoder-Decoder Architecture for Machine Translation Problem both encoder and Decoder will be implemented using RNNs (specifically LSTM and GRU units) where Input encoded sentence along with previously learned word embedding as vector will be given to encoder which generates a fixed length context vector, Decoder takes that vector and will generate target language translation.\nBut it performs poorly with longer sequences sentences, to overcome this problem we will improve it with attention-based encoder-decoder model.\nFor complete details please have a look at PDF attached or Google Doc draft.</p>\n",
          "difficulty": null,
          "id": "proj_cuneiform-digital-li_2019_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5914126327480320/",
          "proposal_id": null,
          "short_description": "The project aims to build a machine translation model that can convert Sumerian (Language used around 2000 BC) to English Language using Neural...",
          "slug": "neural-machine-translation-for-sumerian-and-english",
          "status": "completed",
          "student_name": "Ravneet Punia",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Neural Machine Translation for Sumerian and English"
        },
        {
          "code_url": "https://github.com/cdli-gh/Framework/wiki/OCR-for-Cuneiform-RGB-Images",
          "description": "<p>The current display system used at CDLI requires that a user reads a text to absorb visual and text information simultaneously, and to interpret the mapping between them, since image and transliteration are shown side by side (example: <a href=\"https://cdli.ucla.edu/P315663\" target=\"_blank\">https://cdli.ucla.edu/P315663</a>). Experts in cuneiform studies are usually able to discern this mapping only for their areas of expertise; non-experts and informal learners, on the other hand, have no direct means of affiliating image and annotation content.\nWith the advent of machine learning techniques, this text-image hyperlink concern can now be addressed. This would involve building models using state of the art computer vision techniques specifically trained over a large dataset with annotated ground truth to understand the underlying structure in the tablet images so as to optimally perform image segmentation, character detection and recognition.\nThe goal of the project involves developing machine learning models:</p>\n<ol>\n<li>That ingest cuneiform text and image to generate segments equivalent to the number of lines of transliteration. </li>\n<li>Detect and recognize cuneiform characters to generate transliterations directly from the image.</li>\n</ol>\n",
          "difficulty": null,
          "id": "proj_cuneiform-digital-li_2019_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5929730530869248/",
          "proposal_id": null,
          "short_description": "The current display system used at CDLI requires that a user reads a text to absorb visual and text information simultaneously, and to interpret the...",
          "slug": "computer-vision-challenge-for-the-cuneiform-script",
          "status": "completed",
          "student_name": "Vishal Thamizharasan",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Computer vision challenge for the cuneiform script"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2019/organizations/4653253634031616/"
    },
    "year_2020": {
      "num_projects": 9,
      "projects": [
        {
          "code_url": "https://cdli-gh.github.io/blog/gsoc20/bibliography/posts/15_eval3",
          "description": "<p>CDLI is moving away from its older flat database and for the occasion has designed a full model for bibliographic data management. This challenge concerns in the first place the conception of the management pages for this data, and in second the display of bibliographic data. In order to make CDLI’s bibliographic data more useful, it should be easily manageable by the admin, but also have a nice linked display and be exportable in BibTeX and other formats for the users.</p>\n",
          "difficulty": null,
          "id": "proj_cuneiform-digital-li_2020_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/6706871584423936/",
          "proposal_id": null,
          "short_description": "CDLI is moving away from its older flat database and for the occasion has designed a full model for bibliographic data management. This challenge...",
          "slug": "bibliography-management-and-display",
          "status": "completed",
          "student_name": "Ajit Jadhav",
          "student_profile": null,
          "tags": [
            "database"
          ],
          "title": "Bibliography management and display"
        },
        {
          "code_url": "https://cdli-gh.github.io/blog/gsoc20/img_pipeline/index",
          "description": "<p>This pipeline would extend the framework's capabilities to process images and convert RAW images to archival view and web view which can be further indexed to the website. The project would feature an image processing binary responsible for unattended image processing which would be indexed in the database. It extends to attaching a user-interface that enables the users to write descriptions of the tablets.</p>\n",
          "difficulty": null,
          "id": "proj_cuneiform-digital-li_2020_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5648529566990336/",
          "proposal_id": null,
          "short_description": "This pipeline would extend the framework's capabilities to process images and convert RAW images to archival view and web view which can be further...",
          "slug": "image-processing-pipeline-from-raw-to-archival",
          "status": "completed",
          "student_name": "AmanSingh",
          "student_profile": null,
          "tags": [
            "web",
            "database"
          ],
          "title": "Image Processing Pipeline : From RAW to Archival"
        },
        {
          "code_url": "https://cdli-gh.github.io/blog/gsoc20/translation_pipeline/index",
          "description": "<p>This project aims to build a full translation pipeline with the integration of NER (Named Entity Recognition) and POS (Part of Speech) tagging of Sumerian language and Post-processing of the translated English text to produce best and accurate results. The model should be built either using rule based or Neural based approach. The final pipeline including the Machine Translation System (Different Project) should be able to tag and translate the whole 1.5M Sumerian text perfectly.</p>\n",
          "difficulty": null,
          "id": "proj_cuneiform-digital-li_2020_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5672069980749824/",
          "proposal_id": null,
          "short_description": "This project aims to build a full translation pipeline with the integration of NER (Named Entity Recognition) and POS (Part of Speech) tagging of...",
          "slug": "translating-the-whole-ur-iii-corpus",
          "status": "completed",
          "student_name": "Himanshu Choudhary",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Translating the whole Ur III corpus"
        },
        {
          "code_url": "https://cdli-gh.github.io/blog/gsoc20/api/posts/results",
          "description": "<p>General points:</p>\n<ul>\n<li>linked-data metadata with formal schemas</li>\n<li>metadata API in three parts: base REST API, content negotiation and export links</li>\n<li>interfaces for managing, editing and exporting publications</li>\n</ul>\n",
          "difficulty": null,
          "id": "proj_cuneiform-digital-li_2020_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5453787629617152/",
          "proposal_id": null,
          "short_description": "General points:\n\nlinked-data metadata with formal schemas\nmetadata API in three parts: base REST API, content negotiation and export links\ninterfaces...",
          "slug": "metadata-api-and-management-and-display-of-bibliographies",
          "status": "completed",
          "student_name": "Lars Willighagen",
          "student_profile": null,
          "tags": [
            "api"
          ],
          "title": "Metadata API and Management and Display of Bibliographies"
        },
        {
          "code_url": "https://github.com/MrLogarithm/cdli-accounting-viz/wiki/GSoC-2020:-CDLI-Accounting-Corpus-Analysis-and-Visualizations",
          "description": "<p>This proposal outlines a suite of tools to assist researchers working with the numeric component of CDLI accounting corpora. This includes an extension to the CDLI search feature which will allow users to search for documents based on the quantity of items they record. Also included are visualizations of the numeric data, such as the distribution of values associated with different counted objects; the distribution of different number systems; and correlations between number systems and counted objects. These tools will present the information hosted by the CDLI in a more accessible format by converting transcribed cuneiform numerals into interactive graphics with arabic numerals. This will open the data to a wider audience by reducing the need for domain expertise to interpret the data. Experts will also benefit from seeing summary statistics about the corpora and graphs highlighting trends which may not be apparent from manual inspection of the texts.</p>\n",
          "difficulty": null,
          "id": "proj_cuneiform-digital-li_2020_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/4616852216479744/",
          "proposal_id": null,
          "short_description": "This proposal outlines a suite of tools to assist researchers working with the numeric component of CDLI accounting corpora. This includes an...",
          "slug": "visualization-pipeline-for-cdli-accounting-corpora",
          "status": "completed",
          "student_name": "Logan Born",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Visualization Pipeline for CDLI Accounting Corpora"
        },
        {
          "code_url": "https://github.com/anila-a/cdli-tablet-app/wiki/GSoC-2020:-Revamp-CDLI-tablet-apps-(Apple-and-Android)",
          "description": "<p>CDLI tablet app offers a curated collection of images, text, and metadata of artifacts inscribed with the cuneiform script. Artifacts from the ancient Near East, which document three millennia of human activity, are made available to the users through this mobile application.</p>\n<p>The idea of the Revamp CDLI tablet apps project is to recreate the existing CDLI tablet app using Flutter and provide a web admin interface for the mobile app data entry and management. Besides its existing components, the new mobile application will offer additional features for a highly-customized UX. CDLI tablet app will be accessible for both Android and iOS devices.</p>\n",
          "difficulty": null,
          "id": "proj_cuneiform-digital-li_2020_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/6564103281180672/",
          "proposal_id": null,
          "short_description": "CDLI tablet app offers a curated collection of images, text, and metadata of artifacts inscribed with the cuneiform script. Artifacts from the...",
          "slug": "revamp-cdli-tablet-apps-apple-and-android",
          "status": "completed",
          "student_name": "Anila Hoxha",
          "student_profile": null,
          "tags": [
            "android",
            "ios",
            "web",
            "mobile",
            "ai"
          ],
          "title": "Revamp CDLI tablet apps (Apple and Android)"
        },
        {
          "code_url": "https://cdli-gh.github.io/blog/gsoc20/design_integration/index",
          "description": "<p>The cuneiform digital library initiative has a vivid user base. Coming up with an outstanding first impression is an expectation that cannot be downplayed. This aspect should be captured in all fields and on a daily basis. \nA neat and pleasant UI is a must, web accessibility must be equally important for a platform to grow.\nA website accessible to everyone will not only mean we open the door to a wider range of users but will also go towards helping make the web accessible for everyone.</p>\n",
          "difficulty": null,
          "id": "proj_cuneiform-digital-li_2020_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/4945343327764480/",
          "proposal_id": null,
          "short_description": "The cuneiform digital library initiative has a vivid user base. Coming up with an outstanding first impression is an expectation that cannot be...",
          "slug": "design-integration-and-accessibility-audit",
          "status": "completed",
          "student_name": "Samarth Sharma",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "ui"
          ],
          "title": "Design Integration and Accessibility audit"
        },
        {
          "code_url": "https://github.com/Karna98/GSoC-2020-Report",
          "description": "<p>CDLI Framework integrates features of the project in a logical infrastructure, prepares new data displays, including machine-readable outputs, to enhance knowledge diffusion. It includes a unified interface for the project website, more powerful search capabilities, more internal links to navigate the catalogue, and intuitive displays for calendars, glossaries, bibliographies, etc.</p>\n<p>The Project focuses on :</p>\n<ol>\n<li>Building an authentication and authorization system for the framework. </li>\n<li>Integrating Elastic Search for Simple Search.</li>\n<li>Optimizing queries for Advance Search.</li>\n<li>Preparing search results (Expanded and Compact format) with data pre-processing.</li>\n</ol>\n",
          "difficulty": null,
          "id": "proj_cuneiform-digital-li_2020_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5840077927743488/",
          "proposal_id": null,
          "short_description": "CDLI Framework integrates features of the project in a logical infrastructure, prepares new data displays, including machine-readable outputs, to...",
          "slug": "improving-cdli-framework",
          "status": "completed",
          "student_name": "Vedant Wakalkar",
          "student_profile": null,
          "tags": [
            "web",
            "ui"
          ],
          "title": "Improving CDLI Framework"
        },
        {
          "code_url": "https://cdli-gh.github.io/blog/gsoc20/journals/index",
          "description": "<p>This project focuses on the publication of various types of journals that CDLI hosts, currently CDLI hosts four journals, two peer-reviewed journals (CDL Journal and CDL Bulletin), the CDL Pre-prints repository and the CDL Notes. For the upload of articles, appropriate designs and workflow need to be developed which includes the development of required routes, controllers, views &amp; tests. The major challenges to this project are the conversion of the editor's article inputs to CDLI's article publications which will be carried out by using latex and Maths libraries. Further on the project necessary end-to-end &amp;, unit testing phases should be established to improve the development workflow and avoid build issues.</p>\n",
          "difficulty": null,
          "id": "proj_cuneiform-digital-li_2020_009",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5922021642338304/",
          "proposal_id": null,
          "short_description": "This project focuses on the publication of various types of journals that CDLI hosts, currently CDLI hosts four journals, two peer-reviewed journals...",
          "slug": "journals-management-display",
          "status": "completed",
          "student_name": "Nisheal John",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "Journals Management & Display"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2020/organizations/5649030769541120/"
    },
    "year_2021": {
      "num_projects": 7,
      "projects": [
        {
          "code_url": "https://cdli-gh.github.io/blog/gsoc21/transliterationEditorAndApi/index",
          "description": "<p>JTF is a new JSON-based format for transliterations that aims to make cuneiform textual data easily accessible for processing and modifications. It comes with a NodeJS API, jtf-lib, to provide an ATF format parser and converter, a CRUD interface, and a module for sign list operations, jtf-signlist. A React web application, uqnu, is being developed to import transliterations from files, validate, edit, export, etc. The task is to integrate this infrastructure into CDLI's framework and allow crowdsourcing and individual work on texts.</p>\n",
          "difficulty": null,
          "id": "proj_cuneiform-digital-li_2021_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6669899463655424/",
          "proposal_id": null,
          "short_description": "JTF is a new JSON-based format for transliterations that aims to make cuneiform textual data easily accessible for processing and modifications. It...",
          "slug": "transliterations-editor-and-api",
          "status": "completed",
          "student_name": "Vishv Kakadiya",
          "student_profile": null,
          "tags": [
            "react",
            "web",
            "api",
            "ai"
          ],
          "title": "Transliterations editor and API"
        },
        {
          "code_url": "https://uchihasomil.github.io/Final-Report/#/",
          "description": "<p>The Project includes :</p>\n<ul>\n<li>Designing and Implementing the Admin dashboard.</li>\n<li>Merging Admin and public templates following the WCAG norms.</li>\n<li>Adding breadcrumbs to navigate back and forth.</li>\n<li>Removing “Related Actions” &amp; using Admin dashboard, Header menu for navigation to relevant entities, and bootstrap tags/badge at the bottom where it is necessary. </li>\n<li>Delete modal with entity’s name and denial for delete right if there are other linked entities. </li>\n<li>Implementing missing UI for nearly all Edit and Add pages via a proposed common unified design.</li>\n<li>About page.</li>\n</ul>\n<p>These improvements will allow administrators to publish and maintain the CDLI’s entities since options are presented hierarchically with keeping the administrators' workflows in mind. Also, the project aims to solve discrepancy problems by merging the templates and enhancing the UX.\nI have included some designs in my proposal for implementing the above tasks and will incorporate suggestions in design by its actual users at an early stage of GSoC. Once the Front end is done with the existing sass elements to unify UI with existing pages, then I will be checking for any Violations of WCAG using Axe Devtools and will reiterate the front end.</p>\n",
          "difficulty": null,
          "id": "proj_cuneiform-digital-li_2021_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5685888901709824/",
          "proposal_id": null,
          "short_description": "The Project includes :\n\nDesigning and Implementing the Admin dashboard.\nMerging Admin and public templates following the WCAG norms.\nAdding...",
          "slug": "design-challenge",
          "status": "completed",
          "student_name": "Somil Jain",
          "student_profile": null,
          "tags": [
            "ai",
            "ui",
            "ux"
          ],
          "title": "Design Challenge"
        },
        {
          "code_url": "https://github.com/yashrajdesai/GSoC-2021-Report#-google-summer-of-code-2021-",
          "description": "<p>The project mainly focuses on enhancing the search and advanced search features in the CDLI framework.\nThe objectives of the project are :</p>\n<ol>\n<li>Add the \"IDs\" and “Keywords”  search fields to both Simple &amp; Advanced Search.</li>\n<li>Implementing search for fuzzy queries in ID's field.</li>\n<li>Enable search inscription with sign value permutation.</li>\n<li>Highlight transliteration sign values in ATF display.</li>\n<li>On add or edit, save a sanitized version of an inscription as a list of sign names.</li>\n<li>Making search input flexible by allowing users to search using both UTF-8 and ASCII characters.</li>\n<li>Filter search result by RTI, Image, Transliterations, 3D data.</li>\n<li>Port request to ElasticSearch from cURL to HttpClient</li>\n<li>Port ElasticSearch to the CakePHP ElasticSearch plugin.</li>\n</ol>\n",
          "difficulty": "advanced",
          "id": "proj_cuneiform-digital-li_2021_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5421781967437824/",
          "proposal_id": null,
          "short_description": "The project mainly focuses on enhancing the search and advanced search features in the CDLI framework.\nThe objectives of the project are :\n\nAdd the...",
          "slug": "discovery-search-and-advanced-search-features",
          "status": "completed",
          "student_name": "Yashraj Desai",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Discovery Search and Advanced Search features"
        },
        {
          "code_url": "https://github.com/cdli-gh/blog/blob/gh-pages/_blog/gsoc21/designChallengeAradhanaKund/final-report.md",
          "description": "<p>This project aims to unify the complete styling of the website using minimal space and complexity. Also, it aims to improve the designing of certain parts of the website to improve the User Interface. \nThe project aims at delivering all the goals and deliverables as mentioned in the Project Idea List. It is made sure that the accessibility, design, and the interface is improved through the project. \nThis project will not only provide a better user experience but also help in simplifying the codebase of CDLI.\nFinally ,it will be made sure that the designs and improvisations are responsive to mobile, tablet and all kind of browsers.</p>\n",
          "difficulty": "advanced",
          "id": "proj_cuneiform-digital-li_2021_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6177060019503104/",
          "proposal_id": null,
          "short_description": "This project aims to unify the complete styling of the website using minimal space and complexity. Also, it aims to improve the designing of certain...",
          "slug": "design-challenge",
          "status": "completed",
          "student_name": "Aradhana Kund",
          "student_profile": null,
          "tags": [
            "web",
            "mobile",
            "ai"
          ],
          "title": "DESIGN CHALLENGE"
        },
        {
          "code_url": "https://github.com/apoorva1509/GSoC-2021/blob/main/README.md",
          "description": "<p>This project focuses on the CDLI journal workflow before we submit an article. Before the submission of journals it should be accessible for an open review process. To implement open journals in the system,  an appropriate workflow needs to be developed which is intended to be carried out using <a href=\"https://pkp.sfu.ca/ojs/ojs_download/\" target=\"_blank\">https://pkp.sfu.ca/ojs/ojs_download/</a> software. In addition to this, we intend to make further integration in the framework regarding endorsement of reviewers with published articles.</p>\n",
          "difficulty": null,
          "id": "proj_cuneiform-digital-li_2021_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/4801923697344512/",
          "proposal_id": null,
          "short_description": "This project focuses on the CDLI journal workflow before we submit an article. Before the submission of journals it should be accessible for an open...",
          "slug": "journals-open-review-workflow-and-integration",
          "status": "completed",
          "student_name": "Apoorva",
          "student_profile": null,
          "tags": [],
          "title": "Journals Open Review Workflow and Integration"
        },
        {
          "code_url": "https://cdli-gh.github.io/blog/gsoc21/3dViewerIntegration/index",
          "description": "<p>This project is to load 3D Models in PLY format from the CDLI database into the existing 3D Model Web Viewer using the Three.js library. The idea is to implement an RTI Viewer so that any CDLI tablet for which the PLY model is available has an easy-to-navigate option for the 3D viewer for that model.</p>\n",
          "difficulty": "beginner",
          "id": "proj_cuneiform-digital-li_2021_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/4811902416322560/",
          "proposal_id": null,
          "short_description": "This project is to load 3D Models in PLY format from the CDLI database into the existing 3D Model Web Viewer using the Three.js library. The idea is...",
          "slug": "3d-viewer-integration",
          "status": "completed",
          "student_name": "Mustafa Dhar",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "database"
          ],
          "title": "3D Viewer Integration"
        },
        {
          "code_url": "https://cdli-gh.github.io/blog/gsoc21/digitalLibraryManagement/index",
          "description": "<p>This project is about preparing a dashboard that can show an admin the visual assets of the digital library for each artifact but also add, edit, delete, images using our archival images serve as a source of better quality images to prepare their web counterpart. Access to images should also be managed there (some images are not public).</p>\n<ul>\n<li>Develop a dashboard and a series of workflows so admins can manage the digital library (dl)</li>\n<li>Populate the tables with information from the current dl</li>\n<li>Keep the system flexible so we can create an extension for crowdsourcing of images in the future</li>\n<li>Assist in setting up an automated grab of archival and raw images from the VM, to the archival server. These images will have been uploaded through the images manager or the minio interface.</li>\n<li>Set up a granular access to images at the image level (instead of at the artifact level)</li>\n</ul>\n",
          "difficulty": null,
          "id": "proj_cuneiform-digital-li_2021_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6269188376625152/",
          "proposal_id": null,
          "short_description": "This project is about preparing a dashboard that can show an admin the visual assets of the digital library for each artifact but also add, edit,...",
          "slug": "digital-library-management",
          "status": "completed",
          "student_name": "daksh",
          "student_profile": null,
          "tags": [
            "web"
          ],
          "title": "Digital Library Management"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2021/organizations/5679162177617920/"
    },
    "year_2022": {
      "num_projects": 7,
      "projects": [
        {
          "code_url": "https://github.com/Aditi-Singh16/GSoC-22-Report/blob/main/README.md",
          "description": "The seals portal aims at displaying all of the resources in the CDLI concerning a seal, aggregated in one place, with important features like viewing image annotations and graphical representation of seals chemistry.\nThe objectives of the project are:\nCreating the seals portal which lists different CDLI seals as groups i.e. physical, composite, sealings, and all cdli seals for a better user experience.\nIt shows a list of best-attested composite seals along with an image and description. \nIt presents a table containing seals and impressed tablets by period, here the users can view seals grouped by period (name and duration).\nThe seals' single view will display the seal image, a graphical way to present seals' chemical information; this graph can be viewed in a bar chart, pie chart, line chart and can be converted to tabular format.\nThe seals’ single view includes accordions to display physical information, inscription, identifiers, provenience, Composites, Inscriptions, and Chemical information.\nIt also displays Image annotations.\nThis project will also have a standalone converter tool for converting annotations from COCO format to w3c.json format. \nThere will be a bulk update interface to upload annotations to the database the user can upload the annotations in w3c.json or COCO format.",
          "difficulty": null,
          "id": "proj_cuneiform-digital-li_2022_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/caFqYFAc/",
          "proposal_id": null,
          "short_description": "The seals portal aims at displaying all of the resources in the CDLI concerning a seal, aggregated in one place, with important features like viewing...",
          "slug": "seals-portal",
          "status": "completed",
          "student_name": "Aditi Singh",
          "student_profile": null,
          "tags": [
            "ai",
            "database"
          ],
          "title": "Seals Portal"
        },
        {
          "code_url": "https://github.com/cdli-gh/apertium-sux-eng",
          "description": "The previously developed Machine Translation systems for Sumerian face sparsity issues because of their low-resource. The advanced translation techniques work better with the higher availability of data, whereas for low-resource languages, Rule Based/Symbolic Machine translation is a good alternative which can be used to improvise the accuracy. The objective is to build a sumerian-english machine translation system using one of the widely used machine translation platforms Apertium.",
          "difficulty": "advanced",
          "id": "proj_cuneiform-digital-li_2022_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/hTlBC1N6/",
          "proposal_id": null,
          "short_description": "The previously developed Machine Translation systems for Sumerian face sparsity issues because of their low-resource. The advanced translation...",
          "slug": "apertium-phrase-based-mt-system",
          "status": "completed",
          "student_name": "Himanshu Choudhary",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Apertium - Phrase-based MT system"
        },
        {
          "code_url": "https://github.com/ajinkya1702/GSOC-2022-Project-Report",
          "description": "This project mainly focuses on updating and improving the current search features. The search setup has been completed under past programs of GSOC and hence the documentation of it is needed which would also be covered under the scope of this project. I will be using Elasticsearch and PHP to add various features which would make the search more user-friendly",
          "difficulty": null,
          "id": "proj_cuneiform-digital-li_2022_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/Vvp3XmeB/",
          "proposal_id": null,
          "short_description": "This project mainly focuses on updating and improving the current search features. The search setup has been completed under past programs of GSOC...",
          "slug": "search-enhancements",
          "status": "completed",
          "student_name": "Ajinkya Morankar",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Search Enhancements"
        },
        {
          "code_url": "https://cdli-gh.github.io/blog/gsoc22/ImproveTheCredits/posts/15_eval2",
          "description": "The idea  aims at updating how digital assets’ (artifacts) license, ownership and credits are stored, while considering how they can be displayed in a more detailed way. \n\nThe implementation is necessary because in the past, Cuneiform Digital Library Initiative manges digital assets  by looking at existing files directly on the drive. Recently, the platfrom has improved by switching to managing digital assets in the database. Hence improving the system becomes necessary while making it more granular.\n\n\n                                                         Approach\n\nI will Design a Table schema for the new credit system data\n\nExtending the API in cakephp to accomodate new data for machines to access the data for the credit  system\n\nExtending the interface to display the information regarding the credits system where appropriate ( all the places where a digital asset can be displayed).\n\nI will Implement edition forms and bulk upload feature for Updating and deletion of credit data for digital assets.\n\n                                                                                    Deliverables: \n\nPerfect database schema for credit system implementation\n\nBasic Controller Logic for the idea written.\n\nExtended API For additional information regarding digital assets, based on search results and based on a single artifact\n\nExtended interface for credit system  information to be displayed for all digital assets\n\nAccurate Cite button and provision of good user experience for the credit system.\n\nGranular information for 3d models for credit system",
          "difficulty": null,
          "id": "proj_cuneiform-digital-li_2022_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/pBbCdRWu/",
          "proposal_id": null,
          "short_description": "The idea aims at updating how digital assets’ (artifacts) license, ownership and credits are stored, while considering how they can be displayed in a...",
          "slug": "improve-the-credits-ownership-and-licencing-of-digital-assets",
          "status": "completed",
          "student_name": "Chidiebere",
          "student_profile": null,
          "tags": [
            "api",
            "ai",
            "database"
          ],
          "title": "Improve the credits: ownership and licencing of digital assets"
        },
        {
          "code_url": "https://cdli-gh.github.io/blog/gsoc22/TowardsAGeneralPurposeEntityBibliographyLinkingSystem/index",
          "description": "Currently, the bibliography data on assyriology is only linked with ancient artifact entities, but it also contains information about other entities, such as important places, kingdoms, languages, etc. In order to facilitate better organization of the database, I have in mind 4 goals of expanding the reference system:\r\n\r\n1. Adapt the old reference system to the new one.\r\n\r\n2. Clean the current bibliography data, and identify the different types of entities that may be extracted.\r\n\r\n3. Generalize the entity reference system from bibliography: given a citation entry, the user should be able to navigate to the various types of entities using the links in the citation entry. This would conform to cakePHP conventions so that connections are bidirectional: in the entity page, the user should also be able to view which citation entries refer to this single entity.\r\n\r\n4. Enable single publication file submission in the current bibliography upload system.",
          "difficulty": null,
          "id": "proj_cuneiform-digital-li_2022_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/FM5IjD5N/",
          "proposal_id": null,
          "short_description": "Currently, the bibliography data on assyriology is only linked with ancient artifact entities, but it also contains information about other entities,...",
          "slug": "towards-a-general-purpose-entity-bibliography-linking-system",
          "status": "completed",
          "student_name": "Circle Chen",
          "student_profile": null,
          "tags": [
            "ai",
            "database"
          ],
          "title": "Towards a General-Purpose Entity-Bibliography Linking System"
        },
        {
          "code_url": "https://cdli-gh.github.io/blog/gsoc22/NewFeaturesAndUsabilityEnhancement/posts/17_eval2",
          "description": "This project aims at adding new features to the CDLI framework and enhancing the usability of some of the pre-existing features. \nThe objectives of this project are : \nPresenting retired artifacts in a tabular format and redirecting users to the new entry when they link to a retired artifact. \nA new feature like the download button for the publications page will help users download it with all bib type options like bib, ris, formatted etcetera.\nAdding a feature to bulk update artifacts (multiple edit form) based on any of the properties of artifacts will be a huge time saver.\n Lastly, displaying a dropdown to export entity indexes in various formats like csv, ttf, json, json-rdf on all entity pages.",
          "difficulty": null,
          "id": "proj_cuneiform-digital-li_2022_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/pDQYTu4a/",
          "proposal_id": null,
          "short_description": "This project aims at adding new features to the CDLI framework and enhancing the usability of some of the pre-existing features. The objectives of...",
          "slug": "new-features-and-usability-enhancement",
          "status": "completed",
          "student_name": "Shivoham Angal",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "New Features and Usability Enhancement"
        },
        {
          "code_url": "https://cdli-gh.github.io/blog/gsoc22/DesignChallenge1",
          "description": "The project aims on creating a generic view with a user-centric interface using minimal space and complexity. The project aims to :\nImprove the designing of certain parts of the website(such as Forms, Search Page UI, Artifacts Page) to improve the User Interface and accessibility\nAdd new features  like - Citation, Raw image scan, Resources dropdown\nMake the whole website more responsive and maximize the use of Bootstrap.\nDesigning and Implementing Common Templates for Index and Single Entity Pages\nThe project also aims to implement all the goals and ideas in the Project Idea List.",
          "difficulty": "advanced",
          "id": "proj_cuneiform-digital-li_2022_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/AAi9cvHh/",
          "proposal_id": null,
          "short_description": "The project aims on creating a generic view with a user-centric interface using minimal space and complexity. The project aims to : Improve the...",
          "slug": "design-challenge-i",
          "status": "completed",
          "student_name": "UtkarshTiwari",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "ui"
          ],
          "title": "Design Challenge I"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2022/organizations/cuneiform-digital-library-initiative-cdli/"
    },
    "year_2023": null,
    "year_2024": null,
    "year_2025": null
  },
  "first_time": false,
  "contact": {
    "email": "cdli+gsoc@ucla.edu",
    "guide_url": null,
    "ideas_url": null,
    "irc_channel": "https://gitlab.com/cdli/framework/-/wikis/Join-the-Community-and-GSoC-Contact",
    "mailing_list": "https://docs.google.com/forms/d/1neaY7d-IGX0Hu_x5kgJpehLnlRp0yx5PqlIMoDIYKJE"
  },
  "social": {
    "blog": "https://cdli-gh.github.io/blog/index",
    "discord": null,
    "facebook": null,
    "github": null,
    "gitlab": null,
    "instagram": null,
    "linkedin": null,
    "mastodon": null,
    "medium": null,
    "reddit": null,
    "slack": null,
    "stackoverflow": null,
    "twitch": null,
    "twitter": "https://twitter.com/cdli_news",
    "youtube": null
  },
  "meta": {
    "version": 1,
    "generated_at": "2026-01-25T15:28:53.035Z"
  }
}