{
  "id": "692251d153dd9d7326d33d91",
  "slug": "department-of-biomedical-informatics-emory-university",
  "name": "Department of Biomedical Informatics, Emory University",
  "category": "Security",
  "description": "Biomedical research to advance healthcare",
  "image_url": "https://summerofcode.withgoogle.com/media/org/department-of-biomedical-informatics-emory-university/l9jrm7pdhwnkxh3b-360.png",
  "img_r2_url": "https://pub-268c3a1efc8b4f8a99115507a760ca14.r2.dev/department-of-biomedical-informatics-emory-university.webp",
  "logo_r2_url": null,
  "url": "https://med.emory.edu/departments/biomedical-informatics/",
  "active_years": [
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "first_year": 2021,
  "last_year": 2025,
  "is_currently_active": true,
  "technologies": [
    "python",
    "java",
    "tensorflow",
    "medical imaging",
    "deeplearning",
    "javascript",
    "workflows",
    "dicom",
    "bash",
    "Colab"
  ],
  "topics": [
    "cloud",
    "distributed systems",
    "science and medicine",
    "data integration",
    "workflows",
    "radiology",
    "distributed system",
    "data security",
    "ML/AL"
  ],
  "total_projects": 27,
  "stats": {
    "avg_projects_per_appeared_year": 5.4,
    "projects_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": null,
      "year_2019": null,
      "year_2020": null,
      "year_2021": 6,
      "year_2022": 8,
      "year_2023": 5,
      "year_2024": 5,
      "year_2025": 3
    },
    "students_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": null,
      "year_2019": null,
      "year_2020": null,
      "year_2021": 6,
      "year_2022": 8,
      "year_2023": 5,
      "year_2024": 5,
      "year_2025": 3
    },
    "total_students": 27
  },
  "years": {
    "year_2016": null,
    "year_2017": null,
    "year_2018": null,
    "year_2019": null,
    "year_2020": null,
    "year_2021": {
      "num_projects": 6,
      "projects": [
        {
          "code_url": "https://github.com/monjoybme/CovCT_application",
          "description": "<p>Development of an AI-based Android Application for distinguishing COVID-19 and Pneumonia using Computed Tomography Images.The project aims at development of an Android application capable of efficiently generating a report based on AI capabilities of the well trained neural network, using the Computed Tomography (CT) Images of patients as a part of the project. The report will show the AI predicted results for distinguishing covid-19 and non-Covid-19 disease using the CT Images. These results will also contain saliency maps and segmented regions to better outline and detect the affected regions from CT Images.\nThe application would be equipped with computer vision algorithms such as contrast stretching, adaptive and global thresholding, Image enhancement and many state of the art methods to carefully present every detail from the CT image. The backend of the application would be optimal for performance of trained Deep Learning Models and computer Vision Algorithms.</p>\n",
          "difficulty": null,
          "id": "proj_department-of-biomed_2021_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6468381577838592/",
          "proposal_id": null,
          "short_description": "Development of an AI-based Android Application for distinguishing COVID-19 and Pneumonia using Computed Tomography Images.The project aims at...",
          "slug": "covct-development-of-an-ai-based-android-application-for-distinguishing-covid-19-and-pneumonia-using-computed-tomography-images-and-generate-reports-for-analysis",
          "status": "completed",
          "student_name": "Aryan Verma",
          "student_profile": null,
          "tags": [
            "android",
            "ai",
            "ui",
            "backend"
          ],
          "title": "CovCT: Development of an AI-based Android Application for distinguishing COVID-19 and Pneumonia using Computed Tomography Images and generate reports for analysis"
        },
        {
          "code_url": "https://github.com/NISYSLAB/DHGWorkflow",
          "description": "<p>LoopSim framework aims to facilitate workflows with loops i.e workflows without specific start and end services. LoopSim requires an interface to create these types of workflows using some kind of graph.<br>\nIt currently relies on a Closed Source software yEd - Graph Editor for workflow creation. The objective of this project is to remove this dependency on a closed source software and build an open-source solution tailored for LoopSim requirements.</p>\n<p>We also need to integrate this project with the existing parser so as to automate the flow from running the script and building the workflow to parsing it. The proposed solution will make it easier to web host the LoopSim project.</p>\n",
          "difficulty": null,
          "id": "proj_department-of-biomed_2021_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5691749820792832/",
          "proposal_id": null,
          "short_description": "LoopSim framework aims to facilitate workflows with loops i.e workflows without specific start and end services. LoopSim requires an interface to...",
          "slug": "a-frontend-for-loopsim-framework-to-model-workflows-with-closed-loops",
          "status": "completed",
          "student_name": "Shubham Awasthi",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "ui",
            "frontend"
          ],
          "title": "A Frontend For Loopsim Framework To Model Workflows With Closed Loops"
        },
        {
          "code_url": "https://github.com/Emory-HITI/Niffler/tree/dev/modules/frontend",
          "description": "<p>This project aims to develop a potential frontend for Niffler. Niffler is currently a command-line tool where the user has to download it in their system and run python commands to retrieve the DICOM images.\nThe main aim of Niffler is to retrieve DICOM images from multiple PACS and store them as png images or metadata files. This can be done currently via the command line. Enhancing this with a frontend and making this a web application would be beneficial and easy to use by a large number of non-technical users and clients.</p>\n",
          "difficulty": "beginner",
          "id": "proj_department-of-biomed_2021_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5467348785430528/",
          "proposal_id": null,
          "short_description": "This project aims to develop a potential frontend for Niffler. Niffler is currently a command-line tool where the user has to download it in their...",
          "slug": "a-frontend-for-niffler-dicom-framework-for-machine-learning-pipelines-and-processing-workflows",
          "status": "completed",
          "student_name": "Nishchal Singi",
          "student_profile": null,
          "tags": [
            "python",
            "web",
            "ai",
            "frontend"
          ],
          "title": "A frontend for Niffler DICOM framework for machine learning pipelines and processing workflows"
        },
        {
          "code_url": "https://github.com/NISYSLAB/VisualRLComposer/",
          "description": "<p>The project is aiming to develop a GUI for the simulations of reinforcement learning so that users, particularly, the researchers can be able to test and implement their ideas and algorithms about reinforcement learning with the embedded environments easily even though they are not able to implement the codes in a fast way. The GUI will involve an interface that is encompassing graphical blocks which should be clickable by the user. Users will be able to create an execution flow by selecting the graphical blocks which are referring to the selection of the environment (e.g. CartPole-v1, Acrobot-v1, etc.) and the algorithms. Furthermore, the relevant information such as Q-values, reward functions will be shown on the GUI at any time during training and testing.</p>\n",
          "difficulty": null,
          "id": "proj_department-of-biomed_2021_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5508858906148864/",
          "proposal_id": null,
          "short_description": "The project is aiming to develop a GUI for the simulations of reinforcement learning so that users, particularly, the researchers can be able to test...",
          "slug": "graphical-user-interface-for-openai-gym",
          "status": "completed",
          "student_name": "Özgür Kara",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Graphical User Interface for OpenAI Gym"
        },
        {
          "code_url": "https://github.com/monjoybme/Neural-Studio",
          "description": "<p>Tensorflow GUI will help everyone from beginners to professionals in their day to day work. People who are new to the field of deep learning can use this to build , train and test neural networks without requiring in depth programming knowledge or tensorflow framework. Professionals can use it to create boilerplate code , train and test their models.</p>\n",
          "difficulty": "beginner",
          "id": "proj_department-of-biomed_2021_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5871367701921792/",
          "proposal_id": null,
          "short_description": "Tensorflow GUI will help everyone from beginners to professionals in their day to day work. People who are new to the field of deep learning can use...",
          "slug": "tensorflow-gui",
          "status": "completed",
          "student_name": "Viraj Patel",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Tensorflow GUI"
        },
        {
          "code_url": "https://gist.github.com/chinvib66/3c0590b32da92158e2470b7541d4ae12",
          "description": "<p>This Project aims to develop unit and integration tests for the Niffler modules and implement automated testing using Continuous Integration. The Testing framework will include both manual testing as well as automated testing to reduce overall manual effort in testing. The project will introduce checks to confirm that the commits to the codebase do not break the functionality of Niffler, before each major production release. These tests will significantly reduce the potential for bugs in the codebase, allowing the deployment of newer versions seamlessly.</p>\n",
          "difficulty": null,
          "id": "proj_department-of-biomed_2021_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5955674151845888/",
          "proposal_id": null,
          "short_description": "This Project aims to develop unit and integration tests for the Niffler modules and implement automated testing using Continuous Integration. The...",
          "slug": "a-testing-framework-for-niffler-dicom-frameworks-for-continuous-integration",
          "status": "completed",
          "student_name": "Chinmay Vibhute",
          "student_profile": null,
          "tags": [
            "ml",
            "ai"
          ],
          "title": "A Testing Framework for Niffler DICOM frameworks for Continuous Integration"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2021/organizations/6515383720214528/"
    },
    "year_2022": {
      "num_projects": 8,
      "projects": [
        {
          "code_url": "https://github.com/ControlCore-Project/concore/tree/dev/fri",
          "description": "This program incorporates server-based deployment workflow files to the server in a secure manner. It allows composing the workflows, aware of the existing programs in the server. it also allows the upload of the user programs, so that workflows can be composed with those, in addition to existing programs in the server.",
          "difficulty": null,
          "id": "proj_department-of-biomed_2022_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/fKRyHw43/",
          "proposal_id": null,
          "short_description": "This program incorporates server-based deployment workflow files to the server in a secure manner. It allows composing the workflows, aware of the...",
          "slug": "a-server-environment-for-the-concore-framework",
          "status": "completed",
          "student_name": "amit_62",
          "student_profile": null,
          "tags": [],
          "title": "A server environment for the concore framework"
        },
        {
          "code_url": "https://github.com/Emory-HITI/Niffler/tree/dev/modules/suvpar",
          "description": "Niffler enables computing scanner utilization using real-time DICOM metadata extraction. Niffler acquires images from the PACS in real-time (meta-extraction) and on-demand (cold-extraction), then extracts DICOM metadata into a Mongo database or a CSV file, and performs computations on the metadata to compute utilization metrics for the scanners. This project performs the computations for the MR scanners, although it can be used for any modality. However, these computations were largely limited to the study level - how frequently a scanner idled between studies and how long it took for a scanner to perform a given study. Computing those metrics in a finger granularity, at the series level, is more challenging since the start time and end time of a series is harder to find with just public DICOM headers.\nFurthermore, while this project has a scanner utilization computed in the backend, there is no integrated front-end to present the results elegantly. The created results are currently stored in CSV files and displayed through an Eaglescope dashboard. The front-end can be improved with better integration.",
          "difficulty": null,
          "id": "proj_department-of-biomed_2022_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/gnSbFf5t/",
          "proposal_id": null,
          "short_description": "Niffler enables computing scanner utilization using real-time DICOM metadata extraction. Niffler acquires images from the PACS in real-time...",
          "slug": "better-representations-of-scanner-utilization-from-dicom-metadata",
          "status": "completed",
          "student_name": "Nitesh Kumar Kushwaha",
          "student_profile": null,
          "tags": [
            "database",
            "ui",
            "backend"
          ],
          "title": "Better representations of scanner utilization from DICOM metadata"
        },
        {
          "code_url": "https://github.com/Emory-HITI/MRIQC",
          "description": "The aim of this project is to automatically detect the key features of MRI phantom images and use those features to determine the state of the clinical MRI equipment being used at the site . \nThe challenge here is to develop a model that is robust and gives accurate results even in low contrast and noisy images. \nThe model should first be able to localize  the specific regions of interest in the series of images and then extract specific features which would be used determine the state of MRI equipment being used. \nThe next  part would be use relevant pre-processing , that should reduce the noise and enhance the specific features of the image .\nThe final part would be use a segmentation algorithm that accurately extracts the key features of the image and which can then be used to determine the state of MRI equipment being used.",
          "difficulty": null,
          "id": "proj_department-of-biomed_2022_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/kXYuzMVs/",
          "proposal_id": null,
          "short_description": "The aim of this project is to automatically detect the key features of MRI phantom images and use those features to determine the state of the...",
          "slug": "mriqc-automated-analysis-of-weekly-mri-quality-control-images-for-acr-accreditation",
          "status": "completed",
          "student_name": "Praroop Chanda",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "MRIQC- Automated analysis of weekly MRI Quality Control Images for ACR Accreditation"
        },
        {
          "code_url": "https://gist.github.com/Aviral09/217727240b71e55a31c910df2fa3ce29",
          "description": "Concore is a framework for closed-Loop peripheral neuromodulation control systems. The CONTROL-CORE protocol, known as concore, allows modular simulation of controller and PM nodes to run on different operating systems, computing platforms, and programming languages. \nDHGWorkflow is a browser-based directed hypergraph editor. Concore uses DHGWorkflow as a front-end workflow editor. DHGWorkflow was developed as a stand-alone lightweight graph editor.\nThis project aims to integrate the concore framework in the DHGWorkflow in a user friendly way so that uses can define custom validations as well as import, visualize and manipulate concore workflows with ease.",
          "difficulty": null,
          "id": "proj_department-of-biomed_2022_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/6p475fQ1/",
          "proposal_id": null,
          "short_description": "Concore is a framework for closed-Loop peripheral neuromodulation control systems. The CONTROL-CORE protocol, known as concore, allows modular...",
          "slug": "adopt-dhgworkflow-for-concore-with-a-seamless-integration",
          "status": "completed",
          "student_name": "Aviral Kumar Goel",
          "student_profile": null,
          "tags": [
            "ml",
            "ai"
          ],
          "title": "Adopt DHGWorkflow for concore with a seamless integration"
        },
        {
          "code_url": "https://github.com/NISYSLAB/numpy-analyzer",
          "description": "The project is an open-source Python package for loading, analysis, and visualization of electrophysiological data. The package will enable users to perform various types of analysis and visualization of data in an easy way with a couple of lines. This will free users to focus on the results and interpretation of the analysis and visualizations instead of worrying about the implementation details.",
          "difficulty": "beginner",
          "id": "proj_department-of-biomed_2022_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/Gxre8QcM/",
          "proposal_id": null,
          "short_description": "The project is an open-source Python package for loading, analysis, and visualization of electrophysiological data. The package will enable users to...",
          "slug": "a-python-based-tool-for-viewing-and-basic-analysis-of-files-with-numpy-format",
          "status": "completed",
          "student_name": "Nada Ahmed Elmasry",
          "student_profile": null,
          "tags": [
            "python",
            "ai"
          ],
          "title": "A Python based tool for viewing and basic analysis of files with NumPy format"
        },
        {
          "code_url": "https://gist.github.com/yahia3200/b18be28c20daa346ac19956f34e4d825",
          "description": "Eaglescaope is a framework for creating interactive visualizations and selection dashboards without coding. This project aims to expand upon the current visualizations supported by the framework and to add new features that facilitate creating and sharing data dashboards. The proposed contributions can be grouped into   \n\nSupporting new multidimensional interactive visualizations: these new visualizations should help the user explore the relation between two or more variables and get more insights by interacting and filtering graphs. \n\nRefactoring and documentation: continue the refactoring process by separating filtering logic, adding data and filters to a global state, and adding documentation for the users on using the framework and its general architecture. \n\nAdding new features to the framework: that make the process of creating and sharing dashboards more accessible and more effortless.",
          "difficulty": null,
          "id": "proj_department-of-biomed_2022_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/gdeHCIGo/",
          "proposal_id": null,
          "short_description": "Eaglescaope is a framework for creating interactive visualizations and selection dashboards without coding. This project aims to expand upon the...",
          "slug": "interactive-multidimensional-visualizations-for-eaglescope",
          "status": "completed",
          "student_name": "Yahia Zakaria",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Interactive Multidimensional Visualizations for Eaglescope"
        },
        {
          "code_url": "https://github.com/Emory-HITI/Niffler/tree/dev/modules/workflows/Nextflow_workflows",
          "description": "Niffler provides various modules to handle different DICOM related tasks. Some of the modules are to be executed sequentially by the user to get the desired output. This project aims to reduce human intervention by building flexible and scalable pipelines using Nextflow. Nextflow is a domain-specific language for workflow orchestration. It enables scalable and reproducible workflows using software containers. Nextflow allows us to add new modules without having to hard-code the pipeline.",
          "difficulty": null,
          "id": "proj_department-of-biomed_2022_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/E7S50Qd9/",
          "proposal_id": null,
          "short_description": "Niffler provides various modules to handle different DICOM related tasks. Some of the modules are to be executed sequentially by the user to get the...",
          "slug": "workflow-module-for-niffler-framework",
          "status": "completed",
          "student_name": "Pavan_Bellam",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Workflow module for Niffler framework"
        },
        {
          "code_url": "https://gist.github.com/mehulsinha73/620974c0cb82daa0857028c2b18228ad",
          "description": "This proposal aims to extend VisualRLComposer, a GUI for OpenAI Gym. \n\nThe project will be extended by adding: multi environment experimentation which will allow users to run multiple environments in parallel; Implementation of CNN’s and ANN’s for  relevant reinforcement learning algorithms which users can design via a visual medium; and Integrating the GUI with Neuroweavers (translatable intelligent closed-loop neuromodulation systems) will cover a niche of reinforcement learning that few, if none, can provide.",
          "difficulty": "medium",
          "id": "proj_department-of-biomed_2022_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/TiVdtMeB/",
          "proposal_id": null,
          "short_description": "This proposal aims to extend VisualRLComposer, a GUI for OpenAI Gym. The project will be extended by adding: multi environment experimentation which...",
          "slug": "extending-the-graphical-user-interface-for-openai-gym",
          "status": "completed",
          "student_name": "Mehul Sinha",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Extending the Graphical User Interface for OpenAI Gym"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2022/organizations/department-of-biomedical-informatics-emory-university/"
    },
    "year_2023": {
      "num_projects": 5,
      "projects": [
        {
          "code_url": "https://github.com/sharmalab/escMR",
          "description": "DICOM is the global standard for managing and exchanging medical images and data but lacks a consistent series-naming scheme.\nI will use machine learning for the identification and classification task, and the detailed approach is mentioned in the proposal document.\nI will add a new module to run on DICOM images of the MRI modality. This module will execute on DICOM images acquired in real-time or on-demand by Niffler. It will identify and categorize the MRI series (orientation, weighting) into different brain sequences, which will help identify repeated or missing series in an MRI study. Additionally, it will check whether the sequence parameters meet standard thresholds. Lastly, a confidence score will be given.",
          "difficulty": null,
          "id": "proj_department-of-biomed_2023_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/oC59dZpT",
          "proposal_id": "YispPD6d",
          "short_description": "DICOM is the global standard for managing and exchanging medical images and data but lacks a consistent series-naming scheme. I will use machine...",
          "slug": "a-methodology-to-categorize-exam-series",
          "status": "completed",
          "student_name": "Himanshu Kumar1",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "A Methodology To Categorize Exam Series"
        },
        {
          "code_url": "https://github.com/wizofe/gsoc23-emory",
          "description": "The aim is to develop a desktop application (GUI) that allows users to run their Deep Learning experiments that is integrated with PyTorch library via drag&drop environment. The users should be able to construct a pipeline visually, without dealing with the code, and apply the selected/designed deep learning models to the data easily.",
          "difficulty": null,
          "id": "proj_department-of-biomed_2023_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/AWlAnAvo",
          "proposal_id": "R5G2qqq2",
          "short_description": "The aim is to develop a desktop application (GUI) that allows users to run their Deep Learning experiments that is integrated with PyTorch library...",
          "slug": "develop-a-drag-and-drop-gui-for-deep-learning-experimentation",
          "status": "completed",
          "student_name": "Ioannis Valasakis",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Develop a drag-and-drop GUI for deep learning experimentation"
        },
        {
          "code_url": "https://github.com/parteekcoder/concore/wiki",
          "description": "Concore is a lightweight framework for closed-loop peripheral neuromodulation control systems. Control-editor is a React-based frontend environment for concore. It allows users to create studies as graphml files and program files. \nThis project will allow the users to upload their examples to the concore repository automatically without using GitHub.These examples will help new or existing users to generate and understand studies quickly.",
          "difficulty": null,
          "id": "proj_department-of-biomed_2023_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/vZSLKQsL",
          "proposal_id": "WGvKAGmZ",
          "short_description": "Concore is a lightweight framework for closed-loop peripheral neuromodulation control systems. Control-editor is a React-based frontend environment...",
          "slug": "developing-contribute-action",
          "status": "completed",
          "student_name": "Parteek Goyal",
          "student_profile": null,
          "tags": [
            "react",
            "ml",
            "ui",
            "frontend"
          ],
          "title": "Developing Contribute Action"
        },
        {
          "code_url": "https://github.com/Rahuljagwani/concore-editor/wiki/GSoC-2023-Department-of-Biomedical-Informatics,-Emory-University:-An-Integrated-CONTROL%E2%80%90CORE-Experience",
          "description": "At present, all the Concore methods such as build, debug, run etc. are executed from\nCLI by user and Concore-editor does not serve the functionality of performing these\nmethods directly from frontend. Therefore, to achieve the following this project aims to integrate Concore-editor with Concore so that on studies developed in Concore-editor, the specific Concore functions can be performed straight away.\nThis project implements the above using the approach of making custom API calls from Concore-Editor to Concore Backend with custom arguments which are essential for Concore Backend to function. Making necessary checks to execute API calls in order is another aspect of the approach taken.",
          "difficulty": null,
          "id": "proj_department-of-biomed_2023_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/cRrCc5M4",
          "proposal_id": "Nwx0PnzK",
          "short_description": "At present, all the Concore methods such as build, debug, run etc. are executed from CLI by user and Concore-editor does not serve the functionality...",
          "slug": "an-integrated-control-core-experience",
          "status": "completed",
          "student_name": "Rahul Jagwani",
          "student_profile": null,
          "tags": [
            "api",
            "ai",
            "ui",
            "frontend",
            "backend"
          ],
          "title": "An Integrated CONTROL-CORE experience"
        },
        {
          "code_url": "https://shivangvijay.github.io/GSoC/index.html",
          "description": "To achieve real-time execution in Concore, one approach is to optimize the existing codebase. However, implementing the system with straightforward C++ implementations may offer even better results in terms of efficiency and speed, due to the language's closer proximity to hardware. As Concore involves multiple processes, an IPC mechanism should be developed to replace the current file-sharing communication method, in order to enable efficient data transfer. Finally, it's necessary to ensure that Concore with optimized C++ programs can run on an affordable hardware device that supports real-time computation.",
          "difficulty": null,
          "id": "proj_department-of-biomed_2023_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/ZrOpJIc7",
          "proposal_id": "XOrhQuuk",
          "short_description": "To achieve real-time execution in Concore, one approach is to optimize the existing codebase. However, implementing the system with straightforward...",
          "slug": "a-real-time-computing-support-for-concore",
          "status": "completed",
          "student_name": "Shivang Vijay",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "A real-time computing support for concore."
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2023/organizations/department-of-biomedical-informatics-emory-university"
    },
    "year_2024": {
      "num_projects": 5,
      "projects": [
        {
          "code_url": "https://drive.google.com/file/d/1I43CDyhHcYV3pA17fjwOc-gwuG9UfSXl/view?usp=sharing",
          "description": "Not only can clustering in itself be  a useful task to solve, features learnt from deep clustering algorithms can also be used in downstream tasks such as sleep stage classification. Using an open dataset such as the Temple University Hospital EEG corpus, I plan to develop a method for Deep Clustering of EEG data based on autoencoders. Having previously worked with this dataset, I am familiar with it's processing and using the processed data for Transformer pretraining. In addition to this, I am also familiar with general signal processing as I am an Electrical Engineering Masters student.\nAt the end of the program I would hope to have developed an opensource method which can be published and which can be finetuned for other downstream tasks.",
          "difficulty": null,
          "id": "proj_department-of-biomed_2024_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/HiwOQ34D/",
          "proposal_id": null,
          "short_description": "Not only can clustering in itself be a useful task to solve, features learnt from deep clustering algorithms can also be used in downstream tasks...",
          "slug": "a-framework-for-unsupervised-deep-clustering",
          "status": "completed",
          "student_name": "timisanjo",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "A Framework for Unsupervised Deep Clustering"
        },
        {
          "code_url": "https://drive.google.com/drive/folders/18KPx7bOTWP2I6EzGHXeyJzl2j8gE7vwG?usp=sharing",
          "description": "This proposal highlights some key points and expected results of the project. The project proposes developing an open-source Graphical User Interface (GUI) that integrates with various foundational models for image segmentation tasks. A key strength lies in its ability to leverage multiple models, empowering users to tackle diverse image segmentation challenges. I propose completing this project in three phases: First, we will determine the range of image segmentation domains covered by our application. Then, we will select frameworks to design the GUI's frontend and backend sides. Lastly, We will test the GUI for user-friendliness and prepare it for open-source release, along with the complete documentation",
          "difficulty": null,
          "id": "proj_department-of-biomed_2024_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/c5wxwLza/",
          "proposal_id": null,
          "short_description": "This proposal highlights some key points and expected results of the project. The project proposes developing an open-source Graphical User Interface...",
          "slug": "a-gui-of-foundational-model-toolbox-for-image-segmentation",
          "status": "completed",
          "student_name": "Sarper",
          "student_profile": null,
          "tags": [
            "ai",
            "ui",
            "frontend",
            "backend"
          ],
          "title": "A GUI of Foundational Model Toolbox for Image Segmentation"
        },
        {
          "code_url": "https://github.com/Zhreyu/EEG-Foundational-Model",
          "description": "The project's core objective is to develop an open-source foundational model for EEG data analysis, using deep learning techniques and extensive pre-training on a broad spectrum of EEG datasets. This foundational model will enable more effective processing, feature extraction, and interpretation of EEG signals, catering to both large-scale datasets and specific, smaller datasets.",
          "difficulty": null,
          "id": "proj_department-of-biomed_2024_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/RcMyRlLr/",
          "proposal_id": null,
          "short_description": "The project's core objective is to develop an open-source foundational model for EEG data analysis, using deep learning techniques and extensive...",
          "slug": "development-of-an-open-source-eeg-foundation-model",
          "status": "completed",
          "student_name": "Shreyas S",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Development of an Open-Source EEG Foundation Model"
        },
        {
          "code_url": "https://github.com/metesaka/NeuroweaverGUI",
          "description": "Time series data has wide application across numerous sectors including healthcare, finance, and environmental studies, offering profound insights into historical trends and future predictions. Time series data requires advanced analytical methodologies for effective feature extraction and application of machine learning techniques, bearing significant challenges, particularly for individuals lacking specialized expertise. Recognizing these challenges, this project proposes the development of a sophisticated, user-friendly Graphical User Interface (GUI) application designed to provide easy access to complex time series analysis. By simplifying the methodologies through an intuitive interface, the solution aims to empower users ranging from novices to experts, facilitating deeper engagement with time series data. Through this user-centric application, the project aims to extend the benefits of big data and machine learning technologies, enhancing research and operational efficiencies across various fields.",
          "difficulty": "beginner",
          "id": "proj_department-of-biomed_2024_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/C9kbqHtb/",
          "proposal_id": null,
          "short_description": "Time series data has wide application across numerous sectors including healthcare, finance, and environmental studies, offering profound insights...",
          "slug": "development-of-a-graphical-user-interface-for-time-series-toolbox-using-deep-learning",
          "status": "completed",
          "student_name": "Mete",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Development of a Graphical User Interface for Time Series Toolbox Using Deep Learning"
        },
        {
          "code_url": "https://docs.google.com/document/d/1cfVFNZGfsSP7vj3g7TFCL9i90seujQ9SBnbujxDh4-U/edit?usp=sharing",
          "description": "This project aims to enhance the Open Source Electrophysiological Toolbox (OSET) by expanding its Python capabilities. The goal is to create a comprehensive Python package that mirrors the functionality of the existing MATLAB implementation. This expansion includes adding standardized unit tests, thorough documentation, example codes, and installation guidelines. By modernizing the software architecture and ensuring cross-language performance consistency, the project seeks to make OSET more accessible to researchers, particularly those in AI, while maintaining its usability for biomedical engineering and informatics. The expected outcomes include a fully functional Python package that aligns with the current MATLAB version, facilitating broader usage and contributing to the advancement of biomedical research.",
          "difficulty": null,
          "id": "proj_department-of-biomed_2024_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/5g7xbg4v/",
          "proposal_id": null,
          "short_description": "This project aims to enhance the Open Source Electrophysiological Toolbox (OSET) by expanding its Python capabilities. The goal is to create a...",
          "slug": "python-expansion-of-the-open-source-electrophysiological-toolbox",
          "status": "completed",
          "student_name": "Muhammad Ubadah Tanveer",
          "student_profile": null,
          "tags": [
            "python",
            "ai",
            "ui"
          ],
          "title": "Python Expansion of the Open Source Electrophysiological Toolbox"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2024/organizations/department-of-biomedical-informatics-emory-university/"
    },
    "year_2025": {
      "num_projects": 3,
      "projects": [
        {
          "code_url": null,
          "description": "Institutional departments, such as the Biomedical Informatics (BMI) Department of Emory University School of Medicine, manage vast amounts of data, often reaching petabyte scales across multiple Linux-based storage servers. Researchers storing data in these systems need a streamlined way to modify ACLs to grant or revoke access for collaborators. Currently, the IT team at BMI is responsible for manually handling these ACL modifications, which is time-consuming, error-prone, and inefficient, especially as data volume and user demands grow.\n\nTo address this challenge at BMI and similar institutions worldwide, a Web Management Interface is needed to allow users to modify ACLs securely. This solution would eliminate the burden on IT teams by enabling on-demand permission management while ensuring security and reliability.\n\nThe proposed system will feature a robust and highly configurable backend, high-speed databases, orchestration daemons for file storage servers, and an intuitive frontend. The proposal includes an in-depth analysis of required components, high-level and low-level design considerations, technology selection, and the demonstration of a functional prototype as proof of concept.\n\nThe goal is to deliver a production-ready, secure, scalable, and reliable system for managing ACLs across multiple servers hosting filesystems such as NFS, BeeGFS, and others. This solution will streamline access control management and prepare it for deployment at BMI and other institutions worldwide, significantly reducing the manual workload for IT teams.",
          "difficulty": null,
          "id": "proj_department-of-biomed_2025_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/FFAXDtDw",
          "proposal_id": "byNWkCyC",
          "short_description": "Institutional departments, such as the Biomedical Informatics (BMI) Department of Emory University School of Medicine, manage vast amounts of data,...",
          "slug": "securing-linux-storage-with-acls-open-source-web-management-interface-for-enhanced-data-protection",
          "status": "in-progress",
          "student_name": "_Aditya_Patil_",
          "student_profile": null,
          "tags": [
            "web",
            "ml",
            "database",
            "ui",
            "ux"
          ],
          "title": "Securing Linux Storage with ACLs: Open-Source Web Management Interface for Enhanced Data Protection"
        },
        {
          "code_url": null,
          "description": "This project aims to develop adaptive, personalized neuromodulation therapies for conditions like epilepsy by integrating synthetic EEG data from The Virtual Brain (TVB) with reinforcement learning (RL). A foundation model (e.g., a transformer) will learn to predict how EEG signals respond to electrical stimulation, while an RL agent continuously adjusts stimulation parameters, such as intensity and frequency, to optimize key metrics, for example, minimizing pathological synchrony.\r\n\r\nBy training a surrogate model of brain responses and letting an RL agent fine-tune stimulation based on reward signals, the system can achieve closed-loop adaptability. This addresses the shortcomings of fixed, non-adaptive therapies and aims for more effective and personalized neurological interventions.\r\n\r\nKey Deliverables include:\r\n\r\n- A simulation pipeline that produces EEG data reflecting various neuromodulation effects.\r\n- A curated dataset of stimulation–EEG response pairs covering clinically relevant parameter ranges.\r\n- A trained machine learning model (surrogate simulator), with documentation and accuracy metrics against TVB outputs.\r\n- A reinforcement learning environment integrating the surrogate model, with defined state/action spaces and reward functions.\r\n- A trained RL controller that adapts stimulation parameters to meet therapeutic objectives, supported by performance logs and analysis.\r\n- Comprehensive documentation, including setup instructions, usage guides, and a final report. All code will be open-sourced for broader collaboration.\r\n\r\nUltimately, this initiative accelerates neuromodulation research, lowers computational overhead, and opens the door to customized, closed-loop therapies that adapt in real time to each patient’s unique brain activity.",
          "difficulty": null,
          "id": "proj_department-of-biomed_2025_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/JkPFPa6X",
          "proposal_id": "AaaS989y",
          "short_description": "This project aims to develop adaptive, personalized neuromodulation therapies for conditions like epilepsy by integrating synthetic EEG data from The...",
          "slug": "adaptive-closed-loop-neuromodulation-a-reinforcement-learning-framework-using-synthetic-eeg-data",
          "status": "in-progress",
          "student_name": "Amirhossein Afkhami Ardekani",
          "student_profile": null,
          "tags": [
            "api",
            "ai",
            "ui"
          ],
          "title": "Adaptive Closed-Loop Neuromodulation: A Reinforcement Learning Framework Using Synthetic EEG Data"
        },
        {
          "code_url": null,
          "description": "Acquiring neural fMRI and abdominal MRI data is inherently expensive and time-consuming, significantly limiting the volume of datasets available for advanced analysis. Consequently, the full potential of GI tract disease diagnosis and segmentation models remains unrealized, as limited datasets hinder their accuracy and generalizability.\n\nDiffusion models offer a promising solution to these challenges. By effectively learning intricate spatiotemporal patterns inherent in fMRI/MRI data, diffusion models can synthesize high-quality, realistic data samples. This capability augments available datasets, substantially enhancing the accuracy and reliability of GI tract semantic segmentation and disease diagnosis models.",
          "difficulty": "advanced",
          "id": "proj_department-of-biomed_2025_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/QB45Mcpx",
          "proposal_id": "GrZyZWMU",
          "short_description": "Acquiring neural fMRI and abdominal MRI data is inherently expensive and time-consuming, significantly limiting the volume of datasets available for...",
          "slug": "leveraging-diffusion-models-to-enhance-segmentation-models-for-gi-tract-disorder-evaluation",
          "status": "in-progress",
          "student_name": "Miguel Aenlle",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Leveraging Diffusion Models to Enhance Segmentation Models for GI Tract Disorder Evaluation"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2025/organizations/department-of-biomedical-informatics-emory-university"
    }
  },
  "first_time": false,
  "contact": {
    "email": "mzeydab@emory.edu",
    "guide_url": "https://github.com/NISYSLAB/Emory-BMI-GSoC/blob/main/CONTRIBUTOR-GUIDANCE.md",
    "ideas_url": "https://github.com/NISYSLAB/Emory-BMI-GSoC/?tab=readme-ov-file#list-of-ideas",
    "irc_channel": "http://bit.ly/emory-bmi",
    "mailing_list": null
  },
  "social": {
    "blog": null,
    "discord": null,
    "facebook": null,
    "github": null,
    "gitlab": null,
    "instagram": null,
    "linkedin": null,
    "mastodon": null,
    "medium": null,
    "reddit": null,
    "slack": null,
    "stackoverflow": null,
    "twitch": null,
    "twitter": "https://twitter.com/emorybmi",
    "youtube": null
  },
  "meta": {
    "version": 1,
    "generated_at": "2026-01-25T15:28:53.048Z"
  }
}