{
  "id": "692251d353dd9d7326d33dac",
  "slug": "fortran-lang",
  "name": "Fortran-lang",
  "category": "Programming languages",
  "description": "High-performance parallel programming language",
  "image_url": "https://summerofcode.withgoogle.com/media/org/fortran-lang/ay9se7mc6vgdwgbn-360.png",
  "img_r2_url": "https://pub-268c3a1efc8b4f8a99115507a760ca14.r2.dev/fortran-lang.webp",
  "logo_r2_url": null,
  "url": "https://fortran-lang.org",
  "active_years": [
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "first_year": 2021,
  "last_year": 2025,
  "is_currently_active": true,
  "technologies": [
    "python",
    "c",
    "c++",
    "llvm",
    "compiler",
    "fortran"
  ],
  "topics": [
    "science",
    "engineering",
    "numerical computing",
    "libraries",
    "high-performance computing",
    "compilers",
    "programming languages",
    "build systems",
    "Fortran"
  ],
  "total_projects": 21,
  "stats": {
    "avg_projects_per_appeared_year": 4.2,
    "projects_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": null,
      "year_2019": null,
      "year_2020": null,
      "year_2021": 5,
      "year_2022": 5,
      "year_2023": 3,
      "year_2024": 3,
      "year_2025": 5
    },
    "students_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": null,
      "year_2019": null,
      "year_2020": null,
      "year_2021": 5,
      "year_2022": 5,
      "year_2023": 3,
      "year_2024": 3,
      "year_2025": 5
    },
    "total_students": 21
  },
  "years": {
    "year_2016": null,
    "year_2017": null,
    "year_2018": null,
    "year_2019": null,
    "year_2020": null,
    "year_2021": {
      "num_projects": 5,
      "projects": [
        {
          "code_url": "https://github.com/fortran-lang/stdlib/pull/491",
          "description": "<p>The Fortran offers all the ingredients needed for building modules of various data types such as linked-list, maps, binary tree, etc.<br>\nThis project aims to enhance the already existing and continuously improving Fortran-lang, i.e. stdlib, by implementing a linked list module in it. We wish to provide a module that can be used “off the shelf” by any Fortran user. The project mainly focuses on implementing the most efficient linked list and not just a simple linked list.</p>\n",
          "difficulty": null,
          "id": "proj_fortran-lang_2021_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5486930011095040/",
          "proposal_id": null,
          "short_description": "The Fortran offers all the ingredients needed for building modules of various data types such as linked-list, maps, binary tree, etc.\nThis project...",
          "slug": "linked-list-in-stdlib-of-fortran-lang",
          "status": "completed",
          "student_name": "Chetan Karwa",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Linked List in stdlib of Fortran-lang"
        },
        {
          "code_url": "https://gist.github.com/Thirumalai-Shaktivel/c2a1aaa5239e792e499eaa8942987519",
          "description": "<p>This project aims to ensure that all the grammar rules defined are exposed to the AST(Abstract Syntax Tree) level.<br>\n    ‣ Basically working on Lexical and Syntax Analysis (Two phases of the Compiler Design).<br>\n    ‣ Some grammar rules were not defined in the parser. After adding them, created AST nodes related to those grammar rules, defined macros, used them in the parser to expose those nodes to the AST level.<br>\n    ‣ Parse Comments, Semicolons, and Newlines in the Fortran code. Preserve them in the AST, and print them using fmt(Subcommand).<br>\n    ‣ Add tests for each implementation to make sure everything works correctly as expected.</p>\n",
          "difficulty": null,
          "id": "proj_fortran-lang_2021_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5088526328135680/",
          "proposal_id": null,
          "short_description": "This project aims to ensure that all the grammar rules defined are exposed to the AST(Abstract Syntax Tree) level.\n    ‣ Basically working on Lexical...",
          "slug": "lfortran-finish-ast-generation",
          "status": "completed",
          "student_name": "Thirumalai Shaktivel",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "LFortran: Finish AST generation"
        },
        {
          "code_url": "https://github.com/fortran-lang/fpm/pull/498",
          "description": "<p>This project should broaden the functionality of being able to specify flags for compilation profiles, which is so far quite limited. It should also allow the support of different argument types. Therefore the user should be able to specify project local arguments, which are not overwritten by main package arguments when a project is used as a dependency and also argument types, which are applicable for the whole project.</p>\n",
          "difficulty": null,
          "id": "proj_fortran-lang_2021_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/4646731328782336/",
          "proposal_id": null,
          "short_description": "This project should broaden the functionality of being able to specify flags for compilation profiles, which is so far quite limited. It should also...",
          "slug": "handling-compiler-arguments",
          "status": "completed",
          "student_name": "Jakub Jelinek",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Handling compiler arguments"
        },
        {
          "code_url": "https://web.archive.org/web/20210822135122/https://rgoswami.me/posts/gsoc21-fin-reprot/",
          "description": "<p>The overarching goal of the project is to have a minimum viable project which can compile the <a href=\"https://github.com/certik/dftatom\" target=\"_blank\">dftatom project</a> which is of personal interest to me as a computational chemist. Following through with <a href=\"https://gitlab.com/lfortran/lfortran/-/merge_requests/717\" target=\"_blank\">the initial contributions I made</a> fulfilling the patch requirement, I shall work towards the <a href=\"https://gitlab.com/lfortran/lfortran/-/wikis/GSoC-2021-Ideas\" target=\"_blank\">completion of the math library</a>. In particular, I intend to complete the tasks for the new Fortran runtime library. To be pragmatic and get an MVP, I shall work on allowing LFortran to <a href=\"https://gitlab.com/lfortran/lfortran/-/issues/52\" target=\"_blank\">use externally compiled modules</a>. Subsequently, I shall work on the implementation of arrays and their intrinsics and round out the project by enumerating all remaining corner-cases required for the dftatom project.</p>\n",
          "difficulty": null,
          "id": "proj_fortran-lang_2021_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6524640414924800/",
          "proposal_id": null,
          "short_description": "The overarching goal of the project is to have a minimum viable project which can compile the dftatom project which is of personal interest to me as...",
          "slug": "lfortran-and-computational-chemistry",
          "status": "completed",
          "student_name": "Rohit Goswami",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "LFortran and Computational Chemistry"
        },
        {
          "code_url": "https://docs.google.com/document/d/1zgSPek0ZB1L8MZ5D_NEXEHFMmmg9QSwZQTOa2pcp128/edit?usp=sharing",
          "description": "<p>Addition of <strong>deferred length variables</strong> in <strong>Fortran 2003</strong> provides a user with an utility to leave the responsibility of allocating the required space to a variable on the compiler. A deferred length variable is either <code>pointer</code> or <code>allocatable</code>. Compiler during execution allocates space based upon the value to be assigned to a variable.<br>\n<em>For eg:</em> If the value to be assigned to a character variable is <code>\"spiderman\"</code>, then the compiler will automatically allocate a space required to store this character sequence of length 9 and a reference to this space will be stored in the variable. Similarly, if a new character sequence, let’s say, <code>\"batman\"</code>(which is of length 6) is assigned to this same variable then the compiler will allocate a space required to store <code>\"batman\"</code> and a reference to this space will overwrite the previously stored reference in the variable. Thus, space required by the variable is constant as it is not storing the actual character sequence and is rather storing the reference to the space where the character sequence is actually stored.</p>\n<p><em>Goals of the project:</em><br>\n1). Conceptualize and add new functionalities to strings<br>\n2). Designing and implementing list of variable-length strings</p>\n",
          "difficulty": null,
          "id": "proj_fortran-lang_2021_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6316253567778816/",
          "proposal_id": null,
          "short_description": "Addition of deferred length variables in Fortran 2003 provides a user with an utility to leave the responsibility of allocating the required space to...",
          "slug": "project-strings-improving-strings-support-in-fortran",
          "status": "completed",
          "student_name": "Aman Godara",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "Project Strings: Improving strings support in Fortran"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2021/organizations/6542461173760000/"
    },
    "year_2022": {
      "num_projects": 5,
      "projects": [
        {
          "code_url": "https://gist.github.com/Shaikh-Ubaid/b93adf592383ca0f25ba5d4d88854701",
          "description": "This project is about adding support of generating WASM using the LFortran Compiler. It focuses on building a custom ASR (Abstract Semantic Representation) to WASM Backend for the LFortran Compiler.\n\nAs part of this project, we develop:\n\n‣ A WASM Backend for LFortran using which it can compile Fortran code to WebAssembly as Target\n\n‣ A WAT Backend for LFortran\n\n‣ A Web-Frontend where we deploy the LFortran wasm binary and can see it live in action.\n\n‣ LFortran (along with its runtime library) compiles to WASM using emscripten. The compiled compiler (in binary wasm format) can be served to users statically and users can enjoy running Fortran inside their browsers.\n\nThe live website which hosts the LFortran compiler (compiled to binary wasm) is deployed at https://dev.lfortran.org/.",
          "difficulty": null,
          "id": "proj_fortran-lang_2022_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/2knIxPfC/",
          "proposal_id": null,
          "short_description": "This project is about adding support of generating WASM using the LFortran Compiler. It focuses on building a custom ASR (Abstract Semantic...",
          "slug": "lfortran-implementing-a-custom-wasm-backend",
          "status": "completed",
          "student_name": "Mohd Ubaid Shaikh",
          "student_profile": null,
          "tags": [
            "web",
            "ui",
            "frontend",
            "backend"
          ],
          "title": "LFORTRAN: IMPLEMENTING A CUSTOM WASM BACKEND"
        },
        {
          "code_url": "https://github.com/henilp105/GSoc-2022-Port-Fortran-lang.org-Final-Report",
          "description": "The idea is to Port the Entire site from Jekyll to Sphinx and MyST parser to add internationalisation as it comes built in Sphinx which also acts as an added advantage in implementing the site using sphinx and to increase the ease of maintenance and to make it easier for future contributors to contribute to the organisation.My Solution proposes the following Implementations:  \n\n1.Implement Interactive Community page using Js  \n\n2.Use Markdown for generating the static site in Sphinx + Myst  \n\n3.Internationalization Using Sphinx \n\n4.Ease of Portability of Learn section of Fortan-lang.org site  \n\n5.Implement a new Sphinx extension to Create Docutil nodes in python.   \n\n6.Automate The Build of translated site using GitHub pages and Add Documentation to the New Fortran-lang.org site.  \n\n7.Addition of Extensive Documentation in Markdown files to the new Sphinx site and to make it easy for the new members to contribute to the community.  \n\n8.Implement changes and enhancements in UI/UX.  \n\n9.Implementation of landing page of site and Various pages and Layouts of the Site from Jekyll to Sphinx Using Markdown (Myst Dialect).",
          "difficulty": "beginner",
          "id": "proj_fortran-lang_2022_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/L28fukIz/",
          "proposal_id": null,
          "short_description": "The idea is to Port the Entire site from Jekyll to Sphinx and MyST parser to add internationalisation as it comes built in Sphinx which also acts as...",
          "slug": "port-fortran-langorg-to-sphinx",
          "status": "completed",
          "student_name": "Henil Shalin Panchal",
          "student_profile": null,
          "tags": [
            "python",
            "ai",
            "ui",
            "ux"
          ],
          "title": "Port fortran-lang.org to Sphinx"
        },
        {
          "code_url": "https://gist.github.com/ashirrwad/ea7eb6f289b6b651d362916721842370",
          "description": "The project aimed to build a playground for Modern Fortran which enables users to run their code online. It will be offered as an extension to the official fortran-lang website where users can experiment with their code and play around with supported libraries. The playground also offers an interactive tutorial for Fortran newcomers, giving them an overview of the language syntax and features.",
          "difficulty": null,
          "id": "proj_fortran-lang_2022_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/h0J5Izcu/",
          "proposal_id": null,
          "short_description": "The project aimed to build a playground for Modern Fortran which enables users to run their code online. It will be offered as an extension to the...",
          "slug": "build-an-online-playground-for-fortran-langorg",
          "status": "completed",
          "student_name": "Ashirwad Mishra",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "ui"
          ],
          "title": "Build an online playground for fortran-lang.org"
        },
        {
          "code_url": "https://oshanathgsoc.blogspot.com/2022/09/gsoc-2022-lfortran-implementing-generics.html",
          "description": "Currently LFortran requires that all function parameters to be typed. This makes implementing algorithms supported by many types, tedious. This project will implement generics in LFortran using the same design as C++ 20 concepts for type restrictions. A previously proposed notation will be used. The implementation will be done completely in the ASR level. (Abstract semantic representation). It will introduce a new data type that stores data types (type) and will use it to generate concrete functions from generic functions.",
          "difficulty": null,
          "id": "proj_fortran-lang_2022_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/kP9aFiIW/",
          "proposal_id": null,
          "short_description": "Currently LFortran requires that all function parameters to be typed. This makes implementing algorithms supported by many types, tedious. This...",
          "slug": "lfortran-implementing-generics",
          "status": "completed",
          "student_name": "Oshanath Rajawasam",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "LFortran - Implementing generics"
        },
        {
          "code_url": "https://github.com/arteevraina/GSoC-2022-Fortran-lang-Final_Work_Product/blob/main/README.md",
          "description": "This proposal describes the plan and research I have done to make the packages in Fortran Ecosystem FPM compatible. I have described in detail how I am going to take the help of Fortran Community on Discourse for helping me in decision making and the metrics on which I will prioritize which packages to make compatible with fpm first. I have also put forward in detail the packages that I have researched on Github, Gitlab and other code hosting platforms that interest me and that I think should be made fpm compatible by looking at what we currently have in Fpm Registry. So, for this, I have also created a tentative timeline with a brief overview of my plan during the pre-GSoC, Community Bonding, and Coding Period. It also describes in detail my commitment to the program and my programming background as well.\n\nGoals of Projects :\n\n1. Made packages from different domains like Command-Line Parsing, General Purpose Libraries, Command Line Parsing, and much more compatible with Fortran Package Manager.\n2. Collaborate with maintainers of the packages which are to be made available on the fpm registry.\n3. Interact with Fortran's open source community on Discourse and ask for suggestions and feedback while working on the project.",
          "difficulty": null,
          "id": "proj_fortran-lang_2022_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/wiAa3vbH/",
          "proposal_id": null,
          "short_description": "This proposal describes the plan and research I have done to make the packages in Fortran Ecosystem FPM compatible. I have described in detail how I...",
          "slug": "fpm-ize-the-fortran-ecosystem",
          "status": "completed",
          "student_name": "Arteev Raina",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "fpm-ize the Fortran ecosystem"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2022/organizations/fortran-lang/"
    },
    "year_2023": {
      "num_projects": 3,
      "projects": [
        {
          "code_url": "https://gist.github.com/Pranavchiku/5a5a1c82c68b51ea6ffd2b1e0602ecd3",
          "description": "I propose enhancing LFortran so that it can compile the majority or all of SciPy's Fortran code to binaries, allowing SciPy to be entirely compiled using LFortran and Clang. Currently, LFortran can compile the majority of Fortran files to ASR (Abstract Semantic Representation); however, there are some lacking features, such as COMMON, BLOCK DATA, SAVE, etc., that must be implemented for it to function properly. I have supplied multiple implementations that will allow these features to function effectively in the vast majority of circumstances. When lacking features are successfully implemented, the majority of the codebase will compile to LLVM. First, I will concentrate on the following packages: specfun, odepack, quadpack, fitpack, and Arpack, and then I will shift to other packages. By compiling SciPy, LFortran would acquire a larger user base, which would in turn encourage additional testing and development.",
          "difficulty": null,
          "id": "proj_fortran-lang_2023_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/6IzqNOrE",
          "proposal_id": "Ex5xJbs6",
          "short_description": "I propose enhancing LFortran so that it can compile the majority or all of SciPy's Fortran code to binaries, allowing SciPy to be entirely compiled...",
          "slug": "compiling-scipy-with-lfortran",
          "status": "completed",
          "student_name": "Pranav Goswami",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "Compiling SciPy with LFortran"
        },
        {
          "code_url": "https://github.com/rajkumardongre/GSoC23-Final-Report-Rajkumar-Dongre",
          "description": "The project aims to implement a High-level library for HTTP requests.  The library would allow Fortran programmers to make all standard HTTP request methods (GET, HEAD, POST, PUT, DELETE, CONNECT, OPTIONS, TRACE, and PATCH). This project will use fortran-curl, a set of Fortran bindings to libcurl, under the hood. The outcome of this project is that consuming HTTP web services from Fortran applications would become significantly easier than ever before.\n\nExpected outcomes: Implemented a minimal but working capability to make HTTP requests from Fortran and parse data from the response body and headers",
          "difficulty": null,
          "id": "proj_fortran-lang_2023_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/i0udhZW2",
          "proposal_id": "J5OvxlFx",
          "short_description": "The project aims to implement a High-level library for HTTP requests. The library would allow Fortran programmers to make all standard HTTP request...",
          "slug": "high-level-http-client-library",
          "status": "completed",
          "student_name": "Rajkumar Dongre",
          "student_profile": null,
          "tags": [
            "web",
            "ai"
          ],
          "title": "High-level HTTP client library"
        },
        {
          "code_url": "https://gist.github.com/Spnetic-5/9d06fd264180693215757c811d0cf615",
          "description": "This project aims to enhance the capabilities of neural-fortran, a parallel Fortran framework for deep learning, by implementing additional optimization algorithms. While the framework currently supports training and inference of dense and convolutional neural networks using stochastic and mini-batch gradient descent optimizers, more versatile learning and training from a broader range of problems and datasets require the use of other optimization algorithms such as RMSprop, Adam, and others commonly used in popular deep learning frameworks like Keras. The project will also require work on implementing, documenting, and testing these optimizers, which will broaden the applicability of neural-fortran and allow it to be used for a wider range of deep learning tasks. The successful implementation of these optimization algorithms will provide users with more flexibility and choice when training their models, ultimately improving the performance and capabilities of neural-fortran.",
          "difficulty": null,
          "id": "proj_fortran-lang_2023_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/zVM00eKK",
          "proposal_id": "MJC0i7a9",
          "short_description": "This project aims to enhance the capabilities of neural-fortran, a parallel Fortran framework for deep learning, by implementing additional...",
          "slug": "optimizers-in-a-deep-learning-framework",
          "status": "completed",
          "student_name": "Saurabh Suresh Powar",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Optimizers in a deep learning framework"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2023/organizations/fortran-lang"
    },
    "year_2024": {
      "num_projects": 3,
      "projects": [
        {
          "code_url": "https://gist.github.com/AnonMiraj/ab524953c8580ed6d34ad5545963b934",
          "description": "This project aims to address the lack of a modern, platform-agnostic graphics library for Fortran by designing and implementing a graphics canvas API along with basic graphics classes and multiple backend implementations. \n\nThe plan involves creating tools for 2D graphics primitives such as points, lines, and brushes, as well as designing an abstract graphics canvas API. This API will provide a unified interface for interacting with various backend implementations.",
          "difficulty": null,
          "id": "proj_fortran-lang_2024_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/tdNkVMi6/",
          "proposal_id": null,
          "short_description": "This project aims to address the lack of a modern, platform-agnostic graphics library for Fortran by designing and implementing a graphics canvas API...",
          "slug": "graphics-library-for-fortran",
          "status": "completed",
          "student_name": "Ezz el-dean Nabil",
          "student_profile": null,
          "tags": [
            "api",
            "ai",
            "backend"
          ],
          "title": "Graphics Library for Fortran"
        },
        {
          "code_url": "https://docs.google.com/document/d/1b3aTxEUsiL-zirk5Y-y1m8OOD8-LOFf_9HsqKEW7zhk/edit?usp=sharing",
          "description": "I propose to enhance LFortran so that it can compile all Fortran intrinsic functions. My primary focus will be on completing the missing intrinsic functions within the frontend. I'll ensure clear error messages are provided for unimplemented coarrays and atomic functions. Additionally, I'll enhance the performance of numerical functions by offering two implementations: one prioritizing speed with lower accuracy, and another emphasizing accuracy albeit slower. Following this, I'll streamline the asr builder by removing macros and improving its interface for better usability. Finally, integrating Fortran support for intrinsic functions will be included in the project deliverables.",
          "difficulty": null,
          "id": "proj_fortran-lang_2024_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/jT1KC9UX/",
          "proposal_id": null,
          "short_description": "I propose to enhance LFortran so that it can compile all Fortran intrinsic functions. My primary focus will be on completing the missing intrinsic...",
          "slug": "implementation-of-lfortran-intrinsic-functions",
          "status": "completed",
          "student_name": "Parth Mistry",
          "student_profile": null,
          "tags": [
            "ml",
            "ui",
            "frontend"
          ],
          "title": "Implementation of LFortran intrinsic functions"
        },
        {
          "code_url": "https://gist.github.com/HarshitaKalani/bc29d5f2793165264d09c948a84c49b3",
          "description": "This project delves into the intricate landscape of intrinsic functions within\nLFortran, evaluating their current status and proposing strategic enhancements. To enhance efficiency, certain functions require migration from the\nold runtime and compile-time libraries to become intrinsic functions, while\nothers need to be developed anew. Additionally, there are intrinsic functions\nthat fall outside the scope of this project; they will be flagged with an error\nmessage indicating their non-implementation status. The methodology to\nimplement an intrinsic function from scratch is also elucidated, outlining a\nstructured approach to integrate new functionalities. Ideas related to design\nimprovements and enhancing performance has also been proposed.",
          "difficulty": null,
          "id": "proj_fortran-lang_2024_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/wiGOcfOQ/",
          "proposal_id": null,
          "short_description": "This project delves into the intricate landscape of intrinsic functions within LFortran, evaluating their current status and proposing strategic...",
          "slug": "lfortran-intrinsic-functions",
          "status": "completed",
          "student_name": "Harshita Kalani",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "LFortran Intrinsic Functions"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2024/organizations/fortran-lang/"
    },
    "year_2025": {
      "num_projects": 5,
      "projects": [
        {
          "code_url": null,
          "description": "This project aims to enhance OpenMP support in LFortran by developing a unified ASR node, that encapsulates all core and advanced OpenMP directives and clauses. The new design will enable robust handling of constructs like Parallel, Do, Teams, Tasks, SIMD, and Target offloading, ensuring systematic lowering to runtime calls. Key deliverables includes implementing various OpenMP features, enhancing Fortran Backend and explore Target Offloading design and it's implementation. This will make LFortran a more powerful and extensible tool for HPC applications.",
          "difficulty": "advanced",
          "id": "proj_fortran-lang_2025_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/cu5wDfGZ",
          "proposal_id": "ldqUubIm",
          "short_description": "This project aims to enhance OpenMP support in LFortran by developing a unified ASR node, that encapsulates all core and advanced OpenMP directives...",
          "slug": "enhancing-openmp-support-in-lfortran",
          "status": "in-progress",
          "student_name": "adit4443ya",
          "student_profile": null,
          "tags": [
            "ai",
            "backend"
          ],
          "title": "Enhancing OpenMP Support in LFortran"
        },
        {
          "code_url": null,
          "description": "In the upcoming GSoC project, I will be compiling two code bases—AoC-2024 and Stdlib—using LFortran. These code bases can be compiled by any modern Fortran compiler, such as GFortran. For both code bases, my plan is to discover bugs and failures in various phases of LFortran (Frontend, ASR passes, and Backend) and report minimal reproducible examples for these bugs. My next step will be to fix all the reported bugs to ensure the successful generation of executables. Finally, I will be working to align the outputs from LFortran with those of GFortran. Additionally, I will work on enhancing compilation speeds when compiling these code bases using LFortran",
          "difficulty": null,
          "id": "proj_fortran-lang_2025_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/uhd1Mpkb",
          "proposal_id": "zlGdmlt2",
          "short_description": "In the upcoming GSoC project, I will be compiling two code bases—AoC-2024 and Stdlib—using LFortran. These code bases can be compiled by any modern...",
          "slug": "compiling-aoc-2024-and-stdlib-using-lfortran",
          "status": "in-progress",
          "student_name": "AnshMehta",
          "student_profile": null,
          "tags": [
            "ai",
            "frontend",
            "backend"
          ],
          "title": "Compiling AoC-2024 and Stdlib using LFortran"
        },
        {
          "code_url": null,
          "description": "In order to make LFortran reach beta quality, it is essential to compile more benchmarked fortran codes. FPM(Fortran Package Manager) is one of the best example of such codebase. Successfully compiling FPM will make LFortran a more robust compiler and it will be a huge boost for LFortran to reach at beta quality. \nFor this year's GSOC project, I am planing to compile FPM with LFortran. Since FPM depends on other 5 open source fortran codebases (toml-f, fortran-regex, fortran-shlex, M_CLI2, jonquil) , my plan is to compile those 5 small codebases till 1st month of coding period. \nTo compile any code, my idea is to create workarounds that compile with LFortran till code compiles fully with LFortran, then create MREs for each workarounds and finally fix them and remove workarounds from original code. This way I will compile in order: toml-f, fortran-regex, fortran-shlex, M_CLI2, jonquil so that all dependencies are solved well. After completing these 5 codes, I will follow same process to compile FPM. Detailed weekly plan is discussed in my proposal.\nDeliverables: Compile toml-f, fortran-regex, fortran-shlex, M_CLI2, jonquil, FPM completely with LFortran.",
          "difficulty": null,
          "id": "proj_fortran-lang_2025_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/gQy7gPby",
          "proposal_id": "pUqVGRxh",
          "short_description": "In order to make LFortran reach beta quality, it is essential to compile more benchmarked fortran codes. FPM(Fortran Package Manager) is one of the...",
          "slug": "compile-fpm-with-lfortran",
          "status": "in-progress",
          "student_name": "Jinang Shah",
          "student_profile": null,
          "tags": [
            "ml",
            "ai",
            "ui"
          ],
          "title": "Compile FPM with LFortran"
        },
        {
          "code_url": null,
          "description": "This project aims to extend the community maintained Fortran standard library's system module to include more cross platform functionality related to File system operations (such as listing directories, checking permissions etc) and creation, modification of sub-processes.",
          "difficulty": null,
          "id": "proj_fortran-lang_2025_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/xTdyYrMf",
          "proposal_id": "CSwyHC8D",
          "short_description": "This project aims to extend the community maintained Fortran standard library's system module to include more cross platform functionality related to...",
          "slug": "file-system-and-process-management-library-stdlib",
          "status": "in-progress",
          "student_name": "Suprit S Jahagirdar",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "File System and Process Management Library (stdlib)"
        },
        {
          "code_url": null,
          "description": "PETSc, the Portable, Extensible Toolkit for Scientific Computation, is for the scalable (parallel) solution of scientific applications modeled by partial differential equations (PDEs). Besides its native API in C it has bindings for Fortran and Python. PETSc also contains TAO, the Toolkit for Advanced Optimization, a software library supporting MPI and GPUs through CUDA, HIP, Kokkos, or OpenCL. \n\nWhile most of the Fortran interfaces can be generated automatically from the C-API, functions with \"complex\" arguments such as procedure pointers, pointers to arrays, and strings require the manual creation of interface code on both the C and the Fortran side. Moreover, due to the discrepancy of features between C and Fortran, a one-to-one translation of APIs leads to Fortran interfaces that don't leverage the capabilities of modern Fortran. Examples include overloaded functions for different types in Fortran, for which a C-API requires VOID and an explicit type argument and arrays, for which the length is part of the type definition in Fortran but requires a second argument in the C-API.\n\nThis project aims to improve the automation of generating Fortran interfaces by leveraging modern Fortran features such as BIND(C) and ISO_C_BINDING along with annotation strategies to reduce the need of manual generation of interfaces. The improved system will enhance both usability for end-users and maintainability for developers.",
          "difficulty": "advanced",
          "id": "proj_fortran-lang_2025_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/jm7DF82F",
          "proposal_id": "xwEPXinc",
          "short_description": "PETSc, the Portable, Extensible Toolkit for Scientific Computation, is for the scalable (parallel) solution of scientific applications modeled by...",
          "slug": "improved-fortran-interface-generation-for-petsc",
          "status": "in-progress",
          "student_name": "Tapashree Pradhan",
          "student_profile": null,
          "tags": [
            "python",
            "api",
            "ai",
            "ui"
          ],
          "title": "Improved Fortran Interface Generation for PETSc"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2025/organizations/fortran-lang"
    }
  },
  "first_time": false,
  "contact": {
    "email": "ondrej@certik.us",
    "guide_url": "https://github.com/fortran-lang/webpage/wiki/GSoC-2025-Contributor-Instructions",
    "ideas_url": "https://github.com/fortran-lang/webpage/wiki/GSoC-2025-Project-ideas",
    "irc_channel": "https://fortran-lang.discourse.group/",
    "mailing_list": "https://groups.io/g/fortran-lang"
  },
  "social": {
    "blog": null,
    "discord": null,
    "facebook": null,
    "github": null,
    "gitlab": null,
    "instagram": null,
    "linkedin": null,
    "mastodon": null,
    "medium": null,
    "reddit": null,
    "slack": null,
    "stackoverflow": null,
    "twitch": null,
    "twitter": "https://twitter.com/fortranlang",
    "youtube": null
  },
  "meta": {
    "version": 1,
    "generated_at": "2026-01-25T15:28:53.142Z"
  }
}