{
  "id": "692251d353dd9d7326d33da7",
  "slug": "fossology",
  "name": "FOSSology",
  "category": "Web",
  "description": "Open Source License Compliance by OSS",
  "image_url": "https://summerofcode.withgoogle.com/media/org/fossology/bqfblnvpsqnfg5bh-360.png",
  "img_r2_url": "https://pub-268c3a1efc8b4f8a99115507a760ca14.r2.dev/fossology.webp",
  "logo_r2_url": null,
  "url": "https://fossology.org",
  "active_years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "first_year": 2018,
  "last_year": 2025,
  "is_currently_active": true,
  "technologies": [
    "linux",
    "postgresql",
    "c",
    "c++",
    "php",
    "lamp",
    "jquery",
    "bash",
    "python",
    "javascript",
    "twig",
    "reactjs",
    "go"
  ],
  "topics": [
    "compliance",
    "open source",
    "licensing",
    "spdx",
    "license compliance",
    "license-scan",
    "oss licensing",
    "oss compliance",
    "oss licencing",
    "license management",
    "automation",
    "nlp",
    "compliance automation"
  ],
  "total_projects": 42,
  "stats": {
    "avg_projects_per_appeared_year": 5.25,
    "projects_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": 1,
      "year_2019": 3,
      "year_2020": 3,
      "year_2021": 7,
      "year_2022": 6,
      "year_2023": 5,
      "year_2024": 7,
      "year_2025": 10
    },
    "students_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": 1,
      "year_2019": 3,
      "year_2020": 3,
      "year_2021": 7,
      "year_2022": 6,
      "year_2023": 5,
      "year_2024": 7,
      "year_2025": 10
    },
    "total_students": 35
  },
  "years": {
    "year_2016": null,
    "year_2017": null,
    "year_2018": {
      "num_projects": 1,
      "projects": [
        {
          "code_url": "https://github.com/fossology/atarashi",
          "description": "<p>Software License compliance is very important for any business/ OSS(open source software) nowadays which creates a need for more accurate license scanning. So, the aim of the project is to develop a new/improved license text scanner using different approaches so that one can generate an SPDX file and other copyright files with accuracy and thus the process can be automated.”</p>\n",
          "difficulty": null,
          "id": "proj_fossology_2018_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5703702744662016/",
          "proposal_id": null,
          "short_description": "Software License compliance is very important for any business/ OSS(open source software) nowadays which creates a need for more accurate license...",
          "slug": "new-improved-license-scanner",
          "status": "completed",
          "student_name": "amanjain5221",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "New/ Improved License Scanner"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2018/organizations/5988565108391936/"
    },
    "year_2019": {
      "num_projects": 3,
      "projects": [
        {
          "code_url": "https://sandipbhuyan.com/updates/4",
          "description": "<p>FOSSology is a open source license compliance software system and toolkit. As a toolkit a user can run license, copyright and export control scans from the command line. The FOSSology system is a combination of agent runs in series to perform specific task. The proposed project is to create another agent for software heritage for searching through the software heritage archive.\nUser using FOSSology through software heritage can see  if the current file (or the files of an upload) is published in Software Heritage. With this functionality a user can see if the file has been published in a different open source before or if this file is really part of the distribution.</p>\n",
          "difficulty": null,
          "id": "proj_fossology_2019_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/6455667395657728/",
          "proposal_id": null,
          "short_description": "FOSSology is a open source license compliance software system and toolkit. As a toolkit a user can run license, copyright and export control scans...",
          "slug": "integration-of-software-heritage-in-fossology",
          "status": "completed",
          "student_name": "Sandip Kumar Bhuyan",
          "student_profile": null,
          "tags": [],
          "title": "Integration of Software Heritage in FOSSology"
        },
        {
          "code_url": "https://github.com/vivekaindia/fossology/wiki/GSoC-Final-Report:-Agent-Spasht",
          "description": "<p>Clearly Defined is a collection metadata of licences, copyrights and the source codes. Clearly Defined clarifies data on open source components, and mostly focus over the open source licence, source location and attribution parties. This helps in providing more information about what their obligations are and feel more confident in meeting them.</p>\n<p>The project aim is to connect the Clearly Defined REST API and query through the metadata provided by Clearly Defined. This will help in importing the data and reducing the manual clearing task for users. Moreover, the FOSSology can lead to contribute to clearly defined by providing new license metadata and helping the community.</p>\n",
          "difficulty": null,
          "id": "proj_fossology_2019_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5527519191629824/",
          "proposal_id": null,
          "short_description": "Clearly Defined is a collection metadata of licences, copyrights and the source codes. Clearly Defined clarifies data on open source components, and...",
          "slug": "spasht-agent",
          "status": "completed",
          "student_name": "Vivek_Kumar",
          "student_profile": null,
          "tags": [
            "api",
            "ai"
          ],
          "title": "Spasht Agent"
        },
        {
          "code_url": "https://github.com/hastagAB/GSoC-19",
          "description": "<p>Atarashi scans for license statements in open source software, focusing on text statistics. Designed to work stand-alone and with FOSSology. Right now it works on the simple command-line interface and separately from FOSSology. \nTo make it more user-friendly it needs a GUI. FOSSology already has a stable GUI and advance features improved over the years. \nAtarashi works on <em>Text Statistics</em> and <em>Information Retrieval Algorithms</em> written purely in Python. Integrating Atarashi with FOSSology will not only make it more powerful but will also give various existing features for FOSSology to use in its User Interface. \nA <em>standardized algorithm evaluator</em> is needed for the existing and upcoming license scanning algorithms to validate its accuracy and reliability.\nA <em>Machine Learning Model &amp; Algorithm</em> needs to be established so that it can be improved in the future. This will give us the most accurate and best results and will make Atarashi more powerful &amp; faster than ever.</p>\n",
          "difficulty": null,
          "id": "proj_fossology_2019_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/6052136226390016/",
          "proposal_id": null,
          "short_description": "Atarashi scans for license statements in open source software, focusing on text statistics. Designed to work stand-alone and with FOSSology. Right...",
          "slug": "continuation-of-atarashi-oss",
          "status": "completed",
          "student_name": "HastagAB",
          "student_profile": null,
          "tags": [
            "python",
            "ui"
          ],
          "title": "Continuation of Atarashi OSS"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2019/organizations/4832912116023296/"
    },
    "year_2020": {
      "num_projects": 3,
      "projects": [
        {
          "code_url": "https://github.com/Kaushl2208/GSoC-2020",
          "description": "<p>Atarashi scans for license statements in open source software, focusing on text statistics. Designed to work stand-alone and with Fossology. It currently uses text retrieval algorithms for getting a similarity score. I will be introducing a new agent working on the concept of \"Siamese Manhattan LSTM\". Making Atarashi more precise and accurate than ever. Atarashi also uses Code Comment extractor as a fork. I will be building a separate library for Code comment extractor with a variety of updating and integrating it with Atarashi. Followed by shifting the current command-line interface tool used by Atarashi. These changes will make Atarashi faster, accurate, precise and independent than earlier.</p>\n",
          "difficulty": null,
          "id": "proj_fossology_2020_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5727053447430144/",
          "proposal_id": null,
          "short_description": "Atarashi scans for license statements in open source software, focusing on text statistics. Designed to work stand-alone and with Fossology. It...",
          "slug": "refurbishing-atarashi",
          "status": "completed",
          "student_name": "Kaushlendra Pratap Singh",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "Refurbishing Atarashi"
        },
        {
          "code_url": "https://github.com/darshank15/GSoC_2020_FOSSOlogy/wiki",
          "description": "<p>FOSSology generates a large set of data that can be exported to the time-series Influx database and visualized with the help of a grafana dashboard. I will write scripts that collect useful data from FOSSology DB and expose them to  InfluxDB. Develop a monitoring dashboard in Grafana by integrating InfluxDB as input data source. Also develop an alerting mechanism to notify admin via email.</p>\n",
          "difficulty": null,
          "id": "proj_fossology_2020_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5228020761100288/",
          "proposal_id": null,
          "short_description": "FOSSology generates a large set of data that can be exported to the time-series Influx database and visualized with the help of a grafana dashboard....",
          "slug": "dashboard-python-influxdb-grafana",
          "status": "completed",
          "student_name": "Darshan Kansagara",
          "student_profile": null,
          "tags": [
            "python",
            "ai",
            "database",
            "ux"
          ],
          "title": "Dashboard ( Python, influxDB, Grafana )"
        },
        {
          "code_url": "https://github.com/hastagAB/GSoC-2020",
          "description": "<p>Currently, Atarashi has 4 active agents types that use 9 different types of algorithms to find the similarity between license statements. According to the evaluation of all the agents and their types, it can be seen that there is a need for improvement in the speed as well as the accuracy of the agents.\nI’ll be implementing the basics of Lucene and percolate search on the top of different agents to increase the speed of the agent without much tweaking with their original algorithm.</p>\n<p>A python library for code comment extraction is needed to be created with various additional features for providing support to Atarashi as well as FOSSology. This will be packaged &amp; published to PyPI for easy installation and usage.</p>\n<p>For any Machine Learning/Deep Learning model to be implemented we need a dataset of SPDX open-source licenses. There isn’t any dataset available online so we need to create our own dataset as per the requirements.</p>\n<p>I’ll be working on the improvement of the semanticTextSim agent and will be introducing a new part of it. Currently, we have doc2vec implementation and I’m planning to introduce the BERT embeddings for finding semantic text similarity.</p>\n",
          "difficulty": "beginner",
          "id": "proj_fossology_2020_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/4859076292378624/",
          "proposal_id": null,
          "short_description": "Currently, Atarashi has 4 active agents types that use 9 different types of algorithms to find the similarity between license statements. According...",
          "slug": "accelerating-atarashi",
          "status": "completed",
          "student_name": "HastagAB",
          "student_profile": null,
          "tags": [
            "python",
            "ai",
            "ui"
          ],
          "title": "Accelerating  Atarashi"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2020/organizations/6163301563629568/"
    },
    "year_2021": {
      "num_projects": 7,
      "projects": [
        {
          "code_url": "https://medium.com/@shruti-ag/gsoc21-with-fossology-fd97cd2a3924",
          "description": "<p>The UI Migration project is an effort focused on generating the new component-based architecture with the integration of the APIs. To make the project more <strong>efficient</strong> and <strong>easily accessible</strong>, an entire code base shift from Symfony-Twig to React.js is proposed. React.js features an incrementally adaptable architecture that focuses on declarative rendering and component composition. React.js component system will enable us to organize the current working APIs appropriately.</p>\n<p>The main <strong>objectives</strong> of this project are:</p>\n<ol>\n<li>Working on good interactive design, with a modern look.</li>\n<li>Integrating the APIs to the new component-based UI structure.</li>\n<li>Seamless routing and page transitions.</li>\n<li>Giving the power of the node engine to our UI. Making all NPM accessible.</li>\n<li>Write appropriate documentation.</li>\n</ol>\n",
          "difficulty": null,
          "id": "proj_fossology_2021_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6677638625624064/",
          "proposal_id": null,
          "short_description": "The UI Migration project is an effort focused on generating the new component-based architecture with the integration of the APIs. To make the...",
          "slug": "migration-of-ui-into-reactjs",
          "status": "completed",
          "student_name": "Shruti Agarwal",
          "student_profile": null,
          "tags": [
            "react",
            "api",
            "ml",
            "ai",
            "ui"
          ],
          "title": "Migration of UI into React.js"
        },
        {
          "code_url": "https://gsoc.avinal.space/posts/report/final-evaluation.html",
          "description": "<h3>Build System</h3>\n<p>FOSSology’s build system is based on multilevel makefiles that work together to provide a build infrastructure for the project. Although make is a robust build system but it is too outdated and slow compared to modern build systems. Although build configurations are not supposed to be updated as often as source files, there are few noticeable problems with make. This project will migrate the build system to more user freindly and popular CMake.</p>\n<h3>Workflow (Continuous Integration)</h3>\n<p>Fossology has been using free Travis CI for all its continuous builds, tests and deployment purposes throughout the organization. GitHub Actions provides better integration, faster build times and is versatile in many other ways. This projects aims at improving the overall CI/CD for the project as well as upgrade the targets and virtual platforms to the latest compatible versions.</p>\n",
          "difficulty": null,
          "id": "proj_fossology_2021_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5660262408912896/",
          "proposal_id": null,
          "short_description": "Build System\nFOSSology’s build system is based on multilevel makefiles that work together to provide a build infrastructure for the project. Although...",
          "slug": "new-build-system-and-improving-cicd-workflow",
          "status": "completed",
          "student_name": "Avinal",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "New Build System and improving CI/CD workflow"
        },
        {
          "code_url": "https://github.com/pulls?q=is%3Apr+org%3Afossology+author%3AAman-Codes+sort%3Aupdated-desc+is%3Aclosed",
          "description": "<p>FOSSology frontend is built using the Symfony framework of PHP. It needs to get revamped to make it faster for development, more adaptive to newer technologies, and impart a modernized look. I would rewrite the UI in React from scratch while ensuring a <strong>highly scalable</strong>, <strong>flexible</strong>, and <strong>easy to use and maintain</strong> code architecture. Also, I will be upgrading the existing API and would integrate it with the new frontend code.</p>\n<p><strong>Deliverables</strong> of this project:</p>\n<ul>\n<li>A fresh modern look to the FOSSology UI</li>\n<li>Complete migration of frontend to React</li>\n<li>Upgradation of API to provide more functionalities</li>\n<li>Documentation of frontend code</li>\n</ul>\n",
          "difficulty": "beginner",
          "id": "proj_fossology_2021_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5701142176071680/",
          "proposal_id": null,
          "short_description": "FOSSology frontend is built using the Symfony framework of PHP. It needs to get revamped to make it faster for development, more adaptive to newer...",
          "slug": "adding-react-library-to-new-ui",
          "status": "completed",
          "student_name": "Aman Dwivedi",
          "student_profile": null,
          "tags": [
            "react",
            "api",
            "ai",
            "ui",
            "frontend"
          ],
          "title": "Adding React library to new UI"
        },
        {
          "code_url": "https://github.com/Kaushl2208/GSoC2021",
          "description": "<p>Fossology's copyright detection agent uses a rule-based approach to detect copyright statements but the agent is showing a lot of False Positives result. The way proposed to get better accuracy and results is by using ML techniques it. The most likely way is using NLP for data pre-processing and then making a Knowledge Base Relation corpus on top of which we can apply different ML algorithms and can improve up the accuracy. Applying checks on a different level and limiting down a statement to only the part where only the copyright statement is present will definitely help in reducing the False Positives.</p>\n",
          "difficulty": null,
          "id": "proj_fossology_2021_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5092933132353536/",
          "proposal_id": null,
          "short_description": "Fossology's copyright detection agent uses a rule-based approach to detect copyright statements but the agent is showing a lot of False Positives...",
          "slug": "copyright-false-positive-detection-using-ml",
          "status": "completed",
          "student_name": "Kaushlendra Pratap Singh",
          "student_profile": null,
          "tags": [
            "ml"
          ],
          "title": "Copyright False Positive Detection Using ML"
        },
        {
          "code_url": "https://github.com/SinghShreya05/GSoC-2021",
          "description": "<ol>\n<li>Dynamic Time Warping (DTW) will be included as one of the agents in similarity matching.</li>\n<li>NLP Library - SpaCy will be used in various agents for better text pre-processing.</li>\n<li>New Datasets of SPDX OSS will be created using string generation through regex. Lexicographically relevant and Dynamic Time Warping (DTW) matching will be used as a criteria to selection of relevant newly generated datasets.</li>\n<li>Differentiating License Headers from Full Text.</li>\n<li>Shifting from txt files to JSON endpoint by developing an API.</li>\n<li>The existing infrastructure of Atarashi will be made up to date with better code coverage and reusability of the features.</li>\n<li>Testing and Evaluation will be done at frequent intervals to provide better test coverage.</li>\n<li>Atarashi’s documentation will be updated at frequent intervals. It will be made up to date for easier installation and usage by providing detailed description and examples.</li>\n</ol>\n",
          "difficulty": null,
          "id": "proj_fossology_2021_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5342410434936832/",
          "proposal_id": null,
          "short_description": "Dynamic Time Warping (DTW) will be included as one of the agents in similarity matching.\nNLP Library - SpaCy will be used in various agents for...",
          "slug": "atarashi-minerva",
          "status": "completed",
          "student_name": "sayshreya",
          "student_profile": null,
          "tags": [
            "api",
            "ai"
          ],
          "title": "ATARASHI - MINERVA"
        },
        {
          "code_url": "https://github.com/OmarAbdelSamea/fossology/wiki",
          "description": "<p>FOSSology is designed in modular fashion but it certainly does not follow micro-service architecture. If there is a change in an agent's logic, the whole source code has to be built again and installed. Whereas in micro-service architecture, only this agent needs to be built and installed/deployed.</p>\n<p>Current Draw backs of installing FOSSology in cluster mode</p>\n<ul>\n<li>When adding or removing a node, scheduler needs to be restarted.</li>\n<li>Every node needs to have same set of agents.</li>\n<li>Because of the current version check mechanism on scheduler, for a single change, the whole code base needs to be redeployed to get new version string.</li>\n</ul>\n<h4>Project Goal</h4>\n<ul>\n<li>Ability to add one agent to each node for easier updating and scaling.</li>\n<li>Dynamically adding new nodes without the need to restart or stop the scheduler</li>\n<li>Kubernetes deployment for easy scaling in or out</li>\n</ul>\n",
          "difficulty": "beginner",
          "id": "proj_fossology_2021_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/4661860250419200/",
          "proposal_id": null,
          "short_description": "FOSSology is designed in modular fashion but it certainly does not follow micro-service architecture. If there is a change in an agent's logic, the...",
          "slug": "making-fossology-architecture-microservice-friendly",
          "status": "completed",
          "student_name": "Omar  AbdelSamea",
          "student_profile": null,
          "tags": [
            "ai",
            "kubernetes",
            "ui"
          ],
          "title": "Making FOSSology architecture microservice friendly"
        },
        {
          "code_url": "https://itssingh.github.io/gsoc-blog/final-evaluation.html",
          "description": "<p>Project Information\nNomos and Monk are the two leading scanners FOSSology uses for license detection and Copyright for scanning copyright,url,emails and holders name. FOSSology approach is to detect licenses with either a large (large: 2500 regexes) dataset of regex patterns (nomos) or a full string comparison against license full texts (large: ~400 text) (monk). Atarashi license scanner implements multiple text statistics and information retrieval algorithms. \nScanCode Toolkit is a very established license scanner similar to Nomos or Monk. It is a simple python based command line scanner that runs on Windows, Linux, and Mac. It implements a number of different approaches and integrates these into one application for identifying and classifying license relevant content in packages.\nThe basic idea is to use the command line interface from the ScanCode package in order to be called right from the FOSSology application. FOSSology will pass a single file and take the result from the ScanCode command line call. Scan result will include license name, the SPDX key, Score, Copyright and Holder name, Emails and Urls present in the given code and as per requested by the user.</p>\n",
          "difficulty": null,
          "id": "proj_fossology_2021_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/4682906395475968/",
          "proposal_id": null,
          "short_description": "Project Information\nNomos and Monk are the two leading scanners FOSSology uses for license detection and Copyright for scanning copyright,url,emails...",
          "slug": "integrating-scancode-toolkit",
          "status": "completed",
          "student_name": "Sarita Singh",
          "student_profile": null,
          "tags": [
            "python",
            "ai",
            "ux"
          ],
          "title": "Integrating ScanCode Toolkit"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2021/organizations/5641437164601344/"
    },
    "year_2022": {
      "num_projects": 6,
      "projects": [
        {
          "code_url": "https://medium.com/@rohit-pandey/gsoc-2022-final-report-bf1e34440bce",
          "description": "Copyright and licensing is difficult, especially when reusing software from different projects that are released under various different licenses. REUSE make it easier for us to declare the licenses under which our works are released, but they also make it easier for a computer to understand how your project is licensed.\n\nFOSSology currently uses old methods of defining licenses on source files. Following the REUSE specs, the code base of FOSSology should be updated with new licensing format",
          "difficulty": null,
          "id": "proj_fossology_2022_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/xyZ7I14N/",
          "proposal_id": null,
          "short_description": "Copyright and licensing is difficult, especially when reusing software from different projects that are released under various different licenses....",
          "slug": "adopting-reuse-standards-in-fossology",
          "status": "completed",
          "student_name": "Rohit_Pandey",
          "student_profile": null,
          "tags": [],
          "title": "Adopting REUSE standards in FOSSology"
        },
        {
          "code_url": "https://github.com/soham4abc/GSOC22",
          "description": "Working on to improve the current UI of the FOSSology project and bring it to completion. Fixing the known issues of the REST API and exposing new API endpoints to the frontend in order to introduce more functionality. Also adding API docs using SwaggerUI for better API testing and implementing them to the frontend.",
          "difficulty": null,
          "id": "proj_fossology_2022_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/NMgsk1bT/",
          "proposal_id": null,
          "short_description": "Working on to improve the current UI of the FOSSology project and bring it to completion. Fixing the known issues of the REST API and exposing new...",
          "slug": "fossologyui-overhaul-and-rest-api-improvements",
          "status": "completed",
          "student_name": "Soham Banerjee",
          "student_profile": null,
          "tags": [
            "api",
            "ui",
            "frontend"
          ],
          "title": "FossologyUI Overhaul and  REST API Improvements"
        },
        {
          "code_url": "https://gist.github.com/krishna9304/3571728fa42a2a1e4b1d2938cd5eed4e",
          "description": "The goal is to take the FOSSologyUI project to completion and finally sync all the features with the fossology old UI. There would also be introduction of new API endpoints as per requirement. Post the development phase, a migration of build tool from webpack to vite is planned, that will enhance the quality of the project and increase the efficiency in many ways. As the size of the application will grow, making everything of industry grade, so that it's easier to scale in the future would be the primary aim of this proposal.",
          "difficulty": null,
          "id": "proj_fossology_2022_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/o03BpJn1/",
          "proposal_id": null,
          "short_description": "The goal is to take the FOSSologyUI project to completion and finally sync all the features with the fossology old UI. There would also be...",
          "slug": "rest-api-and-ui-improvements-for-fossologyui",
          "status": "completed",
          "student_name": "krishna9304",
          "student_profile": null,
          "tags": [
            "web",
            "api",
            "ai",
            "ui"
          ],
          "title": "REST API and UI improvements for FOSSologyUI"
        },
        {
          "code_url": "https://github.com/its-sushant/GSoC-22",
          "description": "To implement some of machine/deep learning models on Minerva OSS Dataset from FOSSology and integrate it to atarashi as an agent. Models that are going to be used are logistic regression, LSVM, Naive baiyes, doc2vec for semantic similarity and bert model using fine-tuning.",
          "difficulty": null,
          "id": "proj_fossology_2022_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/gsITMRsG/",
          "proposal_id": null,
          "short_description": "To implement some of machine/deep learning models on Minerva OSS Dataset from FOSSology and integrate it to atarashi as an agent. Models that are...",
          "slug": "improve-minerva-oss-dataset-and-implement-models-for-atarashi",
          "status": "completed",
          "student_name": "Sushant Kumar",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Improve  Minerva  OSS  Dataset  and implement models for Atarashi"
        },
        {
          "code_url": "https://github.com/dushimsam/GSoC-22",
          "description": "Ideation and implementation of  the new design patterns and features to be added to the FOSSology system. Fix bugs of the existing APIs which are not operating as intended , exposition and integration of the more APIs for the new  features.",
          "difficulty": null,
          "id": "proj_fossology_2022_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/GeYAxA7Q/",
          "proposal_id": null,
          "short_description": "Ideation and implementation of the new design patterns and features to be added to the FOSSology system. Fix bugs of the existing APIs which are not...",
          "slug": "rest-api-and-ui-improvements",
          "status": "completed",
          "student_name": "DUSHIMIMANA Samuel",
          "student_profile": null,
          "tags": [
            "api",
            "ui"
          ],
          "title": "REST API and UI improvements"
        },
        {
          "code_url": "https://fossology.github.io/gsoc/docs/2022/project/",
          "description": "I would like to participate in the project “Introduce concept of project in FOSSology” which can be founded in the idea list.\nThe “project” is defined by:\n1.\ta project ID (as primary key)\n2.\ta project name\n3.\ta root folder in Fossology\n4.\tone or more Group IDs and associated access.\n5.\ta URL / ID / Free field to link the project to an external tool\nThe “project” concept is put by Nicolas Toussaint in the issue https://github.com/fossology/fossology/issues/1738.  As described, it could be useful in many ways, such as gathering multiple uploads under the same umbrella, and making bulk changes to all uploads / sub-directories that belong to a given project.\nThis project is like a web project. I need to modify both back-end logic and front-end pages. And the product of this project will be a new-version website that could support the operations on “project” level.",
          "difficulty": null,
          "id": "proj_fossology_2022_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/lfS6IRrZ/",
          "proposal_id": null,
          "short_description": "I would like to participate in the project “Introduce concept of project in FOSSology” which can be founded in the idea list. The “project” is...",
          "slug": "introduce-concept-of-project-in-fossology",
          "status": "completed",
          "student_name": "fwhdzh",
          "student_profile": null,
          "tags": [
            "web",
            "ai"
          ],
          "title": "Introduce concept of project in FOSSology"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2022/organizations/fossology/"
    },
    "year_2023": {
      "num_projects": 5,
      "projects": [
        {
          "code_url": "https://github.com/Hero2323/GSoC-2023",
          "description": "This project’s goal is to improve the accuracy of Fossology’s copyright\ndetection system using machine learning. This functionality was originally\nimplemented in 2021 to improve the two-step process of copyright\ndetection used by most copyright detection software; using Regex and then\nhuman intervention.\n\nThe machine learning approach uses Named Entity Recognition (NER) and\nPart of Speech (POS) tagging to figure out which statements contain\ncopyright and which do not.\n\nI’ll be working on improving all parts of the project; starting from the\ndataset & preprocessing, then working my way to the NER hypothesis until\nthe machine learning model used and the final integration.",
          "difficulty": null,
          "id": "proj_fossology_2023_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/bAs5hkHh",
          "proposal_id": "iIc51ji6",
          "short_description": "This project’s goal is to improve the accuracy of Fossology’s copyright detection system using machine learning. This functionality was originally...",
          "slug": "reducing-fossologys-false-positive-copyrights",
          "status": "completed",
          "student_name": "Abdelrahman Jamal",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Reducing Fossology's false positive copyrights"
        },
        {
          "code_url": "https://github.com/dushimsam/GSoC-23",
          "description": "Fossology is focusing on the development of a new UI framework, which requires adequate support from REST APIs. However, the current state of available APIs in the Slim framework is insufficient to meet the needs of the project. There's still a need to enhance the existing APIs and add new ones to ensure sufficient support for the development of the new UI framework.\n\nThe solution involves fixing the issues with the current REST APIs and improving the parameters and result object of the existing REST APIs. This will be done by going through each module and making sure that the required API for each component is available, tested and exposed for the frontend's consumption.",
          "difficulty": null,
          "id": "proj_fossology_2023_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/lGWKqBe6",
          "proposal_id": "SZrqWUic",
          "short_description": "Fossology is focusing on the development of a new UI framework, which requires adequate support from REST APIs. However, the current state of...",
          "slug": "rest-api-improvements",
          "status": "completed",
          "student_name": "DUSHIMIMANA Samuel",
          "student_profile": null,
          "tags": [
            "api",
            "ai",
            "ui",
            "frontend"
          ],
          "title": "REST API improvements"
        },
        {
          "code_url": "https://fossology.github.io/gsoc/docs/2023/laas/finalevaluation",
          "description": "It provides a convenient and effective way for organizations to manage their use of open-source licenses. With the growing popularity of open-source software, organizations are finding it more difficult to keep track of the various licenses and terms under which they are permitted to use open-source components. Open-source licenses can be complicated, making it difficult to understand how they apply to a specific piece of software or interact with other licenses. It can be used for various purposes by organizations like FOSSology and SW360 like license identification, filtering, and managing licenses.",
          "difficulty": null,
          "id": "proj_fossology_2023_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/g9Oh9JTt",
          "proposal_id": "Vf9kchQy",
          "short_description": "It provides a convenient and effective way for organizations to manage their use of open-source licenses. With the growing popularity of open-source...",
          "slug": "license-as-a-service",
          "status": "completed",
          "student_name": "K-vya",
          "student_profile": null,
          "tags": [],
          "title": "License as a Service"
        },
        {
          "code_url": "https://github.com/soham4abc/GSOC23",
          "description": "Developing the remaining REST APIs that are required to expose the database for the new FossologyUI. This proposal also focuses on implementing test cases for the existing and upcoming APIs for the Fossology server.",
          "difficulty": null,
          "id": "proj_fossology_2023_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/7bIMZdQi",
          "proposal_id": "CmoYmlQb",
          "short_description": "Developing the remaining REST APIs that are required to expose the database for the new FossologyUI. This proposal also focuses on implementing test...",
          "slug": "rest-api-completion-and-improvement",
          "status": "completed",
          "student_name": "Soham Banerjee",
          "student_profile": null,
          "tags": [
            "api",
            "ai",
            "database",
            "ui"
          ],
          "title": "REST API Completion and improvement"
        },
        {
          "code_url": "https://github.com/its-sushant/GSoC-23",
          "description": "Currently, FOSSology generates SBOM in SPDX format, which allows for integration with various tools. However, CycloneDX is another popular format for generating SBOMs. By integrating CycloneDX report generation in FOSSology, it will be possible to work with other tools that use CycloneDX. Although a PHP library exists for generating CycloneDX reports, it cannot be used because it is licensed under Apache-2.0, while FOSSology is under GPL-2.0. Therefore, a custom implementation of CycloneDX report generation in FOSSology is necessary. So the main goal of this project focuses on the implementation of CycloneDX report generation in FOSSology.",
          "difficulty": null,
          "id": "proj_fossology_2023_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/DrUld2iF",
          "proposal_id": "UvFIIyn5",
          "short_description": "Currently, FOSSology generates SBOM in SPDX format, which allows for integration with various tools. However, CycloneDX is another popular format for...",
          "slug": "support-cyclonedx-report",
          "status": "completed",
          "student_name": "Sushant Kumar",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Support CycloneDX report"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2023/organizations/fossology"
    },
    "year_2024": {
      "num_projects": 7,
      "projects": [
        {
          "code_url": "https://github.com/abhi-kumar17871/GSoC-24",
          "description": "Incorporating SPDX v3.0 compatibility and broadening support for Core, Software, and Licensing profiles, along with the ability to generate reports in diverse formats like JSON, my aim is to significantly enhance the system's functionality. This ensures alignment with current industry standards, facilitating improved usability and accessibility for users seeking SPDX compliance solutions. Ultimately, it empowers organizations to efficiently manage open-source licensing obligations and streamline compliance processes.",
          "difficulty": null,
          "id": "proj_fossology_2024_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/5T0iub0X/",
          "proposal_id": null,
          "short_description": "Incorporating SPDX v3.0 compatibility and broadening support for Core, Software, and Licensing profiles, along with the ability to generate reports...",
          "slug": "support-spdx-30-reports",
          "status": "completed",
          "student_name": "Abhishek_Kumar011",
          "student_profile": null,
          "tags": [
            "ml",
            "ai"
          ],
          "title": "Support SPDX 3.0 Reports"
        },
        {
          "code_url": "https://github.com/valens200/GSoC-2024",
          "description": "This proposal aims to address the need for improving and upgrading APIs on FOSSology to version 2 by identifying areas for enhancement, fixing issues, and ensuring that clients using V1 aren't affected.\n\nTo solve this, There are three main objectives to focus on. First, enhancing existing APIs by adding missing features for comprehensive implementation. Second, upgrading REST APIs to version 2, fixing bugs, and adopting new design patterns for efficient functionality. Additionally, any new endpoints added will adhere to Version 2 standards.\n\nMy plan includes quality assurance measures, such as unit and integration testing, to ensure all requirements are met satisfactorily. Overall, my goal is to improve the usability and effectiveness of FOSSology's APIs for a better user experience.",
          "difficulty": null,
          "id": "proj_fossology_2024_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/0oTx6AYV/",
          "proposal_id": null,
          "short_description": "This proposal aims to address the need for improving and upgrading APIs on FOSSology to version 2 by identifying areas for enhancement, fixing...",
          "slug": "rest-api-improvements",
          "status": "completed",
          "student_name": "NIYONSENGA Valens",
          "student_profile": null,
          "tags": [
            "api",
            "ai",
            "ui"
          ],
          "title": "REST API Improvements."
        },
        {
          "code_url": "https://github.com/dvjsharma/GSoC-24",
          "description": "In recent years, FOSSology's REST APIs have expanded significantly, enhancing user accessibility, flexibility, and automation. However, the development is not yet complete, prompting some users to resort to mocking WebUI access solely for information retrieval. With the development of FOSSology's new React UI also underway, robust support for REST APIs becomes imperative. This project aims to finalise the development of FOSSology's REST API by exposing any remaining endpoints, enhancing and upgrading existing ones to V2, increasing test coverage, and improving documentation. The approach involves a comprehensive review of each module to ensure the availability and exposure of required APIs for frontend consumption. These efforts will streamline development workflows, enhancing the overall usability of the FOSSology platform and facilitating the development of the new React UI.",
          "difficulty": null,
          "id": "proj_fossology_2024_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/mRBxa9jt/",
          "proposal_id": null,
          "short_description": "In recent years, FOSSology's REST APIs have expanded significantly, enhancing user accessibility, flexibility, and automation. However, the...",
          "slug": "rest-api-improvements",
          "status": "completed",
          "student_name": "Divij Sharma",
          "student_profile": null,
          "tags": [
            "react",
            "web",
            "api",
            "ml",
            "ai"
          ],
          "title": "REST API Improvements"
        },
        {
          "code_url": "https://docs.google.com/document/d/1xBVwKjn3AjuAp8EqPfiISVr9gSHiUUfbc-2Ux7muKe4/edit?usp=sharing",
          "description": "To address the challenges identified with the FOSSology scheduler, particularly the limitations stemming from its programming language (C) and its linear queue design, proposed idea is to refactor current scheduler codebase in python and integrating Rocketry to create a more flexible, maintainable, and feature-rich scheduler.  \n\n1. Task Scheduling: Implement task scheduling with rocketry, utilizing its cron-style syntax for defining job frequencies. This allows for precise control over when jobs are executed, aligning with FOSSology's existing scheduling requirements.\n\n2. Mutual Exclusivity and Concurrency: Define tasks with mutual exclusivity constraints directly within Rocketry, ensuring that jobs which should not run concurrently are handled appropriately. Utilize Rocketry's support for asynchronous execution to improve the scheduler's efficiency and responsiveness.\n\n3. Error Handling and Logging: Built-in error handling and logging mechanisms to ensure that job failures are captured accurately, and relevant information is logged for debugging purposes.",
          "difficulty": null,
          "id": "proj_fossology_2024_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/FKEKsiP4/",
          "proposal_id": null,
          "short_description": "To address the challenges identified with the FOSSology scheduler, particularly the limitations stemming from its programming language (C) and its...",
          "slug": "overhauling-scheduler-design",
          "status": "completed",
          "student_name": "Aaditya Singh",
          "student_profile": null,
          "tags": [
            "python",
            "ai",
            "ui"
          ],
          "title": "OVERHAULING SCHEDULER DESIGN"
        },
        {
          "code_url": "https://github.com/Akashsah2003/GSoC-24",
          "description": "This project aims to support the detection and reporting of SPDX License Expressions. Currently, FOSSology uses regular expressions, full-text match, and fuzzy match to scan licenses, stores all types of license expressions as a list of licenses, and wrongly classifies them as conjunctive licenses or disjunctive licenses. It also stores license exceptions as licenses and does not differentiate exceptions from licenses.\n\nIn the project, I will be working on scanning license expressions using regular expressions with Ojo, storing them in the database, creating UI components to see license expressions in the file clearing page, and finally updating reports to export the expressions in the correct format.",
          "difficulty": null,
          "id": "proj_fossology_2024_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/3TCAw8EI/",
          "proposal_id": null,
          "short_description": "This project aims to support the detection and reporting of SPDX License Expressions. Currently, FOSSology uses regular expressions, full-text match,...",
          "slug": "spdx-license-expression-support",
          "status": "completed",
          "student_name": "Akash Sah",
          "student_profile": null,
          "tags": [
            "ai",
            "database",
            "ui"
          ],
          "title": "SPDX license expression support"
        },
        {
          "code_url": "https://github.com/Hero2323/GSoC-24",
          "description": "One of Fossology's primary features is extracting licenses and license text from files. Traditional methods like text comparison, regular expressions, and SPDX identifiers can result in false positives, often requiring human review.\n\nThis project aims to leverage recent advancements in Large Language Models (LLMs). LLMs can process text at a near-human level or beyond.  In the domain of copyrights and licenses, models like Gemini-Pro, ChatGPT-3.5, and GPT4  have demonstrated exceptional accuracy in recognizing and converting licenses into formats like SPDX.\n\nResearch across various fields, including medicine and coding, indicates that smaller, domain specific LLMs can outperform larger, general-purpose models in their respective areas.\n\nFor this project, we'll fine-tune a relatively small LLM with parameters in the 2-7 billion range for optimal performance in license identification and other applications. Potential models include gemma (2B or 7B), Mistral (7B variant), LLaMA-2 (7B), phi-2 (2.7B) and others.\n\nThis project involves selecting the best-suited model, utilizing existing datasets for fine-tuning, experimenting with different fine-tuning techniques based on data and computational resources, and finally, deploying the refined model.",
          "difficulty": null,
          "id": "proj_fossology_2024_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/6RIfpdn6/",
          "proposal_id": null,
          "short_description": "One of Fossology's primary features is extracting licenses and license text from files. Traditional methods like text comparison, regular...",
          "slug": "ai-powered-software-license-identification",
          "status": "completed",
          "student_name": "Abdelrahman Jamal",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "AI-Powered Software License Identification"
        },
        {
          "code_url": "https://rajuljha.github.io/posts/gsoc-24-project-report/",
          "description": "To be able to easily and continuously scan packages with fossology checks in CI pipelines, a docker image (fossology/fossology:scanner) capable of running license checks (using nomos or ojo) and keyword and copyright scans is available.\n\nThe motivation for this proposal is to improve the CI Scanner Image in various aspects and numerous quality of life improvements, like highlighting the exact location of violation, ability to customize the keywords used by the scanner, and improving user experience – allow whitelisting from a custom location and ability to download and scan dependencies.\n\nThe major goals of the project are:\n1. Ability to highlight the exact location (line number) of a violation during reporting\n2. Allow users to customize keyword scanning using their own keyword.conf\n3. Allow users to store allowlist.json  file elsewhere (currently, it is required to be present at the root of the project)\n4. Allow users to download and scan dependencies by providing a path at CI/CD pipeline trigger.",
          "difficulty": null,
          "id": "proj_fossology_2024_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/by86kI7T/",
          "proposal_id": null,
          "short_description": "To be able to easily and continuously scan packages with fossology checks in CI pipelines, a docker image (fossology/fossology:scanner) capable of...",
          "slug": "improving-fossology-ci-scanner",
          "status": "completed",
          "student_name": "Rajul Jha",
          "student_profile": null,
          "tags": [
            "ai",
            "docker",
            "ui"
          ],
          "title": "Improving Fossology CI Scanner"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2024/organizations/fossology/"
    },
    "year_2025": {
      "num_projects": 10,
      "projects": [
        {
          "code_url": null,
          "description": "This project aims to improve the Debian packaging process for FOSSology, an open-source license compliance tool. Currently, FOSSology relies on CPack for packaging, which has limitations in flexibility and Debian policy compliance. This proposal suggests transitioning to Debian's native packaging tools (dpkg, debhelper, and lintian), automating the build process, and integrating continuous integration (CI) for better package management. Deliverables include structured Debian packages, automated build scripts, CI pipelines, and detailed documentation to facilitate future maintenance. This work will make FOSSology more accessible, easier to install, and compliant with Debian standards, benefiting system administrators and developers.",
          "difficulty": null,
          "id": "proj_fossology_2025_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/x53xJCC2",
          "proposal_id": "MxWGJCxd",
          "short_description": "This project aims to improve the Debian packaging process for FOSSology, an open-source license compliance tool. Currently, FOSSology relies on CPack...",
          "slug": "enhancing-debian-packaging-for-fossology",
          "status": "in-progress",
          "student_name": "Ahmed-Gamal",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Enhancing Debian Packaging for FOSSology"
        },
        {
          "code_url": null,
          "description": "Currently in Safaa Project data was manually curated And we see that most of the things are manual here. This project will concentrate on creating a pipeline, Scripts to copy copyright data automatically from fossology instance to train the model, Utilizing LLMS and deep learning techniques to increase the accuracy of our output.",
          "difficulty": null,
          "id": "proj_fossology_2025_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/mlPA9FVj",
          "proposal_id": "alfVXho5",
          "short_description": "Currently in Safaa Project data was manually curated And we see that most of the things are manual here. This project will concentrate on creating a...",
          "slug": "data-pipeline-for-safaa",
          "status": "in-progress",
          "student_name": "Anuk",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Data Pipeline For Safaa"
        },
        {
          "code_url": null,
          "description": "The goal of this project is to enhance the LicenseDB platform by integrating several important features including advanced database migrations, support for refresh tokens, and a notification system to notify users when a license is updated. In addition, it will require setting up a clean backend and fronted monorepo for simplified development. The improvements will ensure the platform is better, reliable, scalable, and more user-friendly.",
          "difficulty": "advanced",
          "id": "proj_fossology_2025_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/vphnpwAh",
          "proposal_id": "bMxldsPE",
          "short_description": "The goal of this project is to enhance the LicenseDB platform by integrating several important features including advanced database migrations,...",
          "slug": "licensedb-platform-improvements",
          "status": "in-progress",
          "student_name": "Chayan_Das",
          "student_profile": null,
          "tags": [
            "database",
            "ui",
            "backend"
          ],
          "title": "LicenseDB Platform Improvements"
        },
        {
          "code_url": null,
          "description": "This project aims to redesign the FOSSology interface with a user-centered design approach that enhances usability and accessibility. The redesign will focus on improving the navigation, making it easier for users to find what they need and complete tasks more efficiently. Enhancing visual hierarchy, and ensuring consistent formatting, we will create a more intuitive experience. A scalable, reusable design system will be developed to ensure that the platform can grow and evolve in the future. Iterative testing and user feedback will guide the design process, ensuring that the final result meets user expectations and improves their overall experience with FOSSology.",
          "difficulty": null,
          "id": "proj_fossology_2025_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/gX6omKmk",
          "proposal_id": "vZGiEH2T",
          "short_description": "This project aims to redesign the FOSSology interface with a user-centered design approach that enhances usability and accessibility. The redesign...",
          "slug": "fossology-ux-and-ui-redesign",
          "status": "in-progress",
          "student_name": "Devanshi Sachan",
          "student_profile": null,
          "tags": [
            "ai",
            "ui",
            "ux"
          ],
          "title": "FOSSology UX and UI Redesign"
        },
        {
          "code_url": null,
          "description": "Standard license scanning tools often overlook custom or organization-specific texts, leaving critical gaps in compliance. This project enhances FOSSology by upgrading the MONK BULK agent to detect custom text phrases. Users will be able to define these phrases through the UI, store them in the database, and perform bulk scans to identify exact matches in uploaded files. This extension not only strengthens FOSSology’s scanning capabilities but also improves UI and database efficiency for seamless retrieval. With thorough testing for accuracy and scalability, this upgrade will make FOSSology an even more powerful and adaptable license compliance tool.\n\nDeliverables for this project:\n1.) Creating a User Interface for Text and Bulk Phrases Management\n2.) Supporting Text Phrases Scanning\n3.) Implementing Bulk Phrases Scanning\n4.) Enhancing MONK Agent Functionality\n5.) Documentation",
          "difficulty": null,
          "id": "proj_fossology_2025_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/897MRrjD",
          "proposal_id": "Y9Llh838",
          "short_description": "Standard license scanning tools often overlook custom or organization-specific texts, leaving critical gaps in compliance. This project enhances...",
          "slug": "support-text-phrases-and-bulk-based-scanning-for-monk-a-like-agent",
          "status": "in-progress",
          "student_name": "Harshit Gandhi",
          "student_profile": null,
          "tags": [
            "ml",
            "database",
            "ui"
          ],
          "title": "Support text phrases and bulk based scanning for MONK a like agent"
        },
        {
          "code_url": null,
          "description": "This project aims to complete the microservices infrastructure for FOSSology by continuing the work from GSoC 2021, with a goal to fully deploy FOSSology on Kubernetes. Over the past few years, multiple changes have been made to the codebase and the build system, requiring updates and integration strategies. \n\nKey deliverables include:\n- Reviewing and aligning the legacy GSoC Kubernetes setup with the current codebase\n- Completing pending work from pull request #2086\n- Providing a fully working FOSSology Kubernetes deployment\n- Creating comprehensive documentation for Kubernetes setup\n- (Stretch Goals): Creating a single setup script, implementing health checks, and exposing usage/performance metrics\n\nThis project ensures easier deployment, better scalability, and modern DevOps practices for FOSSology’s infrastructure.",
          "difficulty": null,
          "id": "proj_fossology_2025_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/MjOyiOj7",
          "proposal_id": "7DYrZrbk",
          "short_description": "This project aims to complete the microservices infrastructure for FOSSology by continuing the work from GSoC 2021, with a goal to fully deploy...",
          "slug": "complete-microservices-infrastructure-for-fossology",
          "status": "in-progress",
          "student_name": "M.Salman",
          "student_profile": null,
          "tags": [
            "ai",
            "kubernetes",
            "ui"
          ],
          "title": "Complete microservices  infrastructure for  FOSSology"
        },
        {
          "code_url": null,
          "description": "The OSS Review Toolkit (ORT) is a robust solution designed to identify and analyze the dependencies within a software project. FOSSology, on the other hand, is a specialized tool for scanning source code to detect software licenses. This project aims to integrate FOSSology, a robust license scanning tool, into the OSS Review Toolkit (ORT), which analyzes project dependencies. By building a scanner plugin within ORT, users will have the option to utilize FOSSology’s capabilities directly in ORT workflows. The integration will involve sending SPDX data to FOSSology, retrieving scan results, and presenting them alongside ORT’s output, enhancing license compliance checks through a unified toolchain.",
          "difficulty": null,
          "id": "proj_fossology_2025_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/zaei2pGq",
          "proposal_id": "qqwc7aXM",
          "short_description": "The OSS Review Toolkit (ORT) is a robust solution designed to identify and analyze the dependencies within a software project. FOSSology, on the...",
          "slug": "integrating-oss-review-toolkit-with-fossology",
          "status": "in-progress",
          "student_name": "Prakash Mishra",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Integrating OSS Review Toolkit with FOSSology"
        },
        {
          "code_url": null,
          "description": "Atarashi is a modern, information-retrieval-based license scanner. Unlike traditional rule-based approaches, Atarashi leverages statistical techniques such as TF-IDF, cosine similarity, Damerau Levenshtein distance and N-gram distance to detect licenses in source code files. While the system achieves good accuracy (approximately 80%), there is still scope for improvement.\nThis proposal aims to enhance Atarashi’s accuracy and robustness by integrating a keyword-based pre-filtering model, improving the existing classifier, and adding fallback mechanisms for ambiguous license predictions. Apart from that, from a previous initiative we have a Minerva, which is an augmented license dataset which can be used to train ML Models for licence identification. The goal is not only to refine license identification but also to integrate the work seamlessly into the current open pull request (#1634) and ensure its successful merging into the main FOSSology codebase.",
          "difficulty": null,
          "id": "proj_fossology_2025_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/Lbnvb90g",
          "proposal_id": "uS1bUq0O",
          "short_description": "Atarashi is a modern, information-retrieval-based license scanner. Unlike traditional rule-based approaches, Atarashi leverages statistical...",
          "slug": "enhance-atarashis-ability",
          "status": "in-progress",
          "student_name": "Rajul Jha",
          "student_profile": null,
          "tags": [
            "ml",
            "ai"
          ],
          "title": "Enhance Atarashi's ability"
        },
        {
          "code_url": null,
          "description": "This project aims to complete and modernize the React-based UI of FOSSology by aligning it with the updated REST API v2 and current frontend best practices. The work includes finalizing the incomplete interface, upgrading React to 19.1.0 for improved performance and concurrency, and migrating from yarn to pnpm for faster, space-efficient development. It will also implement UX improvements from the  FOSSology UX and UI redesign project and create a reusable component library with Storybook. Comprehensive documentation and deployment guidelines will be provided to ensure long-term maintainability and contributor onboarding.",
          "difficulty": null,
          "id": "proj_fossology_2025_009",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/QJCf0exh",
          "proposal_id": "zWU8PbfQ",
          "short_description": "This project aims to complete and modernize the React-based UI of FOSSology by aligning it with the updated REST API v2 and current frontend best...",
          "slug": "completion-of-ui-using-reactjs",
          "status": "in-progress",
          "student_name": "Tiyasa Kundu",
          "student_profile": null,
          "tags": [
            "react",
            "api",
            "ai",
            "ui",
            "ux"
          ],
          "title": "Completion of UI using React.js"
        },
        {
          "code_url": null,
          "description": "In this project, I am going to add improvements to FOSSology by making the Scancode integration faster and more stable using multithreading. I will also add a feature on the upload page that lets users select reports from OSSelot to reuse during analysis.Using the current spasht implementation to fetch the details of the folder from OSSelot. I will enhance the functionality of the existing Import Dump and Export Dump features to support reuse based on reports. Additionally, I will create a new page where users can easily contribute their FOSSology-generated reports back to the OSSelot project as GitHub pull requests. I will also write test cases to ensure the reliability of import/export functionality.",
          "difficulty": null,
          "id": "proj_fossology_2025_010",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/ER9UmRSf",
          "proposal_id": "MqOxPVht",
          "short_description": "In this project, I am going to add improvements to FOSSology by making the Scancode integration faster and more stable using multithreading. I will...",
          "slug": "reuse-of-clearing-decisions-using-reports-from-osselot-project",
          "status": "in-progress",
          "student_name": "Vaibhav_Sahu",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Reuse of clearing decisions using reports from OSSelot project."
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2025/organizations/fossology"
    }
  },
  "first_time": false,
  "contact": {
    "email": "fossology@fossology.org",
    "guide_url": null,
    "ideas_url": "https://fossology.github.io/gsoc/docs/2025/GSoC-projects",
    "irc_channel": "https://fossology.slack.com/",
    "mailing_list": "fossology-devel@fossology.org"
  },
  "social": {
    "blog": "https://fossology.org",
    "discord": null,
    "facebook": null,
    "github": null,
    "gitlab": null,
    "instagram": null,
    "linkedin": null,
    "mastodon": null,
    "medium": null,
    "reddit": null,
    "slack": "https://fossology.slack.com/",
    "stackoverflow": null,
    "twitch": null,
    "twitter": null,
    "youtube": null
  },
  "meta": {
    "version": 1,
    "generated_at": "2026-01-25T15:28:53.127Z"
  }
}