{
  "id": "692251d453dd9d7326d33daf",
  "slug": "free-and-open-source-silicon-foundation",
  "name": "Free and Open Source Silicon Foundation",
  "category": "Other",
  "description": "Working together for Free and Open Source Silicon",
  "image_url": "https://summerofcode.withgoogle.com/media/org/free-and-open-source-silicon-foundation/aie951otsp3xucok.png",
  "img_r2_url": "https://pub-268c3a1efc8b4f8a99115507a760ca14.r2.dev/free-and-open-source-silicon-foundation.webp",
  "logo_r2_url": null,
  "url": "https://www.fossi-foundation.org",
  "active_years": [
    2016,
    2017,
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "first_year": 2016,
  "last_year": 2025,
  "is_currently_active": true,
  "technologies": [
    "python",
    "javascript",
    "fpga",
    "compiler",
    "open hardware",
    "c",
    "verilog",
    "vhdl",
    "chisel",
    "synthesis",
    "risc-v",
    "web development",
    "jenkins",
    "c++"
  ],
  "topics": [
    "compilers",
    "debug",
    "embedded systems",
    "eda tools",
    "digital design",
    "web",
    "hardware",
    "open hardware",
    "debugging",
    "web community",
    "web services",
    "simulation",
    "electronic design tools",
    "fpga",
    "silicon",
    "eda"
  ],
  "total_projects": 60,
  "stats": {
    "avg_projects_per_appeared_year": 6,
    "projects_by_year": {
      "year_2016": 3,
      "year_2017": 4,
      "year_2018": 6,
      "year_2019": 7,
      "year_2020": 4,
      "year_2021": 11,
      "year_2022": 8,
      "year_2023": 5,
      "year_2024": 6,
      "year_2025": 6
    },
    "students_by_year": {
      "year_2016": 3,
      "year_2017": 4,
      "year_2018": 6,
      "year_2019": 7,
      "year_2020": 4,
      "year_2021": 11,
      "year_2022": 8,
      "year_2023": 5,
      "year_2024": 6,
      "year_2025": 6
    },
    "total_students": 58
  },
  "years": {
    "year_2016": {
      "num_projects": 3,
      "projects": [
        {
          "code_url": "https://github.com/dalmonian/qemu/commits/final-gsoc?author=dalmonian",
          "description": "<p>QEMU is a free and open virtual machine software that can be useful for the OpenRISC community for testing and teaching software development on the platform.</p>\n<p>The idea is to provide full support of the OpenRISC platform with some software already (the Linux operating system) and other devices, all running efficiently on the host system.</p>\n<p>Alongside with the software, documentation should be provided, to guide the community and (especially) beginners on how to use the platform to development and testing.</p>\n",
          "difficulty": "beginner",
          "id": "proj_free-and-open-source_2016_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5634130582700032/",
          "proposal_id": null,
          "short_description": "QEMU is a free and open virtual machine software that can be useful for the OpenRISC community for testing and teaching software development on the...",
          "slug": "qemu-port-of-openrisc",
          "status": "completed",
          "student_name": "Dalmon Ian",
          "student_profile": null,
          "tags": [
            "ui",
            "ux"
          ],
          "title": "QEMU port of OpenRISC"
        },
        {
          "code_url": "https://github.com/RishabhRawat/schematicGenerator/commits?author=RishabhRawat",
          "description": "<p>Schematics are a great way to understand electronic circuits, and specially when we are using high level descriptions, it becomes essential that we are able to portray what we have in mind. Automatic schematic generation will allow us to generate publication quality schematics directly from HDLs (verilog in this case).</p>\n<p>The objective is to take input a circuit desciption in json format (generated by yosys tools), and automagically create a schematic for it. The algorithm will run on the client side, so there will be no need to send data to server (thus no privacy concerns). Moreover interactivity with the generated circuit will allow it to be used as a great tool for learning circuits and HDL.</p>\n<p>I plan to implement the core algorithm as library which can be easily extended to work with a variety of cases like</p>\n<ul>\n<li>Combining it with simulators to perform interactive simulations</li>\n<li>Using it to create non-electronic schematics</li>\n</ul>\n",
          "difficulty": null,
          "id": "proj_free-and-open-source_2016_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5834884065001472/",
          "proposal_id": null,
          "short_description": "Schematics are a great way to understand electronic circuits, and specially when we are using high level descriptions, it becomes essential that we...",
          "slug": "yosys-tools-automatic-schematic-generation-for-web-browsers",
          "status": "completed",
          "student_name": "Rishabh Rawat",
          "student_profile": null,
          "tags": [
            "web",
            "ui"
          ],
          "title": "Yosys Tools: Automatic schematic generation for web browsers"
        },
        {
          "code_url": "https://github.com/eliaskousk/parallella-riscv",
          "description": "<p>With this proposal I hope to benefit the open-source hardware enthusiast community with work related to the incredible Parallela board used by thousands of students and hobbyists around the world.  This project will focus on the integration of the RISC-V rocket core, inside the Zynq FPGA device of Parallela. The RISC-V rocket core is an implementation of the RISV-V ISA that has gotten a lot of attention and support due to being clean, modular and power efficient. This project will allow owners of Parallela boards to write and execute RISC-V programs with minimal effort from their side. The system will work out of the box with a prebuilt binary image ready to be placed in an SD card and users will be able to re-build it with minimal effort. Moreover, a tutorial document will be created to aid inexperienced users make the most of this work and allow them to modify it for their own needs and purposes with custom hardware and / or software code.</p>\n",
          "difficulty": null,
          "id": "proj_free-and-open-source_2016_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/6309771351162880/",
          "proposal_id": null,
          "short_description": "With this proposal I hope to benefit the open-source hardware enthusiast community with work related to the incredible Parallela board used by...",
          "slug": "risc-v-port-to-parallela",
          "status": "completed",
          "student_name": "eliaskousk",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "RISC-V port to Parallela"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2016/organizations/5210550707421184/"
    },
    "year_2017": {
      "num_projects": 4,
      "projects": [
        {
          "code_url": "https://docs.google.com/document/d/e/2PACX-1vRV4cqkd5YSsOL3YfkgUP9jNG7DW7-_UgjQerCQCRFaiL9M8Yu6H15reaIEw5cxypOwSKXWs0eK3dX4/pub",
          "description": "<p>Open Tiled Manycore System-on-Chip (OpTiMSoC) is an open-source framework that allows one to design and prototype manycore-based platforms on FPGA devices. In its current status, OpTiMSoC offers wide support for experimenting different architectural-level configurations. However, when comes to benchmarking the prototyped platform at software-level, current runtime libraries and operating systems still have to be improved. To address this problem, the goal of this project is integrate OpenRISC Linux Port into OpTiMSoC. To do so, a new manycore configuration with a Host Tile will be designed and implemented. The Host Tile will run OpenRISC Linux and will be able to communicate with Gzll kernels running on Computing Tiles via message-passing through the Network-on-Chip (NoC). Overall, the communication infrastructure will be exported to user-level through standard UNIX file system operations.</p>\n",
          "difficulty": null,
          "id": "proj_free-and-open-source_2017_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6425216313982976/",
          "proposal_id": null,
          "short_description": "Open Tiled Manycore System-on-Chip (OpTiMSoC) is an open-source framework that allows one to design and prototype manycore-based platforms on FPGA...",
          "slug": "integration-of-openrisc-linux-port-into-optimsoc",
          "status": "completed",
          "student_name": "Pedro Henrique Penna",
          "student_profile": null,
          "tags": [
            "ux"
          ],
          "title": "Integration of OpenRISC Linux Port into OpTiMSoC"
        },
        {
          "code_url": "https://hatimak.me/notes/gsoc-final/",
          "description": "<p>Electronic Delay Storage Automatic Calculator (EDSAC) is a first generation British computer commissioned in 1949. It was built by Maurice Wilkes and his team at the University of Cambridge Mathematical Laboratory. EDSAC is the world’s first stored-program computer.</p>\n<p>The project’s goal is to reimagine the EDSAC on modern hardware, with the ultimate objective to make the historic computer accessible to and reproducible by a new generation of computer architects and engineers. Investigating the evolution of computing techniques gives architects and engineers context to modern concepts of computer architecture, organisation and design.</p>\n<p>The historic computer, complete with all its subsystems, will be replicated on an FPGA, using Verilog HDL, capable of accepting and executing all EDSAC Orders. To emulate the ancient I/O, various “I/O flavours” will be designed to interface with the FPGA board, via a standardised communication protocol. Users can choose, extend and even add new I/O flavours. An assembler utility will be built in Python, which users can utilise to debug and build their code for EDSAC, which can be then loaded onto the FPGA for execution.</p>\n",
          "difficulty": null,
          "id": "proj_free-and-open-source_2017_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6470218444439552/",
          "proposal_id": null,
          "short_description": "Electronic Delay Storage Automatic Calculator (EDSAC) is a first generation British computer commissioned in 1949. It was built by Maurice Wilkes and...",
          "slug": "edsac-museum-on-fpga",
          "status": "completed",
          "student_name": "hatim",
          "student_profile": null,
          "tags": [
            "python",
            "ui"
          ],
          "title": "EDSAC Museum on FPGA"
        },
        {
          "code_url": "https://amitosh.in/stories/2017/08/28/gsoc-2017-project-report/",
          "description": "<p><a href=\"https://www.librecores.org/\" target=\"_blank\">LibreCores.org</a> lists free and open source \"IP Cores\" on the website for the community to view and use. Currently the website extracts the project readme and license and renders them on the project page, along with links to the project homepage and git repository.</p>\n<p>A user browsing for cores on LibreCores will be interested to know the quality of the project’s code so as to determine how useful the project will be to them. A part of such information can be inferred from the project's source code repository and activity in issue trackers. Also, these metrics may be put to use in search ranking in the future.</p>\n<p>In this project I worked on collecting and visualizing metrics about project quality of projects listed on LibreCores.org. These metrics include the frequency of code commits, activity in issue trackers, code quality, presence of documentation in code and contributors to the project.</p>\n",
          "difficulty": null,
          "id": "proj_free-and-open-source_2017_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5363226728464384/",
          "proposal_id": null,
          "short_description": "LibreCores.org lists free and open source \"IP Cores\" on the website for the community to view and use. Currently the website extracts the project...",
          "slug": "quality-metrics-for-projects-listed-on-librecoresorg",
          "status": "completed",
          "student_name": "Amitosh Swain Mahapatra",
          "student_profile": null,
          "tags": [
            "web"
          ],
          "title": "Quality metrics for projects listed on LibreCores.org"
        },
        {
          "code_url": "https://gist.github.com/codelec/cb26f7e2184c12599178bb5b6585c805",
          "description": "<p>Update riscv-sodor currently implemented in Chisel2 to Chisel3 along with that also update Privilege ISA Spec it complies to from 1.7 to 1.10 and then later port sodor to an FPGA using an AXI wrapper eventually allowing others to use Sodor (a librecore) in their projects. Updating sodor an educational microarchitecture to latest tools and specifications would help teach/convey latest standards.</p>\n",
          "difficulty": null,
          "id": "proj_free-and-open-source_2017_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/4540415818596352/",
          "proposal_id": null,
          "short_description": "Update riscv-sodor currently implemented in Chisel2 to Chisel3 along with that also update Privilege ISA Spec it complies to from 1.7 to 1.10 and...",
          "slug": "updating-sodor",
          "status": "completed",
          "student_name": "kritik bhimani",
          "student_profile": null,
          "tags": [],
          "title": "Updating Sodor"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2017/organizations/5021512822161408/"
    },
    "year_2018": {
      "num_projects": 6,
      "projects": [
        {
          "code_url": "https://eahmedsalman.github.io/GSOC.html",
          "description": "<p>Transaction-Level Verilog (TL-Verilog) is an emerging language extension to System Verilog, Has the ability to define flexible reusable components. \nFor this project, will develop a library of compatible components such as FIFOs, queues, arbiters, elastic buffers, etc. that could form the basis of a new era of hardware design,And will demonstrate the ease of composing these components into sophisticated transaction flows and quickly implementing what are currently considered to be complex designs, such as a complete on-chip network!</p>\n",
          "difficulty": "advanced",
          "id": "proj_free-and-open-source_2018_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5041550052556800/",
          "proposal_id": null,
          "short_description": "Transaction-Level Verilog (TL-Verilog) is an emerging language extension to System Verilog, Has the ability to define flexible reusable components. ...",
          "slug": "develop-a-transaction-level-verilog-component-library",
          "status": "completed",
          "student_name": "Ahmed Salman",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "Develop a Transaction-Level Verilog Component Library"
        },
        {
          "code_url": "https://www.dsprelated.com/showarticle/1194.php",
          "description": "<p>Design and implementation of digital filters is essential for electronics engineers. Digital filter design in hardware usually is a two stage process; algorithm development in a language like Python, Matlab or Java and RTL design in a Hardware Description Language like VHDL or Verilog. myHDL is a Python module for developing, synthesizing and testing HDL code.  PyFDA is a GUI based tool in written in Python/Qt for analysing and designing discrete time filters.\nThis project aims to leverage and demonstrate the advantages of myHDL, PyFDA and python in general in the field of Digital Filter design.  Algorithm exploration, modeling, designing and simulating of digital filters can all be done in Python and PyFDA.\nThe project will focus on development and rigorous testing of digital filter designs and their integration with PyFDA. The algorithms for each type of filter will be chosen such that the hardware utilization is kept to a minimum.  Initially Systolic FIR filter and parallel path  IIR filter will be implemented. Later more complicated implementations of non-linear estimation filters will be explored. The filters will be rigorously tested and integrated with PyFDA.</p>\n",
          "difficulty": null,
          "id": "proj_free-and-open-source_2018_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5102733606518784/",
          "proposal_id": null,
          "short_description": "Design and implementation of digital filters is essential for electronics engineers. Digital filter design in hardware usually is a two stage...",
          "slug": "digital-filter-block-implementations-in-myhdl-and-pyfda-integration",
          "status": "completed",
          "student_name": "Sriyash Caculo",
          "student_profile": null,
          "tags": [
            "python",
            "java",
            "ai",
            "ui"
          ],
          "title": "Digital Filter Block Implementations in MyHDL and PyFDA Integration"
        },
        {
          "code_url": "https://www.sandipbhuyan.com/blog-content/13",
          "description": "<p>LibreCores.org lists free and open source “IP Cores” on the website for the community to view and use. All listed projects are backed by a git repository. Currently, LibreCores.org websites extract the project README and LICENSE and render them on the project page, along with links to the project homepage and git repository.</p>\n<p>A user browsing for cores on LibreCores will be interested search for a specific category of projects to determine which projects will come under which classification. A user may want to search for a project through a list of projects. The indexing of all the IP Cores and Improving the search experience in LibreCores in terms of discoverability. The IP Cores details will be classified and indexed for making search experience better and more efficient.</p>\n<p>This project aims to add classification system for better categorization of a project and to implement a search engine for a better searching experience of projects on LibreCores.org.</p>\n",
          "difficulty": null,
          "id": "proj_free-and-open-source_2018_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5385508481925120/",
          "proposal_id": null,
          "short_description": "LibreCores.org lists free and open source “IP Cores” on the website for the community to view and use. All listed projects are backed by a git...",
          "slug": "improve-the-librecoresorg-in-terms-of-discoverability",
          "status": "completed",
          "student_name": "Sandip Kumar Bhuyan",
          "student_profile": null,
          "tags": [
            "web",
            "ai"
          ],
          "title": "Improve the LibreCores.org in terms of discoverability"
        },
        {
          "code_url": "https://github.com/stevehoover/warp-v/commits?author=ahadnagy",
          "description": "<p>WARP-V is an emerging open-source CPU core generator for RISC-V CPUs. It benefits from the flexibility of Transaction-Level Verilog (TL-Verilog) to support a wide range of implementations from simple CPUs for FPGAs through high-frequency ASIC implementations.\nThe goal of the project is to formally verify the WARP-V core, making development easier for the strict requirements of the RISC-V specification and enabling the use of the WARP-V core in highly demanding and critical areas.</p>\n",
          "difficulty": null,
          "id": "proj_free-and-open-source_2018_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5642777157173248/",
          "proposal_id": null,
          "short_description": "WARP-V is an emerging open-source CPU core generator for RISC-V CPUs. It benefits from the flexibility of Transaction-Level Verilog (TL-Verilog) to...",
          "slug": "formal-verification-of-warp-v-processor",
          "status": "completed",
          "student_name": "Ákos Hadnagy",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "Formal verification of WARP-V processor"
        },
        {
          "code_url": "https://medium.com/@kunalgulati29/concluding-an-awesome-experience-at-google-summer-of-code-2018-60b9c8fc3c04",
          "description": "<p>I'm proposing the creation of a Math Library for BaseJump STL. Adding a set of routines that employ the CORDIC algorithm to implement directly and indirectly computable functions like logarithmic, exponential, sqrt, etc. An overall better parameterization of bit-widths in the existing and new modules, along with functions that directly compute on an array with computations based on a configurable pipeline structure. I also propose to add explicit parallelization inspired by SIMD architecture to the mathematical functions in which the number of independent parallel data elements and bit-length is added as a parameter.</p>\n",
          "difficulty": null,
          "id": "proj_free-and-open-source_2018_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/4583495749861376/",
          "proposal_id": null,
          "short_description": "I'm proposing the creation of a Math Library for BaseJump STL. Adding a set of routines that employ the CORDIC algorithm to implement directly and...",
          "slug": "basejump-stl-hacker",
          "status": "completed",
          "student_name": "kunalgulati",
          "student_profile": null,
          "tags": [],
          "title": "BaseJump STL Hacker"
        },
        {
          "code_url": "https://github.com/misaelnieto/devsim_gsoc_2018/blob/master/GSOC_2018_Report.md",
          "description": "<p>DEVSIM is  a TCAD (Technology Computer Aided Design) semiconductor device simulation software. TCAD tools are special simulation software that can simulate the fabrication process of semiconductors as well as their operation. The objective of this work is to add the necessary improvements to DEVSIM  so it can simulate solar cells.</p>\n",
          "difficulty": null,
          "id": "proj_free-and-open-source_2018_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/6310236080046080/",
          "proposal_id": null,
          "short_description": "DEVSIM is  a TCAD (Technology Computer Aided Design) semiconductor device simulation software. TCAD tools are special simulation software that can...",
          "slug": "enable-devsim-to-simulate-solar-cells",
          "status": "completed",
          "student_name": "Noe Nieto",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Enable DEVSIM to simulate solar cells"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2018/organizations/6276259533291520/"
    },
    "year_2019": {
      "num_projects": 7,
      "projects": [
        {
          "code_url": "https://www.aquibbaig.in/gsoc-2019-project-report/",
          "description": "<p>This project aims to develop user interactivity on the website through a full-fledged notification system and a platform to record user feedback. The notification system will be used to notify users associated with events and by the community to convey information to their audience i.e. the users, and the user feedback system will be used to determine the project quality/popularity amongst the developers.</p>\n",
          "difficulty": null,
          "id": "proj_free-and-open-source_2019_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/6739681302020096/",
          "proposal_id": null,
          "short_description": "This project aims to develop user interactivity on the website through a full-fledged notification system and a platform to record user feedback. The...",
          "slug": "extend-librecoresorg-in-terms-of-user-interactivity-and-feedback",
          "status": "completed",
          "student_name": "Aquib Baig",
          "student_profile": null,
          "tags": [
            "web",
            "ai"
          ],
          "title": "Extend Librecores.org in terms of User Interactivity and Feedback"
        },
        {
          "code_url": "https://zachzzc.github.io/gsoc-ariane/",
          "description": "<p>This project is to add Microarchitectural enhancement of Ariane that is a popular open-source CPU core implementing the RISC-V ISA (instruction set architecture). Currently, the processor is single-issue, meaning that the processor can only issue one instruction per clock cycle. That is a huge performance bottleneck since most functional units in the processor will stay idle when it does not have any instructions to proceed.  In this project, I will implement super-scalar issue logic which allows Ariane to issue two (or more) instructions in the same clock cycle so that the overall performance will be greatly improved.</p>\n",
          "difficulty": null,
          "id": "proj_free-and-open-source_2019_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5739393887764480/",
          "proposal_id": null,
          "short_description": "This project is to add Microarchitectural enhancement of Ariane that is a popular open-source CPU core implementing the RISC-V ISA (instruction set...",
          "slug": "microarchitectural-enhancement-of-ariane",
          "status": "completed",
          "student_name": "Zach Zheng",
          "student_profile": null,
          "tags": [],
          "title": "Microarchitectural enhancement of Ariane"
        },
        {
          "code_url": "https://www.linkedin.com/pulse/gsoc-2019-summary-alaa-salman-alaa-salman/",
          "description": "<p>Analysis of the architectural performance of WARP-V using FireSim and RocketChip Chisel code. Adding WARP-V to RocketChip to utilize the capabilities of RocketChip in generating a whole SoC. Integrating WARP-V with RocketChip components: L1 Cache, TLB and Page table walker to make RocketChip, WARP-V version, able to run Linux. then running RocketChip, WARP-V version, on FireSim to analysis the performance of WARP-V.</p>\n",
          "difficulty": null,
          "id": "proj_free-and-open-source_2019_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5427309819985920/",
          "proposal_id": null,
          "short_description": "Analysis of the architectural performance of WARP-V using FireSim and RocketChip Chisel code. Adding WARP-V to RocketChip to utilize the capabilities...",
          "slug": "analysis-of-warp-v-on-firesim-with-rocketchip",
          "status": "completed",
          "student_name": "Alaa Salman",
          "student_profile": null,
          "tags": [
            "ux"
          ],
          "title": "Analysis of WARP-V on FireSim with RocketChip"
        },
        {
          "code_url": "https://www.linkedin.com/pulse/paving-way-fpga-accelerated-web-applications-%25C3%25A1kos-hadnagy",
          "description": "<p>Building hardware requires access to costly tools and hardware, furthermore complexity in hardware design remains a deterrent force. FPGAs in the cloud solved the high upfront cost of the hardware, and some aspects of tool availability, but not the complexity and scale yet. Moreover, reuse of the already existing IPs is extremely difficult.</p>\n<p>For this Summer of Code project, an extension to the FPGA-Webserver project (<a href=\"https://github.com/alessandrocomodi/fpga-webserver\" target=\"_blank\">https://github.com/alessandrocomodi/fpga-webserver</a>) is proposed to provide an end-to-end solution for accelerating web applications and developing hardware using cloud FPGAs.</p>\n<p>A ready-to-use environment like this could potentially accelerate compute-intensive tasks in web applications and could appear in online HW design tools as backend.</p>\n",
          "difficulty": "advanced",
          "id": "proj_free-and-open-source_2019_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5289349430640640/",
          "proposal_id": null,
          "short_description": "Building hardware requires access to costly tools and hardware, furthermore complexity in hardware design remains a deterrent force. FPGAs in the...",
          "slug": "fpga-accelerated-web-applications",
          "status": "completed",
          "student_name": "Ákos Hadnagy",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "cloud",
            "ui",
            "backend"
          ],
          "title": "FPGA-Accelerated Web Applications"
        },
        {
          "code_url": "https://medium.com/@kunalgulati29/juxtapiton-x86-support-coming-through-906e68a5806?source=friends_link&sk=06dedd485e2341ba8f2ef612582f9356",
          "description": "<p>JuxtaPiton is an architecture being developed at Princeton’s Parallel Group for heterogeneous ISA research. For this project, I will replace the existing PICORV32 core with the open-source ao486 core to have x86 ISA support along with the OpenSPARC T1’s SPARC V9. This kind of a heterogeneous system enables reuse of a lot of legacy x86 code. We also try to interface the L1 cache level of ao486 with the L1.5 cache subsystem of OpenPiton. \nThis allows us to harness Piton’s P-Mesh subsystem which maintains cache coherency across both the cores.</p>\n",
          "difficulty": null,
          "id": "proj_free-and-open-source_2019_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5384463226241024/",
          "proposal_id": null,
          "short_description": "JuxtaPiton is an architecture being developed at Princeton’s Parallel Group for heterogeneous ISA research. For this project, I will replace the...",
          "slug": "enhancing-juxtapiton-with-x86-support",
          "status": "completed",
          "student_name": "Kunal Gulati",
          "student_profile": null,
          "tags": [
            "api",
            "ai",
            "ux"
          ],
          "title": "Enhancing JuxtaPiton with X86 Support"
        },
        {
          "code_url": "https://fossi-foundation.org/2019/08/23/gsoc_LibrecoresCI_Report",
          "description": "<p>Librecores provides a platform to share projects and ideas, in the area of free and open source digital hardware design. Librecores CI is an approach/service to provide continuous integration\nto hardware projects hosted on Librecores to improve user experience and reliability. This project aims to provide automation service for some hardware projects that have a constantly evolving code. Jenkins, the automation server will be used to achieve the goals of the project.</p>\n",
          "difficulty": null,
          "id": "proj_free-and-open-source_2019_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/4688375410327552/",
          "proposal_id": null,
          "short_description": "Librecores provides a platform to share projects and ideas, in the area of free and open source digital hardware design. Librecores CI is an...",
          "slug": "continuous-integration-for-hardware-projects-on-librecores-ci",
          "status": "completed",
          "student_name": "Nancy Chauhan",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Continuous Integration for Hardware Projects on LibreCores CI"
        },
        {
          "code_url": "https://github.com/reSHARMA/RISCV32-GPU/blob/master/GSoCWorkSubmission.md",
          "description": "<p>Bespoke Silicon group at University of Washington is working on the second version of their open source RISC-V manycore processor. They are also working on a CUDA-light programming environment using LLVM. This GSoC I plan to extend RV32 LLVM backend incorporating new hardware features.</p>\n",
          "difficulty": null,
          "id": "proj_free-and-open-source_2019_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5894040778702848/",
          "proposal_id": null,
          "short_description": "Bespoke Silicon group at University of Washington is working on the second version of their open source RISC-V manycore processor. They are also...",
          "slug": "llvm-code-generation-for-risc-v-open-source-gpu",
          "status": "completed",
          "student_name": "Reshabh Sharma",
          "student_profile": null,
          "tags": [
            "backend"
          ],
          "title": "LLVM Code Generation for RISC-V Open Source GPU"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2019/organizations/5087457110917120/"
    },
    "year_2020": {
      "num_projects": 4,
      "projects": [
        {
          "code_url": "https://gist.github.com/crusader2000/0a1159af7945d96c7802f852488d6cca",
          "description": "<p>The goal of the project is to automate and augment the verification of the custom FPGA and the bitstream with Cocotb, an open-source framework for verifying VHDL/ Verilog RTL using python. At the end of the project, users will get to generate a bitstream file and also know whether it is correct or not automatically.</p>\n",
          "difficulty": null,
          "id": "proj_free-and-open-source_2020_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5675644702162944/",
          "proposal_id": null,
          "short_description": "The goal of the project is to automate and augment the verification of the custom FPGA and the bitstream with Cocotb, an open-source framework for...",
          "slug": "automating-hardware-and-bitstream-verification-for-prga-with-cocotb",
          "status": "completed",
          "student_name": "Ansh Puvvada",
          "student_profile": null,
          "tags": [
            "python"
          ],
          "title": "AUTOMATING HARDWARE AND BITSTREAM VERIFICATION FOR PRGA WITH COCOTB"
        },
        {
          "code_url": "https://medium.com/@manangupta16/ao486-integration-with-byoc-d2cb7cbc3e17",
          "description": "<p>This project involves a heterogeneous-ISA system based on a BYOC (Bring Your Own Core) framework. This provides a cache coherent, manycore research framework meant to support a variety of ISAs. The ao486 core having a x86 ISA, provides support for legacy code and is one of the few open source CISC ISAs. The initial approach to integration involved connecting BYOC through the Avalon interface. In this project, work is done with the bare interface of ao486 to interface it with BYOC to maintain cache coherency across all cores.</p>\n",
          "difficulty": null,
          "id": "proj_free-and-open-source_2020_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/4841390690795520/",
          "proposal_id": null,
          "short_description": "This project involves a heterogeneous-ISA system based on a BYOC (Bring Your Own Core) framework. This provides a cache coherent, manycore research...",
          "slug": "integrating-ao486-with-byoc-framework",
          "status": "completed",
          "student_name": "Manan Gupta",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Integrating ao486 with BYOC Framework"
        },
        {
          "code_url": "https://www.notion.so/shivampotdar/Integration-of-WARP-V-with-OpenPiton-535d9506f2744061aee2e78d499cb269",
          "description": "<p>WARP-V is an open-source and highly flexible and configurable CPU core with customisable ISA and pipelines written in the emerging “Transaction-Level” modelling. OpenPiton is an open-source, general-purpose, multi-threaded manycore framework for heterogeneous architecture research.\nThis project aims to evolve WARP-V further by adding necessary support for memory, microarchitecture extensions etc., and make it RISC-V Linux compatible and then integrate it with the OpenPiton-derived Bring Your Own Core (BYOC) Framework.\nThis would open the doors for the first Linux-capable processor based on TL-Verilog and easy scaling to multicore heterogeneous implementation with OpenPiton.</p>\n",
          "difficulty": "beginner",
          "id": "proj_free-and-open-source_2020_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5920190543429632/",
          "proposal_id": null,
          "short_description": "WARP-V is an open-source and highly flexible and configurable CPU core with customisable ISA and pipelines written in the emerging...",
          "slug": "integration-of-warp-v-with-openpiton",
          "status": "completed",
          "student_name": "Shivam Potdar",
          "student_profile": null,
          "tags": [
            "ai",
            "ux"
          ],
          "title": "Integration of WARP-V  with OpenPiton"
        },
        {
          "code_url": "https://www.linkedin.com/pulse/gsoc-2020-summary-vineet-jain/?trackingId=7eyjPaRWR4iZKLBmx%2Bvrfg%3D%3D",
          "description": "<p>The WARP-V RISC-V core generator was developed in 2018, it is the most-configurable, most-adaptable open-source RISC-V CPU core generator, taking advantage of advanced digital design features of TL-Verilog. Till now WARP-V has support for RV32I base instruction set architecture and is formally verified using Risc-V formal. My proposal is to implement RV32F(Single Precision Floating-point) Unit extensions to the Warp-V core by using a \"hard float by Berkeley\" library written in chisel, which also supports IEEE 754 single-precision floating-point unit. My proposal is also to introduce Virtual Memory support(TLB) in Warp-V and to complete the implementation of Bit-Manipulation Instructions.</p>\n",
          "difficulty": "advanced",
          "id": "proj_free-and-open-source_2020_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5176789988540416/",
          "proposal_id": null,
          "short_description": "The WARP-V RISC-V core generator was developed in 2018, it is the most-configurable, most-adaptable open-source RISC-V CPU core generator, taking...",
          "slug": "enhancement-in-warp-v-and-optimization",
          "status": "completed",
          "student_name": "VineetJain07",
          "student_profile": null,
          "tags": [],
          "title": "Enhancement in Warp-V and Optimization"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2020/organizations/6376070820921344/"
    },
    "year_2021": {
      "num_projects": 11,
      "projects": [
        {
          "code_url": "https://medium.com/@guillem812/google-summer-of-code-2021-fossi-foundation-openpiton-d512c8d4b3ff",
          "description": "<p>This project will focus on a current problem in the Hardware community: The speed of RTL Simulations. These types of simulations are a necessary step in any hardware design. It is intrinsically a hard problem, and even commercial simulators run slow compared to the real hardware, which can be several orders of magnitude faster. On the open-source side, Verilator is one of the most famous players and offers a competitive simulation speed time compared to the closed-source ones. We will base our work on this tool. \nThis project will consider that modern processors rely on Network-On-Chip (NoC) to communicate several cores in the same chip. The idea would be to use this hardware partition into consideration and make a stand-alone simulation per core and communicate through OpenMPI. This could potentially enable the simulation of a 1000-core processor, something currently unmanageable.</p>\n",
          "difficulty": null,
          "id": "proj_free-and-open-source_2021_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6681896750153728/",
          "proposal_id": null,
          "short_description": "This project will focus on a current problem in the Hardware community: The speed of RTL Simulations. These types of simulations are a necessary step...",
          "slug": "parallelising-verilog-rtl-simulations-using-mpi",
          "status": "completed",
          "student_name": "Guillem Lopez Paradis",
          "student_profile": null,
          "tags": [],
          "title": "Parallelising Verilog RTL Simulations Using MPI"
        },
        {
          "code_url": "https://medium.com/@zrafique/gsoc21-with-fossi-foundation-ff1c869daec8",
          "description": "<p>This project aims to design and integrate the integer “Multiplication and Division Unit (MDU)” with SERV core as a co-processor. The MDU will support all of the instructions that are provided in <code>The RISC-V Instruction Set Manual. Volume I: Unprivileged ISA</code> chapter 7, M-Standard Extension for Integer Multiplication and Division, Version 2.0”. This MDU is to be designed in a way that it would use most of the DSP resources on the targeted FPGA board and it would be generic and parameterize so that it can easily be integrated with any of the RISC-V core.</p>\n",
          "difficulty": null,
          "id": "proj_free-and-open-source_2021_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5390461421748224/",
          "proposal_id": null,
          "short_description": "This project aims to design and integrate the integer “Multiplication and Division Unit (MDU)” with SERV core as a co-processor. The MDU will support...",
          "slug": "m-extension-support-for-serv",
          "status": "completed",
          "student_name": "Zeeshan Rafique",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "M-extension support for SERV"
        },
        {
          "code_url": "https://github.com/veronia-iskandar/core-v-mcu/wiki",
          "description": "<p>The open-source RISC-V instruction set architecture is gaining interest throughout industry and academia. One advantage of RISC-V is the ability to add custom instruction extensions to the processor targeting specific applications.  A joint project between Embecosm and Southampton university recently developed an open source ISA extension for the CV32E40P RISC-V core to accelerate neural network inference acceleration (<a href=\"https://github.com/AI-Vector-Accelerator\" target=\"_blank\">https://github.com/AI-Vector-Accelerator</a>). The verification of the AI vector extensions project currently exists only as a Verilator model, and speed ups are based on cycle counts, with no insight to any impact on clock speed in actual silicon. There is no pipeline and everything is single cycle because there are no timing constraints in Verilator. This project aims to take the existing work and bring it up on a Nexys A7 FPGA platform.</p>\n",
          "difficulty": null,
          "id": "proj_free-and-open-source_2021_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5039351469178880/",
          "proposal_id": null,
          "short_description": "The open-source RISC-V instruction set architecture is gaining interest throughout industry and academia. One advantage of RISC-V is the ability to...",
          "slug": "bring-up-cv32e40p-ai-accelerator-on-fpga",
          "status": "completed",
          "student_name": "Veronia Iskandar",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Bring up CV32E40P AI accelerator on FPGA"
        },
        {
          "code_url": "https://harshitha172000.github.io/blog4.html",
          "description": "<p>OpenRISC’s mor1kx is one of the old open source projects with more sophisticated and multi-core features. FuseSoC support for mor1kx makes it unique, enabling users to run their assembly programs in a virtual SoC. The or1k-elf toolchain compiles assembly programs, simulated using Icarus Verilog to visualize waveforms. Mor1kx processor went through several tests to verify its functionality, and the or1k-tests successfully identified many unseen bugs in the design.</p>\n<p>But we can’t guarantee that the processor is error-free. Formal Verification identifies the hidden bugs in the design. This verification methodology gives confidence that the system remains stable for a long time. Hence in this project, the mor1kx processor is thoroughly tested using Formal Methods, ensuring that implementation meets its specifications.</p>\n",
          "difficulty": null,
          "id": "proj_free-and-open-source_2021_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5101300231962624/",
          "proposal_id": null,
          "short_description": "OpenRISC’s mor1kx is one of the old open source projects with more sophisticated and multi-core features. FuseSoC support for mor1kx makes it unique,...",
          "slug": "formal-verification-of-mor1kx-processor-using-yosys-formal-tools",
          "status": "completed",
          "student_name": "Harshitha S",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Formal Verification of Mor1kx processor using Yosys-Formal tools"
        },
        {
          "code_url": "https://medium.com/@vineetajm1999/developing-applications-for-cloud-fpgas-are-easier-than-you-think-6b39b7010412",
          "description": "<p>The WARP-V is an open-source and highly configurable, adaptable, and flexible Core generator. It supports various ISA like MIPS, Open-Source RISC-V, and can even be configured with custom ISA. It is designed using emerging “Transaction-Level” modeling that takes advantage of advanced digital design features, timing-abstract nature of language features provided by TL-Verilog. My Project Proposal to harness its advantages and develop support for the multicore NoC design creating a custom kernel interface and deploying it on the cloud via the already existing 1st CLaaS framework. This project will not only lead to a highly configurable many-core hardware accelerator but it will also serve to motivate the industry toward FPGA-accelerated web applications and FPGA-accelerated cloud computing and also to demonstrate the flexibility of TL-Verilog and WARP-V to motivate the industry toward better design methodology.</p>\n",
          "difficulty": "advanced",
          "id": "proj_free-and-open-source_2021_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5331817669853184/",
          "proposal_id": null,
          "short_description": "The WARP-V is an open-source and highly configurable, adaptable, and flexible Core generator. It supports various ISA like MIPS, Open-Source RISC-V,...",
          "slug": "warp-v-many-core-in-the-cloud",
          "status": "completed",
          "student_name": "Vineet Jain",
          "student_profile": null,
          "tags": [
            "web",
            "cloud"
          ],
          "title": "WARP-V Many-Core in the Cloud"
        },
        {
          "code_url": "https://lakshmi-sathi.medium.com/gsoc-21-preparing-the-black-parrot-for-tapeout-using-the-open-source-google-skywater-130nm-pdk-77cbf3031cde",
          "description": "<p>Black Parrot is a tiny, modular Linux capable open-source processor core that encourages external contributions and strives for infrastructure agnosticism. It has been previously taped out successfully on commercial nodes TSMC 40nm and GlobalFoundaries 12nm. Last year, Google released the Google-Skywater 130nm Open-Source PDK which opened new windows in the field of Semiconductor Design and Manufacturing. To be able to successfully get a reliable, tiny, and modular Linux-capable processor like Black Parrot onto Skywater, and have it working, would be a key milestone for the open-source technology node. The aim of this project is to get a single-core implementation of Black-Parrot tapeout-ready on the Google-Skywater 130nm node.</p>\n",
          "difficulty": null,
          "id": "proj_free-and-open-source_2021_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6225963054006272/",
          "proposal_id": null,
          "short_description": "Black Parrot is a tiny, modular Linux capable open-source processor core that encourages external contributions and strives for infrastructure...",
          "slug": "black-parrot-on-open-source-google-skywater-130nm-node",
          "status": "completed",
          "student_name": "Lakshmi S",
          "student_profile": null,
          "tags": [
            "ai",
            "ux"
          ],
          "title": "Black Parrot on Open-Source Google-Skywater 130nm node"
        },
        {
          "code_url": "https://github.com/ninja3011/Block_Based_Circuit_Design",
          "description": "<p>Block-Based Circuit Design is a solution to counter the complexity of Circuit Design. We aim to develop and deploy a Block-Based TL-Verilog solution for developers and new entrants to the sphere. Powered by Blockly from Google, it will deliver a simple, concise, and intuitive gateway to Circuit Design.</p>\n",
          "difficulty": "advanced",
          "id": "proj_free-and-open-source_2021_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/4718205288841216/",
          "proposal_id": null,
          "short_description": "Block-Based Circuit Design is a solution to counter the complexity of Circuit Design. We aim to develop and deploy a Block-Based TL-Verilog solution...",
          "slug": "block-based-circuit-design",
          "status": "completed",
          "student_name": "Ninad Jangle",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Block Based Circuit Design"
        },
        {
          "code_url": "https://github.com/BalaDhinesh/Virtual-FPGA-Lab",
          "description": "<p>Field-Programmable Gate Array(FPGA) is a hardware circuit that a user can program to carry out logical operations. FPGAs are beneficial for prototyping application-specific integrated circuits (ASICs) or processors.</p>\n<p>The advantage of FPGA being energy-efficient, flexible to reprogram, support parallelism, decreased latency made them widely used in many applications. But the flexibility of FPGAs comes at the price of the difficulty of reprogramming the circuit. FPGA’s are a bit costly and difficult to learn for beginners. Also, students don’t have access to physical FPGA Lab classes in their curriculum amidst this pandemic situation. So there is a massive demand in having an alternative option of having an online simulator for FPGA curriculum development.</p>\n<p>This project aims to solve the problem by taking advantage of the VIZ Visualization feature in the Makerchip platform and provide visualizations of basic peripherals of an FPGA, thereby mimicking the physical lab experience.</p>\n",
          "difficulty": "beginner",
          "id": "proj_free-and-open-source_2021_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6546623399723008/",
          "proposal_id": null,
          "short_description": "Field-Programmable Gate Array(FPGA) is a hardware circuit that a user can program to carry out logical operations. FPGAs are beneficial for...",
          "slug": "virtual-fpga-lab",
          "status": "completed",
          "student_name": "Bala Dhinesh",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Virtual FPGA Lab"
        },
        {
          "code_url": "https://github.com/adithyasunil26/GSoC-21-Project-Report",
          "description": "<p>The objective of this project is to port BaseJump STL to FuseSoC so that new projects can directly reuse these hand-optimized IP cores rather than starting from scratch. BaseJump STL has the hardware primitives defined in the form of SystemVerilog modules. FuseSoC makes use of core files that reference the provider, file sets and default targets allowing for the reuse of IP cores in the process of creating, building and simulating SoC solutions. The major tasks involved in this project are creating cores for all the hardware models in BaseJump STL and porting the testing infrastructure.</p>\n",
          "difficulty": null,
          "id": "proj_free-and-open-source_2021_009",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6016523134566400/",
          "proposal_id": null,
          "short_description": "The objective of this project is to port BaseJump STL to FuseSoC so that new projects can directly reuse these hand-optimized IP cores rather than...",
          "slug": "porting-basejump-stl-to-fusesoc",
          "status": "completed",
          "student_name": "Adithya Sunil Edakkadan",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "Porting BaseJump STL to FuseSoC"
        },
        {
          "code_url": "https://medium.com/@nazerke.turtayeva/gsoc21-with-fossi-end-of-the-journey-2d2f6667eb1d",
          "description": "<p>The memory to CPU bottleneck is one of the fundamental and essential issues of commodity processors. With sweeply increasing computing speed, instructions might spend much of their time in waiting queues during read-store access. Nevertheless, there are also many available OS and microarchitecture designs for solving this performance complication. One of the important is the multi-level Translation Lookahead Buffer(TLB) Implementation. Based on the cache locality principle, it aids to keep the frequently used address translations near the core, hence amortizes the waiting time for instruction fetching and load-store units. With many levels in place, the less is the frequency of misses, the better is the performance. Thus, this proposal will aim to enhance the current TLB structure of the CVA6 (Ariane) core to a multi-level with L2 TLB on top of the existing L1 TLBs.</p>\n<p>Here, CVA6 is the application class and Linux bootable 64-bit RISC-V 1.7GHz CPU Core. It is also addable to the OpenPiton Heterogeneous Multicore Research Platform.</p>\n",
          "difficulty": null,
          "id": "proj_free-and-open-source_2021_010",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/4880958041358336/",
          "proposal_id": null,
          "short_description": "The memory to CPU bottleneck is one of the fundamental and essential issues of commodity processors. With sweeply increasing computing speed,...",
          "slug": "multi-level-tlb-support-for-ariane",
          "status": "completed",
          "student_name": "Nazerke Turtayeva",
          "student_profile": null,
          "tags": [
            "ai",
            "ux"
          ],
          "title": "Multi-level TLB support for Ariane"
        },
        {
          "code_url": "https://medium.com/@nmishra9/tensorcore-extension-for-deep-learning-41728fc22495",
          "description": "<p>Deep Learning continues to be a key application for a range of services nowadays - from autonomous vehicles to data centers and even in embedded applications. The core operation in these Deep learning architectures are fused dot products and matrix multiply. \nOwing to the huge memory and compute demands of these applications, multiple approaches to speed up or optimize deep learning operations (like Conv2d, FC, etc.) have been proposed such as using GPUs, creating custom accelerators with their own specific dataflows  (like TPU, Eyeriss) or creating custom ISAs.\nThis project takes a slightly different take on the matter. The objective is to add a tensor core extension to a RISC-V processor like WARP-V to create a custom RISC-V ISA design to accelerate Deep learning workloads.</p>\n",
          "difficulty": null,
          "id": "proj_free-and-open-source_2021_011",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5986417527750656/",
          "proposal_id": null,
          "short_description": "Deep Learning continues to be a key application for a range of services nowadays - from autonomous vehicles to data centers and even in embedded...",
          "slug": "tensorcore-extension-for-deep-learning",
          "status": "completed",
          "student_name": "Nitin Mishra",
          "student_profile": null,
          "tags": [],
          "title": "TensorCore Extension for Deep Learning"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2021/organizations/6542389937700864/"
    },
    "year_2022": {
      "num_projects": 8,
      "projects": [
        {
          "code_url": "https://github.com/yihuajack/GSoC2022_FOSSi_Sootty_Report",
          "description": "Sootty is a novel graphical waveform viewer targeted at modern terminals, however, it currently only supports VCD format and decimal system, not fully supporting markers or cursors. In this project, Sootty will support more mainstream input formats, common numerical systems when displaying numbers, and markers. These enhancement features are limited to what terminals can display, but they will be faster and easier to use than a complex graphical user interface for terminal users. Sootty will integrate numerical system converters and different format interpreters to realize these features.",
          "difficulty": "advanced",
          "id": "proj_free-and-open-source_2022_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/Pquk5CIB/",
          "proposal_id": null,
          "short_description": "Sootty is a novel graphical waveform viewer targeted at modern terminals, however, it currently only supports VCD format and decimal system, not...",
          "slug": "enhancing-the-sootty-terminal-based-graphical-waveform-viewer",
          "status": "completed",
          "student_name": "Yihua Liu",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Enhancing the Sootty Terminal-based Graphical Waveform Viewer"
        },
        {
          "code_url": "https://medium.com/@jsliang/irsim-dynamic-power-analysis-and-other-improvements-3c1880080a38",
          "description": "Large digital designs are prone to consume lots of power and thus, a tool for power analysis is needed. There are two types of power analyses: static, which is more of an estimation that ignores circuit operations, and dynamic, which simulates the circuit behavior in conjunction with switching power. These tools are Verilog gate level-simulations and SPICE simulations, respectively, but the former can be inaccurate while the latter is computationally demanding. IRSIM, a tool intermediate between these two simulation tools, simulates the circuit as a network of transistor capable of turning ON and OFF, serving as a tradeoff between speed and accuracy in dynamic power analysis. The goal of this project is to develop and enhance a command-line interface compatible with up-to-date transistor components in the IRSIM library to ensure the analysis accounts for various power domains.",
          "difficulty": "medium",
          "id": "proj_free-and-open-source_2022_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/EGSzEX1H/",
          "proposal_id": null,
          "short_description": "Large digital designs are prone to consume lots of power and thus, a tool for power analysis is needed. There are two types of power analyses:...",
          "slug": "irsim-dynamic-power-analysis-and-other-improvements",
          "status": "completed",
          "student_name": "Jason Liang",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "IRSIM Dynamic Power Analysis and Other Improvements"
        },
        {
          "code_url": "https://github.com/KarthikL1729/GSoC-Final-Submission",
          "description": "My proposal aims to make Sootty, a CLI waveform viewer, a more utilitarian and intuitive tool to use, by adding features that I believe it would benefit from. I propose to implement new features like flags for saving previously used queries and multiple trigger expressions to help make the tool more user friendly.",
          "difficulty": null,
          "id": "proj_free-and-open-source_2022_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/bhujsZfq/",
          "proposal_id": null,
          "short_description": "My proposal aims to make Sootty, a CLI waveform viewer, a more utilitarian and intuitive tool to use, by adding features that I believe it would...",
          "slug": "improving-query-language-features-in-sootty",
          "status": "completed",
          "student_name": "L Lakshmanan",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Improving Query Language Features in Sootty"
        },
        {
          "code_url": "https://medium.com/@ali1120001a/development-framework-for-open-mpw-shuttles-47ca5956586a",
          "description": "Efabless, Google, and SkyWater Technologies, through the Open MPW and ChipIgnite programs, provide free ASIC fabrication. To help streamline the development flow. This project aims at the creation of the starting template for the development of the projects using the free online Makerchip IDE. The project template will include the visualization of the Caravel harness using the Makerchip’s visual debug feature which will make debugging user designs very easy as compared to the default waveform viewers. This project will also include the support for FPGA prototyping by using the Virtual FPGA labs which have been created using visual debug. The sample user project is used by the open-source designs for the MPW submissions so the proposed project will also involve build flow enhancements to the Caravel sample user project by adding support for TL-Verilog and the Makerchip.",
          "difficulty": "beginner",
          "id": "proj_free-and-open-source_2022_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/bAoybrn8/",
          "proposal_id": null,
          "short_description": "Efabless, Google, and SkyWater Technologies, through the Open MPW and ChipIgnite programs, provide free ASIC fabrication. To help streamline the...",
          "slug": "development-framework-for-open-mpw-shuttles",
          "status": "completed",
          "student_name": "Ali Imran",
          "student_profile": null,
          "tags": [
            "ml",
            "ai",
            "ui"
          ],
          "title": "Development Framework for Open MPW Shuttles"
        },
        {
          "code_url": "https://frog-in-the-well.github.io/GSoC-2022-Final-report/",
          "description": "The CIRCT project is an open-source effort to develop Circuit Intermediate Representations, Compilers, and Tools by applying the MLIR and LLVM development methodology and best practices to the domain of hardware design tools.\n\nIn particular, it could act as a common platform and accelerate the development of interoperable design and verification tools, as opposed to today’s landscape of proprietary tools implementing their own disjoint and incompatible IRs.\n\nThis project's idea is to demonstrate said verification prowess by implementing \"circt-lec\", a basic LEC (Logical Equivalence Checker) tool for combinational CIRCT designs. Specifically, it has to translate two circuits into their fundamental boolean equations and formally prove or disprove their equivalence through the aid of an existing SMT solver (an engine for determining whether mathematical formulas are satisfiable).",
          "difficulty": "medium",
          "id": "proj_free-and-open-source_2022_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/EDrBHxfN/",
          "proposal_id": null,
          "short_description": "The CIRCT project is an open-source effort to develop Circuit Intermediate Representations, Compilers, and Tools by applying the MLIR and LLVM...",
          "slug": "logical-equivalence-checks-with-circt",
          "status": "completed",
          "student_name": "Dragoș Cristian Lizan",
          "student_profile": null,
          "tags": [
            "ml",
            "ai",
            "ui"
          ],
          "title": "Logical Equivalence Checks with CIRCT"
        },
        {
          "code_url": "https://balintgergely.hu/posts/gsoc-22-anycore/",
          "description": "AnyCore is an advanced superscalar processor developed at NC State University, designed to be highly configurable across parameters like issue width and pipeline depth. The goals of the project are fixing memory related issues of the core, finishing integration of an open-source Floating Point Unit (FPU), and enhancing the core in areas needed for running a Unix-like operating system.",
          "difficulty": "advanced",
          "id": "proj_free-and-open-source_2022_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/XLn57TC4/",
          "proposal_id": null,
          "short_description": "AnyCore is an advanced superscalar processor developed at NC State University, designed to be highly configurable across parameters like issue width...",
          "slug": "enhancing-anycore-a-superscalar-risc-v-processor",
          "status": "completed",
          "student_name": "Gergely Bálint",
          "student_profile": null,
          "tags": [],
          "title": "Enhancing AnyCore, a superscalar RISC-V processor"
        },
        {
          "code_url": "https://github.com/shariethernet/RPHAX",
          "description": "Utilizing cloud FPGAs prove to be very expensive and minor coding bugs could consume precious compute cycles and incur hefty bills. This proves using FPGAs on AWS F1, virtually ineffective for students, enthusiasts and early researchers. Additionally, 1st CLaaS, already has a streaming interface in place, not all hardware accelerators would require continuous streaming of data. The addition of support for Memory Mapped Interfaces like AXI4, AXI4 Lite, Wishbone and custom interfaces similar to RoCC, Core-V eXtension interface etc., would enable a wider ecosystem of hardware accelerators to support 1st CLaaS integration without any RTL Level modifications. \n\nBesides these, supporting 1st CLaaS on Local FPGAs/Remote FPGAs contrary to AWS F1 would prove useful to enthusiasts, researchers, professors and students having FPGA on-premise or remotely accessible. 1st CLaaS for PYNQ leverages the PYNQ (Python Productivity for Zynq) Framework, which consists of a Jupyter Server running in a Linux Operating system on the ARM Processor in the Zynq SoC. Addressing the current limitations of 1st CLaaS, the proposed framework that not only brings 1st CLaaS to PYNQ FPGAs, but also vendor agnostically automates TL-Verilog/Verilog/SystemVerilog based Hardware accelerator design from RTL to bitstream and deployment eliminating the need to interact with a wide range of vendor specific tools. The framework would provide a complete FPGA based hardware design flow within the browser/terminal right from designing in makerchip-app and IP-Block design-Bitstream generation to deployment on FPGA in a single command.",
          "difficulty": null,
          "id": "proj_free-and-open-source_2022_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/9LIcUGoQ/",
          "proposal_id": null,
          "short_description": "Utilizing cloud FPGAs prove to be very expensive and minor coding bugs could consume precious compute cycles and incur hefty bills. This proves using...",
          "slug": "1st-claas-for-pynq-fpgas",
          "status": "completed",
          "student_name": "Shrihari",
          "student_profile": null,
          "tags": [
            "python",
            "cloud",
            "ui",
            "ux"
          ],
          "title": "1st CLaaS for PYNQ FPGAs"
        },
        {
          "code_url": "https://medium.com/@kinzahqamarzaman/tinyparrot-a-minimal-blackparrot-risc-v-multicore-variant-ff0ca76d2fb6",
          "description": "This project aims to shrink BlackParrot multicore to have a minimal variant called TinyParrot multicore. The main goal of this project is to get very low resource ASIC tapeouts. \nThe deliverables of this project are:\n**Provide Minimal ISA support: This will be done by parameterizing the FPU logic (all the FP \n    pipes, register file, and bypass paths).\n**Shrink the size of caches: The cache size will be reduced to 1kb of data.\n**Logic saving optimizations: The optimizations are planned to be done through Yosys. Yosys \n     supports optimization passes and runs them while synthesis.",
          "difficulty": null,
          "id": "proj_free-and-open-source_2022_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/fsd4FPpL/",
          "proposal_id": null,
          "short_description": "This project aims to shrink BlackParrot multicore to have a minimal variant called TinyParrot multicore. The main goal of this project is to get very...",
          "slug": "tinyparrot-a-minimal-blackparrot-risc-v-multicore-variant",
          "status": "completed",
          "student_name": "Kinza Qamar Zaman",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "TinyParrot: A minimal BlackParrot RISC-V Multicore variant"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2022/organizations/free-and-open-source-silicon-foundation/"
    },
    "year_2023": {
      "num_projects": 5,
      "projects": [
        {
          "code_url": "https://chaitravi-ce.hashnode.dev/unveiling-the-power-the-crucial-role-of-visualization-in-understanding-risc-v-cores",
          "description": "The Makerchip platform has added custom visualization support for circuit simulations, allowing for improved insights into microarchitectural behavior and circuit debugging. This project seeks to extend the capabilities of the platform by implementing customized circuit visualization for various circuits, including SweRV, SERV, BaseJump STL, and fundamental circuits for educational purposes. Additionally, the project will incorporate neural networks and gamified circuit design visualization to further enhance the user experience. This feature will provide a clearer understanding of how each step of the code is functioning, leading to improved insights and faster debugging. By enabling users to visualize and analyze circuits in a more efficient and engaging manner, this project aims to improve the overall functionality and usability of the Makerchip platform.",
          "difficulty": null,
          "id": "proj_free-and-open-source_2023_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/pKARyx8Z",
          "proposal_id": "NXu7aOSP",
          "short_description": "The Makerchip platform has added custom visualization support for circuit simulations, allowing for improved insights into microarchitectural...",
          "slug": "circuit-visualization-with-makerchip-platform",
          "status": "completed",
          "student_name": "Chaitravi Chalke",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Circuit Visualization with Makerchip Platform"
        },
        {
          "code_url": "https://github.com/PrincetonUniversity/openpiton/pull/137",
          "description": "The Platform Level Interrupt Controller (PLIC) is the de facto interrupt controller in RISC-V systems. However, the specification has intrinsic limitations regarding scalability and feature richness, e.g., it lacks support for Message Signal Interrupts (MSI) and virtualization. The RISC-V Advanced Interrupt Architecture (AIA) is the new reference specification for interrupt handling. RISC-V International has just ratified the AIA specification. This project aims to integrate an (in-house) open-source AIA IP into the OpenPiton+Ariane platform and conduct an in-depth evaluation of the performance and suitability for general-purpose, multithreaded, manycore processors.",
          "difficulty": "advanced",
          "id": "proj_free-and-open-source_2023_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/4X5wkVOC",
          "proposal_id": "GiDGVFf8",
          "short_description": "The Platform Level Interrupt Controller (PLIC) is the de facto interrupt controller in RISC-V systems. However, the specification has intrinsic...",
          "slug": "enhancing-openpitonariane-soc-with-an-open-source-advanced-interrupt-architecture-aia",
          "status": "completed",
          "student_name": "Kinza Qamar Zaman",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Enhancing OpenPiton+Ariane SoC With an Open-Source Advanced Interrupt Architecture (AIA)"
        },
        {
          "code_url": "https://mole99.uber.space/2023/GSoC_Final/GSoC23%20%E2%80%94%20Final%20Project%20Report.html",
          "description": "When you design a digital circuit, you want to make sure that all timings are correct, even post-layout. Therefore, the gate level netlist is annotated with delays extracted from the layout. The file format that contains these delay and timing information is called Standard Delay Format (SDF).\n\nIcarus Verilogs' SDF implementation has shortcomings in the following categories:\n\n1. Wire / Interconnect delays\n2. Conditional path delays\n3. Timing checks\n\nWork needs to be done on these categories, all while supporting related bugs as we more completely test gate level simulations.\n\nWith the work proposed here, I would like to improve Icarus' SDF support to simulate SDF back-annotated timing simulations for the open SKY130 PDK.\n\nThe deliverables for this project are:\n\n1. Implementing the SDF `INTERCONNECT` feature\n2. Writing tests for the regression suite\n3. Example of a SDF back-annotated timing simulation using the SKY130 PDK",
          "difficulty": null,
          "id": "proj_free-and-open-source_2023_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/Oj6mrbBI",
          "proposal_id": "F69LuD1q",
          "short_description": "When you design a digital circuit, you want to make sure that all timings are correct, even post-layout. Therefore, the gate level netlist is...",
          "slug": "improving-sdf-support-in-icarus-verilog",
          "status": "completed",
          "student_name": "Leo Moser",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Improving SDF support in Icarus Verilog"
        },
        {
          "code_url": "https://aileonn.github.io/projects/gsoc/",
          "description": "As the demand for High-Performance Computing (HPC) continues to grow, there is a need for open-source solutions that can deliver the performance required by modern applications. Different open-source architecture frameworks have been developed by the community, like OpenPiton, however, all of them present performance limitations that impact their ability to execute computationally-intensive tasks. \n\nOpenPiton is an open-source framework for designing many-core processors. Although OpenPiton was originally developed for SPARC v9 architectures, currently it is also compatible with different core architectures (RISC-V 32-bit, RISC-V 64-bit, x86, and SPARCv9). In this project, we will focus on improving the performance of the integration of CVA6/Ariane into OpenPiton (OpenPiton+Ariane).\n\nThe architecture of OpenPiton consists of one chipset and one or more tiles. The chipset houses modules used to communicate the tiles with the peripherals, such as the UART. The tile is used to build the mesh for many-core designs. In these designs, the tiles are interconnected by three NoC routers to generate the mesh. Each tile comprises the three NoC routers, the Ariane core, and the cache hierarchy, which consists of Ariane’s private L1 data and instruction caches, a private L1.5 cache and a shared distributed L2 cache. \n\nDespite the fact that OpenPiton offers many advantages, it presents performance limitations that restrict its adoption in the HPC field. In this project, we will improve the performance of OpenPiton by replacing the L1 data cache of Ariane with the High-Performance, Multi-Requester, Out-of-Order, L1 data cache (HPDcache). In addition, other features such as the amount of L1.5 cache miss status holding registers (MSHRs) or the L1.5 cache associativity can also be improved in order to approach OpenPiton even closer to the HPC field.",
          "difficulty": null,
          "id": "proj_free-and-open-source_2023_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/4SrrAPf1",
          "proposal_id": "v4lTtZ5I",
          "short_description": "As the demand for High-Performance Computing (HPC) continues to grow, there is a need for open-source solutions that can deliver the performance...",
          "slug": "enhancing-openpitonariane-with-a-high-performance-data-cache",
          "status": "completed",
          "student_name": "Noelia Oliete Escuín",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "Enhancing OpenPiton+Ariane With a High-Performance Data Cache"
        },
        {
          "code_url": "https://medium.com/@qalam_89573/gsoc23-parameterized-device-layouts-for-gf180mcu-63a283439021",
          "description": "Throughout this project, I hope to gain a firmer understanding of TCL scripting and the backend working of parameterized devices and hopefully make some new ones too these devices are used many times while using magic to makes our work easier. this project will help me in a deeper understanding of how each command in the command line works in magic and how we can make some changes in its scripts to make it to improve user inference. In terms of the project, the goal is to work in scripts to draw devices like LDNMOS, LDPMOS, bipolar transistors, photodiodes, Avalanche Diode, etc as well as fixing a few devices that are known to draw incorrectly for some parameter values.as far as working on this project is concerned as per my own rough timeline following is the methodology i would use while working on the project : The magic VLSI tool uses TCL scripts for the parameterized design layouts so we should start by going through some of the scripts to get a better understanding of what we are working with then we will be going through each of the mentioned devices and study its CMOS design and draw it on the magic tool using the magic command line TCL scripts, we will also be looking at the pre-existing devices to check if we were getting the required drawings of them or not if the drawings are not as required then we will be making changes to those scripts as well, in the meantime, we will be looking for improvements we could make on the user inference of magic tool too. \nto get a better understanding of how I would work on this project please go through the proposal I have attached below. \nthankyou soo much for your time, \nlooking forward to working with you soon.",
          "difficulty": null,
          "id": "proj_free-and-open-source_2023_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/ybNyzTnL",
          "proposal_id": "3ItOfvVc",
          "short_description": "Throughout this project, I hope to gain a firmer understanding of TCL scripting and the backend working of parameterized devices and hopefully make...",
          "slug": "parameterized-device-layouts-for-gf180mcu",
          "status": "completed",
          "student_name": "Qurrat ul ain Alam",
          "student_profile": null,
          "tags": [
            "ai",
            "ui",
            "backend"
          ],
          "title": "Parameterized device layouts for GF180MCU"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2023/organizations/free-and-open-source-silicon-foundation"
    },
    "year_2024": {
      "num_projects": 6,
      "projects": [
        {
          "code_url": "https://akiho-kawada.github.io/projects/gsoc2024/",
          "description": "Since CVA6/Ariane is highly modular by design, it is relatively easy to develop and integrate multiple L1 caches. Additionally, because CVA6/Ariane is open source, users can develop L1 caches customized for their needs.\n\nThe primary technological feature of HPDC is its L1 Dcache, which supports Multi-Requester, Multi-Issue, and Out-of-Order operations. This capability is especially valuable for HPC systems striving for high memory throughput. However, HPDC is still under development, and various functional enhancements are being implemented or planned to make it more useful for HPC systems by providing a variety of functions for diverse cores.\n\nIn this year's GSoC, the objective is to first expand the functionality of the L1 cache for the CVA6/Ariane core, and then to make it scalable to accommodate many cores, laying the groundwork for making HPDC an even more significant entity for HPC systems.\n\nBy exploring the appropriate scale and structure, it's possible to enhance HPDC's functions to be used as an instruction cache with scalability in mind. Furthermore, by connecting with OpenPiton, it becomes extremely easy to scale to large systems with many cores. This aligns with the goals of the GSoC project.",
          "difficulty": "beginner",
          "id": "proj_free-and-open-source_2024_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/zTms74CY/",
          "proposal_id": null,
          "short_description": "Since CVA6/Ariane is highly modular by design, it is relatively easy to develop and integrate multiple L1 caches. Additionally, because CVA6/Ariane...",
          "slug": "transforming-the-openhw-high-performance-data-cache-into-a-high-performance-instruction-cache",
          "status": "completed",
          "student_name": "Akiho Kawada",
          "student_profile": null,
          "tags": [],
          "title": "Transforming the OpenHW High Performance Data Cache into a High Performance Instruction Cache"
        },
        {
          "code_url": "https://surajms.com/2024/11/gsoc2024/",
          "description": "The project aims to integrate RISC-V Cache Management Operation (CMO) extensions into the OpenPiton processor framework. This integration will improve cache coherency and management, resulting in enhanced performance and efficiency for systems built on the OpenPiton platform. The project will involve understanding the RISC-V CMO specifications, modifying the OpenPiton cache subsystem, and extensive testing to ensure compatibility and performance improvements.",
          "difficulty": null,
          "id": "proj_free-and-open-source_2024_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/v2S1lk5q/",
          "proposal_id": null,
          "short_description": "The project aims to integrate RISC-V Cache Management Operation (CMO) extensions into the OpenPiton processor framework. This integration will...",
          "slug": "implementing-risc-v-cache-management-operation-extensions-in-openpiton",
          "status": "completed",
          "student_name": "Suraj Shirvankar",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Implementing RISC-V Cache Management Operation Extensions in OpenPiton"
        },
        {
          "code_url": "https://charmed-lunge-3d4.notion.site/GSoC-2024-Improving-ATPG-Fault-Coverage-in-Fault-By-Youssef-Kandil-fdd89a45132744e982605a5c35da156e",
          "description": "The semiconductor industry, driven by Moore's Law, continuously pushes the boundaries of integrated circuit (IC) technology, leading to ever-shrinking transistor feature sizes. Recent research by the U.S. Department of Energy (U.S. DOE) shows promising endeavors of reducing feature sizes to record sizes as small as 1 nanometer. However, the growing complexity of ICs raises the likelihood of manufacturing defects, consequently, sustaining reliability within this zero-failure tolerance domain poses an increasingly daunting task. In this landscape, Design-for-Testability (DFT) features play a paramount role in guaranteeing the quality and reliability of integrated circuits (ICs) amidst evolving complexities. \n\nThis proposal aims to enhance the Fault DFT toolchain through the Google Summer of Code (GSoC) program. “Fault” is a premier open-source DFT toolchain that provides a comprehensive solution including automatic test pattern generation (ATPG), scan insertion, and scan chain testing. The project focuses on improving Automatic Test Pattern Generation (ATPG) fault coverage within the Fault framework by integrating algorithmic ATPG methodologies and implementing techniques for enhancing controllability and observability in digital designs. By addressing these challenges, the project seeks to advance open-source EDA tools and meet the evolving demands of the semiconductor industry.",
          "difficulty": "advanced",
          "id": "proj_free-and-open-source_2024_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/dz0PI5I1/",
          "proposal_id": null,
          "short_description": "The semiconductor industry, driven by Moore's Law, continuously pushes the boundaries of integrated circuit (IC) technology, leading to...",
          "slug": "improving-atpg-fault-coverage-in-fault",
          "status": "completed",
          "student_name": "Youssef Kandil",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Improving ATPG Fault Coverage in Fault"
        },
        {
          "code_url": "https://cknizek.github.io/ZynqParrot24/",
          "description": "TinyParrot is a BlackParrot RISC-V multi-core variant that aims to be small enough to fit onto educational FPGA development boards like the Pynq Z2. In order to get there, the TinyParrot variant needs to optimize and constrain itself in order to meet the physical device constraints (such as LUTs, BRAMs, and flip-flops) provided by development boards like the Pynq Z2 FPGA development board. This project will implement size optimizations that ultimately decrease the amount of resources required by TinyParrot, enabling TinyParrot to fit on the Pynq Z2. \n\n\nAt a high level, this will be accomplished by first parameterizing the FMUL/FDIV instructions as part of an MFD parameterization effort. Then, hardware primitives will be re-mapping using the BaseJump STL library in order to standardize and optimize the existing RTL. The ultimate goal of these optimization efforts is to implement TinyParrot on the Pynq Z2.",
          "difficulty": null,
          "id": "proj_free-and-open-source_2024_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/oNSPaAeY/",
          "proposal_id": null,
          "short_description": "TinyParrot is a BlackParrot RISC-V multi-core variant that aims to be small enough to fit onto educational FPGA development boards like the Pynq Z2....",
          "slug": "tinyparrot-a-minimal-blackparrot-risc-v-multicore-variant",
          "status": "completed",
          "student_name": "Colin Knizek",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "TinyParrot: A minimal BlackParrot RISC-V Multicore variant"
        },
        {
          "code_url": "https://medium.com/@rajlysm15/enhancing-tl-verilog-support-in-vs-code-my-google-summer-of-code-journey-de75f201b419",
          "description": "This project aims to enable the seamless integration of the Silicon Compiler's hardware design tools and flows within popular development environments like Visual Studio Code (VS Code). Silicon Compiler is an open-source, modular build system that automates the translation process from hardware design source code to silicon. It essentially serves as a \"make for silicon,\" enabling developers to efficiently compile and synthesise hardware designs into silicon implementations. By leveraging the Silicon Compiler's microservices and developing a JavaScript API, users will be able to run various hardware design tasks, such as logic synthesis, place-and-route, static timing analysis, and simulation, directly from within their familiar coding environments. This integration will streamline the design process, improve productivity, and provide a seamless experience for developers working with Verilog or related hardware description languages (HDLs) within the editor. Instead of switching between different tools and environments, they can leverage the integrated functionality directly within VS Code, streamlining their workflow and improving productivity.",
          "difficulty": null,
          "id": "proj_free-and-open-source_2024_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/Flnw49Xn/",
          "proposal_id": null,
          "short_description": "This project aims to enable the seamless integration of the Silicon Compiler's hardware design tools and flows within popular development...",
          "slug": "integration-of-silicon-compiler-microservices-into-the-tl-verilog-mode-in-vs-code",
          "status": "completed",
          "student_name": "Raj Aryan Singh",
          "student_profile": null,
          "tags": [
            "java",
            "javascript",
            "api",
            "ml",
            "ai"
          ],
          "title": "Integration of Silicon Compiler Microservices into the TL-Verilog Mode in VS-Code"
        },
        {
          "code_url": "https://github.com/elhewaty/FOSSi-Foundation-GSOC24/blob/main/README.md",
          "description": "Add a vectorization support to Arcilator. An efficient vectorization pass will make Arcilator faster, as hardware designs often contain highly repetitive structures that require the same computation on different data pieces. The proposed pass will implement most of the Superword Level parallelism features. This project starts by packing the seed operations and extending the pack sets as needed according to the cost function that calculates the benefit from packing and unpacking instructions.",
          "difficulty": null,
          "id": "proj_free-and-open-source_2024_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/U4OHb5Cf/",
          "proposal_id": null,
          "short_description": "Add a vectorization support to Arcilator. An efficient vectorization pass will make Arcilator faster, as hardware designs often contain highly...",
          "slug": "arcilator-vectorization",
          "status": "completed",
          "student_name": "Mohamed Atef",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Arcilator Vectorization"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2024/organizations/free-and-open-source-silicon-foundation/"
    },
    "year_2025": {
      "num_projects": 6,
      "projects": [
        {
          "code_url": null,
          "description": "The project aims to add an exporter plugin for PeakRDL that enables a high level visualization for control & status register (CSR) design using Makerchip’s IDE and the visual debug (VIZ) framework. Makerchip provides an IDE for TL-Verilog design and simulation, where special JavaScript code can be written (VIZ Model) alongside the design to add a higher level of signal visualization that helps in simulation debugging.",
          "difficulty": null,
          "id": "proj_free-and-open-source_2025_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/HzAZmK1x",
          "proposal_id": "3FeY0Lho",
          "short_description": "The project aims to add an exporter plugin for PeakRDL that enables a high level visualization for control & status register (CSR) design using...",
          "slug": "peakrdl-exporter-plugin-for-csr-visualization-on-makerchip",
          "status": "in-progress",
          "student_name": "Ali Mohsen",
          "student_profile": null,
          "tags": [
            "java",
            "javascript",
            "ai"
          ],
          "title": "PeakRDL Exporter Plugin for CSR Visualization on Makerchip"
        },
        {
          "code_url": null,
          "description": "This project aims to create a tool that automatically generates Python typing stubs for the Device Under Test (DUT) in cocotb-based hardware verification testbenches. By leveraging cocotb’s existing introspection capabilities, the tool will produce .pyi stub files describing the DUT’s interface – its hierarchy of modules and signals – in a statically typed fashion. These stubs will enable IDE features like auto-completion via VS Code’s Pylance and allow static type checkers such as mypy to catch errors in testbench code, significantly improving the hardware verification development experience​. The generated stubs will mirror the HDL design’s structure (with considerations for hierarchical vs. flat representations) and provide a structured abstraction of the DUT interface that can even be used for mocking or unit-testing components of the testbench. Initially, the stub generator will rely on runtime cocotb introspection only, but it will be designed with extensibility in mind, so that future enhancements (e.g., integrating a SystemVerilog language server like slang for richer type info) can be incorporated​. Over a 175-hour Google Summer of Code timeline, the project will deliver a working stub-generation utility, along with documentation, tests, and integration into the cocotb ecosystem, providing a concrete benefit to the open-source hardware verification community.",
          "difficulty": null,
          "id": "proj_free-and-open-source_2025_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/9RiVc4jy",
          "proposal_id": "rbakqbAv",
          "short_description": "This project aims to create a tool that automatically generates Python typing stubs for the Device Under Test (DUT) in cocotb-based hardware...",
          "slug": "device-under-test-python-typing-stub-generator-for-cocotb-tests",
          "status": "in-progress",
          "student_name": "chaitanyasharma",
          "student_profile": null,
          "tags": [
            "python",
            "ai"
          ],
          "title": "Device-Under-Test Python Typing Stub Generator for cocotb tests"
        },
        {
          "code_url": null,
          "description": "​​Jump Label Implementation​​ aims to eliminate branch overhead in kernel code by dynamically patching JMP/NOP instructions at runtime using GCC's asm goto feature. This involves defining static branch templates (ARCH_STATIC_BRANCH_ASM for NOP cases and ARCH_STATIC_BRANCH_JUMP_ASM for JMP cases) and implementing core functions (arch_static_branch and arch_static_branch_jump) along with a runtime patching mechanism (arch_jump_label_transform). The key deliverable is near-zero-cost branch decisions, significantly improving performance for frequently checked kernel conditions like tracepoints and debugging checks.\n\n​​Ftrace Implementation​​ provides efficient function tracing (function) and call-graph profiling (function_graph) with minimal overhead. The -pg compiler flag inserts mcount() calls that dynamically redirect to either a no-op stub (when disabled) or a full tracer (when enabled). The implementation includes dynamic redirection in mcount(), the core function tracer (ftrace_trace_function), and the extended function_graph tracer with entry/exit hooks (ftrace_graph_caller and return_to_handler). This enables deep call-stack analysis while maintaining low runtime cost when tracing is inactive, supporting dynamic kernel debugging with minimal performance impact.",
          "difficulty": null,
          "id": "proj_free-and-open-source_2025_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/qYsJ8YEg",
          "proposal_id": "aJ9KZpnG",
          "short_description": "​​Jump Label Implementation​​ aims to eliminate branch overhead in kernel code by dynamically patching JMP/NOP instructions at runtime using GCC's...",
          "slug": "openrisc-linux-feature-development",
          "status": "in-progress",
          "student_name": "Chen Miao",
          "student_profile": null,
          "tags": [
            "ai",
            "ux"
          ],
          "title": "OpenRISC Linux Feature Development"
        },
        {
          "code_url": null,
          "description": "This project aims to enhance the OpenPiton+Ariane architecture to progress toward RISC-V RVA23 profile compliance. The primary focus will be implementing the Svnapot extension, which allows for Naturally Aligned Power-Of-Two regions in memory to improve TLB efficiency. I will modify the CVA6 Memory Management Unit (MMU), specifically the Page Table Walker (PTW) and Translation Lookaside Buffer (TLB), to support this extension. As stretch goals, I plan to implement additional supervisor extensions required for RVA23 compliance, such as Svpbmt (Page-Based Memory Types) and Svadu (Hardware Updating of A/D Bits). The project will include comprehensive testing and documentation, ensuring all implementations conform to RISC-V specifications while integrating seamlessly with the existing architecture.",
          "difficulty": null,
          "id": "proj_free-and-open-source_2025_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/JPg97sG6",
          "proposal_id": "K0LuZBP2",
          "short_description": "This project aims to enhance the OpenPiton+Ariane architecture to progress toward RISC-V RVA23 profile compliance. The primary focus will be...",
          "slug": "architectural-improvements-to-openpitonariane-for-risc-v-profile-compliance",
          "status": "in-progress",
          "student_name": "Jayishnu",
          "student_profile": null,
          "tags": [
            "ml",
            "ai",
            "ui"
          ],
          "title": "Architectural Improvements to OpenPiton+Ariane for RISC-V Profile Compliance"
        },
        {
          "code_url": null,
          "description": "Modern RTL simulation is computationally expensive and often limited by single-node processing capabilities. This proposal aims to improve Metro-MPI++, a tool for distributed RTL simulation using Verilator and MPI, to better handle large-scale designs like OpenPiton. The project focuses on automating tile and interconnect detection in OpenPiton, optimizing MPI-based simulation interfaces, integrating hybrid parallelism with OpenMP, and laying the groundwork for FPGA backend support. The deliverables include a scalable partitioning framework, enhancements to the simulation runtime, example simulations demonstrating speedup, and contributions to Verilator’s partitioning features. These improvements will make RTL simulation more scalable, accessible, and efficient for open-source hardware projects.",
          "difficulty": null,
          "id": "proj_free-and-open-source_2025_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/PkUd6Us3",
          "proposal_id": "xrwHEIg6",
          "short_description": "Modern RTL simulation is computationally expensive and often limited by single-node processing capabilities. This proposal aims to improve...",
          "slug": "metro-mpi",
          "status": "in-progress",
          "student_name": "Kislay Arya",
          "student_profile": null,
          "tags": [
            "ai",
            "backend"
          ],
          "title": "Metro-MPI++"
        },
        {
          "code_url": null,
          "description": "This project seeks to enhance the ZynqParrot environment by integrating a RISC-V trace module that adheres to the official RISC-V trace specification. The goal is to provide a powerful debugging and performance-analysis framework for RISC-V cores running on FPGAs. By implementing the tracer in SystemVerilog, and developing a C/C++ driver to enable trace data collection, this project will significantly improve visibility into RISC-V program execution.\r\n\r\nIn addition to the core tracer implementation, the work includes developing a structured verification plan, performing system-level tests within ZynqParrot, and creating accompanying documentation to ensure widespread adoption by the open-source community. Key deliverables include the RTL tracer module, the C/C++ driver, and a comprehensive project report. Ultimately, this effort will accelerate open-source hardware innovation by enabling developers to more easily debug and optimize their RISC-V designs within ZynqParrot.",
          "difficulty": null,
          "id": "proj_free-and-open-source_2025_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/Gc6k7MOv",
          "proposal_id": "qLt4WGvF",
          "short_description": "This project seeks to enhance the ZynqParrot environment by integrating a RISC-V trace module that adheres to the official RISC-V trace...",
          "slug": "zynqparrot-risc-v-tracer-implementation",
          "status": "in-progress",
          "student_name": "Pavan Dheeraj Kota",
          "student_profile": null,
          "tags": [],
          "title": "ZynqParrot RISC-V Tracer Implementation"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2025/organizations/free-and-open-source-silicon-foundation"
    }
  },
  "first_time": false,
  "contact": {
    "email": "gsoc@fossi-foundation.org",
    "guide_url": "https://www.fossi-foundation.org/gsoc",
    "ideas_url": "https://fossi-foundation.org/gsoc/gsoc25-ideas",
    "irc_channel": "https://gitter.im/librecores/Lobby",
    "mailing_list": "https://lists.librecores.org/listinfo/discussion"
  },
  "social": {
    "blog": "https://fossi-foundation.org/news",
    "discord": null,
    "facebook": null,
    "github": null,
    "gitlab": null,
    "instagram": null,
    "linkedin": null,
    "mastodon": null,
    "medium": null,
    "reddit": null,
    "slack": null,
    "stackoverflow": null,
    "twitch": null,
    "twitter": "https://twitter.com/fossifoundation",
    "youtube": null
  },
  "meta": {
    "version": 1,
    "generated_at": "2026-01-25T15:28:53.147Z"
  }
}