{
  "id": "692251d553dd9d7326d33dc3",
  "slug": "genes-genomes-and-variation",
  "name": "Genes, Genomes and Variation",
  "category": "Science and medicine",
  "description": "Authoritative databases of genome sequences and their function",
  "image_url": "https://lh3.googleusercontent.com/p8PJcwnPwpVUuuesrDQkQxj_TpubhtovFLmyAfwpbnWU28tgkvewYzdXqob_BY0Uh0_061o-IdAYODgEyjUZcthyncDrnw",
  "img_r2_url": "https://pub-268c3a1efc8b4f8a99115507a760ca14.r2.dev/genes-genomes-and-variation.webp",
  "logo_r2_url": null,
  "url": "http://www.ensembl.org",
  "active_years": [
    2016,
    2017,
    2018,
    2019
  ],
  "first_year": 2016,
  "last_year": 2019,
  "is_currently_active": false,
  "technologies": [
    "mysql",
    "javascript",
    "perl",
    "python",
    "rest"
  ],
  "topics": [
    "databases",
    "bioinformatics",
    "web platform and services",
    "data visualisation",
    "web",
    "genomics",
    "data visualization",
    "database",
    "scientific visualization",
    "data analysis"
  ],
  "total_projects": 12,
  "stats": {
    "avg_projects_per_appeared_year": 3,
    "projects_by_year": {
      "year_2016": 2,
      "year_2017": 5,
      "year_2018": 2,
      "year_2019": 3,
      "year_2020": null,
      "year_2021": null,
      "year_2022": null,
      "year_2023": null,
      "year_2024": null,
      "year_2025": null
    },
    "students_by_year": {
      "year_2016": 2,
      "year_2017": 5,
      "year_2018": 2,
      "year_2019": 3,
      "year_2020": null,
      "year_2021": null,
      "year_2022": null,
      "year_2023": null,
      "year_2024": null,
      "year_2025": null
    },
    "total_students": 12
  },
  "years": {
    "year_2016": {
      "num_projects": 2,
      "projects": [
        {
          "code_url": "https://github.com/wolfib/sequenceTubeMap",
          "description": "<p>Recent scientific advances have lead to a huge increase in the amount of available genomic sequence information. In the past this sequence information consisted of a single reference sequence, which can be relatively easily visualised in a linear way. Today we often know multiple variants of a particular DNA sequence. The differences between the individual sequences are called polymorphisms and can range in size from variations of a single base pair (single nucleotide polymorphism = SNP) to variations involving long stretches of DNA.</p>\n<p>There are a number of approaches (and file formats) for formally encoding variants of genomic sequences and their relationships in the form of graphs. Unfortunately it is often difficult to visualise these graphs in a way which conveys the complex information yet is intuitively easy to understand. The goal of this project is to help in the visualisation of genomic sequences and their variations by providing a JavaScript module which generates visual representations of genomic sequence graphs. This module aims to display the information about all sequence variants in a single visualisation as elegantly as possible.</p>\n",
          "difficulty": "beginner",
          "id": "proj_genes-genomes-and-va_2016_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5861745595777024/",
          "proposal_id": null,
          "short_description": "Recent scientific advances have lead to a huge increase in the amount of available genomic sequence information. In the past this sequence...",
          "slug": "visualization-of-genomic-sequence-graphs",
          "status": "completed",
          "student_name": "Wolfgang Beyer",
          "student_profile": null,
          "tags": [
            "java",
            "javascript",
            "ai",
            "ui"
          ],
          "title": "Visualization of Genomic Sequence Graphs"
        },
        {
          "code_url": "https://github.com/Ensembl/XML-To-Blockly/commits/gh-pages?author=anujk14",
          "description": "<p>eHive is a system used to run computation pipelines in distributed environments. eHive workflows are currently being migrated to a Relax NG specification. Currently the eHive workflows are manually coded and this requires expertise in computer science. It also takes up a lot of time. Due to such shortcomings handling workflows becomes very cumbersome.</p>\n<p>This project aims to remove these drawbacks of the existing system by creating a graphical editor for eHive workflows using Google's Blockly library which would enable us to visualize the XML code in terms of Blockly blocks and provide output for them in XML format using Blockly's existing \"Export to XML\" option. The backbone of this graphical editor would be some rules written to handle the Relax NG XML schema specification and to create Blockly blocks automatically in accordance with the same.</p>\n<p>For example, the XML to Blockly converter would apply pre-defined rules to the Relax NG specification entered by the user, and generate code to represent the specification using Blockly blocks.</p>\n<p>The proposed editor would have capabilities of handling not just workflows for eHive, but any specifications written using the Relax NG schema.</p>\n",
          "difficulty": null,
          "id": "proj_genes-genomes-and-va_2016_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5977064662368256/",
          "proposal_id": null,
          "short_description": "eHive is a system used to run computation pipelines in distributed environments. eHive workflows are currently being migrated to a Relax NG...",
          "slug": "graphical-workflow-editor-for-ehive-using-blockly",
          "status": "completed",
          "student_name": "Anuj Khandelwal",
          "student_profile": null,
          "tags": [
            "ml",
            "ai",
            "ui"
          ],
          "title": "Graphical workflow editor for eHive using Blockly"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2016/organizations/6638327222501376/"
    },
    "year_2017": {
      "num_projects": 5,
      "projects": [
        {
          "code_url": "https://github.com/EnsemblGSOC/chanaka-gsoc-2017",
          "description": "<p>Ensembl is a data warehousing and data sets project which helps to analyse advanced biological data. Simple this application displays a 1 dimensional map of a chromosomal region and then the stacks annotations on top of it. So scientists can configure these images and add/remove tracks at will to highlight biological features of interest.</p>\n<p>This is a brief introduction on the project which is currently in use in Ensembl project. The main goal of this project is to develop a database to store above mentioned tracks and also implement a REST API to search the tracks. And also an administration panel to manage(search) all the tracks and all other inside scripting and all.  So I would like to divide this project into 3 main stages.</p>\n<p>Implementation of the database\nImplementation of the REST API\nDesign and develop front end.</p>\n",
          "difficulty": "advanced",
          "id": "proj_genes-genomes-and-va_2017_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6753041504010240/",
          "proposal_id": null,
          "short_description": "Ensembl is a data warehousing and data sets project which helps to analyse advanced biological data. Simple this application displays a 1 dimensional...",
          "slug": "project-proposal-ensembl-track-database-mentors-andy-yates-stephen-trevanion",
          "status": "completed",
          "student_name": "Chanaka De Silva",
          "student_profile": null,
          "tags": [
            "api",
            "ai",
            "database"
          ],
          "title": "Project Proposal Ensembl Track Database Mentors : Andy Yates, Stephen Trevanion"
        },
        {
          "code_url": "https://gist.github.com/stefanches7/79f167369b543ab9089dc03c26780bc3",
          "description": "<p>The Ensembl and Ensembl Genomes projects provide genomic data for over 40 thousands genomes. Considering even the increasing number of this data, it rapidly becomes harder for the end user to work directly with current FTP sites. This project aims to tackle this problem.</p>\n",
          "difficulty": null,
          "id": "proj_genes-genomes-and-va_2017_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/4741862938116096/",
          "proposal_id": null,
          "short_description": "The Ensembl and Ensembl Genomes projects provide genomic data for over 40 thousands genomes. Considering even the increasing number of this data, it...",
          "slug": "data-file-search-api",
          "status": "completed",
          "student_name": "Stefan Dvoretskii",
          "student_profile": null,
          "tags": [
            "api",
            "ai"
          ],
          "title": "Data file search API"
        },
        {
          "code_url": "https://github.com/ravaan/GSoC-Strain_Differential",
          "description": "<p>The objective of the project is to get a <strong>scrollable web view</strong> for gene variations after changing the reference strain of genome data in real time. The project uses backend data processing in <strong>Java</strong> and front end visualization using customized <strong>Genoverse - an HTML5 and JavaScript genome browser</strong> with the reference change algorithm implemented in Java.</p>\n<p>The Genome data from VCF file format is converted into optimized index files and stored which is later processed on demand using reference change algorithm, converted into standard gene visualization tracks and visualized using Genoverse.</p>\n",
          "difficulty": null,
          "id": "proj_genes-genomes-and-va_2017_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6539939722297344/",
          "proposal_id": null,
          "short_description": "The objective of the project is to get a scrollable web view for gene variations after changing the reference strain of genome data in real time. The...",
          "slug": "strain-differential",
          "status": "completed",
          "student_name": "Arpit Agarwal",
          "student_profile": null,
          "tags": [
            "java",
            "javascript",
            "web",
            "ml",
            "ai"
          ],
          "title": "Strain Differential"
        },
        {
          "code_url": "https://github.com/EnsemblGSOC/sourabhr-gsoc-2017/blob/master/README.md",
          "description": "<p>The motive is enable support for large binary file formats in Genoverse, a genome browser that is written in javascript. This project would involve writing javascript parsers for  BigWig, BigBed and VCF file formats. Once this support is added, Genoverse could be adopted by Ensembl for use in their genome browser. This would let Ensembl to process the files on client side and reduce load on server, letting it handle the large amount of genome data Ensembl hosts.</p>\n",
          "difficulty": null,
          "id": "proj_genes-genomes-and-va_2017_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5774476155289600/",
          "proposal_id": null,
          "short_description": "The motive is enable support for large binary file formats in Genoverse, a genome browser that is written in javascript. This project would involve...",
          "slug": "enabling-large-file-format-support-in-genoverse",
          "status": "completed",
          "student_name": "Sourabhreddy Medapati",
          "student_profile": null,
          "tags": [
            "java",
            "javascript"
          ],
          "title": "Enabling large file format support in Genoverse"
        },
        {
          "code_url": "https://github.com/EnsemblGSOC/GeneticDataVisualisationInMixedReality_RachelSlater",
          "description": "<p>This project would involve building an application allowing genes to be visualised in ‘mixed reality’ with the Microsoft HoloLens. Mixed reality (MR), sometimes referred to as hybrid reality, is the merging of real and virtual worlds to produce new environments and visualisations where physical objects co-exist and interact in real-time. HoloLens uses the real-world as a canvas on which to overlay virtual elements. \nThe prospective application will utilise the genetic data held by Ensembl, and bring genes and genomes to life by creating 3-D ‘holograms’ of them which viewers can interact with using natural gestures, voice commands, and eye movements. \nDepending on the success of the resulting application, there is scope to move the application to the Improbable Spatial OS platform (<a href=\"https://improbable.io/\" target=\"_blank\">https://improbable.io/</a>), which can be integrated with applications built with Unity. (Improbable is partnered with Google Cloud Platform to deliver their services). This platform allows developers to build simulations of virtual worlds in which concurrent players can interact. This would mean that the gene and genome visualisations could be viewed and interacted with online by many people at once.</p>\n",
          "difficulty": null,
          "id": "proj_genes-genomes-and-va_2017_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5936022491758592/",
          "proposal_id": null,
          "short_description": "This project would involve building an application allowing genes to be visualised in ‘mixed reality’ with the Microsoft HoloLens. Mixed reality...",
          "slug": "gene-visualisation-in-mixed-reality-with-microsoft-hololens",
          "status": "completed",
          "student_name": "Rachel Slater",
          "student_profile": null,
          "tags": [
            "cloud",
            "ui"
          ],
          "title": "Gene Visualisation in Mixed Reality with Microsoft HoloLens."
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2017/organizations/5455879507804160/"
    },
    "year_2018": {
      "num_projects": 2,
      "projects": [
        {
          "code_url": "https://github.com/EnsemblGSOC/nabil-gsoc-2018",
          "description": "<p>In Comparative Genomics we compare an unknown gene with some other known genes, for better inference of biological properties of that unknown gene. Identification of Gene Orthology Relation is the most important task of Comparative Genomics, as they tend to preserve similar molecular and biological functions. Thus if we can establish orthology relationships between two genes, we can obtain valuable evolutionary history of the two genes. However, with advanced sequencing depth and expansion in transcriptome data, genes are no longer the proper units for interrogation in functional conservation, evolutionary events, and expressional patterns, especially in the field of alternative splicing. As the accumulation of transcriptomic data, alternative splicing is taken into account in the assignments of gene orthologs and the orthology is suggested to be further considered at transcript level. Whether gene or transcript orthology, exons are the basic units that represent the whole gene structure; however, there is not much reported study on how to build exon level orthology in a whole genome scale. Therefore, it is essential to establish a transcription oriented gene orthology algorithm.</p>\n",
          "difficulty": "advanced",
          "id": "proj_genes-genomes-and-va_2018_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/4976103340900352/",
          "proposal_id": null,
          "short_description": "In Comparative Genomics we compare an unknown gene with some other known genes, for better inference of biological properties of that unknown gene....",
          "slug": "transcript-comparisons",
          "status": "completed",
          "student_name": "Nabil Ibtehaz",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Transcript Comparisons"
        },
        {
          "code_url": "https://github.com/EnsemblGSOC/tony-gsoc-2018",
          "description": "<p>Develop an automated system that performs analyses on newly sequenced genomes.</p>\n",
          "difficulty": null,
          "id": "proj_genes-genomes-and-va_2018_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5956232191934464/",
          "proposal_id": null,
          "short_description": "Develop an automated system that performs analyses on newly sequenced genomes.",
          "slug": "automated-processing-of-primary-genome-analysis",
          "status": "completed",
          "student_name": "Tony Yang",
          "student_profile": null,
          "tags": [],
          "title": "Automated Processing of Primary Genome Analysis"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2018/organizations/5477445075468288/"
    },
    "year_2019": {
      "num_projects": 3,
      "projects": [
        {
          "code_url": "https://github.com/EnsemblGSOC/srijan-gsoc-2019",
          "description": "<p>Advances in RNA sequencing technologies have revealed the complexity of our genome. Long non-coding RNAs (lncRNAs) make up the majority of the non-coding transcriptome. Understanding the significance of this RNA world is one of the most important challenges faced in biology today, and the lncRNAs within it represent a gold mine of potential new biomarkers and drug targets. Its discovery is still at a preliminary stage.\nTo date, very few lncRNAs have been characterized in detail. However, it is clear that lncRNAs are important regulators of gene expression, and lncRNAs are thought to have a wide range of functions in cellular and developmental processes. There are many specialized lncRNA databases (like RefSeq, GENCODE, Ensembl, SGD, tair). We will use Machine Learning techniques to highlight and compare two sets of calls (of Ensembl / GENCODE and RefSeq) and determine which calls are incorrect.\nGoal of the Project: Implement a machine learning model (a 2nd pass filter) which will predict / validate credible calls (true positive/false positive cases) produced by RefSeq and GENCODE (or Ensembl).</p>\n",
          "difficulty": "advanced",
          "id": "proj_genes-genomes-and-va_2019_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5451745902198784/",
          "proposal_id": null,
          "short_description": "Advances in RNA sequencing technologies have revealed the complexity of our genome. Long non-coding RNAs (lncRNAs) make up the majority of the...",
          "slug": "applying-machine-learning-techniques-to-characterising-and-naming-lncrna-genes",
          "status": "completed",
          "student_name": "Srijan Verma",
          "student_profile": null,
          "tags": [
            "ai",
            "database"
          ],
          "title": "Applying machine learning techniques to characterising and naming lncRNA genes"
        },
        {
          "code_url": "https://medium.com/@goyal.praduman611/gsoc19-with-ensembl-final-submission-60390448a2b2?source=friends_link&sk=5b1b31011d8defb003e688c87c4c5785",
          "description": "<p>The project aims to deliver a responsive web-based analytics dashboard, integrated to an in-house catalogue of circRNAs identified from multiple species with the functionalities like searching on the basis of genome coordinates and host gene names, a visual representation of inferred circRNA structure, comparing isoforms across different samples that would be linked to Ensembl genome browser.</p>\n",
          "difficulty": null,
          "id": "proj_genes-genomes-and-va_2019_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/6244922426916864/",
          "proposal_id": null,
          "short_description": "The project aims to deliver a responsive web-based analytics dashboard, integrated to an in-house catalogue of circRNAs identified from multiple...",
          "slug": "circular-rna-analytics-frontend",
          "status": "completed",
          "student_name": "Praduman Goyal",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "frontend"
          ],
          "title": "Circular RNA analytics frontend"
        },
        {
          "code_url": "https://github.com/EnsemblGSOC/compara-deep-learning",
          "description": "<p>Homology refers to the shared ancestry between a pair of structures, organisms or genes, in different taxa.\nCurrently, homology types are decided on the basis of phylogenetic trees. They are later checked, for quality-control measures, by a whole genome-alignment score. The aim of this project is to use the methods of Deep Learning to predict the homology calls and check the homologies predicted by the above methods.</p>\n",
          "difficulty": null,
          "id": "proj_genes-genomes-and-va_2019_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5953105168957440/",
          "proposal_id": null,
          "short_description": "Homology refers to the shared ancestry between a pair of structures, organisms or genes, in different taxa.\nCurrently, homology types are decided on...",
          "slug": "using-deep-learning-techniques-to-enhance-orthology-calls",
          "status": "completed",
          "student_name": "Harshit Gupta-1",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Using Deep Learning Techniques To Enhance Orthology Calls"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2019/organizations/4535509118877696/"
    },
    "year_2020": null,
    "year_2021": null,
    "year_2022": null,
    "year_2023": null,
    "year_2024": null,
    "year_2025": null
  },
  "first_time": false,
  "contact": {
    "email": "helpdesk@ensembl.org",
    "guide_url": null,
    "ideas_url": null,
    "irc_channel": null,
    "mailing_list": "http://lists.ensembl.org/mailman/listinfo/dev"
  },
  "social": {
    "blog": "http://www.ensembl.info/",
    "discord": null,
    "facebook": null,
    "github": null,
    "gitlab": null,
    "instagram": null,
    "linkedin": null,
    "mastodon": null,
    "medium": null,
    "reddit": null,
    "slack": null,
    "stackoverflow": null,
    "twitch": null,
    "twitter": "https://twitter.com/ensembl",
    "youtube": null
  },
  "meta": {
    "version": 1,
    "generated_at": "2026-01-25T15:28:53.191Z"
  }
}