{
  "id": "692251d553dd9d7326d33dc6",
  "slug": "geomscale",
  "name": "GeomScale",
  "category": "Science and medicine",
  "description": "Scalable geometric and statistical software",
  "image_url": "https://summerofcode.withgoogle.com/media/org/geomscale/ongpste986nd7t6p-360.png",
  "img_r2_url": "https://pub-268c3a1efc8b4f8a99115507a760ca14.r2.dev/geomscale.webp",
  "logo_r2_url": null,
  "url": "https://geomscale.github.io",
  "active_years": [
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "first_year": 2020,
  "last_year": 2025,
  "is_currently_active": true,
  "technologies": [
    "python",
    "c++",
    "r",
    "jupyter",
    "github-actions"
  ],
  "topics": [
    "biology",
    "statistics",
    "mathematical software",
    "optimization",
    "finance",
    "mathematics",
    "data science",
    "computational biology",
    "computation geometry",
    "computational geometry"
  ],
  "total_projects": 30,
  "stats": {
    "avg_projects_per_appeared_year": 5,
    "projects_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": null,
      "year_2019": null,
      "year_2020": 3,
      "year_2021": 5,
      "year_2022": 6,
      "year_2023": 3,
      "year_2024": 7,
      "year_2025": 6
    },
    "students_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": null,
      "year_2019": null,
      "year_2020": 3,
      "year_2021": 5,
      "year_2022": 6,
      "year_2023": 3,
      "year_2024": 7,
      "year_2025": 6
    },
    "total_students": 26
  },
  "years": {
    "year_2016": null,
    "year_2017": null,
    "year_2018": null,
    "year_2019": null,
    "year_2020": {
      "num_projects": 3,
      "projects": [
        {
          "code_url": "https://github.com/GeomScale/volume_approximation/pull/93",
          "description": "<p>We aim to provide an implementation of modern approaches to Sum of Squares problems.</p>\n",
          "difficulty": null,
          "id": "proj_geomscale_2020_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/6034482273976320/",
          "proposal_id": null,
          "short_description": "We aim to provide an implementation of modern approaches to Sum of Squares problems.",
          "slug": "optimization-and-sum-of-squares",
          "status": "completed",
          "student_name": "Bento Natura",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Optimization and Sum of Squares"
        },
        {
          "code_url": "https://alexmanochis.github.io/GSoC20/",
          "description": "<p>Uniform sampling from convex polytopes in high dimensions is very useful in many scientific fields and applications. The package volesti is a C++ software with an R interface in CRAN which provides 4 geometric random walks for uniform sampling from convex polytopes among other algorithms in the field of geometric statistics. A classical and difficult problem is to know when the Markov chain converges to the target distribution in order to stop sampling. Diagnostics are tools that can be used to check whether the quality of a sample generated with an MCMC algorithm is sufficient to provide an accurate approximation of the target distribution. The goals of this project are to provide: i) three diagnostic tools for a random walk to check convergence to the target distribution, ii) efficient implementations of all the known geometric random walks for uniform sampling from convex bodies, that are not implemented in volesti and iii) an improved implementation for Billiard walk which is already implemented in volesti. The diagnostic tools would allow us to compare the mixing time of various random walks, which is a classical and hard problem in high dimensional statistics.</p>\n",
          "difficulty": null,
          "id": "proj_geomscale_2020_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/4925284253433856/",
          "proposal_id": null,
          "short_description": "Uniform sampling from convex polytopes in high dimensions is very useful in many scientific fields and applications. The package volesti is a C++...",
          "slug": "a-comparative-study-of-uniform-high-dimensional-samplers",
          "status": "completed",
          "student_name": "Alexandros Manochis",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "A comparative study of uniform high dimensional samplers"
        },
        {
          "code_url": "https://papachristoumarios.github.io/2020/07/21/Sampling-from-high-dimensional-truncated-log-concave-densities-with-volesti/",
          "description": "<p>This proposal aims to provide functionality on sampling from high-dimensional densities. A log-concave density is a density g(x) proportional to exp(-f(x)) where f(x) is a (strongly) convex function, possibly truncated to a convex domain K. Our work aims to implement state-of-the-art methods for sampling from these densities.</p>\n",
          "difficulty": null,
          "id": "proj_geomscale_2020_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5931962579025920/",
          "proposal_id": null,
          "short_description": "This proposal aims to provide functionality on sampling from high-dimensional densities. A log-concave density is a density g(x) proportional to...",
          "slug": "sampling-from-high-dimensional-log-concave-densities",
          "status": "completed",
          "student_name": "Marios Papachristou",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Sampling from High-Dimensional log-concave densities"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2020/organizations/4606415412396032/"
    },
    "year_2021": {
      "num_projects": 5,
      "projects": [
        {
          "code_url": "https://github.com/GeomScale/volume_approximation/pull/173",
          "description": "<p>Package volesti supports volume estimation for polytopes, providing several randomized approximation methods. The most efficient implementation employs billiard walk (uniform sampling) and a certain Multiphase Monte Carlo technique. The project is about extending volesti to support uniform and gaussian sampling for spectrahedra. Moreover, we will extend the volume estimation methods to support spectrahedra.\nSpectrahedra are probably the most well studied shapes after polyhedra. They are the feasible regions of semidefinite programs in the way that polytopes are feasible regions of linear programs. Thus, the project is of special interest for the research communities of geometric computing and optimization.</p>\n",
          "difficulty": null,
          "id": "proj_geomscale_2021_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6401652449345536/",
          "proposal_id": null,
          "short_description": "Package volesti supports volume estimation for polytopes, providing several randomized approximation methods. The most efficient implementation...",
          "slug": "high-dimensional-geometric-computations-with-least-matrix-inequalities",
          "status": "completed",
          "student_name": "Alexandros Manochis",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "High dimensional geometric computations with least matrix inequalities"
        },
        {
          "code_url": "https://hariszaf.github.io/gsoc2021/",
          "description": "<p>Metabolic modeling has been interwoven with constraing-based methods. \nThe value of randomized sampling in the framework of metabolic modeling has been proved itself over the years (see <a href=\"https://doi.org/10.1074/jbc.R800048200\" target=\"_blank\">Schellenberger and Pallson (2009)</a> and <a href=\"https://www.nature.com/articles/s41540-019-0109-0\" target=\"_blank\">Herrmann et al (2019)</a>).\nAim of this project is to integrate the produced data and knowledge of these twenty  (and more) years and make use of the randomized flux sampling method  to evaluate the metabolic interactions retrieved. \nTo this end, thousands of publicly available reference microbial genomes will be selected, and their automatic metabolic network reconstructions will be implemented. \nBased on these models, cross-feeding interactions algorithms will be performed for groups of species to extract key metabolic processes. \nNew functions, implementing the recently developed <a href=\"https://hal.inria.fr/hal-03047049v2\" target=\"_blank\">Multiphase Monte Carlo Sampling (MMCS)</a> algorithm in the framework  of the <em>dingo</em> library, will \nmake use of the randomized flux sampling concept to evaluate the processes retrieved.</p>\n",
          "difficulty": null,
          "id": "proj_geomscale_2021_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6407348884602880/",
          "proposal_id": null,
          "short_description": "Metabolic modeling has been interwoven with constraing-based methods. \nThe value of randomized sampling in the framework of metabolic modeling has...",
          "slug": "from-dna-sequences-to-metabolic-interactions-building-a-pipeline-to-extract-key-metabolic-processes",
          "status": "completed",
          "student_name": "Haris Zafeiropoulos",
          "student_profile": null,
          "tags": [
            "ai",
            "ui",
            "ux"
          ],
          "title": "From DNA sequences to metabolic interactions: building a pipeline to extract key metabolic processes"
        },
        {
          "code_url": "https://github.com/GeomScale/volume_approximation/pull/172",
          "description": "<p>Package volesti provides several geometric random walks for high dimensional\nsampling from convex polytopes. The current implementations can be used for any log­concave distribution restricted to a convex polytope but they do not support parallel execution and sparse linear algebra computations. The aim of this project is to provide parallel implementations for all the existing random walks in volesti and efficient sparse linear algebra computations when the matrix of a polytope is sparse. I believe that this project would be of special interest for high dimensional geometric and statistical computing, e.g. in Markov Chain Monte Carlo multivariate integration, convex optimization and Bayesian inference.</p>\n",
          "difficulty": null,
          "id": "proj_geomscale_2021_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6593875421954048/",
          "proposal_id": null,
          "short_description": "Package volesti provides several geometric random walks for high dimensional\nsampling from convex polytopes. The current implementations can be used...",
          "slug": "parallel-geometric-random-walks-with-sparse-numerical-optimizations",
          "status": "completed",
          "student_name": "Konstantinos Pallikaris",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Parallel Geometric Random Walks with Sparse Numerical Optimizations"
        },
        {
          "code_url": "https://surajchoubey.github.io/gsoc21/",
          "description": "<p>Integration is a fundamental problem in mathematics, physics and computer science with many applications that span the whole spectrum of sciences and engineering. Monte Carlo Integration can be used to compute multi-dimensional definite numerical integrals using various sampling techniques using random numbers. It is used for various research and development purposes and it will help in extending VolEsti library’s functionality of multidimensional integrals.</p>\n",
          "difficulty": null,
          "id": "proj_geomscale_2021_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/4825133331513344/",
          "proposal_id": null,
          "short_description": "Integration is a fundamental problem in mathematics, physics and computer science with many applications that span the whole spectrum of sciences and...",
          "slug": "geomscale-monte-carlo-integration",
          "status": "completed",
          "student_name": "Suraj Choubey",
          "student_profile": null,
          "tags": [],
          "title": "GeomScale: Monte Carlo Integration"
        },
        {
          "code_url": "https://gist.github.com/vaithak/b62b7967fc918f6671c2de7276131f53",
          "description": "<p>The problem of counting the linear extensions of a given partial order consists of finding (counting) all the possible ways that we can extend the partial order to a total order that preserves the original partial order. It is an important problem with various applications in Artificial Intelligence and Machine Learning, for example in partial-order plans and in learning graphical models. It is a well known #P-complete problem; the fastest known algorithms are based on dynamic programming and require exponential time and space. Nevertheless, if we only need an approximate counting attained with a probability of success, then the problem admits a polynomial-time solution for all posets using Markov chain Monte Carlo (MCMC) methods. This project aims to implement new randomized methods to approximate the number of linear extensions based on volume approximation.</p>\n",
          "difficulty": null,
          "id": "proj_geomscale_2021_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6050504680931328/",
          "proposal_id": null,
          "short_description": "The problem of counting the linear extensions of a given partial order consists of finding (counting) all the possible ways that we can extend the...",
          "slug": "counting-linear-extensions",
          "status": "completed",
          "student_name": "Vaibhav Thakkar",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Counting linear extensions"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2021/organizations/5291444977270784/"
    },
    "year_2022": {
      "num_projects": 6,
      "projects": [
        {
          "code_url": "https://gist.github.com/zhanggiene/8471601fa25ba9db90303661b0e2237b",
          "description": "The most efficient algorithm to sample from a log-concave distribution, that volesti supports is the Hamiltonian Monte Carlo with leapfrog integration. The leapfrog method is an Euler method that in each step evaluates the gradient of the log-probability density function of the target distribution. To sample from a log-concave distribution volesti currently requires a function that evaluates this gradient as an input.\n\nHowever, there are plenty of applications that require sampling from a distribution where the gradient of the log-probability density function is unknown. This project will address this problem and will provide to volesti routines of automatic differentiation of a multivariate function. Then, a function that evaluates the log-density will suffice to sample from the target distribution.",
          "difficulty": null,
          "id": "proj_geomscale_2022_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/TD3u7S00/",
          "proposal_id": null,
          "short_description": "The most efficient algorithm to sample from a log-concave distribution, that volesti supports is the Hamiltonian Monte Carlo with leapfrog...",
          "slug": "automatic-differentiation-support-in-volesti",
          "status": "completed",
          "student_name": "Zhang Zhuyan",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "Automatic differentiation support in volesti"
        },
        {
          "code_url": "https://abureyanahmed.github.io/gsoc2022/final_report_gsoc.pdf",
          "description": "In this project, we will implement different algorithms to count linear extensions approximately. In the problem of counting the linear extensions, we are given an initial partial order $P$. The objective of this problem is to generate all orders (linear extensions) that preserve $P$. However, there can be an exponential number of such orders. Hence the running time to count the number of total orders that preserves $P$ will be exponential. To get rid of exponential computation, we will approximate the number of linear extensions using volume computation. We will develop different approximation algorithms and compare their performance.",
          "difficulty": null,
          "id": "proj_geomscale_2022_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/rpWAufXk/",
          "proposal_id": null,
          "short_description": "In this project, we will implement different algorithms to count linear extensions approximately. In the problem of counting the linear extensions,...",
          "slug": "counting-linear-extensions-with-volume-computation",
          "status": "completed",
          "student_name": "reyan_ahmed",
          "student_profile": null,
          "tags": [],
          "title": "Counting linear extensions with volume computation"
        },
        {
          "code_url": "https://github.com/GeomScale/dingo/pull/18",
          "description": "Sampling and volume computation of convex polytopes is a challenging computational problem with many applications in inference from linear constraints [1]. Thus, sampling algorithms are essential in many scientific fields. Biology in general, and most particularly metabolic modeling, is among those scientific fields that need such approaches the most to address their modern challenges. Flux Balance Analysis (FBA) is a typical example of a constraint-based metabolic model (CBMM) [2]. However, flux sampling is considered a superior methodology. Python package dingo provides the Multiphase Monte Carlo Sampling (MMC) algorithm to sample from the flux space of a metabolic network. However, the preprocessing methods implemented in dingo need major improvements regarding memory allocation. The goal of this project is to improve the preprocessing methods in dingo to support faster sampling and rounding pipelines.",
          "difficulty": null,
          "id": "proj_geomscale_2022_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/968ibP0I/",
          "proposal_id": null,
          "short_description": "Sampling and volume computation of convex polytopes is a challenging computational problem with many applications in inference from linear...",
          "slug": "memory-allocation-in-facet-redundancy-removal-in-dingo",
          "status": "completed",
          "student_name": "Haris Zafeiropoulos",
          "student_profile": null,
          "tags": [
            "python",
            "ai",
            "ux"
          ],
          "title": "Memory allocation in facet redundancy removal in dingo"
        },
        {
          "code_url": "https://github.com/GeomScale/dingo/pull/40",
          "description": "Package dingo is a python package that analyzes metabolic networks. It relies\non high dimensional sampling with Markov Chain Monte Carlo (MCMC) methods and fast optimization methods to analyze the possible states of a metabolic network. It represents a metabolic network with a convex polytope, while the points in the interior of the polytope correspond to steady states of the network. By sampling, dingo, explores and statistically studies the flux space of the network. To perform MCMC sampling, dingo relies on the C++ library volesti. Currently, it provides MMCS algorithm which is based on Billiard Walk and on a multiphase rounding scheme. This project will provide dingo additional options for uniform sampling by exposing into it several C++ implementations of random walks that are included in volesti. Moreover, it will provide sampling from the exponential distribution using the C++ implementation of Hamiltonian Monte Carlo in volesti.",
          "difficulty": null,
          "id": "proj_geomscale_2022_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/UKcKOkcC/",
          "proposal_id": null,
          "short_description": "Package dingo is a python package that analyzes metabolic networks. It relies on high dimensional sampling with Markov Chain Monte Carlo (MCMC)...",
          "slug": "support-for-new-sampling-methods-and-new-model-formats-in-dingo",
          "status": "completed",
          "student_name": "KONSTANTINOS PALLIKARIS",
          "student_profile": null,
          "tags": [
            "python",
            "ai",
            "ux"
          ],
          "title": "Support for new sampling methods and new model formats in dingo"
        },
        {
          "code_url": "https://iakoviid.github.io/GoogleSummerOfCode2022/",
          "description": "The relationship between sampling and optimization has gained increasing interest in recent years. A great number of optimization algorithms that are developed leverage sampling. The goal of this project is to equip the VolEsti library with a Riemannian Hamiltonian Monte Carlo (RHMC) sampler constrained on convex bodies and then use it for the implementation of optimization algorithms. The implemented sampler should return samples from log-concave distributions constrained in polytopes as well as spectrahedra.  First of all, the initial implementation will be based on very recent promising research about an RHMC algorithm constrained in polytopes. We will expand on this effort by extending its capabilities to handle Spectrahedra. Afterwards, the above implementation will be used as a subroutine for a Semidefinite Program (SDP) solver. Last but not least, we will also include benchmark tests to compare the efficiency of our code against other state of the art libraries. As a summary, the project's deliverables will consist of the implementation of: an RHMC sampler first constrained on polytopes, then extended on spectrahedra, SDP optimization algorithms that use RHMC and finally testing against other libraries.",
          "difficulty": null,
          "id": "proj_geomscale_2022_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/li2dNGB6/",
          "proposal_id": null,
          "short_description": "The relationship between sampling and optimization has gained increasing interest in recent years. A great number of optimization algorithms that are...",
          "slug": "randomized-sdp-solver-with-riemannian-hamiltonian-monte-carlo",
          "status": "completed",
          "student_name": "Ioannis Iakovidis",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Randomized SDP solver with Riemannian Hamiltonian Monte Carlo"
        },
        {
          "code_url": "https://github.com/huuphuocle/sampling_correlation_matrices",
          "description": "We study the sampling of correlation matrices from a given probability density, which has applications in various scientific, engineering and business areas (biology, finances,...). This problem is technically difficult due to the constraints of correlation matrices (entries in [-1,1], positive semi-definiteness). The current methods can only scale to a few tens of dimensions.\n\nThis project aims to provide efficient C++ implementations for new geometric-flavored algorithms to sample correlation matrices (Arakelian, Chalkis 2021)  and integrate them into VolEsti, an open-source high-performance software for sampling, volume computing and geometric statistics. Our main tasks consist of implementing a new class of convex bodies to represent the space of correlation matrices and geometric operations for performing two random walk sampling algorithms (the accelerated billiard walk and Reflective Hamiltonian Monte Carlo algorithm) over those convex bodies. These tasks can be supported by the already existing geometric facilities of VolEsti and the theoretical results found in related works. We will focus mainly on building an optimized C++ code to achieve better scalability for those algorithms and carry out intensive experiment and benchmark with other competitors to justify our efficiency. \n\nThe expected duration of this project is 175 hours spread over 7 weeks of coding period (June 13 - July 29). The C++ implementation obtained by the end of this project will expand VolEsti towards an all-in-one high-performance statistic tools for research and business uses.",
          "difficulty": null,
          "id": "proj_geomscale_2022_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/biRI2YLT/",
          "proposal_id": null,
          "short_description": "We study the sampling of correlation matrices from a given probability density, which has applications in various scientific, engineering and...",
          "slug": "sampling-correlation-matrices",
          "status": "completed",
          "student_name": "Huu Phuoc Le",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Sampling correlation matrices"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2022/organizations/geomscale/"
    },
    "year_2023": {
      "num_projects": 3,
      "projects": [
        {
          "code_url": "https://github.com/GeomScale/dingo/commit/a1724b07217248d51e4b3e799a82c039b667c91e",
          "description": "My proposal is to extend the Python package dingo with two Markov Chain Monte Carlo sampling methods, which will enable exponential sampling from the set of flux vectors for constraint-based metabolic modelling. The sampling methods - NUTS Reflective Hamiltonian Monte Carlo, Reflective Exact HMC, and Riemannian Hamiltonian Monte Carlo - have already been implemented in C++ and integrated into the volesti codebase. The extended C++ bindings and Python wrappers will enable access to these methods through dingo.\n\nThis will involve running experiments on benchmark metabolic networks to compare the results obtained from the new random walks and the existing Multiphase Monte Carlo Sampling method based on Billiard walk. The experiments will generate new biological insights by providing an exponential sampling of flux vectors, which will allow for an unbiased characterization of the metabolic capabilities of biochemical networks. The final deliverables of the project will be the extended dingo package, the results of the experiments, and a brief report discussing the findings.",
          "difficulty": null,
          "id": "proj_geomscale_2023_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/FHAnvNUp",
          "proposal_id": "AhFPweoF",
          "short_description": "My proposal is to extend the Python package dingo with two Markov Chain Monte Carlo sampling methods, which will enable exponential sampling from the...",
          "slug": "support-exponential-sampling-from-the-space-of-steady-states-of-a-metabolic-network",
          "status": "completed",
          "student_name": "Guillermo Martin",
          "student_profile": null,
          "tags": [
            "python",
            "ai",
            "ux"
          ],
          "title": "Support exponential sampling from the space of steady states of a metabolic network"
        },
        {
          "code_url": "https://docs.google.com/document/d/e/2PACX-1vSBBqs7U1k8y_zWDEvuIk4_Qo9PzqGrj3BXib_ELUggmLdeHv7cuZxpf571MhVuKrSF5WdrfOF3K_df/pub",
          "description": "This project will improve the memory allocation in the main routine for facet redundancy removal in GeomScale's Python package dingo. The project is expected to highly improve the run-time of the preprocessing of a metabolic network with dingo. Thus, that will be an important contribution that will allow for preprocessing of large metabolic networks in Systems Biology.",
          "difficulty": null,
          "id": "proj_geomscale_2023_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/g3A99uhs",
          "proposal_id": "2UuZkXJV",
          "short_description": "This project will improve the memory allocation in the main routine for facet redundancy removal in GeomScale's Python package dingo. The project is...",
          "slug": "memory-allocation-in-facet-redundancy-removal-in-dingo",
          "status": "completed",
          "student_name": "Nitish Malang",
          "student_profile": null,
          "tags": [
            "python",
            "ai"
          ],
          "title": "Memory allocation in facet redundancy removal in dingo"
        },
        {
          "code_url": "https://geomscale.github.io/Progress-of-Rvolesti-GSoC23/",
          "description": "The main goal of this project is to create a dedicated repository for the R interface code of Volesti, a tool developed by GeomScale for volume computation and sampling in high dimensions. Currently, both the C++ and R interface code reside in the same repository. To achieve this, the existing codebase will be split into two separate repositories. This separation will involve modifying the package description file, R documentation files and R source code files in the new R interface repository. Additionally, the existing tests will be adjusted to match the new package structure and a comprehensive set of test cases will be developed to cover all the essential features of the R interface. Furthermore, the R interface code will be updated to ensure compatibility with the latest versions. Lastly, thorough documentation will be created for the new R interface, explaining the functionality of various functions and arguments, providing practical examples of package usage and demonstrating how the R package integrates with the wider Volesti ecosystem.",
          "difficulty": null,
          "id": "proj_geomscale_2023_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/Ju6SPJP1",
          "proposal_id": "gnVanLN8",
          "short_description": "The main goal of this project is to create a dedicated repository for the R interface code of Volesti, a tool developed by GeomScale for volume...",
          "slug": "move-r-interface-of-volesti-to-a-new-repository",
          "status": "completed",
          "student_name": "Soumya Tarafder",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Move R Interface of Volesti to a New Repository"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2023/organizations/geomscale"
    },
    "year_2024": {
      "num_projects": 7,
      "projects": [
        {
          "code_url": "https://github.com/GeomScale/GeoFin/pull/4",
          "description": "Indexes are baskets of stocks with specific characteristic. They provide examples for diversification in investing to mitigate the volatility of portfolios. Therefore, many investors, including institutions such as fund managers, attempt to build their portfolios to track closely major indexes. However, the effort and the transaction cost for tracking the exact constituents of indexes is not negligible, especially for indexes of many stocks (S&P500). An approach to reduce the transaction cost in index tracking is the sparse replication strategy which tries to mimic the index return through a subset of its constituents. \n\nIn this project, we implement this method through the point of view of mean-variance optimization, i.e., to minimize the tracking error as a quadratic utility function. We first replicate the study in (Shi, Shu, Tian 2020) \"High-dimensional index tracking based on the adaptive elastic net\". This means we will implement an algorithm for sparse index replication using optimization with adaptive elastic net regularization. By implementing a Python framework and exploring possible open-source optimizers, we aim to deliver to GeomScale community a new functionality of portfolio selection, which covers data parsing and preprocessing, backtesting with configurable parameters and automated fine-tuning of hyper-parameters. The next step is to test different ideas to improve this method and calibrate the hyper-parameters to fit the market condition.",
          "difficulty": null,
          "id": "proj_geomscale_2024_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/TjKj1HbI/",
          "proposal_id": null,
          "short_description": "Indexes are baskets of stocks with specific characteristic. They provide examples for diversification in investing to mitigate the volatility of...",
          "slug": "machine-learning-and-optimization-for-finance-index-replication",
          "status": "completed",
          "student_name": "Ho Thi Minh Ha",
          "student_profile": null,
          "tags": [
            "python",
            "ios",
            "ai",
            "ui"
          ],
          "title": "Machine Learning and Optimization for Finance: Index Replication"
        },
        {
          "code_url": "https://sotiristouliopoulos.github.io/dingo/",
          "description": "The first genome-scale models of metabolism appeared in 1999 and 2000. In the following years fundamental Microbial Systems concepts were developed such as in silico methods and algorithms to analyze their properties. Genome-scale Metabolic models (GEMs) built on genome-scale metabolic network reconstructions (GENREs) are capable of deciphering the complex interactions occurring in bacteria, through predictions of the possible mechanism underlying these interactions. \ndingo is a Python package that supports a variety of methods to sample from the flux space of metabolic models, based on state-of-the-art random walks and rounding methods. Aim of this project is to enhance dingo by incorporating a  preprocessing class to reduce and simplify metabolic networks, by removing certain reactions and metabolites. To identify correlated reactions, i.e. the flux of one depends on the others,  I will develop a post-processing function to calculate correlation metrics and compare pairwise reaction fluxes. Additionally, another function will create graphs from the  correlation matrix aiming to predict metabolic pathways.\nIn the second half of the project, I will implement approaches  for building microbial communities models. Two main approaches are to be implemented: Bag of Genomes and Bag of Genes. I will develop :  a new class (“dingo.Community()”) that will  read and store a community model of two microbes based on the user’s approach of choice. Its output will be then used as input to the dingo.PolytopeSampler to proceed with sampling steps. \nSampling in the community flux space with the different sampling methods already supported by dingo and benchmarking of the community modeling approaches against real data will be delivered. Refactoring current dingo functions to adjust the new functionality will be done too.",
          "difficulty": "advanced",
          "id": "proj_geomscale_2024_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/vBkrROTa/",
          "proposal_id": null,
          "short_description": "The first genome-scale models of metabolism appeared in 1999 and 2000. In the following years fundamental Microbial Systems concepts were developed...",
          "slug": "pre-and-post-sampling-features-to-leverage-flux-sampling-at-both-the-strain-and-the-community-level",
          "status": "completed",
          "student_name": "Sotiris Touliopoulos",
          "student_profile": null,
          "tags": [
            "react",
            "python",
            "ai",
            "ui",
            "ux"
          ],
          "title": "Pre- and post-sampling features to leverage flux sampling at both the strain and the community level"
        },
        {
          "code_url": "https://www.overleaf.com/read/jkrvrnbfkhph#9abfea",
          "description": "The goal of this project is to improve currently existing implementations for rounding convex polytopes from Volesti as well as develop a new method and analyze its performance. The new method be using the available C++ implementation from Volesti of the Khachiyan algorithm for solving the minimum volume enclosing ellipsoid (MVEE), which will then be transformed into the maximum volume ellipsoid of the polytope (MVE). Finally, the polytope will be brought into John position using the transformation that maps the MVE to the unit ball. The performance of the improved implementations and the new one will then be compared to existing rounding procedures from PolyRound.",
          "difficulty": null,
          "id": "proj_geomscale_2024_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/geh8GTyg/",
          "proposal_id": null,
          "short_description": "The goal of this project is to improve currently existing implementations for rounding convex polytopes from Volesti as well as develop a new method...",
          "slug": "develop-a-new-rounding-method-for-convex-polytopes",
          "status": "completed",
          "student_name": "Luca Perju",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Develop a new rounding method for convex polytopes"
        },
        {
          "code_url": "https://vgnecula.github.io/gsoc/report.html",
          "description": "The current state-of-the-art algorithms for the volume computation of high dimensional convex bodies, such as the one currently used within the VolEsti package, use uniform sampling techniques. This proposal represents a GeomScale project that aims to develop an algorithm for volume computation of high dimensional convex bodies that would be more efficient than those by using the new advancements in non-uniform sampling techniques. Leveraged to provide scalability and efficiency for this computationally intensive process, methods such as the Hamiltonian Monte Carlo (HMC) stand out for their excellent fit for such a task, where the algorithm has to deal with truncated multivariate distributions, as highlighted by Pakman and Paninski. Seamless integration within the VolEsti package is ensured using C++, which aligns with the best practices for developing high-performance mathematical software discussed by Fisikopoulos et al. \n\nThroughout this project's entire research and development process, a blog will be maintained, monitoring all the insights, challenges, optimizations, and developments that will happen. This blog will represent the final deliverable, showcasing all the work done towards the project’s goals during the GSoC program.",
          "difficulty": null,
          "id": "proj_geomscale_2024_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/ZGHwrpR4/",
          "proposal_id": null,
          "short_description": "The current state-of-the-art algorithms for the volume computation of high dimensional convex bodies, such as the one currently used within the...",
          "slug": "efficient-volume-computation",
          "status": "completed",
          "student_name": "Vladimir Necula",
          "student_profile": null,
          "tags": [
            "ml",
            "ai"
          ],
          "title": "Efficient Volume Computation"
        },
        {
          "code_url": "https://github.com/GeomScale/volesti/pull/335",
          "description": "The proposed project aims to refactor the Multiphase Monte Carlo Sampling (MMCS) algorithm, currently implemented in Python with Cython bindings, to be integrated directly into the Volesti C++ library. This refactoring will improve code maintainability, transparency, and allow for MMCS to be accessed seamlessly from both Python and C++ interfaces, as well as potentially from R interface. By consolidating MMCS within the Volesti library, it will enhance the usability and performance of MMCS in various applications related to sampling.",
          "difficulty": null,
          "id": "proj_geomscale_2024_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/NlOey3aN/",
          "proposal_id": null,
          "short_description": "The proposed project aims to refactor the Multiphase Monte Carlo Sampling (MMCS) algorithm, currently implemented in Python with Cython bindings, to...",
          "slug": "refactor-multiphase-monte-carlo-sampling-for-volesti-and-dingo",
          "status": "completed",
          "student_name": "Akis Schinas",
          "student_profile": null,
          "tags": [
            "python",
            "ml",
            "ai"
          ],
          "title": "Refactor Multiphase Monte Carlo Sampling for volesti and dingo"
        },
        {
          "code_url": "https://github.com/GeomScale/dingo/pull/104",
          "description": "The proposed project aims to modernize the Linear Program (LP)\nsolver interface in dingo, a Python package for analyzing metabolic net-\nworks. By replacing the proprietary Gurobi solver with the open-source\noptlang Python library, this project will enhance the accessibility and\nflexibility of dingo’s LP solving methods. The project will involve re-\nplacing the Gurobi dependency with optlang throughout the codebase,\nmodernizing the LP solver interface, conducting thorough testing and\nvalidation, updating the project documentation, and engaging with\nthe dingo community. The expected benefits of this project include in-\ncreased accessibility to LP solving methods, flexibility in choosing LP\nsolvers, and improved methodologies for metabolic network analysis in\nSystems Biology research.",
          "difficulty": null,
          "id": "proj_geomscale_2024_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/bWOwATfK/",
          "proposal_id": null,
          "short_description": "The proposed project aims to modernize the Linear Program (LP) solver interface in dingo, a Python package for analyzing metabolic net- works. By...",
          "slug": "modernize-linear-program-solver-interface-in-dingo",
          "status": "completed",
          "student_name": "Ke Shih",
          "student_profile": null,
          "tags": [
            "python",
            "ai"
          ],
          "title": "Modernize Linear Program solver interface in dingo"
        },
        {
          "code_url": "https://atrayees.github.io/2024/07/28/gsoc24-finalblogpost/",
          "description": "The goal of this project is to (1) improve sampling routines for correlation matrices and (2) further enhance the R interface with sampling correlation matrices of the volesti repository. The implementation will involve working with open-source C++ libraries to solve Generalized Eigenvalue problems as well as working with R and Rcpp. This implementation will create more efficient, well-tuned sampling routines for correlation matrices and increased accessibility and ease with which users can utilize these subroutines through volesti's R interface.",
          "difficulty": null,
          "id": "proj_geomscale_2024_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/zlQlciUR/",
          "proposal_id": null,
          "short_description": "The goal of this project is to (1) improve sampling routines for correlation matrices and (2) further enhance the R interface with sampling...",
          "slug": "improving-sampling-routines-for-correlation-matrices-and-r-interface",
          "status": "completed",
          "student_name": "Atrayee Samanta",
          "student_profile": null,
          "tags": [],
          "title": "Improving sampling routines for correlation matrices and R interface"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2024/organizations/geomscale/"
    },
    "year_2025": {
      "num_projects": 6,
      "projects": [
        {
          "code_url": null,
          "description": "Dingo is a Python library built on top of the C++ library volesti, primarily designed for sampling from convex polytopes, especially within the context of metabolic networks. However, its usability for general polytope sampling and volume computation is currently limited by an underdeveloped Python interface, with key functionality from volesti either not exposed or difficult to use. This project aims to significantly enhance the general-purpose usability of Dingo by exposing hidden bindings, simplifying polytope definition and computation workflows, and enriching documentation with clear, beginner-friendly examples. The outcome will be a more accessible and robust toolkit for researchers and practitioners in computational geometry, optimization, and related fields.",
          "difficulty": "beginner",
          "id": "proj_geomscale_2025_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/a40WS6Oc",
          "proposal_id": "wwoChN0G",
          "short_description": "Dingo is a Python library built on top of the C++ library volesti, primarily designed for sampling from convex polytopes, especially within the...",
          "slug": "expose-c-sampling-rounding-and-volume-computation-in-dingo",
          "status": "in-progress",
          "student_name": "Akis Schinas",
          "student_profile": null,
          "tags": [
            "python",
            "ai",
            "ui"
          ],
          "title": "Expose C++ Sampling, Rounding and Volume Computation in Dingo"
        },
        {
          "code_url": null,
          "description": "The proposed project aims to continue the implementation of the semideﬁnite pro-\ngramming (SDP) solver in the VolEsti library and to integrate it with sparse linear\nalgebra for sparse SDP solving. This will allow for the eﬃcient solving of speciﬁc SDP\nproblems in the high-dimensional setting. Also, the project will integrate preprocessing techniques to reduce the discrepancy of the SDP before solving it.\nThe proposed preprocessing algorithms will be based on facial reduction and symmetry reduction. The project will also include benchmarking\nand testing of the proposed algorithms on a variety of datasets and compare them\nto the state-of-the-art libraries, like SDPA.",
          "difficulty": null,
          "id": "proj_geomscale_2025_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/dKflrLCE",
          "proposal_id": "X6eQQZ9c",
          "short_description": "The proposed project aims to continue the implementation of the semideﬁnite pro- gramming (SDP) solver in the VolEsti library and to integrate it...",
          "slug": "randomized-sdp-solver-and-improved-preprocessing",
          "status": "in-progress",
          "student_name": "Angelos Korakitis",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Randomized SDP solver and improved preprocessing"
        },
        {
          "code_url": null,
          "description": "The project aims to implement the Markov Chain Monte Carlo-based Shake and Bake algorithm for uniform sampling from the boundary of a convex polytope and integrate it into the C++ library volesti, along with its R interface Rvolesti and the Python package dingo. The implementation will also focus on efficient handling of high-dimensional polytopes using advanced numerical techniques and optimization strategies. Additionally, the functionality of the Shake and Bake algorithm will be tested on several metabolic networks of varying dimensionalities, where convergence performance will be evaluated using PSRF and ESS diagnostics.",
          "difficulty": "advanced",
          "id": "proj_geomscale_2025_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/7DtNTtFc",
          "proposal_id": "KmuXqs9t",
          "short_description": "The project aims to implement the Markov Chain Monte Carlo-based Shake and Bake algorithm for uniform sampling from the boundary of a convex polytope...",
          "slug": "shake-and-bake-sampling-from-the-boundary-of-convex-polytopes",
          "status": "in-progress",
          "student_name": "Iva Janković",
          "student_profile": null,
          "tags": [
            "python",
            "ai"
          ],
          "title": "Shake and Bake - Sampling from the boundary of convex polytopes"
        },
        {
          "code_url": null,
          "description": "This project develops an approximation algorithm for counting the linear extensions of a partial order by estimating the volume of its associated order polytope. Since exact counting is #P-complete, we exploit the fact that the polytope's volume is proportional to the number of linear extensions. Building on the volesti C++ library, the project will implement an optimized exact Hamiltonian Monte Carlo (HMC) sampler with a Gaussian target and a general mass matrix, including efficient boundary oracles for handling polytope constraints.\r\n\r\nThe new HMC-based approach is designed to improve sampling efficiency and scalability, especially in high-dimensional settings, and will be integrated into existing volume estimation algorithms. Deliverables include the new C++ module, enhanced integration with volesti, extensive empirical evaluations against current approximation methods, comprehensive documentation, and reproducible benchmarks.",
          "difficulty": null,
          "id": "proj_geomscale_2025_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/ObNb1YLW",
          "proposal_id": "2ROF9zMv",
          "short_description": "This project develops an approximation algorithm for counting the linear extensions of a partial order by estimating the volume of its associated...",
          "slug": "counting-linear-extensions-with-volume-computation-and-applications-in-ai",
          "status": "in-progress",
          "student_name": "Sophia Qian",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Counting Linear Extensions with Volume Computation and Applications in AI"
        },
        {
          "code_url": null,
          "description": "Genome-scale metabolic network reconstructions (GENREs) are comprehensive maps of all known metabolic reactions and associated genes in a given organism. Starting from a genome, these reconstructions are developed using annotations, biochemical data, and information from scientific literature. This can make GENREs strain-specific. From these networks, genome-scale metabolic models (GEMs) are derived, serving as powerful tools for exploring bacterial systems. Biologically grounded constraints can be applied to these models, resulting in constraint-based models that can predict the flow of metabolites through a defined network with techniques such as Flux Balance Analysis, Flux Variability Analysis and Flux Sampling. However, a common challenge in solutions derived from such models is the occurrence of thermodynamically infeasible loops (or internal cycles), which lead to nonbiological fluxes in simulation results. These loops violate physical principles and are absent in real biological systems. Aim of this project is to support the identification of such loops  allowing dingo to sample feasible solutions.",
          "difficulty": null,
          "id": "proj_geomscale_2025_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/j6mlCS2r",
          "proposal_id": "wdS6OiMr",
          "short_description": "Genome-scale metabolic network reconstructions (GENREs) are comprehensive maps of all known metabolic reactions and associated genes in a given...",
          "slug": "loopless-flux-sampling",
          "status": "in-progress",
          "student_name": "Sotirios Touliopoulos",
          "student_profile": null,
          "tags": [
            "react",
            "ai",
            "ux"
          ],
          "title": "LoopLess Flux Sampling"
        },
        {
          "code_url": null,
          "description": "The goal of this project is to enhance the Volesti library by implementing a sparse variant of the Billiard Walk sampling algorithm, which proposes to leverage lazy Cholesky-based solutions in order to preserve sparsity during rounding and sampling operations. Taking advantage of the sparse linear algebra infrastructure already present in the library, this project aims to improve the computational performance by implementing new methods that will perform dynamic, on-the-fly operations directly through triangular solves, avoiding explicit dense matrix transformations.",
          "difficulty": null,
          "id": "proj_geomscale_2025_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/vLd6ZbJ0",
          "proposal_id": "jG3HNrze",
          "short_description": "The goal of this project is to enhance the Volesti library by implementing a sparse variant of the Billiard Walk sampling algorithm, which proposes...",
          "slug": "sparse-polytope-sampling-via-lazy-rounding",
          "status": "in-progress",
          "student_name": "Vladimir Necula",
          "student_profile": null,
          "tags": [
            "angular",
            "ai"
          ],
          "title": "Sparse Polytope Sampling via Lazy Rounding"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2025/organizations/geomscale"
    }
  },
  "first_time": false,
  "contact": {
    "email": "geomscale@gmail.com",
    "guide_url": "https://github.com/GeomScale/gsoc25/wiki",
    "ideas_url": "https://github.com/GeomScale/gsoc25/wiki/table-of-proposed-coding-projects",
    "irc_channel": "https://gitter.im/GeomScale/community?utm_source=share-link&utm_medium=link&utm_campaign=share-link",
    "mailing_list": "https://groups.google.com/g/geomscale-gsoc"
  },
  "social": {
    "blog": "https://www.linkedin.com/company/geomscale/",
    "discord": null,
    "facebook": null,
    "github": null,
    "gitlab": null,
    "instagram": null,
    "linkedin": null,
    "mastodon": null,
    "medium": null,
    "reddit": null,
    "slack": null,
    "stackoverflow": null,
    "twitch": null,
    "twitter": "https://mobile.twitter.com/GeomScale",
    "youtube": null
  },
  "meta": {
    "version": 1,
    "generated_at": "2026-01-25T15:28:53.198Z"
  }
}