{
  "id": "692251d553dd9d7326d33dc9",
  "slug": "gitlab",
  "name": "GitLab",
  "category": "Infrastructure and cloud",
  "description": "Everyone can contribute",
  "image_url": "https://summerofcode.withgoogle.com/media/org/gitlab/mfhpav5dgegzwg8z-360.png",
  "img_r2_url": "https://pub-268c3a1efc8b4f8a99115507a760ca14.r2.dev/gitlab.webp",
  "logo_r2_url": null,
  "url": "https://about.gitlab.com/community/",
  "active_years": [
    2021,
    2022,
    2023,
    2025
  ],
  "first_year": 2021,
  "last_year": 2025,
  "is_currently_active": true,
  "technologies": [
    "ruby",
    "golang",
    "git",
    "ci",
    "devops",
    "javascript",
    "ruby on rails",
    "go",
    "vue"
  ],
  "topics": [
    "devops",
    "cloud",
    "ai",
    "git",
    "DevSecOps"
  ],
  "total_projects": 15,
  "stats": {
    "avg_projects_per_appeared_year": 3.75,
    "projects_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": null,
      "year_2019": null,
      "year_2020": null,
      "year_2021": 4,
      "year_2022": 3,
      "year_2023": 3,
      "year_2024": null,
      "year_2025": 5
    },
    "students_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": null,
      "year_2019": null,
      "year_2020": null,
      "year_2021": 4,
      "year_2022": 3,
      "year_2023": 3,
      "year_2024": null,
      "year_2025": 5
    },
    "total_students": 15
  },
  "years": {
    "year_2016": null,
    "year_2017": null,
    "year_2018": null,
    "year_2019": null,
    "year_2020": null,
    "year_2021": {
      "num_projects": 4,
      "projects": [
        {
          "code_url": "https://gitlab.com/gitlab-com/marketing/community-relations/contributor-program/gitlab-gsoc-2021/-/issues/6#deliverables",
          "description": "<p>As part of GitLab's commitment to open source, features within Secure from the GitLab Enterprise Edition are making their journey to the Community Edition. Specifically, Secure aims to make SAST and Secret Detection available in GitLab CE. To make these features available in CE, it is important to make Sast and secret_detection methods available. As such, this project’s goal is to port Ruby on Rails modules through reallocating ruby files related to Vulnerabilities, Vulnerability Findings, and the parsing of security reports to be included as part of the CE distribution.</p>\n",
          "difficulty": null,
          "id": "proj_gitlab_2021_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5108438736044032/",
          "proposal_id": null,
          "short_description": "As part of GitLab's commitment to open source, features within Secure from the GitLab Enterprise Edition are making their journey to the Community...",
          "slug": "port-sast-and-secret-detection-rails-platform-code-to-gitlab-ce-project",
          "status": "completed",
          "student_name": "Cyrine Gamoudi",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Port SAST and Secret Detection rails platform code to GitLab CE project"
        },
        {
          "code_url": "https://docs.google.com/document/d/19VhjiSQCYhpDAODv4xqxci7fB-1GysOl7KhkboWZPJY/edit?usp=sharing",
          "description": "<p>Educational institutions, open-source projects and private organizations have the need to create and maintain educational content such as classes, assignments, handbooks and onboarding material.\nThis material is often stored as binary files and shared manually by email or extractable drives.\nThis means that it often gets lost when people leave their organization, changes go unnoticed and error fixes take long to apply and share with the students.\nThis makes collaboration very difficult for both the educators and the students.</p>\n<p>That's why <em>Courseware as Code</em> brings the good practices of <strong>DevOps</strong> and <strong>CI/CD</strong> into education.\nUsing <code>git</code> for version control and <code>markdown</code> for formatted text, institutions will now be able collaborate and keep track of their educational content.\nPlus by using <em>Gitlab</em> <code>CI/CD pipelines</code>, new and novel ways of interacting with this content opens up.</p>\n<p>But building this workflow from the ground up is tough, especially for non-technical users.\nWith a good template, clear documentation/tutorials and already implemented <strong>CI/CD</strong> pipelines, we plan to make it easy for any user to spin-up their own <em>Courseware as Code</em> implementation.</p>\n",
          "difficulty": "beginner",
          "id": "proj_gitlab_2021_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/4787041501446144/",
          "proposal_id": null,
          "short_description": "Educational institutions, open-source projects and private organizations have the need to create and maintain educational content such as classes,...",
          "slug": "courseware-as-code-enablement",
          "status": "completed",
          "student_name": "Alejandro Rusi",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Courseware as Code Enablement"
        },
        {
          "code_url": "https://gitlab.com/groups/gitlab-org/-/epics/6089",
          "description": "<p>Translate the analyzers used by GitLab presently into more robust and easy to maintain Semgrep (a lightweight static analysis tool)  rulesets. To measure the success of translation, develop a testing framework which can give insights about rule-coverage of the new rulesets and can identify possible gaps which can be rectified in the future.</p>\n",
          "difficulty": "beginner",
          "id": "proj_gitlab_2021_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6017484972359680/",
          "proposal_id": null,
          "short_description": "Translate the analyzers used by GitLab presently into more robust and easy to maintain Semgrep (a lightweight static analysis tool)  rulesets. To...",
          "slug": "writing-sast-vulnerability-rules",
          "status": "completed",
          "student_name": "Anshuman Singh-1",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Writing SAST Vulnerability Rules"
        },
        {
          "code_url": "https://shubhamkumar.live/blog/Improving-Backup-and-Restore-For-GitLab-GSoC-2021/",
          "description": "<p>The backup and restore tools provided by GitLab are relied upon by administrators of GitLab instances as part of their disaster recovery strategy. These procedures rely on standard UNIX tools such as rsync and tar and cover most data excluding GitLab configuration.</p>\n<p>There are a number of ways that we can continue to improve the backup and restore processes to make the experience more reliable, efficient, and transparent for system administrators.</p>\n",
          "difficulty": null,
          "id": "proj_gitlab_2021_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5177345144520704/",
          "proposal_id": null,
          "short_description": "The backup and restore tools provided by GitLab are relied upon by administrators of GitLab instances as part of their disaster recovery strategy....",
          "slug": "geo-team-proposal-improvements-to-backup-and-restore-process",
          "status": "completed",
          "student_name": "Shubham Kumar-1",
          "student_profile": null,
          "tags": [],
          "title": "Geo Team Proposal: Improvements to backup and restore process"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2021/organizations/5396515480141824/"
    },
    "year_2022": {
      "num_projects": 3,
      "projects": [
        {
          "code_url": "https://github.com/Eileen-Yu/Eileen-Yu/blob/main/stories/gsoc22-FinalReport.md",
          "description": "The project aims to bring Package Hunter, the malicious dependency detecting tool, to Kubernetes cluster, thus granting it more robustness, flexibility and portability. It is broken down into several parts:\n1. Provide a native env for Falco monitoring/alerting\n2.  Run Package Hunter in a stable and scalable manner\n3.  Decouple the system into individual components\n4. Improve Disk & Time consuming by K8s features\n\nSteps to achieve the goal:\n1. Migrate Falco to K8s DaemonSet\n2. Migrate Package Hunter to K8s Deployment\n3. Add feature of K8s Job Scheduling to Package Hunter\n4. Cache dependencies in K8s shared PV\n5. RBAC Configuration for Authentication & Authorization\n6. Alerts Query through RESTful API\n7. Service Exposure by K8s Ingress and corresponding controller",
          "difficulty": null,
          "id": "proj_gitlab_2022_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/vSMGsSuH/",
          "proposal_id": null,
          "short_description": "The project aims to bring Package Hunter, the malicious dependency detecting tool, to Kubernetes cluster, thus granting it more robustness,...",
          "slug": "package-hunter-for-kubernetes",
          "status": "completed",
          "student_name": "Eileen Yu",
          "student_profile": null,
          "tags": [
            "api",
            "ai",
            "kubernetes"
          ],
          "title": "Package Hunter for Kubernetes"
        },
        {
          "code_url": "https://gitlab.com/gitlab-org/secure/gsoc-sast-benchmark",
          "description": "GitLab integrates a variety of static analysis (SAST) tools that help to find vulnerabilities in the code as early in the development lifecycle as possible. These tools are constantly updated by either upgrading the underlying implementation or by applying configuration changes.\n\nThe problem is how do we know if these changes improve the tool? If we want to do it in a systematic and data-driven way we can use benchmarking, which allows to measure how impactful and useful the change or configuration update is.\n\nThe goal of this project is to build a benchmarking framework that would allow for frictionless assessment of the quality of the security analyzer before it reaches the production environment. This greatly benefits the SAST community, as the framework opens a way to make data-driven decisions in the development of SAST.",
          "difficulty": null,
          "id": "proj_gitlab_2022_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/8EJJMJYt/",
          "proposal_id": null,
          "short_description": "GitLab integrates a variety of static analysis (SAST) tools that help to find vulnerabilities in the code as early in the development lifecycle as...",
          "slug": "benchmarking-framework-for-sast",
          "status": "completed",
          "student_name": "Martynas Krupskis",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "Benchmarking Framework for SAST"
        },
        {
          "code_url": "https://gitlab.com/groups/gitlab-org/-/epics/8765",
          "description": "GitLab uses Gitaly to read and write git data to the repositories. Gitaly provides RPC access to the git repositories. The RPCs that provide the author and the committer information make use of the git-cat-file command, which doesn’t support mailmap. So, this project aims to add mailmap support in git-cat-file command, make Gitaly to use it and thus enable GitLab to honor the .mailmap file across its various features.",
          "difficulty": null,
          "id": "proj_gitlab_2022_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/yaKP2iJK/",
          "proposal_id": null,
          "short_description": "GitLab uses Gitaly to read and write git data to the repositories. Gitaly provides RPC access to the git repositories. The RPCs that provide the...",
          "slug": "add-support-for-mailmap",
          "status": "completed",
          "student_name": "Siddharth Asthana",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Add Support for Mailmap"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2022/organizations/gitlab/"
    },
    "year_2023": {
      "num_projects": 3,
      "projects": [
        {
          "code_url": "https://gitlab.com/-/snippets/2587070",
          "description": "I am writing to express my interest in contributing to GitLab's Pajamas Migration project as part of the Google Summer of Code program. As a computer science student at South Asia University, I am eager to gain more experience in the open-source community, and I believe that contributing to Pajamas Migration would be an excellent opportunity to do so. In Pajama Migration We have to ensure that all of the frontend components we use are GitLab-UI components, there are still some pages that are not using the right components.\nI am already Involved with Gitlab through MLH Fellowship and am working with the Foundation Team under the mentorship of our maintainer (James Rushford). James was a really great leader and mentor.\n\nI have worked on the following issue so far 112392, and 115432, and right now I am working on Pajamas Migration with our maintainer(James) on issues #395782 and #396775.\nmy Deliverables will include~ \n                           : Complete  Pajamas migrations.\n \t\t\t   : Build out the design system.\n                           : improve user experience\nMy plan~\n         May 4 - May 30: read project-related documents and codes, and get started quickly.\n         May 30 - July 5:  reasonably divide the work with another contributor, and record the corresponding documents at the same time.\n\tjuly 5 - august 21: will continue work on our plans and will try to complete our mission and also will get feedback from the mentor. \n\nmy previous experience at MLH with Gitlab was incredible. I gained valuable technical and soft skills, and I had the opportunity to work on real-world projects with experienced developers. Working with Gitlab helped me gain a better understanding of DevOps.So, I am looking forward work with GitLab again.\n\nI am looking forward to hearing back from you and learning more about how I can get involved in this project in your way. Maybe by giving more details? Knowing the Scope. Thank you for considering my application.",
          "difficulty": null,
          "id": "proj_gitlab_2023_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/femokhnv",
          "proposal_id": "O8eEczFv",
          "short_description": "I am writing to express my interest in contributing to GitLab's Pajamas Migration project as part of the Google Summer of Code program. As a computer...",
          "slug": "pajamas-migration-gitlab-foundations-team",
          "status": "completed",
          "student_name": "Mughees Pervaiz",
          "student_profile": null,
          "tags": [
            "ml",
            "ai",
            "ui",
            "frontend"
          ],
          "title": "Pajamas Migration - GitLab Foundations Team"
        },
        {
          "code_url": "https://gitlab.com/NIKU-SINGH/gsoc-23-final-report",
          "description": "This project aims to simplify the contribution process to GitLab by creating a detailed report for developers using both local and cloud-based Integrated Development Environments (IDEs). The report will identify areas where the process can be improved, and the mentee will work to address 20% of the identified gaps. The ultimate goal is to enhance the contribution experience and make it more inclusive to a broader community of developers.\nThe project can be broken down into 3 parts\nResearch and analysis: \nAims at conducting a user research to understand the contributors journey to Gitlab. \nA user can contribute to gitlab in many ways through Development, Documentation, UI/UX , translation etc.  main work would be to identify the contributors journey in each of those.\n\n\nAddressing gaps in the contributor journey\nCreating a list of identified gaps and discussing a way to tackle those gaps.\n\n\nImproving the Onboarding process\nContributing to Gilab can be overwhelming, this aims at identifying the hurdles that a new contributor faces and come up with an idea to improve the process.",
          "difficulty": null,
          "id": "proj_gitlab_2023_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/aWi565W2",
          "proposal_id": "ZhQinhdA",
          "short_description": "This project aims to simplify the contribution process to GitLab by creating a detailed report for developers using both local and cloud-based...",
          "slug": "document-the-contributor-journey-to-gitlab",
          "status": "completed",
          "student_name": "Niku Singh",
          "student_profile": null,
          "tags": [
            "ai",
            "cloud",
            "ui",
            "ux"
          ],
          "title": "Document the contributor journey to GitLab"
        },
        {
          "code_url": "https://gitlab.com/-/snippets/2580388",
          "description": "GitLab has been pushing initiatives such as Pajamas Migration Days, Hackathons, and Internal OKRs to ensure that the platform’s interface aligns with the specifics of the Pajamas Design System. However, there is still more work to be done to ensure that both the existing code and new changes, such as the new navigation redesign, adheres to the design standards. This project paves way for the Google Summer of Code 2023 participants to join the GitLab Foundations team and take on the challenges of completing this migration process.",
          "difficulty": null,
          "id": "proj_gitlab_2023_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/Bm648ysU",
          "proposal_id": "sORzWy8e",
          "short_description": "GitLab has been pushing initiatives such as Pajamas Migration Days, Hackathons, and Internal OKRs to ensure that the platform’s interface aligns with...",
          "slug": "pajamas-migration-gitlab-foundations-team",
          "status": "completed",
          "student_name": "Shane Maglangit",
          "student_profile": null,
          "tags": [],
          "title": "Pajamas Migration - GitLab Foundations Team"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2023/organizations/gitlab"
    },
    "year_2024": null,
    "year_2025": {
      "num_projects": 5,
      "projects": [
        {
          "code_url": null,
          "description": "This project aims to implement essential Git operations in GitLab's Web IDE, eliminating inefficient repository cloning for common version control tasks. The project will add commit amend, force push, stash, and rebase functionality. \nImplementation will proceed methodically, beginning with features requiring no backend changes before addressing REST API modifications. These enhancements will significantly improve developer productivity by enabling complete Git workflows within the browser, bringing Web IDE capabilities closer to VS-Code source control.",
          "difficulty": null,
          "id": "proj_gitlab_2025_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/mNwPEdaV",
          "proposal_id": "OPctwS0x",
          "short_description": "This project aims to implement essential Git operations in GitLab's Web IDE, eliminating inefficient repository cloning for common version control...",
          "slug": "kashkoush-enhancing-gitlabs-web-ide-with-advanced-source-control-features",
          "status": "in-progress",
          "student_name": "Ahmed Kashkoush",
          "student_profile": null,
          "tags": [
            "web",
            "api",
            "ai",
            "ui",
            "backend"
          ],
          "title": "Kashkoush - Enhancing GitLab's Web IDE with Advanced Source Control Features"
        },
        {
          "code_url": null,
          "description": "Currently, devfile validation only occurs after the user submits the form to create a workspace. This means users only discover invalid devfiles after waiting for form submission.\nImplement just-in-time (JIT) validation for devfiles in the workspace creation form:\nWhen a user selects a devfile from the dropdown, validate it immediately in the background, Display a visual indicator (icon/label) next to the selected devfile showing its validity status, Provide clear, actionable error messages for invalid devfiles before form submission",
          "difficulty": null,
          "id": "proj_gitlab_2025_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/Y9R088Nb",
          "proposal_id": "yQhQS4YE",
          "short_description": "Currently, devfile validation only occurs after the user submits the form to create a workspace. This means users only discover invalid devfiles...",
          "slug": "show-message-if-devfile-is-invalid-before-creating-a-workspace",
          "status": "in-progress",
          "student_name": "Omar Nasser",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Show message if devfile is invalid before creating a workspace"
        },
        {
          "code_url": null,
          "description": "GitLab's security features help developers find vulnerabilities in their code, but the current API doesn't expose all the important information that security teams need. For example, users can't easily access details about when vulnerabilities were first discovered, who authored the related commits, or which pipelines detected the issues. This makes it difficult for teams to automate their security workflows and track vulnerability trends over time.",
          "difficulty": null,
          "id": "proj_gitlab_2025_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/NESmAewc",
          "proposal_id": "MB61DzkW",
          "short_description": "GitLab's security features help developers find vulnerabilities in their code, but the current API doesn't expose all the important information that...",
          "slug": "expand-vulnerability-graphql-offering",
          "status": "in-progress",
          "student_name": "Patrick He",
          "student_profile": null,
          "tags": [
            "api",
            "ai"
          ],
          "title": "Expand Vulnerability GraphQL Offering"
        },
        {
          "code_url": null,
          "description": "This project is a notification system that alerts its users before their deploy tokens expire. Deploy tokens are used to provide secure access to repositories and container registries, independent of a user account. Due to this reason, they are used in CI/CD pipelines, automation scripts, and third-party integrations. Some of these tokens are configured to have an expiry date at the time of creation. \n\nCurrently, GitLab lacks an automated way to notify users about tokens that are about to expire. This can lead to last-minute troubleshooting and potential downtimes. To address this, we can integrate a notification system that notifies the project owners, group owners and admins at different intervals [14, 7, 1] days through email notifications and webhooks. This will ensure timely renewals of the token and avoid unexpected failures.",
          "difficulty": null,
          "id": "proj_gitlab_2025_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/POJu1RD5",
          "proposal_id": "Tyex1vEc",
          "short_description": "This project is a notification system that alerts its users before their deploy tokens expire. Deploy tokens are used to provide secure access to...",
          "slug": "deployment-management-add-notification-for-expiring-deploy-tokens-e-mail-and-webhook",
          "status": "in-progress",
          "student_name": "Pratibha Gupta",
          "student_profile": null,
          "tags": [
            "web",
            "ai"
          ],
          "title": "[Deployment Management]  Add Notification for expiring Deploy Tokens: E-mail and Webhook"
        },
        {
          "code_url": null,
          "description": "When managing cloud infrastructure through GitLab using Terraform, there is a critical security concern: any maintainer can make destructive changes from any branch, even unintentionally. This opens up risks where unreviewed or experimental branches can alter production environments.\n\nThis project aims to implement a system of Protected Terraform States, similar to protected branches in Git. The idea is to enforce that only designated branches (like main or production) can trigger state changes to Terraform-managed infrastructure.\n\nThe proposal includes:\nCreating backend logic to enforce state protection rules.\nDesigning GraphQL APIs to manage and query protected states.\nEnabling fine-grained permission controls for reading, writing, or deleting Terraform state files.\nIntegrating usage tracking to help teams audit and improve security.",
          "difficulty": null,
          "id": "proj_gitlab_2025_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/Q2S2d0FK",
          "proposal_id": "L9c1YfNi",
          "short_description": "When managing cloud infrastructure through GitLab using Terraform, there is a critical security concern: any maintainer can make destructive changes...",
          "slug": "protected-terraform-states",
          "status": "in-progress",
          "student_name": "Sahil Sarawagi",
          "student_profile": null,
          "tags": [
            "api",
            "ai",
            "cloud",
            "backend"
          ],
          "title": "Protected Terraform States"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2025/organizations/gitlab"
    }
  },
  "first_time": false,
  "contact": {
    "email": "contributors@gitlab.com",
    "guide_url": "https://contributors.gitlab.com",
    "ideas_url": "https://gitlab.com/gitlab-org/developer-relations/contributor-success/google-summer-of-code-2025/-/issues",
    "irc_channel": "https://discord.gg/gitlab",
    "mailing_list": null
  },
  "social": {
    "blog": "https://about.gitlab.com/blog/",
    "discord": "https://discord.gg/gitlab",
    "facebook": null,
    "github": null,
    "gitlab": "https://about.gitlab.com/community/",
    "instagram": null,
    "linkedin": null,
    "mastodon": null,
    "medium": null,
    "reddit": null,
    "slack": null,
    "stackoverflow": null,
    "twitch": null,
    "twitter": "https://twitter.com/gitlab",
    "youtube": null
  },
  "meta": {
    "version": 1,
    "generated_at": "2026-01-25T15:28:53.206Z"
  }
}