{
  "id": "692251d453dd9d7326d33dbb",
  "slug": "gnu-octave",
  "name": "GNU Octave",
  "category": "Science and medicine",
  "description": "Free Your Numbers",
  "image_url": "https://summerofcode.withgoogle.com/media/org/gnu-octave/0kc85jo6rl3eo2g0-360.png",
  "img_r2_url": "https://pub-268c3a1efc8b4f8a99115507a760ca14.r2.dev/gnu-octave.webp",
  "logo_r2_url": null,
  "url": "https://www.octave.org",
  "active_years": [
    2016,
    2017,
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "first_year": 2016,
  "last_year": 2025,
  "is_currently_active": true,
  "technologies": [
    "c++",
    "hg"
  ],
  "topics": [
    "mathematics",
    "numerical computation",
    "data processing",
    "matlab",
    "numerical and data analysis software",
    "scientific computing",
    "numerical methods"
  ],
  "total_projects": 23,
  "stats": {
    "avg_projects_per_appeared_year": 2.3,
    "projects_by_year": {
      "year_2016": 5,
      "year_2017": 4,
      "year_2018": 3,
      "year_2019": 0,
      "year_2020": 1,
      "year_2021": 1,
      "year_2022": 3,
      "year_2023": 2,
      "year_2024": 2,
      "year_2025": 2
    },
    "students_by_year": {
      "year_2016": 5,
      "year_2017": 4,
      "year_2018": 3,
      "year_2019": 0,
      "year_2020": 1,
      "year_2021": 1,
      "year_2022": 3,
      "year_2023": 2,
      "year_2024": 2,
      "year_2025": 2
    },
    "total_students": 22
  },
  "years": {
    "year_2016": {
      "num_projects": 5,
      "projects": [
        {
          "code_url": "https://bitbucket.org/amr_keleg/octave-geometry/commits/all?search=user(Amr)",
          "description": "<h3>Implement boolean operations on polygon</h3>\n<ul>\n<li>Computational Geometry has great applications in computer science such as computer graphics, CAD (Computer-aided design), game development, simulations and others.</li>\n<li>And as octave is mainly concerned with computations and simulations, it would be great to add new functions to octave to perform boolean operations on polygons.</li>\n<li>The project will use Boost C++ library to implement a set of new functions to support polygon operations. </li>\n<li>This project will improve Octave's compatibility with Matlab by adding new functionality to Octave.</li>\n</ul>\n",
          "difficulty": null,
          "id": "proj_gnu-octave_2016_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5461783343005696/",
          "proposal_id": null,
          "short_description": "Implement boolean operations on polygon\n\nComputational Geometry has great applications in computer science such as computer graphics, CAD...",
          "slug": "implement-boolean-operations-on-polygons",
          "status": "completed",
          "student_name": "Amr Mohamed",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Implement boolean operations on polygons"
        },
        {
          "code_url": "https://barbaralocsigsoc2016.blogspot.hu/2016/08/summary.html",
          "description": "<p>Certain calling forms of the eig function are currently missing, including:</p>\n<ul>\n<li>preliminary balancing</li>\n<li>computing left eigenvectors as a third output</li>\n<li>choosing among generalized eigenvalue algorithms</li>\n<li>choosing among return value formats of the eigenvalues (vector or matrix)</li>\n</ul>\n",
          "difficulty": null,
          "id": "proj_gnu-octave_2016_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5066033379409920/",
          "proposal_id": null,
          "short_description": "Certain calling forms of the eig function are currently missing, including:\n\npreliminary balancing\ncomputing left eigenvectors as a third output...",
          "slug": "generalised-eigenvalue-problem",
          "status": "completed",
          "student_name": "Barbara Lócsi",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Generalised eigenvalue problem"
        },
        {
          "code_url": "https://genuinelucifer.wordpress.com/2016/08/22/summary-of-work-done-during-gsoc/",
          "description": "<p>This project aims at writing a library in C++ that provides and interface to octave files (.m) to interact with python modules in a more efficient way. It surely will intend to provide more functionality atleast in terms of catching exceptions and provide suitable error messages, if possible, by using callback functions to handle such situations.\nFor the solution, I propose to use Boost.Python (if it’s acceptable in terms of License) because I already have worked with boost libraries (not with Python library but with some others) and I think boost can prove to be the perfect solution. I intend to fully complete the interface with Boost.Python and to modify every file to use it before end of GSoC.</p>\n",
          "difficulty": null,
          "id": "proj_gnu-octave_2016_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5334537018015744/",
          "proposal_id": null,
          "short_description": "This project aims at writing a library in C++ that provides and interface to octave files (.m) to interact with python modules in a more efficient...",
          "slug": "symbolic-package",
          "status": "completed",
          "student_name": "Abhinav Tripathi",
          "student_profile": null,
          "tags": [
            "python",
            "ai",
            "ui"
          ],
          "title": "Symbolic Package"
        },
        {
          "code_url": "http://gsoc2016ode15s.blogspot.it/",
          "description": "<p>One of the major missing functions in Octave is ode15s, which is an effective solver for stiff Differential Equations and Differential Algebraic Equations. The goal of this project is to implement a Matlab compatible adaptive BDF solver for Differential Algebraic Equations (DAEs). The interface would need to be compatible with ode15s while for the backend the SUNDIALS library would be used, which has both a C and a MEX interface. This function will be included in Octave core together with the other ODE solvers that will be released with version 4.2</p>\n",
          "difficulty": null,
          "id": "proj_gnu-octave_2016_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/6106026155704320/",
          "proposal_id": null,
          "short_description": "One of the major missing functions in Octave is ode15s, which is an effective solver for stiff Differential Equations and Differential Algebraic...",
          "slug": "gsoc-ode15s-project-proposal",
          "status": "completed",
          "student_name": "FrancescoFaccio",
          "student_profile": null,
          "tags": [
            "ai",
            "backend"
          ],
          "title": "GSoC ode15s project proposal"
        },
        {
          "code_url": "http://gsoc2016exponentialintegrators.blogspot.it/2016/08/final-evaluation.html",
          "description": "<p>I propose a project about the implementation of some Exponential Integrators.\nExponential integrators are a class of numerical methods for the solution of partial and ordinary differential equations. This class of methods is based on the exact integration of the linear part of an initial value problem and this can help to mitigate the stiffness of a differential equation. My idea is to implement at least four methods, the two basic methods exponential Euler and exponential Rosenbrock-Euler, and then two advanced methods with adaptive time stepping, one from Runge-Kutta and one from Rosenbrock-type exponential integrator family. This is my initial idea, but I'm willing to take advice and expand the project during the work period. I want to implement the methods as m-file so an implementation of this type should go into odepkg.</p>\n",
          "difficulty": "advanced",
          "id": "proj_gnu-octave_2016_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/6328908383256576/",
          "proposal_id": null,
          "short_description": "I propose a project about the implementation of some Exponential Integrators.\nExponential integrators are a class of numerical methods for the...",
          "slug": "gsoc-2016-exponential-integrators",
          "status": "completed",
          "student_name": "Chiara Segala",
          "student_profile": null,
          "tags": [],
          "title": "GSoC 2016 EXPONENTIAL INTEGRATORS"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2016/organizations/4799884188188672/"
    },
    "year_2017": {
      "num_projects": 4,
      "projects": [
        {
          "code_url": "http://gsocspecfun.blogspot.it/2017/08/final-resume.html",
          "description": "<p>Traditionally, problem solving environments like Octave provide simple interfaces to numerical linear algebra, special function evaluation, root finding, and other tools. Special functions (such as Bessel functions, exponential integrals, LambertW, etc) are expected by users to \"just work\". But many of Octave's special functions could be improved to improve their numerical accuracy. Generally a user might expect these to be accurate to full 15 digits. Software testing is important to Octave; this project would improve the tests of many special functions, in particular by comparing the output with slow-but-accurate symbolic computations.</p>\n",
          "difficulty": null,
          "id": "proj_gnu-octave_2017_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5281806362345472/",
          "proposal_id": null,
          "short_description": "Traditionally, problem solving environments like Octave provide simple interfaces to numerical linear algebra, special function evaluation, root...",
          "slug": "gsoc-2017-make-specfuns-special-again",
          "status": "completed",
          "student_name": "Michele Ginesi",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "GSoC 2017: Make specfuns special again"
        },
        {
          "code_url": "https://gsocinterval.blogspot.se/2017/08/final-report.html",
          "description": "<p>I'm interested in improving the interval package for Octave by implementing support for N-dimensional vectors. With this I hope to learn more about Octave and its community with a later goal to create my own package for Taylor arithmetic.</p>\n",
          "difficulty": null,
          "id": "proj_gnu-octave_2017_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5549056675807232/",
          "proposal_id": null,
          "short_description": "I'm interested in improving the interval package for Octave by implementing support for N-dimensional vectors. With this I hope to learn more about...",
          "slug": "improving-the-interval-package-n-dimensional-vectors",
          "status": "completed",
          "student_name": "urathai",
          "student_profile": null,
          "tags": [],
          "title": "Improving the interval package - N-dimensional vectors"
        },
        {
          "code_url": "https://github.com/piyush-jain1/GSoC17OctaveGeometry",
          "description": "<p>I got to know about Octave last year only when I started Machine Learning course of Andrew Ng online. Till then , I only knew abut Matlab. But when I first used Octave, I found that it can do almost everything which Matlab can (as far as I have used).I was pretty happy to know that there is such a free open source software, so when I found a project in this year's GSoC on Octave, I was pretty interested to contribute to the project and make Octave more better, as far as I can.\nIn this task, there is something which will help me use geometrical skills as well as development skills. That''s why I have chosen this project.I read about the Clipper Library which is to be used for this project.  I wrote a function for Union of two Polygons for Octave by using Clipper Library. It was written in C++.\nAll in all, I am pretty excited and looking forward to this project.</p>\n",
          "difficulty": null,
          "id": "proj_gnu-octave_2017_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/4816941248151552/",
          "proposal_id": null,
          "short_description": "I got to know about Octave last year only when I started Machine Learning course of Andrew Ng online. Till then , I only knew abut Matlab. But when I...",
          "slug": "boolean-operations-with-polygons-on-octave",
          "status": "completed",
          "student_name": "PiyushJain",
          "student_profile": null,
          "tags": [],
          "title": "Boolean operations with polygons on Octave"
        },
        {
          "code_url": "https://gsocnnet.blogspot.com/2017/08/summary-of-work-done-during-gsoc.html",
          "description": "<p>Neural Networks are one of the most breakthrough techniques nowadays. The goal of this project is to perform a radical update to Octave nnet package in order to keep pace with the times. Other open-source projects will be used, like Tensorflow. This will allow to guarantee a continuous updating on neural networks improvement and leading to a greater focus on Octave interface.\nThe tendency to open-researching is strong in the deep learning field, where even the biggest companies release their frameworks and open their code. In this sense, a project on the Neural Networks package, where Octave can coexist with Tensorflow, let us exploit their synergy and reach fast consistent goals.</p>\n",
          "difficulty": null,
          "id": "proj_gnu-octave_2017_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5187659337039872/",
          "proposal_id": null,
          "short_description": "Neural Networks are one of the most breakthrough techniques nowadays. The goal of this project is to perform a radical update to Octave nnet package...",
          "slug": "neural-networks-package-convolutional-neural-networks",
          "status": "completed",
          "student_name": "Enrico Bertino",
          "student_profile": null,
          "tags": [],
          "title": "Neural Networks package: Convolutional Neural Networks"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2017/organizations/6187477526118400/"
    },
    "year_2018": {
      "num_projects": 3,
      "projects": [
        {
          "code_url": "https://sudeepam.blogspot.com/2018/08/gsoc-final-post.html",
          "description": "<p>To provide a rich experience to Octave users, the command line suggestion feature, aims to be a fast and accurate method to suggest corrections to the users whenever they make a typographic error while working on the Octave command window. It should also be able to provide the users, an easy method to select and execute the corrections suggested and enable/disable the feature. This could get tricky as Octave comes in both a GUI and a CLI. Therefore, for a successful integration of this feature with Octave, understanding how its parser, error handling, and internal functions work would be essential. The next part of the problem would be to generate the words to suggest. A trivial solution of this problem is easy but computationally expensive and hence not feasible. The challenging part therefore, is to minimize the speed-accuracy trade-off of the feature. A starting point for that would be a smart (probability based for example) implementation of the Edit-distance algorithm, using dynamic programming. Later, a Neural Network based idea would also be tested. The goal of-course, is to use the algorithm that best minimizes the speed-accuracy trade-off and provides the best UX.</p>\n",
          "difficulty": "beginner",
          "id": "proj_gnu-octave_2018_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/6117799197933568/",
          "proposal_id": null,
          "short_description": "To provide a rich experience to Octave users, the command line suggestion feature, aims to be a fast and accurate method to suggest corrections to...",
          "slug": "a-fast-and-accurate-command-line-suggestion-feature",
          "status": "completed",
          "student_name": "P SUDEEPAM",
          "student_profile": null,
          "tags": [
            "ai",
            "ui",
            "ux"
          ],
          "title": "A fast and accurate command line suggestion feature"
        },
        {
          "code_url": "https://bitbucket.org/me_ydv_5/octave/wiki/Home",
          "description": "<p>This project aims to come up with a pan-octave implementation that could be used to connect to the Octave wiki's <a href=\"https://wiki.octave.org/\" target=\"_blank\">webserver</a> with appropriate credentials for publishing octave scripts that could be hosted on the above mentioned server for distribution using the MediaWiki API. Currently, no formal implementation is there but a proof of concept which is implemented as a bash script which was later refactored to use JAVA’s interface to octave. To maintain a stateless HTTP protocol, some information that would be needed will be stored as cookies with the help of Libcurl library.</p>\n<p>The next task would be to set up RESTful services for GNU Octave which could be further extended to support the compatibility with MATLAB’s RESTful interface (webread, webwrite, weboptions, etc.)</p>\n",
          "difficulty": null,
          "id": "proj_gnu-octave_2018_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/4849718693724160/",
          "proposal_id": null,
          "short_description": "This project aims to come up with a pan-octave implementation that could be used to connect to the Octave wiki's webserver with appropriate...",
          "slug": "octave-code-sharing",
          "status": "completed",
          "student_name": "Sahil Yadav",
          "student_profile": null,
          "tags": [
            "java",
            "web",
            "api",
            "ai"
          ],
          "title": "Octave Code Sharing"
        },
        {
          "code_url": "https://eriveltongualter.github.io/GSoC2018/final.html",
          "description": "<p>GNU Octave is a high-level programming language for scientific and numerical computations which uses the m-script language compatible with MATLAB. Both Matlab and Octave provide many similar packages to the end-user. One of the missing functionalities in the Octave controls package is the Control System Designer tool .  This tool is used in controller design to allow exploration of linear controllers through interactive tools. This tool allows the user to interactively modify a controller and apply it to the plant in a variety of closed-loop configurations/topologies. The interactivity allow the user to add &amp; move poles and zeros in the root locus diagram, and implement common controller architectures like PD, PID, and Lead &amp; Lag controllers, as well as assess performance through common diagrams such at Bode, Nyquist, Root Locus, and Step Response plots. The goal of this proposal is to create an Interactive Tool for Single Input Single Output (SISO) Linear Control System Design to provide a much needed missing feature in the Octave controls package for the design and analysis of SISO system controllers.</p>\n",
          "difficulty": null,
          "id": "proj_gnu-octave_2018_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5143121935466496/",
          "proposal_id": null,
          "short_description": "GNU Octave is a high-level programming language for scientific and numerical computations which uses the m-script language compatible with MATLAB....",
          "slug": "interactive-tool-for-siso-linear-control-system-design",
          "status": "completed",
          "student_name": "Erivelton Gualter",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "Interactive tool for SISO Linear Control System Design"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2018/organizations/6026712471044096/"
    },
    "year_2019": {
      "num_projects": 0,
      "projects": [],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2019/organizations/6521761976287232/"
    },
    "year_2020": {
      "num_projects": 1,
      "projects": [
        {
          "code_url": "https://abdallah-elshamy.github.io/GSoC-2020/",
          "description": "<p>JavaScript Object Notation, in short JSON, is a very common human readable and structured data format. Unfortunately, GNU Octave still lacks builtin support for that data format. Having JSON support, Octave can improve for example it's web service functions, which often exchange JSON data these days.</p>\n",
          "difficulty": null,
          "id": "proj_gnu-octave_2020_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5567022663991296/",
          "proposal_id": null,
          "short_description": "JavaScript Object Notation, in short JSON, is a very common human readable and structured data format. Unfortunately, GNU Octave still lacks builtin...",
          "slug": "json-encodingdecoding",
          "status": "completed",
          "student_name": "Abdallah Elshamy",
          "student_profile": null,
          "tags": [
            "java",
            "javascript",
            "web",
            "ui"
          ],
          "title": "JSON encoding/decoding"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2020/organizations/4670095013445632/"
    },
    "year_2021": {
      "num_projects": 1,
      "projects": [
        {
          "code_url": "https://abdallah-elshamy.github.io/GSoC-2021/",
          "description": "<p>The <a href=\"https://jupyter.org/\" target=\"_blank\">Jupyter Notebook</a> is an open-source web application that allows you to create and share documents that contain live code, equations, visualizations, and narrative text. To interactively work with Octave code within Jupyter Notebooks, there already exists an <a href=\"https://github.com/Calysto/octave_kernel\" target=\"_blank\">Octave kernel for Jupyter</a>.\nThis project aims to support the opposite direction: running (and filling) Jupyter Notebook within GNU Octave. This would enable Jupyter Notebook users to evaluate long-running Octave Notebooks on a computing server without a permanent browser connection, which is still <a href=\"https://github.com/jupyter/notebook/issues/1647\" target=\"_blank\">a pending issue</a>.</p>\n",
          "difficulty": null,
          "id": "proj_gnu-octave_2021_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5966212021878784/",
          "proposal_id": null,
          "short_description": "The Jupyter Notebook is an open-source web application that allows you to create and share documents that contain live code, equations,...",
          "slug": "jupyter-notebook-integration",
          "status": "completed",
          "student_name": "Abdallah Elshamy",
          "student_profile": null,
          "tags": [
            "web",
            "ai"
          ],
          "title": "Jupyter Notebook Integration"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2021/organizations/5764694136061952/"
    },
    "year_2022": {
      "num_projects": 3,
      "projects": [
        {
          "code_url": "https://sarrah-basta.github.io/blogs/2022/09/11/GSoC_'22_GNU_Octave_Project_Report.html",
          "description": "Matlab-Compatible ODE Solvers in Octave comprise a set of solvers for initial value problems for ordinary differential equations (ODEs) that aim to have a MATLAB-compatible interface. A GSoC project in 2016 added an initial implementation for DAE solvers, namely, Ode 15 {i,s}, that use a variable step, variable order method , and is based on Sundials, to the Octave repository.\n\tThe major requirement now is to improve this implementation by creating an interface to SUNDIALS IDA API, using Octave's own classes and solvers, so that even SUNDIALS is not compiled against KLU (the solver used for sparse computations by IDA), a safety net is created for the end user such that sparse computations are never disabled in the Ode15{i,s} solvers, instead of falling to computing using dense implementations as before. This has the added benefits of avoidance in creating copies of data to send to SUNDIALS interfaces, as well as use of Octave's vectorized operations, allowing the solvers to be further optimized.",
          "difficulty": null,
          "id": "proj_gnu-octave_2022_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/fg4hsOK0/",
          "proposal_id": null,
          "short_description": "Matlab-Compatible ODE Solvers in Octave comprise a set of solvers for initial value problems for ordinary differential equations (ODEs) that aim to...",
          "slug": "ode15is-matlab-compatible-dae-solvers",
          "status": "completed",
          "student_name": "Sarrah Bastawala",
          "student_profile": null,
          "tags": [
            "api",
            "ai",
            "ui"
          ],
          "title": "ode15{i,s} : Matlab Compatible DAE solvers"
        },
        {
          "code_url": "https://github.com/magedrifaat/GSoC2022-Octave-Tiff",
          "description": "The aim of the project is to improve the way Octave handles TIFF images by using a specialized library (libtiff) to load and handle tiff images instead of the generic GraphicsMagck library currently used. The main objective of the project is to insert the libtiff library into the Octave project by building a wrapper for the library that handles its logic and provide an API that conforms with the existing design of Octave. This API can then be used by the existing Octave functions when handling a TIFF image instead of the old API.",
          "difficulty": null,
          "id": "proj_gnu-octave_2022_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/EJ2ywyMC/",
          "proposal_id": null,
          "short_description": "The aim of the project is to improve the way Octave handles TIFF images by using a specialized library (libtiff) to load and handle tiff images...",
          "slug": "improve-tiff-image-support",
          "status": "completed",
          "student_name": "Maged Rifaat",
          "student_profile": null,
          "tags": [
            "api",
            "ai",
            "ui"
          ],
          "title": "Improve TIFF image support"
        },
        {
          "code_url": "https://wiki.octave.org/GSoC_2022_Symbolic_package_project_final_report",
          "description": "The symbolic package for Octave, octsympy, is a highly demanded package and an important project to the community. As such, it is important to keep it in a healthy state. To create a balanced project, we divide the project into 3 parts to deal with *present*, *past* and /future/ goals respectively. The *present* part aims to work towards 3.0.0 milestones, such as supporting the latest versions of Sympy & Octave and improving the CI. The *past* part deals with long-standing bugs that had fallen through the cracks, fixing those lost and forgotten bugs. Finally, the /future/ part will look at how we can improve maintainance going forward. We will try an experimental work based on the Pythonic project. That being said, exactly how far we get may depend on mentor guidance. In any case, our goal is to make octsympy easier to maintain in the future.",
          "difficulty": null,
          "id": "proj_gnu-octave_2022_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/wzvM80S0/",
          "proposal_id": null,
          "short_description": "The symbolic package for Octave, octsympy, is a highly demanded package and an important project to the community. As such, it is important to keep...",
          "slug": "gsoc-2022-symbolic-package-project-proposal",
          "status": "completed",
          "student_name": "Alex Vong",
          "student_profile": null,
          "tags": [
            "python",
            "ai",
            "ui"
          ],
          "title": "GSoC 2022 Symbolic package project proposal"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2022/organizations/gnu-octave/"
    },
    "year_2023": {
      "num_projects": 2,
      "projects": [
        {
          "code_url": "https://azm999.hashnode.dev/gsoc23-final-report",
          "description": "The project aims to enhance the Statistics package in the GNU Octave by adding Generalised Additive Models (GAMs) Regression and kNN classification functionality. These features will allow users to perform better statistical analyses and modeling with ease of interpretability.",
          "difficulty": null,
          "id": "proj_gnu-octave_2023_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/XDEr4S3N",
          "proposal_id": "ijL5UnY2",
          "short_description": "The project aims to enhance the Statistics package in the GNU Octave by adding Generalised Additive Models (GAMs) Regression and kNN classification...",
          "slug": "addition-of-regression-gam-and-knn-classification-functionality-in-statistics-package",
          "status": "completed",
          "student_name": "Azmat Khan",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Addition of regression GAM and kNN classification functionality in statistics package"
        },
        {
          "code_url": "https://www.vipulcariappa.xyz/blogs/GSoC-2023-Blog-Final.html",
          "description": "octave-pythonic is an octave package used to incorporate python libraries and features in octave using the cpython interpreter. Currently octave-pythonic only supports python versions less than 3.10. But the latest python version is 3.11. The package has not been updated for a long time. My proposal is to improve the state of the package. Making octave-pythonic support the latest versions of python. Adding the missing features in the project. Fixing bugs from the bug tracker at GitLab. Implementing a python wrapper around octave types to use in python. Adding support for function callbacks and handles. And also adding support to use octave from python.",
          "difficulty": null,
          "id": "proj_gnu-octave_2023_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/aeEAbtyR",
          "proposal_id": "Mgu8a5Sp",
          "short_description": "octave-pythonic is an octave package used to incorporate python libraries and features in octave using the cpython interpreter. Currently...",
          "slug": "improve-the-state-of-octave-pythonic",
          "status": "completed",
          "student_name": "Vipul Cariappa",
          "student_profile": null,
          "tags": [
            "python"
          ],
          "title": "Improve the State of octave-pythonic"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2023/organizations/gnu-octave"
    },
    "year_2024": {
      "num_projects": 2,
      "projects": [
        {
          "code_url": "https://drive.google.com/file/d/15nwE0IV9glrHgkwvb5KdtiwgVt-5RHdS/view?usp=sharing",
          "description": "My project aims to enhance the GNU Octave Statistics package by implementing missing functionalities, specifically focusing on adding the missing ClassificationSVM classdef and ClassificationNeuralNetwork classdef. Support Vector Machines (SVMs) and Neural Network classifiers are powerful tools for classification tasks, and their absence in the current package limits users who require this functionality. By adding ClassificationSVM and ClassificationNeuralNetwork, I aim to improve the usability and completeness of the Statistics package, thereby increasing the user base and community satisfaction with Octave. During the Google Summer of Code period, I plan to complete the implementation of ClassificationSVM and ClassificationNeuralNetwork. I am excited to contribute to Octave, learn more about open-source development, and become an active member of the Octave community.\n\nYou can follow the project using the following links:\n\nBlog: https://pallavpurbia.blogspot.com\n\nGithub: https://github.com/XPT5OO1/statistics",
          "difficulty": null,
          "id": "proj_gnu-octave_2024_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/L6MlAMg0/",
          "proposal_id": null,
          "short_description": "My project aims to enhance the GNU Octave Statistics package by implementing missing functionalities, specifically focusing on adding the missing...",
          "slug": "adding-classificationsvm-classificationneuralnetwork-to-the-statistics-package-of-octave",
          "status": "completed",
          "student_name": "Pallav Purbia",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Adding ClassificationSVM, ClassificationNeuralNetwork to the Statistics Package of Octave"
        },
        {
          "code_url": "https://ruchika03.hashnode.dev/gsoc24-final-report",
          "description": "This proposal aims to significantly extend the classification capabilities of the GNU Octave statistics package by implementing additional methods for the existing ClassificationKNN class and introducing new classification classdefs, namely ClassificationGAM and ClassificationDiscriminant. These enhancements will bridge the gap between GNU Octave and MATLAB in terms of advanced data analysis and machine learning functionalities, fostering a richer environment for scientific computing.",
          "difficulty": "advanced",
          "id": "proj_gnu-octave_2024_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/REWm5jlS/",
          "proposal_id": null,
          "short_description": "This proposal aims to significantly extend the classification capabilities of the GNU Octave statistics package by implementing additional methods...",
          "slug": "adding-gam-and-discriminant-classification-classes-and-implementing-missing-methods",
          "status": "completed",
          "student_name": "Ruchika Sonagote",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Adding GAM and Discriminant Classification Classes and Implementing Missing Methods"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2024/organizations/gnu-octave/"
    },
    "year_2025": {
      "num_projects": 2,
      "projects": [
        {
          "code_url": null,
          "description": "The GNU Octave Statistics package lacks class definitions for knnsearch and rangesearch, and its KDTree method is currently disabled due to poor performance (GitHub issue #151). This project aims to implement KDTreeSearcher, ExhaustiveSearcher, and hnswSearcher classes, along with the createns helper function, to enhance clustering capabilities. The KDTree implementation will be optimized using a compiled Octave (.oct) library for faster index construction and queries. Each searcher class will include efficient knnsearch and rangesearch methods. Deliverables include optimized implementations, extensive testing, benchmarks, and comprehensive documentation, improving performance, usability, and MATLAB compatibility.",
          "difficulty": null,
          "id": "proj_gnu-octave_2025_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/vf4W0YiX",
          "proposal_id": "nKCwChqz",
          "short_description": "The GNU Octave Statistics package lacks class definitions for knnsearch and rangesearch, and its KDTree method is currently disabled due to poor...",
          "slug": "adding-clustering-searcher-classes-in-statistics-package",
          "status": "in-progress",
          "student_name": "Swayam Shah",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Adding clustering *Searcher classes in statistics package"
        },
        {
          "code_url": null,
          "description": "I propose to work on the following project: porting the Chebfun package to GNU Octave. Chebfun is a numerical computation package for MATLAB that provides a framework for representing functions in a symbolic manner using ”Chebyshev technology”, a term coined by the package authors to describe the use of Chebyshev polynomials to represent functions up to machine precision. GNU Octave is supposed to be mostly compatible with MATLAB, so Chebfun should ideally work without change on the former, but there are some slight differences and unimplemented features in Octave that make this difficult. Primarily, the main issue is that Octave’s support for object-oriented programming (classdef) is not as feature complete and as stable as MATLAB’s, which is a major problem since Chebfun is written in classdef.\n\n The goal of this project is to port Chebfun to GNU Octave, and to make it work as a dropin replacement for the MATLAB version. Since fixing classdef is not a feasible/recommended goal for a GSoC project, I will instead focus primarily on making the necessary changes to the Chebfun codebase to make it work in Octave. Along the way, I will compile new information about the status of classdef in Octave, and I will share my findings with the Octave developers, and perhaps aid in some changes to the Octave codebase itself.",
          "difficulty": null,
          "id": "proj_gnu-octave_2025_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/6xbfUWnM",
          "proposal_id": "Zfh8hxrh",
          "short_description": "I propose to work on the following project: porting the Chebfun package to GNU Octave. Chebfun is a numerical computation package for MATLAB that...",
          "slug": "porting-chebfun-to-gnu-octave",
          "status": "in-progress",
          "student_name": "Thomas Kolman",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Porting Chebfun to GNU Octave"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2025/organizations/gnu-octave"
    }
  },
  "first_time": false,
  "contact": {
    "email": "octave-maintainers@gnu.org",
    "guide_url": "https://wiki.octave.org/Summer_of_Code_-_Getting_Started",
    "ideas_url": "https://wiki.octave.org/Summer_of_Code_-_Getting_Started#Suggested_projects",
    "irc_channel": "https://octave.discourse.group/",
    "mailing_list": "https://octave.discourse.group/"
  },
  "social": {
    "blog": "https://octave.discourse.group/",
    "discord": null,
    "facebook": null,
    "github": null,
    "gitlab": null,
    "instagram": null,
    "linkedin": null,
    "mastodon": null,
    "medium": null,
    "reddit": null,
    "slack": null,
    "stackoverflow": null,
    "twitch": null,
    "twitter": null,
    "youtube": null
  },
  "meta": {
    "version": 1,
    "generated_at": "2026-01-25T15:28:53.175Z"
  }
}