{
  "id": "692251d653dd9d7326d33dcd",
  "slug": "google-deepmind",
  "name": "Google DeepMind",
  "category": "Artificial Intelligence",
  "description": "Google DeepMind's open-source projects",
  "image_url": "https://summerofcode.withgoogle.com/media/org/google-deepmind-sq/cmdhldmexaj4kpms-360.png",
  "img_r2_url": "https://pub-268c3a1efc8b4f8a99115507a760ca14.r2.dev/google-deepmind.webp",
  "logo_r2_url": null,
  "url": "https://github.com/google-deepmind",
  "active_years": [
    2025
  ],
  "first_year": 2025,
  "last_year": 2025,
  "is_currently_active": true,
  "technologies": [
    "python",
    "javascript",
    "typescript",
    "Jax",
    "Gemma"
  ],
  "topics": [
    "python",
    "Jax",
    "AI,",
    "Gemma"
  ],
  "total_projects": 45,
  "stats": {
    "avg_projects_per_appeared_year": 45,
    "projects_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": null,
      "year_2019": null,
      "year_2020": null,
      "year_2021": null,
      "year_2022": null,
      "year_2023": null,
      "year_2024": null,
      "year_2025": 45
    },
    "students_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": null,
      "year_2019": null,
      "year_2020": null,
      "year_2021": null,
      "year_2022": null,
      "year_2023": null,
      "year_2024": null,
      "year_2025": 45
    },
    "total_students": 45
  },
  "years": {
    "year_2016": null,
    "year_2017": null,
    "year_2018": null,
    "year_2019": null,
    "year_2020": null,
    "year_2021": null,
    "year_2022": null,
    "year_2023": null,
    "year_2024": null,
    "year_2025": {
      "num_projects": 45,
      "projects": [
        {
          "code_url": null,
          "description": "This project will evaluate Google's Gemini (2.5 Pro, 2.0 Flash) and Gemma (3, CodeGemma) models by extending multiple open-source coding benchmarks such as HackerRank ASTRA, Multi-SWE-bench, and WebDev Arena. The evaluation framework will assess coding capabilities across various dimensions, with particular emphasis on multimodal features for frontend development and will leverage the multimodal capabilities of these models, particularly for frontend development evaluation. The solution involves integrating Gemini/Gemma via their respective APIs/libraries, implementing multimodal self-assessment (using visual feedback from rendered UIs), enabling iterative evaluation (allowing models to refine solutions over multiple attempts), expanding the benchmark with complex frontend tasks (e.g., state management, API integration, basic 3D graphics), and automating the entire evaluation pipeline.\n\nDeliverables include the enhanced open-source benchmark with new benchmark tasks, automation scripts, and a public Hugging Face Space displaying continuously updated evaluation results for Gemini, Gemma, and other models, providing a clear, transparent comparison of advanced AI coding capabilities.",
          "difficulty": "advanced",
          "id": "proj_google-deepmind_2025_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/oZbPWaob",
          "proposal_id": "EpItK0lz",
          "short_description": "This project will evaluate Google's Gemini (2.5 Pro, 2.0 Flash) and Gemma (3, CodeGemma) models by extending multiple open-source coding benchmarks...",
          "slug": "evaluate-gemini-on-an-open-source-benchmark",
          "status": "in-progress",
          "student_name": "@anxkhn (Anas Khan)",
          "student_profile": null,
          "tags": [
            "web",
            "api",
            "ai",
            "ui",
            "frontend"
          ],
          "title": "Evaluate Gemini on an Open-Source Benchmark"
        },
        {
          "code_url": null,
          "description": "This project is about building a user-friendly web interface using Gradio that makes fine-tuning Gemma models simple and accessible for everyone—even those without deep technical knowledge. The app will allow users to upload datasets in various formats, select from different fine-tuning styles like Alpaca-style, conversational, or continuous pretraining, and choose between efficient LoRA or full fine-tuning based on their needs.\n\nOnce fine-tuned, users will be able to convert models into formats like PyTorch or GGUF, making them easy to use with tools like Ollama. The app will also support integration with platforms like Vertex AI, enabling users to fine-tune models without worrying about infrastructure setup.\n\nTo make the process even smoother, the project will include a set of easy-to-follow guides and documentation—covering everything from model selection to parameter tuning—so that users can make informed decisions at every step. The goal is to remove the complexity from LLM fine-tuning and empower more people to adapt powerful Gemma models for their own use cases.",
          "difficulty": "beginner",
          "id": "proj_google-deepmind_2025_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/6ep1Zcf2",
          "proposal_id": "t614wIoW",
          "short_description": "This project is about building a user-friendly web interface using Gradio that makes fine-tuning Gemma models simple and accessible for everyone—even...",
          "slug": "implementing-web-interface-for-fine-tuning-gemma-models-using-gradio",
          "status": "in-progress",
          "student_name": "Adarsh J. Dubey",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "ui"
          ],
          "title": "Implementing Web Interface For Fine-Tuning Gemma Models Using Gradio"
        },
        {
          "code_url": null,
          "description": "The project will close the documentation and evaluation gap for Google’s Gemini models by contributing structured onboarding guides and benchmarking templates to Promptfoo and Weights & Biases Weave, with specifically introducing models like Gemini 2.5 Pro, Gemini 2.0 Flash and Gemini 2.0 Flash-Lite. Despite Gemini’s powerful features—like multimodality and advanced safety settings—its presence in open-source evaluation tools lags behind GPT or Llama models. By improving usability, comparability, and safety transparency, this work will help developers, researchers, and product teams integrate and assess Gemini effectively, making it a fully accessible option in the LLM ecosystem.",
          "difficulty": "advanced",
          "id": "proj_google-deepmind_2025_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/TwyQFyTr",
          "proposal_id": "hT7jYz4L",
          "short_description": "The project will close the documentation and evaluation gap for Google’s Gemini models by contributing structured onboarding guides and benchmarking...",
          "slug": "improving-gemini-documentation-for-open-source-model-providers-promptfoo-and-weights-biases",
          "status": "in-progress",
          "student_name": "Adel Muursepp",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "Improving Gemini Documentation for Open Source Model Providers Promptfoo and Weights & Biases"
        },
        {
          "code_url": null,
          "description": "This project aims to rigorously evaluate Google’s Gemini multimodal model on real-world tasks. We plan to address the limitations of current benchmarks by either designing a new, comprehensive evaluation framework or extending an existing benchmark (such as MMMU or MultiBench) to include tasks that span text, image, video, and audio. This aims to include:\n\n- A curated, annotated dataset reflecting diverse, real-world multimodal tasks.\n- An automated Python-based evaluation pipeline that computes metrics for perception, reasoning, and long-context performance.\n- A comprehensive comparative analysis report detailing Gemini’s strengths and areas for improvement relative to other leading models.\n\nThis work will provide valuable insights into Gemini’s capabilities and guide future model enhancements, benefiting both research and practical applications.",
          "difficulty": null,
          "id": "proj_google-deepmind_2025_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/pPwjYAm4",
          "proposal_id": "843JCzXC",
          "short_description": "This project aims to rigorously evaluate Google’s Gemini multimodal model on real-world tasks. We plan to address the limitations of current...",
          "slug": "evaluate-gemini-on-an-open-source-benchmark",
          "status": "in-progress",
          "student_name": "Amrit Rai",
          "student_profile": null,
          "tags": [
            "python",
            "ai",
            "ui"
          ],
          "title": "Evaluate Gemini on an Open-Source Benchmark"
        },
        {
          "code_url": null,
          "description": "This project will elevate Gemini API support across widely used open-source agent frameworks like LangChain, LlamaIndex, CrewAI, and Composio—bridging the gap between Gemini’s full capabilities and the tools developers use to build with it. By introducing support for advanced features such as multimodal inputs, structured function calling, and streaming outputs, I aim to empower developers to build highly interactive, context-aware agents with ease. The project will include contributions to core library integrations, detailed documentation improvements, and the development of end-to-end examples showcasing Gemini in action. The result will be a robust, user-friendly ecosystem for Gemini-based agent development—making it easier than ever for developers to harness its full potential within their own workflows, products, and research.",
          "difficulty": "advanced",
          "id": "proj_google-deepmind_2025_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/P4729El9",
          "proposal_id": "ZdHek9GA",
          "short_description": "This project will elevate Gemini API support across widely used open-source agent frameworks like LangChain, LlamaIndex, CrewAI, and...",
          "slug": "enhance-gemini-api-integrations-in-oss-agents-tools",
          "status": "in-progress",
          "student_name": "Andy L",
          "student_profile": null,
          "tags": [
            "api",
            "ai",
            "ui"
          ],
          "title": "Enhance Gemini API Integrations in OSS Agents Tools"
        },
        {
          "code_url": null,
          "description": "A majority of the Gemma chat applications on Hugging Face Spaces do not allow the user to adjust generation settings or system prompts, giving the user only a generic experience. This project aims to provide users with total control of the model. Users will be able to fine-tune settings such as temperature, top-p, repetition penalty, and max tokens, allowing for a more personalized experience. Additionally, the project will introduce a range of predefined model personalities as well as custom context, enabling users to choose from different response styles, tones, and behaviours that best suit their preferences and use cases. I will deliver an open-source web application with comprehensive documentation accompanying it, which includes instructions, usage guides, and explanations of how different parameters influence the model's output. I believe that this project will be a valuable addition to the Gemma ecosystem on Hugging Face.",
          "difficulty": null,
          "id": "proj_google-deepmind_2025_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/xYQnvnz5",
          "proposal_id": "ZXYgdwPK",
          "short_description": "A majority of the Gemma chat applications on Hugging Face Spaces do not allow the user to adjust generation settings or system prompts, giving the...",
          "slug": "gemma-chat-gradio-demo",
          "status": "in-progress",
          "student_name": "AndyC",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "ui"
          ],
          "title": "Gemma Chat Gradio Demo"
        },
        {
          "code_url": null,
          "description": "This proposal aims to upgrade and expand existing open-source tutorials and examples to support the new unified Gemini SDKs for JavaScript/TypeScript and Python. My approach involves three key components:\n(i) Cookbook Migration:\nMigrate existing Python examples in the Gemini Cookbook to idiomatic JavaScript/TypeScript. I will ensure the code follows best practices in both languages and is thoroughly documented like the already existing cookbook examples.\n(ii) New Tutorials & End-to-End Examples:\nDevelop fresh, comprehensive tutorials demonstrating a variety of Gemini use cases. Examples include building a chatbot, creating a text summarization tool, and generating images from text prompts. Each tutorial will include step-by-step instructions, code samples, and in-depth explanations of underlying Gemini concepts.\n\nDeliverables include:\n- A set of migrated and newly developed code examples in both Python and JavaScript/TypeScript.\n- Comprehensive, user-friendly tutorials and documentation that clearly explain the code and underlying concepts.\n- Updated examples for existing open-source libraries utilizing the Gemini SDK, with clear migration guides.",
          "difficulty": null,
          "id": "proj_google-deepmind_2025_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/5FqYnamd",
          "proposal_id": "3TAT7VoP",
          "short_description": "This proposal aims to upgrade and expand existing open-source tutorials and examples to support the new unified Gemini SDKs for JavaScript/TypeScript...",
          "slug": "unified-gemini-example-cookbook-migrating-and-modernizing-open-source-learning-resources",
          "status": "in-progress",
          "student_name": "andycandy",
          "student_profile": null,
          "tags": [
            "python",
            "java",
            "javascript",
            "typescript",
            "ai"
          ],
          "title": "Unified Gemini Example Cookbook: Migrating and Modernizing Open-Source Learning Resources"
        },
        {
          "code_url": null,
          "description": "This project aims to create a Gemini Workspace in Postman for interacting with the Gemini API’s and providing a central hub for exploration , integration and troubleshooting. This will reduce the onboarding time for developers to get started with Gemini and the initial learning curve. The key features of this project are : \n\n1. Pre-build collections for every feature and API requests\n2.Examples for every requests to analyse the expected response\n3. Environments for testing and production\n4. Quickstart guide and documentation of every requests - purpose and expected behaviour\n5.Test scripts to check the format of the JSON response and the status code\n6. Mock servers using the postman mocking capabilities\nAutomation via Github Action.\n\nWithout the Gemini Workspace in Postman, developers face manual setup, debugging difficulties, and a steep learning curve. The project simplifies API testing, automation, and collaboration, making the Gemini API more accessible, efficient, and user-friendly",
          "difficulty": null,
          "id": "proj_google-deepmind_2025_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/yrmj0F4J",
          "proposal_id": "t9QTWJ3P",
          "short_description": "This project aims to create a Gemini Workspace in Postman for interacting with the Gemini API’s and providing a central hub for exploration ,...",
          "slug": "develop-a-gemini-workspace-in-postman",
          "status": "in-progress",
          "student_name": "Aniket.Saxena",
          "student_profile": null,
          "tags": [
            "api",
            "ai",
            "ui"
          ],
          "title": "Develop a Gemini Workspace in Postman"
        },
        {
          "code_url": null,
          "description": "EchoGem introduces a novel batching engine designed to answer multiple questions about the same source parallelly to reduce response times heavily. It does so by building a modular smart batching engine for Gemini that teaches the model to think in context-aware batches.\r\n\r\nWhat sets EchoGem apart is its focus on modularity and testing—each component is designed to be independently swappable and improvable allowing for open testing and matching different strategies for different parts of the engine. Instead of a naive sliding window or top-k search approach, EchoGem uses semantic clustering of both chunks and questions to form intelligent batch groups. It is also committed to measurable, reproducible gains. Every design decision—whether it's a new chunking strategy or a different context ranking model—can be rigorously backtested using a structured evaluation suite.",
          "difficulty": null,
          "id": "proj_google-deepmind_2025_009",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/7pu5jVUL",
          "proposal_id": "UMmhqYe5",
          "short_description": "EchoGem introduces a novel batching engine designed to answer multiple questions about the same source parallelly to reduce response times heavily....",
          "slug": "echogem-teaching-gemini-to-think-in-batches-by-prioritizing-what-matters",
          "status": "in-progress",
          "student_name": "Aryan Saboo",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "EchoGem – Teaching Gemini to Think in Batches by Prioritizing What Matters"
        },
        {
          "code_url": null,
          "description": "Gemma is a lightweight, open-source large language model by Google DeepMind. This project aims to build an intuitive web interface for fine-tuning Gemma models. The interface will allow users to upload datasets, configure hyperparameters, monitor training progress, and export trained models — all without writing a single line of code. By lowering the entry barrier, the UI will empower a broader range of users to experiment with and adapt large language models to their specific tasks.",
          "difficulty": null,
          "id": "proj_google-deepmind_2025_010",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/vBF5rvcZ",
          "proposal_id": "TRjmr4Jr",
          "short_description": "Gemma is a lightweight, open-source large language model by Google DeepMind. This project aims to build an intuitive web interface for fine-tuning...",
          "slug": "gemma-model-fine-tuning-ui",
          "status": "in-progress",
          "student_name": "Chen-Hao Wu",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "ui"
          ],
          "title": "Gemma Model Fine-tuning UI"
        },
        {
          "code_url": null,
          "description": "The goal of this project is to develop a multi-modal and open-source benchmark with which to evaluate Gemini 2.0. Open-source benchmarks are an unbiased way to test the ability of LLMs in different modalities. Current LLM benchmarks are mostly based on reasoning tasks and maths. However, there does not exist a gold standard LLM benchmark to assess creative thinking. This is a critical gap since creative thinking is essential for progress toward artificial general intelligence (AGI). To solve this, the project aims to extend current creative thinking LLM benchmarks and create a gold standard benchmark across four different modalities (text, image, video, and audio).\n\nUpon the project’s completion, a thorough multi-modal open-source benchmark for creative thinking and creative divergence will be created. This will be accompanied by the evaluation metrics of different models (including Gemini 2.0), along with documentation and custom evaluation scripts. Finally, an educational video explanation of the benchmark will be shared on my YouTube channel (https://www.youtube.com/@Green-Code/), which will serve as an introduction to developers and newcomers to the LLM field.",
          "difficulty": null,
          "id": "proj_google-deepmind_2025_011",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/TSDUDJNY",
          "proposal_id": "KjDhpvqo",
          "short_description": "The goal of this project is to develop a multi-modal and open-source benchmark with which to evaluate Gemini 2.0. Open-source benchmarks are an...",
          "slug": "creation-of-a-creative-thinking-benchmark",
          "status": "in-progress",
          "student_name": "Green Code",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Creation of a Creative Thinking Benchmark"
        },
        {
          "code_url": null,
          "description": "This proposal modernizes Gemini SDK learning resources by migrating outdated examples to JavaScript / TypeScript, developing new tutorials, and updating 2-3 key open-source libraries. Deliverables include 10-12 migrated examples, two tutorials, and library updates, all with comprehensive documentation, enhancing Gemini's accessibility.",
          "difficulty": null,
          "id": "proj_google-deepmind_2025_012",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/q59WH6jl",
          "proposal_id": "lzjjEpbe",
          "short_description": "This proposal modernizes Gemini SDK learning resources by migrating outdated examples to JavaScript / TypeScript, developing new tutorials, and...",
          "slug": "modernizing-gemini-sdk-learning-resources-migration-tutorials-and-library-updates",
          "status": "in-progress",
          "student_name": "Guan-Ming (Wesley), Chiu",
          "student_profile": null,
          "tags": [
            "java",
            "javascript",
            "typescript"
          ],
          "title": "Modernizing Gemini SDK Learning Resources: Migration, Tutorials, and Library Updates"
        },
        {
          "code_url": null,
          "description": "This project aims to develop a comprehensive Postman workspace for Google's Gemini API, providing a central hub for exploration, integration, and troubleshooting. The plan is to create a well-organized API collection covering all Gemini functionalities (text generation, image/video/audio analysis, and code generation), with configured environments for development and production. \n\nDeliverables include:\n1. Pre-built Postman API collection;\n2. Detailed technical documentation within Postman;\n3. Mock server for offline development/testing;\n4. Automated update mechanism via GitHub Actions. \n\nThis project will significantly reduce the learning curve for developers adopting Gemini API, promote best practices, and establish a sustainable framework that evolves alongside Google's Generative AI offerings.",
          "difficulty": null,
          "id": "proj_google-deepmind_2025_013",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/lba2Eefe",
          "proposal_id": "5KGw5oNI",
          "short_description": "This project aims to develop a comprehensive Postman workspace for Google's Gemini API, providing a central hub for exploration, integration, and...",
          "slug": "develop-a-gemini-workspace-in-postman",
          "status": "in-progress",
          "student_name": "Haibo Yang",
          "student_profile": null,
          "tags": [
            "api",
            "ai",
            "ui"
          ],
          "title": "Develop a Gemini Workspace in Postman"
        },
        {
          "code_url": null,
          "description": "This project will develop a robust, extensible benchmarking suite designed for Google's Gemma models to address the lack of standardized evaluation tools for these lightweight open models. While Gemma models represent a significant step toward democratizing access to high-quality LLMs, the community lacks standardized benchmarking tools that reliably measure model performance across diverse tasks, hindering effective research, comparison, and deployment.\n\nI will develop a Python-based benchmarking framework that enables systematic evaluation across standard academic benchmarks such as MMLU, GSM8K, and HumanEval. The framework will support comparing Gemma model sizes from 1B to 28B against other open models like Llama 2. It will include efficiency evaluation measuring latency and memory usage and responsible AI assessment for bias and toxicity. The suite will feature automated benchmarking with statistical validation and visual reporting through charts and detailed analysis.\n\nThe deliverables include a core modular benchmark framework supporting model loading, dataset processing, and evaluation; implementation of key academic benchmarks covering knowledge, reasoning, coding, and mathematics; efficiency benchmarking modules; visualization tools for generating performance charts and leaderboards; automation scripts for reproducible benchmark execution; comprehensive documentation; and an open-source GitHub repository with contribution guidelines. The initial focus will be on Gemma 1B, 2B, and 7B models, with the evaluation of larger models (12B+) as a stretch goal based on available computational resources.",
          "difficulty": null,
          "id": "proj_google-deepmind_2025_014",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/VcLLevh3",
          "proposal_id": "ZNrwKR4X",
          "short_description": "This project will develop a robust, extensible benchmarking suite designed for Google's Gemma models to address the lack of standardized evaluation...",
          "slug": "comprehensive-benchmark-suite-for-evaluating-gemma-models",
          "status": "in-progress",
          "student_name": "Hailey Cheng (Cheng Hei Lam)",
          "student_profile": null,
          "tags": [
            "python",
            "ml",
            "ai",
            "ui"
          ],
          "title": "Comprehensive Benchmark Suite for Evaluating Gemma Models"
        },
        {
          "code_url": null,
          "description": "Google DeepMind’s Gemini is a powerful multimodal model that excels at language comprehension, visual processing, and tool interaction. However, current integrations within key open-source agent frameworks such as LangChain, LlamaIndex, CrewAI, and Composio fall short in comprehensive multimodal input handling, robust function-calling capabilities, and versatile parameter configuration options. This project aims to address these gaps through targeted technical upgrades informed by Gemini’s official SDKs. For LangChain and Composio, improvements will focus on modifying the agent executor loop to handle function-calling for parallel execution. LlamaIndex upgrades will include integrating Gemini's Semantic Retriever API for vector storage, embedding generation and retrieval. Improvements for CrewAI will involve native multimodal input handling and Gemini tool orchestration. Alongside these technical advancements, the project will deliver extensive documentation, including a centralized Gemini integration guide and interactive example notebooks. These strategic refinements will empower developers to fully utilize Gemini, transforming it into a versatile \"brain\" for complex, multimodal applications.",
          "difficulty": "advanced",
          "id": "proj_google-deepmind_2025_015",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/TB24Ncdi",
          "proposal_id": "Eyx2CB9z",
          "short_description": "Google DeepMind’s Gemini is a powerful multimodal model that excels at language comprehension, visual processing, and tool interaction. However,...",
          "slug": "enhancing-gemini-integrations-in-open-source-agent-frameworks",
          "status": "in-progress",
          "student_name": "Indominus",
          "student_profile": null,
          "tags": [
            "api",
            "ai",
            "ui"
          ],
          "title": "Enhancing Gemini Integrations in Open-Source Agent Frameworks"
        },
        {
          "code_url": null,
          "description": "HALO is an innovative open-source framework designed to optimize Gemini API usage for long-context video analysis. By leveraging hierarchical semantic chunking that integrates speaker diarization, topic modeling, and visual scene detection, alongside reinforcement learning–driven adaptive segmentation, HALO structures lengthy video content into meaningful, context-rich segments. Its advanced multi-tier caching system reduces redundant API calls while maintaining conversational coherence over extended interactions. Delivered as a modular, MIT-licensed Python package with comprehensive documentation and seamless Gemini integration, HALO equips developers and researchers to efficiently and scalably extract deep insights from complex educational, corporate, and technical videos, advancing long-form video understanding with Gemini.",
          "difficulty": "advanced",
          "id": "proj_google-deepmind_2025_016",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/5ni7RZ48",
          "proposal_id": "pXqpYMT1",
          "short_description": "HALO is an innovative open-source framework designed to optimize Gemini API usage for long-context video analysis. By leveraging hierarchical...",
          "slug": "halo-hierarchical-abstraction-for-longform-optimization",
          "status": "in-progress",
          "student_name": "Jeet Dekivadia",
          "student_profile": null,
          "tags": [
            "python",
            "api",
            "ml",
            "ai",
            "ui"
          ],
          "title": "HALO: Hierarchical Abstraction for Longform Optimization"
        },
        {
          "code_url": null,
          "description": "Fine-tuning LLMs like Gemma requires deep technical understanding and complex configuration, hindering rapid prototyping and broader application. This project addresses this by creating a Streamlit web interface, streamlining dataset management, configurable fine-tuning pipelines (LoRA, SFT, RL), real-time visualization, and evaluation metrics, leveraging Google Cloud Platform for scalable performance. By making the fine-tuning process more accessible, it empowers users to focus on innovation in text and multimodal domains rather than navigating frustrating technical hurdles.",
          "difficulty": "advanced",
          "id": "proj_google-deepmind_2025_017",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/N2kjH8yi",
          "proposal_id": "3WtSL94T",
          "short_description": "Fine-tuning LLMs like Gemma requires deep technical understanding and complex configuration, hindering rapid prototyping and broader application....",
          "slug": "web-interface-for-accessible-configurable-gemma-open-models-fine-tuning-workflows",
          "status": "in-progress",
          "student_name": "Jet Chiang",
          "student_profile": null,
          "tags": [
            "web",
            "api",
            "ml",
            "ai",
            "cloud"
          ],
          "title": "Web Interface for Accessible, Configurable Gemma Open Models Fine-Tuning Workflows"
        },
        {
          "code_url": null,
          "description": "This project proposes the creation of a comprehensive Postman Workspace tailored for Google’s Gemini API suite. It will offer developers a robust, user-friendly hub to explore, integrate, and test Gemini’s capabilities, significantly lowering the barrier to entry for new Gemini developers.",
          "difficulty": null,
          "id": "proj_google-deepmind_2025_018",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/ntJk8lSk",
          "proposal_id": "3YIezZWd",
          "short_description": "This project proposes the creation of a comprehensive Postman Workspace tailored for Google’s Gemini API suite. It will offer developers a robust,...",
          "slug": "gemini-api-developer-workspace-in-postman",
          "status": "in-progress",
          "student_name": "Jevon Mao",
          "student_profile": null,
          "tags": [
            "api",
            "ai",
            "ui"
          ],
          "title": "Gemini API Developer  Workspace in Postman"
        },
        {
          "code_url": null,
          "description": "A VS Code (or JetBrains) extension to provide AI-powered coding assistance using Google’s Gemini API. This tool enhances the developer experience by offering smart code completions, real-time debugging help, and natural language to code conversion. It can suggest optimized code, detect errors, explain complex logic, and help developers write better, more efficient programs. The extension will also improve response times with caching mechanisms and provide a seamless UI/UX for smooth interaction. By integrating AI-driven support directly into VS Code, this project aims to boost productivity, reduce debugging time, and make coding more intuitive and accessible for developers.\nHere is the source code of the extension created by me, in the GitHub repository here: https://github.com/krishnaagrawal7508/GeminiBot",
          "difficulty": "advanced",
          "id": "proj_google-deepmind_2025_019",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/f9mtEUFy",
          "proposal_id": "HftEyDW2",
          "short_description": "A VS Code (or JetBrains) extension to provide AI-powered coding assistance using Google’s Gemini API. This tool enhances the developer experience by...",
          "slug": "vs-code-extension-to-assist-with-coding-powered-by-gemini-apis",
          "status": "in-progress",
          "student_name": "krishnaagrawal",
          "student_profile": null,
          "tags": [
            "api",
            "ml",
            "ai",
            "ui",
            "ux"
          ],
          "title": "VS Code Extension to assist with coding powered by Gemini APIs"
        },
        {
          "code_url": null,
          "description": "The goal of this project is to create a developer-friendly Postman Workspace for interacting with the Gemini API. This workspace will serve as a central hub for exploring, integrating, and troubleshooting the Gemini API, providing developers with pre-built collections, test scripts, and documentation to streamline their workflow and reduce the learning curve. The workspace will feature well-documented API requests for key Gemini functionalities like text generation, chat, image generation, and code generation. It will also include pre-configured environments for testing and production, secure management of API keys, and a GitHub Action for automated updates.\n\nThe key deliverables for this project include:\n1. A comprehensive Postman Workspace with collections for various Gemini API features.\n2. Pre-configured environments for testing and production.\n3. Integrated, self-contained documentation and tutorials.\n4. Test scripts to validate API responses and handle edge cases.\n5. Mock servers to simulate API responses during local development.\n6. A GitHub Action to automate workspace updates based on API changes.\n\nThis solution will simplify the process for developers, improve productivity, and ensure the Postman Workspace remains up-to-date and reliable.",
          "difficulty": null,
          "id": "proj_google-deepmind_2025_020",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/naa1qGoe",
          "proposal_id": "ZXZlfTXF",
          "short_description": "The goal of this project is to create a developer-friendly Postman Workspace for interacting with the Gemini API. This workspace will serve as a...",
          "slug": "develop-a-gemini-workspace-in-postman",
          "status": "in-progress",
          "student_name": "Lorenzo Drudi",
          "student_profile": null,
          "tags": [
            "api",
            "ml",
            "ai",
            "ui"
          ],
          "title": "Develop a Gemini Workspace in Postman"
        },
        {
          "code_url": null,
          "description": "This proposal aims to develop the Gemma LLM Garage, a full-stack interface to\nmanage datasets and fine-tune Gemma models. Its main goal is to abstract the technical complexity from the end user, empowering anyone with a computer to fine-tune their models.\n\nSo far, I have implemented basic features such as fine-tuning with LoRA, a mechanism for uploading datasets, simple data augmentation options, a live loss graph, and a simple inference platform to test the fine-tuned model. The main deliverables are implementing data cleaning strategies, improving the data augmentation options, implementing a testing workbench for the fine-tuned models, and supporting alternative fine-tuning methods (e.g. QLoRA).\n\nThe project prototype is currently deployed through Google Cloud and can be accessed here: \nhttps://gemma-garage.web.app/\n\nA quick video demo is available here: \nhttps://drive.google.com/file/d/1Knt9a16NfJTUX5rddte_SHcMDKCzA8NS/view",
          "difficulty": "advanced",
          "id": "proj_google-deepmind_2025_021",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/yT16LTpy",
          "proposal_id": "YiB6Pv05",
          "short_description": "This proposal aims to develop the Gemma LLM Garage, a full-stack interface to manage datasets and fine-tune Gemma models. Its main goal is to...",
          "slug": "gemma-garage-leveraging-gemma-3-to-democratize-llm-fine-tuning",
          "status": "in-progress",
          "student_name": "Lucas Martins",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "cloud",
            "ui",
            "ux"
          ],
          "title": "Gemma Garage:  Leveraging Gemma 3 to democratize LLM Fine-tuning"
        },
        {
          "code_url": null,
          "description": "This project aims to develop a more rigorous and focused evaluation testbed than that used by Garrido et al. (2025), with the specific goal of assessing the intuitive physics understanding of Gemma models. By addressing key shortcomings in existing evaluations—such as overreliance on textual outputs, limited control over task difficulty, and incomplete coverage of fundamental physical concepts—this new benchmark will enable more accurate and fair comparisons. Ultimately, it will offer deeper insights into what Gemma models actually grasp about the physical world and guide future improvements in their design and training.",
          "difficulty": null,
          "id": "proj_google-deepmind_2025_022",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/g4DnP02P",
          "proposal_id": "XUlM1WdI",
          "short_description": "This project aims to develop a more rigorous and focused evaluation testbed than that used by Garrido et al. (2025), with the specific goal of...",
          "slug": "enhanced-benchmark-for-evaluating-intuitive-physics-understanding-in-gemma-multimodal-models",
          "status": "in-progress",
          "student_name": "lucas-maes",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Enhanced Benchmark for Evaluating Intuitive Physics Understanding in Gemma Multimodal Models"
        },
        {
          "code_url": null,
          "description": "As multimodal agents become increasingly integrated into real-world applications, ensuring their safe and reliable tool-use behavior is paramount. We introduce ATIA, a novel evaluation suite designed to systematically assess the vulnerability of tool-calling agents to adversarial inputs. ATIA focuses on crafting malicious multimodal inputs—combinations of images, text, and other modalities—that covertly manipulate an agent's decision-making process regarding external tool invocations. By simulating a variety of attack vectors, including visual prompt injections, image–text conflicts, and spurious cross-modal cues, ATIA quantifies critical metrics such as tool call correctness, unsafe tool invocation rate, and adversarial success rate. This benchmark not only exposes potential weaknesses in current multimodal agent architectures but also provides actionable insights for developing robust, safe, and aligned systems. ATIA aims to serve as a reproducible and extensible framework, driving forward research in adversarial robustness and security for next-generation AI agents.",
          "difficulty": null,
          "id": "proj_google-deepmind_2025_023",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/DcszoT5l",
          "proposal_id": "BQXduE5D",
          "short_description": "As multimodal agents become increasingly integrated into real-world applications, ensuring their safe and reliable tool-use behavior is paramount. We...",
          "slug": "atia-a-benchmark-for-adversarial-tool-infiltration-in-agents",
          "status": "in-progress",
          "student_name": "Matthew Nguyen",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "ATIA: A BENCHMARK FOR ADVERSARIAL TOOL INFILTRATION IN AGENTS"
        },
        {
          "code_url": null,
          "description": "This project aims to develop a Python library to support Xarray data (labeled multi-dimensional array library supported by Deepmind) with JAX (Google's differentiable programming framework). This will address the lack of support for labeled multi-dimensional data in machine learning frameworks, extending scientific computing capabilities for domains like weather forecasting and financial modeling.\n\nBuilding on Google Deepmind's Xarray-JAX implementation in Graphcast, I will create a standalone library that leverages JAX's recent Python Array API standard implementation to replace the current wrapper-based approach with native integration. The solution will include direct JAX array usage through the API, updated coordinate handling, adapted tree utility registrations, and preservation of existing functionality.\n\nDeliverables include a production-ready xarray-jax library on PyPI, comprehensive test suite, tutorial notebook demonstrating usage, and documentation covering core functionality. This integration will enable scientists and researchers to work with labeled multi-dimensional data in JAX.",
          "difficulty": null,
          "id": "proj_google-deepmind_2025_024",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/PvgGDxQh",
          "proposal_id": "BRdCMO9L",
          "short_description": "This project aims to develop a Python library to support Xarray data (labeled multi-dimensional array library supported by Deepmind) with JAX...",
          "slug": "xarray-jax-integration-library",
          "status": "in-progress",
          "student_name": "Mikhail Sinitcyn",
          "student_profile": null,
          "tags": [
            "python",
            "api",
            "ai",
            "ui"
          ],
          "title": "Xarray-JAX Integration Library"
        },
        {
          "code_url": null,
          "description": "This project aims to enhance Gemini API integrations in open-source software (OSS) agent tools, specifically LangChain and LlamaIndex, by addressing critical gaps and implementing high-priority features to improve accessibility and functionality for developers. The Gemini API, with its multimodal capabilities and efficiency, has immense potential to empower AI agents, but current integrations in OSS tools lack key features like structured output streaming, context caching, and comprehensive documentation. I will tackle these challenges by implementing three features per tool: for LangChain, structured output streaming, tool calling with Union types, and batch prediction; for LlamaIndex, context caching, search grounding, and code execution. Additionally, I will update existing Gemini-focused documentation, create four example workflows (two per tool) to demonstrate practical use cases, and engage with the OSS community for feedback. As a stretch goal, I will contribute to Agno by addressing Gemini-specific issues like tool calling with structured output and memory leaks. Deliverables include six implemented features (three per tool) with documentation, updated existing Gemini-focused documentation for both tools, four example workflows, a community engagement report, and a final GSoC report/blog. If time permits, I will deliver fixes for two Agno issues with accompanying documentation. This project will increase Gemini API adoption in OSS ecosystems, lower adoption barriers for users, and support DeepMind’s mission of advancing AI accessibility.",
          "difficulty": null,
          "id": "proj_google-deepmind_2025_025",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/GZnZhIEh",
          "proposal_id": "5R8XjDfl",
          "short_description": "This project aims to enhance Gemini API integrations in open-source software (OSS) agent tools, specifically LangChain and LlamaIndex, by addressing...",
          "slug": "enhance-gemini-api-integrations-in-oss-agents-tools-deepmind",
          "status": "in-progress",
          "student_name": "msaadg",
          "student_profile": null,
          "tags": [
            "api",
            "ai"
          ],
          "title": "Enhance Gemini API Integrations in OSS Agents Tools (DeepMind)"
        },
        {
          "code_url": null,
          "description": "OSS-Fuzz-Gen, a framework using LLMs for fuzz target generation and evaluation by Google, currently has a basic experiment report UI alongside a manual CI workflow requiring significant oversight. This proposal introduces an improved report interface amongst other features to improve usability and data presentation. Concurrently, the project will streamline the experiment execution workflow for developers and security researchers by introducing more automation into the CI pipeline.",
          "difficulty": null,
          "id": "proj_google-deepmind_2025_026",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/USNSh5o9",
          "proposal_id": "9WayaXVa",
          "short_description": "OSS-Fuzz-Gen, a framework using LLMs for fuzz target generation and evaluation by Google, currently has a basic experiment report UI alongside a...",
          "slug": "streamline-experiment-execution-and-improve-report-ui-for-oss-fuzz-gen",
          "status": "in-progress",
          "student_name": "Myan (My Anh) Vu",
          "student_profile": null,
          "tags": [
            "ml",
            "ui"
          ],
          "title": "Streamline experiment execution and improve report UI for OSS-Fuzz-Gen"
        },
        {
          "code_url": null,
          "description": "Fine-tuning MLLMs to achieve test-time scaling and strong reasoning performance for visual/spatial tasks can be very expensive because of the increased size of visual/spatial data compared to textual data. Stanford researchers have recently developed a simple yet highly effective fine-tuning methodology for an off-the-shelf pre-trained model that allowed the fine-tuned model to develop test-time scaling and achieve strong reasoning performances for language-based tasks. The resulting Stanford s1 model outperformed OpenAI’s o1-preview by up to 27% on competition math questions. The astonishing detail is that the fine-tuning that allowed for test-time scaling and strong reasoning performance required less than 30 minutes, less than $50, and a tiny dataset of size 1000 [1].\n\nNo budget-friendly visual/spatial equivalent of the aforementioned methodology has been developed yet. I propose a project to extend the fine-tuning methodology of Stanford s1 to test-time scaling and reasoning for visual-based/spatial-based tasks. I  aim to use this to fine-tune Gemma 3 MLLMs to develop test-time scaling and achieve strong reasoning performance for visual/spatial tasks. \n\nIf successful, this project will prove that Gemma 3 MLLMs can be fine-tuned to develop test-time scaling and to achieve strong reasoning performance on spatial/visual tasks cost-efficiently, thereby democratizing AI development and opening up possibilities for Gemma 3 models to be effectively fine-tuned for a greater number and variety of tasks. This project will also serve as a very important step towards building next-generation highly effective large vision models, which were previously hindered by training costs. The impressive context window of Gemma 3 models makes them a perfect candidate for context-heavy reasoning of visual/spatial reasoning tasks in this project.\n\nReferences\n[1]\tN. Muennighoff et al., “s1: Simple test-time scaling.” 2025. [Online]. Available: https://arxiv.org/abs/2501.19393",
          "difficulty": null,
          "id": "proj_google-deepmind_2025_027",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/1E6DMVwi",
          "proposal_id": "vJUEo6aY",
          "short_description": "Fine-tuning MLLMs to achieve test-time scaling and strong reasoning performance for visual/spatial tasks can be very expensive because of the...",
          "slug": "highly-cost-efficient-fine-tuning-of-gemma-3-to-develop-test-time-scaling-for-visualspatial-tasks",
          "status": "in-progress",
          "student_name": "Nattaput Namchittai",
          "student_profile": null,
          "tags": [
            "ml",
            "ai",
            "ui"
          ],
          "title": "Highly Cost-Efficient Fine-Tuning of Gemma 3 to Develop Test-Time Scaling for Visual/Spatial Tasks."
        },
        {
          "code_url": null,
          "description": "Scientific discovery fundamentally relies on integrating and reasoning over multimodal information—text, diagrams, plots, spectra, microscopy images, and experimental observations. While multimodal Language Models like Gemini show promise as potential AI research assistants, their capabilities in nuanced scientific reasoning remain largely unevaluated, particularly across diverse scientific domains. Existing benchmarks often focus on general knowledge, single modalities, or lack the depth needed to probe scientific reasoning. This project proposes the creation of SciResearchBench, a novel,\nopen-source multimodal benchmark specifically designed to evaluate the scientific reasoning and discovery capabilities of multimodal across key research domains like Chemistry, Materials Science, Biology, and Physics. SciResearchBench will mirror real-world research workflows, encompassing tasks in multimodal data integration, experimental understanding, results interpretation, and hypothesis generation. A core focus will be extensive ablation studies to systematically analyze model sensitivities (prompting, cross-modal integration, grounding, reasoning complexity, context length),\nproviding crucial insights into model failure modes and avenues for improvement. The project deliverables include the curated/generated dataset, robust evaluation code, comprehensive evaluation results for Gemini models, detailed analysis, and the full open-source release of all components to the research community.",
          "difficulty": "advanced",
          "id": "proj_google-deepmind_2025_028",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/xshu9ha6",
          "proposal_id": "IWqpnuHm",
          "short_description": "Scientific discovery fundamentally relies on integrating and reasoning over multimodal information—text, diagrams, plots, spectra, microscopy images,...",
          "slug": "sciresearchbench-a-multimodal-benchmark-for-scientific-reasoning-and-discovery",
          "status": "in-progress",
          "student_name": "Nawaf Alampara",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "SciResearchBench: A Multimodal Benchmark for Scientific Reasoning and Discovery"
        },
        {
          "code_url": null,
          "description": "The aim of this project is to develop a code sample in Python that demonstrates some of the key capabilities of Google's Gemini APIs in regards to processing a large content source to answer a number of questions. In particular, it will explore how questions can be strategically grouped into batches, which can then be answered together using a single API call, vastly increasing efficiency. In addition, I will look at how Gemini's long context capabilities can be leveraged to process large amounts of content, such as the entire transcript of a video lecture, using techniques such as chunking to ensure context limits are not exceeded. Finally, I will explore how content caches can be used to allow for interconnected questions, whose answers build upon one another, whilst maintaining efficient API usage.\n\nThe project will result in a series of code samples and corresponding documentation covering a range of topics, from the basics of setting up an API key to how we can use Gemini in combination with applications such as Firebase to create a content cache. This documentation can then be used as a guide, referenced by developers when they are creating their own projects.",
          "difficulty": null,
          "id": "proj_google-deepmind_2025_029",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/QwrjzUxs",
          "proposal_id": "f0ToTu11",
          "short_description": "The aim of this project is to develop a code sample in Python that demonstrates some of the key capabilities of Google's Gemini APIs in regards to...",
          "slug": "batch-prediction-with-long-context-and-context-caching-code-sample",
          "status": "in-progress",
          "student_name": "Phillip Daniel",
          "student_profile": null,
          "tags": [
            "python",
            "api",
            "ai",
            "ui"
          ],
          "title": "Batch Prediction with Long Context and Context Caching Code Sample"
        },
        {
          "code_url": null,
          "description": "Reproducibility as Accuracy (RaA) is a benchmark which aims to evaluate how effective multimodal AI systems are in preserving information fidelity during iterative transformations from image to text.  By implementing a recursive process—converting an image to text and back to an image over multiple iterations—the benchmark will apply quantitative metrics to assess semantic drift and information degradation. Deliverables include an open-source benchmarking framework, a suite of evaluation metrics, comprehensive documentation, and analytical reports, providing insights to enhance the reliability of multimodal AI systems.",
          "difficulty": null,
          "id": "proj_google-deepmind_2025_030",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/hoyVl52a",
          "proposal_id": "KbwjZeaR",
          "short_description": "Reproducibility as Accuracy (RaA) is a benchmark which aims to evaluate how effective multimodal AI systems are in preserving information fidelity...",
          "slug": "reproducibility-as-accuracy-raa-benchmark",
          "status": "in-progress",
          "student_name": "Pranav Agrawal",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Reproducibility as Accuracy (RaA) Benchmark"
        },
        {
          "code_url": null,
          "description": "When attempting to utilize Google's Gemini APIs, developers face a steep learning curve. The scattered documentation, complex parameter configurations, and required manual setup all contribute to this problem. This project aims to improve the experience of developers when working with Google's Gemini APIs by creating a comprehensive and well-documented Postman Workspace.\n\nThis project will result in a ready-to-use Postman Workspace with:\n1. Pre-built API request collections for Gemini's major features (i.e. text, chat, image, code generation).\n2. Configurable environments for development and production with built-in authentication variable support.\n3. Mock servers and test scripts to simulate responses and aid local development.\nEmbedded documentation and tutorials for quick onboarding.\n4. A GitHub Action to automate updates based on changes to the Gemini API specs.\n\nThe end product will offer a centralized, up-to-date toolset, making it faster and simpler for developers to test, debug, and integrate Gemini into their applications. This workspace will serve as a valuable resource to the open-source community.",
          "difficulty": "advanced",
          "id": "proj_google-deepmind_2025_031",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/XG33BRy9",
          "proposal_id": "X37aY71k",
          "short_description": "When attempting to utilize Google's Gemini APIs, developers face a steep learning curve. The scattered documentation, complex parameter...",
          "slug": "streamlining-gemini-api-development-building-a-postman-workspace-for-gemini-apis",
          "status": "in-progress",
          "student_name": "Preston Tjandra",
          "student_profile": null,
          "tags": [
            "api",
            "ml",
            "ai",
            "ui"
          ],
          "title": "Streamlining Gemini API Development: Building a Postman Workspace for Gemini API’s"
        },
        {
          "code_url": null,
          "description": "AI models with function-calling capabilities can be powerful tools for solving real-world problems, but experimenting with them isn’t always straightforward. This project aims to build an AI sandbox web platform where developers and communities can easily explore how Gemma’s function-calling can be used in different sectors.\n\nTo make the platform practical, I’ll focus on crisis response (using the example of La DANA, the storm that impacted Valencia) and potentially healthcare (like optimizing hospital logistics in Venezuela). The project will include a user-friendly interface, a backend powered by FastAPI, and proof-of-concept demos showing how AI can automate real-world tasks like retrieving emergency weather data or coordinating hospital resources.\n\nThe deliverables will include the sandbox platform itself, technical documentation, and tutorials, making it easy for others to replicate or extend the project for their own use cases. The goal is to create something that’s not just useful during GSoC but can keep growing as an open-source tool for AI-powered decision-making.",
          "difficulty": "beginner",
          "id": "proj_google-deepmind_2025_032",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/sfMAOShm",
          "proposal_id": "Jtmo9A1p",
          "short_description": "AI models with function-calling capabilities can be powerful tools for solving real-world problems, but experimenting with them isn’t always...",
          "slug": "gemma-function-calling-sandbox-for-real-world-applications",
          "status": "in-progress",
          "student_name": "Rodrigo Sagastegui",
          "student_profile": null,
          "tags": [
            "web",
            "api",
            "ai",
            "ui",
            "backend"
          ],
          "title": "Gemma Function-Calling Sandbox for Real-World Applications"
        },
        {
          "code_url": null,
          "description": "GemmaEval is a comprehensive, automated benchmarking framework designed to evaluate, visualize, and compare Gemma language models against other open source LLMs across a wide spectrum of NLP tasks. This project will introduce a standardized, reproducible testing environment that evaluates models on 1) classic benchmarks such as TriviaQA, GPQA, MGSM; 2) agentic benchmarks such as SWE-bench, TAU-bench; 3) multimodal benchmarks like MMMU; and 4) safety benchmarks like Weapons of Mass Destruction Proxy (WMDP) benchmark.",
          "difficulty": null,
          "id": "proj_google-deepmind_2025_033",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/RSjjE3tM",
          "proposal_id": "p5fWV2O8",
          "short_description": "GemmaEval is a comprehensive, automated benchmarking framework designed to evaluate, visualize, and compare Gemma language models against other open...",
          "slug": "gemmaeval-a-comprehensive-automated-benchmark-suite-for-gemma",
          "status": "in-progress",
          "student_name": "Ryan Rong",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "GemmaEval: A Comprehensive Automated Benchmark Suite for Gemma"
        },
        {
          "code_url": null,
          "description": "This project aims to advance the evaluation framework for Google’s Gemini 2.0 and Gemma 3-27B multimodal models by integrating a diverse set of open-source, domain-specific benchmarks spanning healthcare, robotics, and general-purpose multimodal reasoning.\nIn the healthcare domain, the evaluation will leverage datasets such as VQA-RAD and OmniMedVQA to assess the models' capabilities in interpreting and reasoning over complex clinical imaging and textual data. For the robotics domain, benchmarks like EmbodiedBench and EmbodiedQA will evaluate the models' proficiency in understanding spatial, visual, and language cues for grounded human-robot interaction tasks. Additionally, general multimodal benchmarks such as SME and BenchLMM will test the models’ ability to produce accurate, context-aware, and human-like explanations grounded in visual inputs.\nTo ensure robustness, the project will also incorporate adversarial attack benchmarks across modalities, evaluating how resilient Gemini 2.0 and Gemma 3-27B are against input perturbations—including visual occlusions, textual prompt manipulations, and conflicting cross-modal signals. Alongside task accuracy, we will analyze the relationship between inference time and adversarial attack success, quantifying how model latency and confidence shift under adversarial conditions.",
          "difficulty": "advanced",
          "id": "proj_google-deepmind_2025_034",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/8r8SJScX",
          "proposal_id": "e3GYErmw",
          "short_description": "This project aims to advance the evaluation framework for Google’s Gemini 2.0 and Gemma 3-27B multimodal models by integrating a diverse set of...",
          "slug": "open-source-multimodal-benchmarks-and-adversarial-robustness-testing-for-gemini-2x-models",
          "status": "in-progress",
          "student_name": "Saravan_Kumar",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Open-Source Multimodal Benchmarks and Adversarial Robustness Testing for Gemini 2.X models"
        },
        {
          "code_url": null,
          "description": "This project develops an efficient framework for analyzing educational video content using the Gemini API. The approach combines optimized batch prediction, intelligent context caching, and conversational memory to reduce API usage significantly while improving coherence in multimodal interactions. The framework addresses common challenges when analyzing video content: redundant API calls, context fragmentation with long transcripts, and lack of conversational coherence across related questions. Key deliverables include a modular architecture implementing efficient batch processing with dependency analysis, adaptive context caching strategies for transcripts of varying lengths, conversation memory management for follow-up questions, and structured response formatting with timestamp references. The solution aims to achieve a 4-5× reduction in API calls while maintaining high-quality responses, serving as both a practical tool and a reference implementation demonstrating Gemini API best practices.",
          "difficulty": null,
          "id": "proj_google-deepmind_2025_035",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/dv9GeGEi",
          "proposal_id": "CBsNfZJM",
          "short_description": "This project develops an efficient framework for analyzing educational video content using the Gemini API. The approach combines optimized batch...",
          "slug": "batch-prediction-framework-long-context-and-context-caching-for-video-analysis",
          "status": "in-progress",
          "student_name": "Sean Brar",
          "student_profile": null,
          "tags": [
            "api",
            "ai"
          ],
          "title": "Batch Prediction Framework: Long Context and Context Caching for Video Analysis"
        },
        {
          "code_url": null,
          "description": "Current manual evaluation methods for LLM-based AI applications are unsustainable and resource-intensive. While using LLMs as judges offers a promising alternative, evaluation frameworks provide structured tools that harness LLMs for automated assessments, offering metrics, benchmarks, and scalable testing methodologies that overcome manual evaluation limitations. Gemini's integration with evaluation platforms lacks comprehensive documentation compared to providers like OpenAI and Anthropic. Analysis of ten major frameworks reveals scattered integration, decentralized documentation, and limited implementation guidance for Gemini, creating barriers for developers and researchers.\n\nI propose a three-pronged approach to improve Gemini support across evaluation frameworks. First, adding native Gemini support to select frameworks (DeepEval and TruLens) that already offer direct integrations for other providers. Second, enhancing both abstraction-layer and framework-specific documentation, covering API key management, model configuration, and multimodal capabilities. Third, creating framework-specific guides in Python and TypeScript that demonstrate effective combination of library features with Gemini APIs.\n\nFor code deliverables, I will develop native Gemini integration for DeepEval and TruLens frameworks, with pull requests submitted to respective GitHub repositories. Documentation deliverables include enhanced guidance for abstraction layers (LiteLLM, LangChain, LlamaIndex) focused on Gemini configuration, and framework-specific documentation covering API management, configuration options, multimodal integration, and evaluation best practices.\nTutorial deliverables will include comprehensive guides for all ten analyzed frameworks, with Python implementations for all frameworks and TypeScript for supported ones, step-by-step configuration instructions, advanced usage examples highlighting Gemini's multimodal capabilities, and error handling techniques.",
          "difficulty": "advanced",
          "id": "proj_google-deepmind_2025_036",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/IG6jL3Hj",
          "proposal_id": "VCA4Xq5z",
          "short_description": "Current manual evaluation methods for LLM-based AI applications are unsustainable and resource-intensive. While using LLMs as judges offers a...",
          "slug": "improve-evals-documentation-for-the-gemini-apis",
          "status": "in-progress",
          "student_name": "Siddharth Sahu",
          "student_profile": null,
          "tags": [
            "python",
            "typescript",
            "api",
            "ai",
            "ui"
          ],
          "title": "Improve Evals Documentation for the Gemini APIs"
        },
        {
          "code_url": null,
          "description": "The goal of this project is to help strengthen the Concordia framework by developing and open-sourcing a collection of new language model agent architectures. The project is meant to iterate on the work done by contestants during the Concordia Contest at NeurIPS 2024. \n\nWhile the Concordia Contest 2024 has concluded, the need for well-documented and diverse examples of cooperative agents in the Concordia ecosystem remains important for the ongoing research in cooperative AI. The main benefit being that the new agents created will help lower the barrier of entry for new researchers and engineers, with the hope of inspiring more people to contribute unique approaches to using the framework and speed up the research being done in cooperative AI by providing practical and reusable agent implementations.",
          "difficulty": null,
          "id": "proj_google-deepmind_2025_037",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/j5h3cWWt",
          "proposal_id": "WUOmrmBe",
          "short_description": "The goal of this project is to help strengthen the Concordia framework by developing and open-sourcing a collection of new language model agent...",
          "slug": "creating-new-agent-architectures-for-concordia",
          "status": "in-progress",
          "student_name": "tesims",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Creating New Agent Architectures for Concordia"
        },
        {
          "code_url": null,
          "description": "This project aims to enhance the integration of Google's Gemini AI into open-source IDE extensions, focusing on developing and improving user interface, implementing long-context support for larger codebases, and utilizing context caching to improve efficiency and reduce cost.",
          "difficulty": null,
          "id": "proj_google-deepmind_2025_038",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/XxTqA1r9",
          "proposal_id": "DnISSoZ9",
          "short_description": "This project aims to enhance the integration of Google's Gemini AI into open-source IDE extensions, focusing on developing and improving user...",
          "slug": "enhance-gemini-support-in-open-source-extensions-continuedevaider-like",
          "status": "in-progress",
          "student_name": "Ton Hoang Nguyen (Bill)",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Enhance Gemini Support in Open-Source Extensions (Continue.dev/Aider-like)"
        },
        {
          "code_url": null,
          "description": "The Gemini Cookbook is a set of sample applications and tutorials illustrating different functionalities of the Gemini APIs. The intent of this proposal is to modernize current tutorials and documentation to assist with the new unified Gemini SDKs for JavaScript/TypeScript and Python. This involves bringing examples from Python into JS/TS, creating new end-to-end tutorials, and modernizing examples for other open source libraries utilizing outdated versions of the Gemini APIs. By giving users new, current learning tools, this project hopes to facilitate adoption of the Gemini APIs.\n\n1. Migrate Existing Python Examples to TypeScript\nConvert the current Python-based examples in the Gemini Cookbook to idiomatic TypeScript using the latest Gemini SDK. This will ensure cross-language support and make sure the resources are accessible to a wider range of developers.\n2. Create End-to-End Tutorials for Real-World Use Cases\nDesign and implement comprehensive, practical tutorials that showcase the capabilities of the Gemini APIs. These tutorials will include projects such as intelligent chatbots, document summarization tools, and image generation from prompts, covering both basic and advanced use cases. New ideas for tutorials can be submitted by the community, and can be sourced from the existing cookbook issues.\n3. Modernize Open-Source Libraries Using Gemini APIs\nIdentify and contribute to popular open-source projects that use deprecated versions of the Gemini SDKs. Update the examples and documentation to leverage the features and improvements introduced in the latest unified Gemini SDKs.",
          "difficulty": "advanced",
          "id": "proj_google-deepmind_2025_039",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/VhcMTva8",
          "proposal_id": "my7TbDYU",
          "short_description": "The Gemini Cookbook is a set of sample applications and tutorials illustrating different functionalities of the Gemini APIs. The intent of this...",
          "slug": "open-source-gemini-example-apps",
          "status": "in-progress",
          "student_name": "Triyan Mukherjee",
          "student_profile": null,
          "tags": [
            "python",
            "java",
            "javascript",
            "typescript",
            "api"
          ],
          "title": "Open-source Gemini Example Apps"
        },
        {
          "code_url": null,
          "description": "This project aims to build a production-grade, open-source code sample that showcases batch question answering over long-context inputs using Google Gemini APIs. The primary use case is multi-turn Q&A on long-form video content (e.g., lectures, documentaries), a critical need in educational and summarization tools.\n\nThe project will focus on:\n\nEfficient batch prediction pipelines using async processing,\nHandling long transcripts with smart chunking and fallback mechanisms,\nReusing input efficiently via context caching,\nSupporting interconnected questions within and across sessions, and\nGenerating clean, structured output in Markdown/JSON with timestamp references.\nDeliverables include:\n\nA modular pipeline for batch Q&A\nLong-context handling with semantic chunking\nA context caching mechanism\nInterconnected thread/question support\nMarkdown/JSON output formatters\nDocumentation, setup examples, and robust error handling\nStretch goals include: real-time streaming via Gemini, a basic frontend in Streamlit/CLI, thread persistence, and efficiency metrics reporting.\n\nThis project will provide a high-impact reference for developers building LLM-first educational apps, video assistants, and advanced retrieval-augmented generation (RAG) systems.",
          "difficulty": "advanced",
          "id": "proj_google-deepmind_2025_040",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/NxQQgsTG",
          "proposal_id": "JBSmoMLD",
          "short_description": "This project aims to build a production-grade, open-source code sample that showcases batch question answering over long-context inputs using Google...",
          "slug": "batch-prediction-with-long-context-and-context-caching",
          "status": "in-progress",
          "student_name": "vanshksingh",
          "student_profile": null,
          "tags": [
            "api",
            "ml",
            "ai",
            "ui",
            "frontend"
          ],
          "title": "Batch Prediction with Long Context and Context Caching"
        },
        {
          "code_url": null,
          "description": "This project aims to: (a) investigate to explore technical possibilities, enhance specifications, and find applications for specific use cases and domains, (b) create a collaborative open source site for Gemma prototypes and cookbooks for the previously identified use cases across domains, and (c) document learnings and create RFCs based on the investigations to provide a roadmap for future work.",
          "difficulty": null,
          "id": "proj_google-deepmind_2025_041",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/rexKK7eu",
          "proposal_id": "f0qK5i6P",
          "short_description": "This project aims to: (a) investigate to explore technical possibilities, enhance specifications, and find applications for specific use cases and...",
          "slug": "exploring-extending-function-calling-in-gemma",
          "status": "in-progress",
          "student_name": "Vedant Kulkarni",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Exploring & Extending Function Calling in Gemma"
        },
        {
          "code_url": null,
          "description": "This project addresses critical gaps in Gemini API integration across leading agent frameworks (LangChain, LlamaIndex, CrewAI, Composio), where multimodal capabilities and function calling remain underdeveloped or inconsistent. By implementing standardized components for multimodal processing, function calling, and performance optimization, the project will democratize access to Gemini's advanced capabilities for developers building sophisticated AI agents.\n\nThe implementation will follow a systematic approach, beginning with a comprehensive framework audit and gap analysis, followed by development of core multimodal support, function calling capabilities, and performance optimization layers. The solution will include a unified adapter layer that standardizes Gemini API access while respecting each framework's architectural patterns.\n\nDeliverables include: (1) enhanced framework integrations with full multimodal support, (2) standardized function calling implementations, (3) performance optimization components including token management and caching systems, (4) comprehensive documentation and examples, and (5) a benchmarking suite for performance analysis. This project will establish a new standard for Gemini integration in the agent ecosystem, enabling entirely new classes of multimodal AI applications.",
          "difficulty": "advanced",
          "id": "proj_google-deepmind_2025_042",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/C9emc20S",
          "proposal_id": "d5pdfZ1E",
          "short_description": "This project addresses critical gaps in Gemini API integration across leading agent frameworks (LangChain, LlamaIndex, CrewAI, Composio), where...",
          "slug": "multimodal-intelligence-supercharging-agents-with-gemini",
          "status": "in-progress",
          "student_name": "Wale",
          "student_profile": null,
          "tags": [
            "api",
            "ai",
            "ui"
          ],
          "title": "Multimodal Intelligence: Supercharging Agents with Gemini"
        },
        {
          "code_url": null,
          "description": "This project aims to design a robust, reproducible benchmark for evaluating the Gemini family of multimodal large language models (MLLMs), such as Gemini 2.0. While prior benchmarks focus on text-only LLMs, standardized evaluation for multimodal reasoning, grounding, and question answering remains limited. To address this, I propose building a new open-source multimodal benchmark using synthetic data, inspired by LLaVA.\n\nThe benchmark will be generated using Stable Diffusion for images and GPT-4o for text and QA pairs. It will cover diverse visual domains and tasks like visual reasoning, image captioning, and multimodal QA. Evaluation metrics such as BLEU, grounding accuracy, and alignment score will be included. Gemini’s performance will be compared with leading open models like LLaVA, Kosmos-2, and OpenFlamingo.\n\nThe deliverables include:\n\n1. A benchmark dataset (synthetic or hybrid)\n2. Gemini 2.0 evaluation pipeline, and baseline comparisons \n3. Visualization dashboards, and detailed performance reports\n4. Open-source release of code, data, and documentation.",
          "difficulty": null,
          "id": "proj_google-deepmind_2025_043",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/2zNO3rjt",
          "proposal_id": "Kb59ZEjE",
          "short_description": "This project aims to design a robust, reproducible benchmark for evaluating the Gemini family of multimodal large language models (MLLMs), such as...",
          "slug": "evaluate-gemini-gemma-on-an-open-source-benchmark",
          "status": "in-progress",
          "student_name": "Yang Ouyang",
          "student_profile": null,
          "tags": [
            "ml",
            "ai",
            "ui"
          ],
          "title": "Evaluate Gemini (Gemma) on an Open-Source Benchmark"
        },
        {
          "code_url": null,
          "description": "Enable and document best practices for function calling in Gemma models, similar to the structured tool-use capabilities . In essence, function calling allows an LLM to go beyond generating text — it lets the model invoke external functions, APIs, or tools based on the user’s intent, turning natural language queries into real-world actions. \r\nThis project aims to bring comparable capabilities to Gemma, an open-source LLM by Google DeepMind, by developing an open toolkit and guidelines for function calling.\r\n In this project, I will investigate and document best practices for integrating function calling with Gemma. This includes creating a comprehensive SDK and documentation & RAG extraction, these covers:\r\n\r\nIntegration approaches – exploring different methods to integrate Gemma with tools, such as auto-generating functions from OpenAPI specs, using ReAct loops for multi-step reasoning, and enabling multimodal (image and text) API calls.\r\nUse case demonstrations – building example scenarios (e.g. calling a web API, querying a database, controlling an external application) to showcase the functionality.\r\nPerformance benchmarking – evaluating Gemma’s function-calling performance on metrics like accuracy and efficiency using the BFCL (Berkeley Function-Calling Leaderboard) standard.\r\nAgent framework support – ensuring the solution works with popular agentic frameworks (LangChain, CrewAI, AutoGen) so developers can easily plug Gemma in as an intelligent agent.\r\n\r\nBy the end of the project, we will have a robust reference implementation and guide for Gemma function calling. This will empower developers and the research community to use Gemma in advanced “agentic” applications — for example, building assistants that can reliably call external APIs or tools. In summary, Gemma’s capabilities will be extended to transform natural language into actions, bridging the gap between open-source models and the sophisticated function-calling features of contemporary AI systems.",
          "difficulty": "advanced",
          "id": "proj_google-deepmind_2025_044",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/pAzrvoRU",
          "proposal_id": "oRljnihn",
          "short_description": "Enable and document best practices for function calling in Gemma models, similar to the structured tool-use capabilities . In essence, function...",
          "slug": "gemma-model-function-calling-exploration",
          "status": "in-progress",
          "student_name": "Yashdeep Prasad",
          "student_profile": null,
          "tags": [
            "react",
            "ios",
            "web",
            "api",
            "ai"
          ],
          "title": "Gemma Model Function Calling Exploration"
        },
        {
          "code_url": null,
          "description": "This project aims to develop a standalone Python SDK that provides researchers with a streamlined and well-documented API for interacting with OSS-Fuzz. The current access methods to OSS-Fuzz's features and data are fragmented and inconsistent, posing challenges in terms of code duplication, error handling, and usability for new researchers. By encapsulating OSS-Fuzz interactions within a cohesive module, this project will standardize data formats, simplify API usage, and improve accessibility for researchers.",
          "difficulty": null,
          "id": "proj_google-deepmind_2025_045",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/51tdKuLz",
          "proposal_id": "KY5A2UGu",
          "short_description": "This project aims to develop a standalone Python SDK that provides researchers with a streamlined and well-documented API for interacting with...",
          "slug": "self-contained-oss-fuzz-module-for-researchers",
          "status": "in-progress",
          "student_name": "Zewei Wang",
          "student_profile": null,
          "tags": [
            "python",
            "api",
            "ml",
            "ai"
          ],
          "title": "Self-Contained OSS-Fuzz Module for Researchers"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2025/organizations/google-deepmind-sq"
    }
  },
  "first_time": true,
  "contact": {
    "email": "webpaige@google.com",
    "guide_url": null,
    "ideas_url": "https://goo.gle/deepmind-gsoc-projects-2025",
    "irc_channel": null,
    "mailing_list": null
  },
  "social": {
    "blog": null,
    "discord": null,
    "facebook": null,
    "github": "https://github.com/google-deepmind",
    "gitlab": null,
    "instagram": null,
    "linkedin": null,
    "mastodon": null,
    "medium": null,
    "reddit": null,
    "slack": null,
    "stackoverflow": null,
    "twitch": null,
    "twitter": "https://twitter.com/googleaidevs",
    "youtube": null
  },
  "meta": {
    "version": 1,
    "generated_at": "2026-01-25T15:28:53.217Z"
  }
}