{
  "id": "692251d753dd9d7326d33dd8",
  "slug": "humanai",
  "name": "HumanAI",
  "category": "Media",
  "description": "AI for the Arts and the Humanities",
  "image_url": "https://summerofcode.withgoogle.com/media/org/humanai/n5oaqivpu4hu4alm-360.png",
  "img_r2_url": "https://pub-268c3a1efc8b4f8a99115507a760ca14.r2.dev/humanai.webp",
  "logo_r2_url": null,
  "url": "http://humanai.foundation",
  "active_years": [
    2024,
    2025
  ],
  "first_year": 2024,
  "last_year": 2025,
  "is_currently_active": true,
  "technologies": [
    "python",
    "machine learning",
    "c++",
    "data analysis",
    "artificial intelligence"
  ],
  "topics": [
    "machine learning",
    "artificial intelligence",
    "ai",
    "Arts",
    "Humanities"
  ],
  "total_projects": 26,
  "stats": {
    "avg_projects_per_appeared_year": 13,
    "projects_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": null,
      "year_2019": null,
      "year_2020": null,
      "year_2021": null,
      "year_2022": null,
      "year_2023": null,
      "year_2024": 11,
      "year_2025": 15
    },
    "students_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": null,
      "year_2019": null,
      "year_2020": null,
      "year_2021": null,
      "year_2022": null,
      "year_2023": null,
      "year_2024": 11,
      "year_2025": 15
    },
    "total_students": 22
  },
  "years": {
    "year_2016": null,
    "year_2017": null,
    "year_2018": null,
    "year_2019": null,
    "year_2020": null,
    "year_2021": null,
    "year_2022": null,
    "year_2023": null,
    "year_2024": {
      "num_projects": 11,
      "projects": [
        {
          "code_url": "https://github.com/humanai-foundation/ArtExtract/tree/main/ArtExtract_Soyoung",
          "description": "This proposal outlines a novel approach for retrieving hidden image from paintings using AI-generated multispectral image dataset and a Siamese network architecture. By leveraging the existing multispectral image dataset, this methodology aims to both create a dedicated multispectral image dataset for paintings and unveil hidden details within them. By fine-tuning the feature extraction module and improving a contrastive loss function, this methodology identifies dissimilar pixels, thus revealing the hidden image and surpassing the limitations of conventional pre-trained models.",
          "difficulty": null,
          "id": "proj_humanai_2024_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/UbSBMuRD/",
          "proposal_id": null,
          "short_description": "This proposal outlines a novel approach for retrieving hidden image from paintings using AI-generated multispectral image dataset and a Siamese...",
          "slug": "revealing-the-unseen-paintings-siamese-network-based-image-retrieval-with-multispectral-images",
          "status": "completed",
          "student_name": "Soyoung Park",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Revealing the Unseen Paintings: Siamese Network-Based Image Retrieval with Multispectral Images"
        },
        {
          "code_url": "https://github.com/humanai-foundation/RenAIssance/tree/main/RenAIssance_CRNN_OCR_Shashank_Shekhar_Singh",
          "description": "This project aims to address the challenge of text recognition from historical Spanish printed sources dating back to the seventeenth century, a domain where existing Optical Character Recognition (OCR) tools often fail due to the complexity and variability of the texts. Leveraging hybrid end-to- end models based on a combination of multiple architectures, such as CNN-RNN, our research seeks to develop advanced machine learning techniques capable of accurately transcribing non-standard printed text.",
          "difficulty": "advanced",
          "id": "proj_humanai_2024_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/lg7vQeMM/",
          "proposal_id": null,
          "short_description": "This project aims to address the challenge of text recognition from historical Spanish printed sources dating back to the seventeenth century, a...",
          "slug": "automating-text-recognition-and-transliteration-of-historical-documents-with-crnn-architectures",
          "status": "completed",
          "student_name": "ShashankShekharSingh",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Automating Text Recognition and Transliteration of Historical Documents with CRNN architectures"
        },
        {
          "code_url": "https://github.com/humanai-foundation/RenAIssance/tree/main/RenAIssance_Transformer_OCR_Arsh_Khan",
          "description": "Optical Character Recognition (OCR) technology has revolutionised document digitization, converting printed and handwritten text into machine-readable formats. However, recognizing text from centuries-old works remains challenging due to the complexity of early non-standard print forms, handwritten texts, and manuscripts. Existing OCR tools like Adobe Acrobat and Google’s Pytesseract OCR often struggle with historical documents due to variations in font styles, image quality, degradation, and layouts. This project aims to develop a hybrid end-to-end Transformer model capable of accurately recognizing text from non-standard Spanish printed sources from the 16th and 17th centuries.",
          "difficulty": "advanced",
          "id": "proj_humanai_2024_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/qnIVjbSY/",
          "proposal_id": null,
          "short_description": "Optical Character Recognition (OCR) technology has revolutionised document digitization, converting printed and handwritten text into...",
          "slug": "text-recognition-with-transformer-models",
          "status": "completed",
          "student_name": "Arsh Ahmed Faisal Khan",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Text Recognition with Transformer Models"
        },
        {
          "code_url": "https://github.com/humanai-foundation/ISSR/tree/main/ISSR_Fatigue_detection",
          "description": "The aim of this project is to gain deeper insights into driver behavior, identifying potential risk factors, and developing effective interventions to improve transportation safety. Key tasks include literature review, data preprocessing,cognitive load prediction for distraction, visual & manual distraction detection,driving style classification, crash risk prediction and gaze analysis. The expected outcomes of this project is  accurate driver behavior analysis and risk assessment based on data and evaluation of driver performance suggestion of interventions for distraction based on gaze analysis",
          "difficulty": null,
          "id": "proj_humanai_2024_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/lqT70TLt/",
          "proposal_id": null,
          "short_description": "The aim of this project is to gain deeper insights into driver behavior, identifying potential risk factors, and developing effective interventions...",
          "slug": "driving-behavior-research-through-ai",
          "status": "completed",
          "student_name": "Aditya Arvind",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Driving Behavior Research through AI"
        },
        {
          "code_url": "https://github.com/Luizerko/ai_choreo",
          "description": "Traditionally, technology and dance have moved in separate circles, rarely crossing paths. However, the landscape is changing with the rise of AI in the creative world. One exciting development is the use of AI to create dance choreography. This innovation comes from training AI models on videos captured from a dancer's performance, allowing the machine to learn and generate new dance moves, a process well illustrated in the paper Beyond Imitation: Generative and Variational Choreography via Machine Learning.\r\n\r\nBuilding on this very interesting work, our project aims to take things a step further by focusing on duets. We're interested in exploring how AI can choreograph dances that involve complex interactions between the dancers, reflecting a more dynamic and authentic expression of human connection and creativity.\r\n\r\nThe idea is to expand the aforementioned existing work in AI-generated choreography by introducing modern machine learning techniques to create dance sequences for duo performances. Initially using a generative model with LSTM units to learn from motion-captured dance movements, this project proposes a new approach by incorporating self-attention mechanisms and Graph Neural Networks. These technologies are expected to allow a deeper understanding of the relationships within and between dancers' movements over time.\r\n\r\nMore specifically, the project will explore the integration of self-attention mechanisms to replace traditional LSTM sequences, enabling the model to more effectively emphasize significant connections across frames of dance movements. Additionally, it seeks to benefit from capturing the spatial relationships between dancers' joints by using GNNs for pre and post-processing.\r\n\r\nThe deliverables of the project  basically consist of the developed dataset and its visualizations, the implemented agents with their respective weights, and a report together with a repository containing the full documentation and code for each step.",
          "difficulty": "advanced",
          "id": "proj_humanai_2024_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/v8dulU0R/",
          "proposal_id": null,
          "short_description": "Traditionally, technology and dance have moved in separate circles, rarely crossing paths. However, the landscape is changing with the rise of AI in...",
          "slug": "ai-generated-choreography-from-solos-to-duets",
          "status": "completed",
          "student_name": "Luis Zerkowski",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "AI-Generated Choreography - from Solos to Duets"
        },
        {
          "code_url": "https://medium.com/@rashiguptaofficial/exploring-gender-roles-in-education-a-grade-wise-analysis-cb87db14bc7d",
          "description": "This proposal seeks to investigate gender disparities in career trajectories and the impact of gender-minority status on career changes during emerging adulthood. Leveraging longitudinal data from the Baccalaureate and Beyond study, I will analyze how gender influences majors, occupations, and career outcomes over time. By applying advanced statistical techniques and theoretical frameworks, I aim to uncover factors driving career choices and trajectories, providing insights for promoting gender diversity and inclusion in education and the workforce. Through rigorous analysis and interpretation, I will deliver actionable findings and disseminate them to stakeholders and policymakers through academic publications, conference presentations, and policy briefs.",
          "difficulty": "advanced",
          "id": "proj_humanai_2024_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/lz5XGsgO/",
          "proposal_id": null,
          "short_description": "This proposal seeks to investigate gender disparities in career trajectories and the impact of gender-minority status on career changes during...",
          "slug": "gender-roles-careers-exploring-congruity-theories",
          "status": "completed",
          "student_name": "Rashi Gupta",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Gender, Roles & Careers: Exploring Congruity Theories"
        },
        {
          "code_url": "https://github.com/wang-zixuan/ChoreoAI/tree/main/ChoreoAI_Zixuan_Wang",
          "description": "This proposal aims at developing AI-generated choreography for duets. It outlines a novel approach leveraging both Transformer and Graph Neural Networks to analyze and generate dance movements, focusing on creating authentic dance material that reflect the intricate dynamics between dancers.\n\nThe project will use Transformer and/or GNN to process motion capture data. The comprehensive solution plan involves:\n· Understanding key relationships between parts of the body of each dancer through a dedicated Spatial/Temporal Joint Relation Module\n· Utilizing self-attention and cross-attention mechanisms to learn spatial-temporal relationships of dancers' movements\n· Enhancing the overall coherence of the generated choreography by implementing regression loss and style similarity loss\n\n· Create a dataset of point-cloud data corresponding to extracted motion capture poses from videos of dance duets\n· Utilize Transformer and/or GNN models with encoder-decoder structure and various attention mechanisms to generate the movements of Dancer #2 conditioned on the inputs of Dancer #1 and/or invent new, physically-plausible duet phrases\n· Implement a Spatial/Temporal Joint Relation Module to learn key relationships between parts of the body of each dancer that are integral to the dynamics of the duet\n· If time permits: incorporate Music Embedding Module to enrich the model with multi-modal inputs\n· Collaborate with the original dancers to use the model outputs to inspire new performance material",
          "difficulty": null,
          "id": "proj_humanai_2024_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/PEvVr15z/",
          "proposal_id": null,
          "short_description": "This proposal aims at developing AI-generated choreography for duets. It outlines a novel approach leveraging both Transformer and Graph Neural...",
          "slug": "ai-generated-choreography-from-solos-to-duets",
          "status": "completed",
          "student_name": "Zixuan Wang",
          "student_profile": null,
          "tags": [
            "ai",
            "cloud"
          ],
          "title": "AI-Generated Choreography - from Solos to Duets"
        },
        {
          "code_url": "https://github.com/humanai-foundation/RenAIssance/tree/main/RenAIssance_Transformer_OCR_Utsav_Rai",
          "description": "This proposal seeks to address the challenge of text recognition in seventeenth-century Spanish documents, a domain where contemporary OCR technologies often fall short due to the unique intricacies of historical prints and manuscripts. Our objective is to develop a high-accuracy, transformer-based model that can adeptly navigate the complexities of early Spanish texts, providing a reliable tool for digitizing and preserving valuable historical documents.\n\nTo achieve this, we plan to leverage the TrOCR model, renowned for its proficiency with both printed and handwritten texts, thanks to its innovative hybrid architecture that combines Vision Transformers (ViT) with Transformer models. The project will begin with a thorough preprocessing of the documents, converting them from PDFs to high-resolution images suitable for text recognition. Automated segmentation into line segments using PyTesseract will follow, transforming our dataset into a line-wise format ideal for focused model training.\n\nThe deliverables include:\n1. A robust, transformer-based model fine-tuned for recognizing text in seventeenth-century Spanish documents.\n2. A comprehensive, line-wise dataset of processed images and their corresponding texts, prepared specifically for training and evaluating the model.\n3. Detailed documentation and analysis of the model's performance, including improvements in Character Error Rate (CER) and Word Error Rate (WER).\nUpon acceptance, this project promises to significantly advance the field of document digitization and historical research, offering an innovative solution to a longstanding problem and enabling broader access to valuable cultural heritage.",
          "difficulty": "advanced",
          "id": "proj_humanai_2024_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/IxqaG5cU/",
          "proposal_id": null,
          "short_description": "This proposal seeks to address the challenge of text recognition in seventeenth-century Spanish documents, a domain where contemporary OCR...",
          "slug": "text-recognition-with-transformer-models",
          "status": "completed",
          "student_name": "Utsav Rai",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Text Recognition with Transformer Models"
        },
        {
          "code_url": "https://medium.com/@sj3192/18c818d77527",
          "description": "Project: Enhancing Program Evaluation Research by Leveraging AI for Integrated Analysis of Mixed-Methods Data\r\n\r\nThis project aims to leverage advanced data analytics and machine learning techniques to extract actionable insights from both quantitative and qualitative data collected from the survey. I plan to perform data integration, machine learning techniques and data visualizations to improve survey accuracy and efficiency and draw some valuable insights from results.\r\n\r\nDeliverables:\r\nSurvey questions\r\nScript/code of programs used to determine the survey sample and perform the data weighting procedures on the data file\r\nIntegrated data set including qualitative and quantitative data\r\nScript/code of programs used to preprocess data, select model and optimize for qualitative and quantitative data\r\nVisualization Dashboard presenting the analysis results, highlighting key insights for relationships and ease of use by stakeholders\r\nA final report including the analysis methodology, findings, predictive factors identified, and advices for stakeholders\r\nOpen-source Repository including all code and models used in the analysis, along with documentation to enable replication and further research by the community",
          "difficulty": "advanced",
          "id": "proj_humanai_2024_009",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/mco38xiq/",
          "proposal_id": null,
          "short_description": "Project: Enhancing Program Evaluation Research by Leveraging AI for Integrated Analysis of Mixed-Methods Data This project aims to leverage advanced...",
          "slug": "humanai-2024-ai-to-improve-analysis-accuracy",
          "status": "completed",
          "student_name": "Shao Jin",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "HumanAI-2024-AI to Improve Analysis Accuracy"
        },
        {
          "code_url": "https://medium.com/@yamanko1234/historical-ocr-with-self-supervised-learning-c4f00da6637f",
          "description": "The goal of this project is to build a model to recognize text in century-old documents with over 80% accuracy. To achieve this goal, I will carry out 2 sub-projects: improving the pre-existing model (SeqCLR  [Aberdam, A., et al., 2021]) which I made as a test of this project, and building another model with different architecture and algorithms from the pre-existing model (PerSec [Hao Liu et al, 2022] or DiG [Mingkun Yang et al, 2022]). The first project, which is an improvement of the pre-existing model, contains verifying hypotheses about elements that hinder the model’s performance and finding solutions to those elements like the implementation of new layers or algorithms. The second project contains an investigation of a new model, implementing the model, and improving the model, which is like the first project’s procedure.",
          "difficulty": null,
          "id": "proj_humanai_2024_010",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/5ulwxFaQ/",
          "proposal_id": null,
          "short_description": "The goal of this project is to build a model to recognize text in century-old documents with over 80% accuracy. To achieve this goal, I will carry...",
          "slug": "self-supervised-models-for-automatic-historical-ocr",
          "status": "completed",
          "student_name": "Yukinori Yamamoto",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Self-supervised models for automatic historical OCR"
        },
        {
          "code_url": "https://medium.com/@domenicolacavalla8/examination-of-the-evolution-of-language-among-dark-web-users-67fd3397e0fb",
          "description": "This project uses Dark Web discussion board data to examine changes in language surrounding crime/offending over time. This project employs natural language processing.\nExtract and preprocess textual data from online forum posts for NLP analysis.\nDevelop and train NLP models, such as LSTM or BERT, to understand the context, sentiment, and thematic elements of forum discussions.",
          "difficulty": null,
          "id": "proj_humanai_2024_011",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/kN6CmoUo/",
          "proposal_id": null,
          "short_description": "This project uses Dark Web discussion board data to examine changes in language surrounding crime/offending over time. This project employs natural...",
          "slug": "examination-of-the-evolution-of-language-among-dark-web-users",
          "status": "completed",
          "student_name": "Domenico Lacavalla",
          "student_profile": null,
          "tags": [
            "web",
            "ai"
          ],
          "title": "Examination of the evolution of language among Dark Web users"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2024/organizations/humanai/"
    },
    "year_2025": {
      "num_projects": 15,
      "projects": [
        {
          "code_url": null,
          "description": "This project focuses on end-to-end Handwritten Text Recognition (HTR) for early modern Spanish manuscripts. Unlike traditional OCR systems, which process isolated characters or lines, end-to-end HTR captures entire documents, preserving not only the text but also structural elements such as layout and reading order. Although this approach holds significant promise for both research and practical applications, it remains underexplored, especially for historical texts.\n\nThis project proposes to apply end-to-end HTR techniques to early modern Spanish manuscripts, a historically rich yet computationally challenging corpus. Leveraging recent advances in deep learning. The project aims to improve recognition accuracy on handwritten and printed texts from this period by building on models which focus on document-wide attention mechanisms, the system will be able to better handle complex layouts and diverse handwriting styles typical of early modern Spanish texts.\n\nUltimately, this research sits at the intersection of machine learning and historical document analysis, contributing both to technical innovation and cultural preservation. By improving the accessibility of early Spanish documents, the project not only supports scholars in the humanities but also contributes to the growing field of AI-driven humanities research. The integration of cutting-edge HTR models into historical workflows can open new possibilities for indexing, searching, and analyzing large volumes of archival material in a scalable, automated fashion.",
          "difficulty": "advanced",
          "id": "proj_humanai_2025_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/53h89bdk",
          "proposal_id": "c5eyjx3g",
          "short_description": "This project focuses on end-to-end Handwritten Text Recognition (HTR) for early modern Spanish manuscripts. Unlike traditional OCR systems, which...",
          "slug": "end-to-end-handwritten-text-recognition-for-early-modern-spanish-documents",
          "status": "in-progress",
          "student_name": "Aniket Junghare",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "End-to-end handwritten text recognition for early modern spanish documents"
        },
        {
          "code_url": null,
          "description": "Optical Character Recognition (OCR) technology has revolutionized document digitization. However, existing OCR tools like Adobe Acrobat and Google’s Pytesseract, they struggle with historical documents due to variations in font styles, image quality, degradation, and layouts. Text recognition from centuries-old works poses a significant challenge due to the complexity of early non-standard print forms, handwritten text and manuscripts.\nOver the past year, transformer-based models have been fine-tuned to improve transcription accuracy, particularly for degraded and complex historical texts. Training on a diverse dataset that combines expert transcriptions and synthetic data has enabled better generalization across various typographical styles.\nBuilding on this progress, we aim to expand the dataset, to help the model finetune to handle handwritten documents as well. Fine-tuning on larger datasets incorporating diverse typographical styles both printed and handwritten and also implementing Language Modeling & Contextual Understanding for post-processing, allowing for  contextual corrections based on 17th-century grammar to further enhancing the OCR accuracy. Additionally, we plan to develop and deploy a web or mobile-based annotation tool for historians, researchers, and institutions to validate and refine OCR outputs",
          "difficulty": "advanced",
          "id": "proj_humanai_2025_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/WvX5G3H0",
          "proposal_id": "Bx2D55Q1",
          "short_description": "Optical Character Recognition (OCR) technology has revolutionized document digitization. However, existing OCR tools like Adobe Acrobat and Google’s...",
          "slug": "end-to-end-ocr-system-using-transformer-models",
          "status": "in-progress",
          "student_name": "Arsh Ahmed Faisal Khan",
          "student_profile": null,
          "tags": [
            "web",
            "mobile",
            "ai",
            "ui"
          ],
          "title": "End to End OCR System using Transformer Models"
        },
        {
          "code_url": null,
          "description": "This project aims to develop an AI-powered system for the virtual reconstruction of fragmented cultural heritage artifacts, with a focus on Mayan stelae. These artifacts are often discovered in broken, randomly oriented, and partially eroded states, making manual reassembly both time-consuming and imprecise. The proposed solution combines geometric analysis, graph-based fragment matching, and machine learning techniques to automate the reconstruction process. By leveraging 3D scans of the fragments and training models on real geometric descriptors, the system will predict correct alignments and reassemble the stele in a digital space. The project will be implemented using Open3D for 3D processing and PyTorch for neural network training. This work not only aids in archaeological restoration efforts but also contributes to the broader field of digital heritage preservation.",
          "difficulty": null,
          "id": "proj_humanai_2025_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/elgslkxD",
          "proposal_id": "SvCkkykm",
          "short_description": "This project aims to develop an AI-powered system for the virtual reconstruction of fragmented cultural heritage artifacts, with a focus on Mayan...",
          "slug": "healing-stones-reconstructing-digitized-cultural-heritage-artifacts-with-artificial-intelligence",
          "status": "in-progress",
          "student_name": "Atif_khan",
          "student_profile": null,
          "tags": [
            "ml",
            "ai"
          ],
          "title": "Healing Stones - Reconstructing digitized cultural heritage artifacts with artificial intelligence"
        },
        {
          "code_url": null,
          "description": "I propose to make an AI-powered tool that can analyze complex communication data from driving simulator experiments at the Translational Research for Injury Prevention (TRIP) Laboratory. The tool will process high-fidelity audiovisual data from six participants working together in networked simulators. Building on my previous work in audio extraction, transcription, sentiment analysis, and preliminary visualization, I want to create a complete solution that includes strong data pipelines, advanced NLP techniques (such as speaker diarization, NER, and topic modeling), dynamic reporting with interactive visualizations (heat maps, network graphs), and an easy-to-use user interface. The final product will be a fully functional prototype with full documentation that will help researchers learn more about how groups work together, how people talk to each other, and how drivers act in order to improve safety and inform the design of smart systems.",
          "difficulty": "beginner",
          "id": "proj_humanai_2025_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/tDtErLvN",
          "proposal_id": "ossKqKrj",
          "short_description": "I propose to make an AI-powered tool that can analyze complex communication data from driving simulator experiments at the Translational Research for...",
          "slug": "communication-analysis-tool-for-human-ai-interaction-driving-simulator-experiments",
          "status": "in-progress",
          "student_name": "eskayML",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Communication Analysis Tool for Human-AI Interaction Driving Simulator Experiments"
        },
        {
          "code_url": null,
          "description": "Project Summary:\n\n\nProblem: Renaissance-era Spanish texts remain digitally inaccessible due to modern OCR systems' inability to process archaic glyphs (ligatures, obsolete diacritics), degraded prints, and non-standard orthography. This limits scholars’ ability to analyze historical linguistic evolution and cultural heritage.\n\n\nSolution: Develop an open-source OCR system using a CNN-RNN hybrid architecture tailored for 17th-century Spanish. The model integrates weighted learning to address class imbalance (e.g., rare symbols like ſ or ç) and synthetic data augmentation to simulate historical print degradation. \n\n\nKey innovations include:\n\n\nWeighted loss functions (focal loss, class-aware cross-entropy) to prioritize underrepresented characters.\n\n\nRule-based post-processing (e.g., positional substitution of ſ → s).\n\n\nSynthetic training data with historical fonts and degradation simulations, alongside real data\n\n\nDeliverables:\n\n\nA trained OCR model achieving ≥80% character accuracy (CER ≤20%).\n\n\nEvaluation metrics (CER/WER) and symbol-specific performance analysis.\n\n\nCodebase with inference scripts, documentation, and sample transcriptions.\n\n\nImpact: This tool will empower digital humanists, archivists, and linguists to transcribe and analyze historical texts at scale, preserving cultural heritage and enabling new research into early modern Spanish. By open-sourcing the system, we aim to democratize access to underserved historical materials and inspire community-driven improvements.",
          "difficulty": null,
          "id": "proj_humanai_2025_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/benininZ",
          "proposal_id": "jBlXvd9I",
          "short_description": "Project Summary: Problem: Renaissance-era Spanish texts remain digitally inaccessible due to modern OCR systems' inability to process archaic glyphs...",
          "slug": "improving-renaissance-spanish-ocr-with-cnn-rnn-hybrids-and-weighted-learning",
          "status": "in-progress",
          "student_name": "Kate O'Reilly",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Improving Renaissance Spanish OCR with CNN-RNN Hybrids and Weighted Learning"
        },
        {
          "code_url": null,
          "description": "This project addresses the challenge of accurately digitizing degraded 17th-century Spanish manuscripts, which suffer from irregular layouts, archaic grammar, and low scan quality. The solution integrates a hybrid OCR pipeline: a Mask R-CNN model segments text blocks into lines, a fine-tuned TrOCR transformer recognizes printed/handwritten text, and a T5 + LLM hybrid system corrects errors while preserving historical grammar. An open-source annotation tool enables historians to validate outputs and expand datasets. Deliverables include: (1) a production-ready OCR pipeline, (2) post-correction module with fallback strategies, (3) annotation tool for dataset refinement, and (4) comprehensive documentation. This tool will enable scalable, accurate digitization of cultural heritage texts.",
          "difficulty": null,
          "id": "proj_humanai_2025_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/vz3dxbtz",
          "proposal_id": "xv7wy5Ot",
          "short_description": "This project addresses the challenge of accurately digitizing degraded 17th-century Spanish manuscripts, which suffer from irregular layouts, archaic...",
          "slug": "17th-century-spanish-text-recognition-with-transformer-models",
          "status": "in-progress",
          "student_name": "Kulkarni Pranav P",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "17th Century Spanish text recognition with transformer models"
        },
        {
          "code_url": null,
          "description": "For Historical Manuscripts, limited availability of data a limiting factor in training OCR or Layout Detection models.\nIn this project I propose the WGAN architecture to generate synthetic renaissance style Image Data which can be used to improve OCR model performance on historical Spanish texts.",
          "difficulty": null,
          "id": "proj_humanai_2025_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/tBqjGdfq",
          "proposal_id": "VyQ777u0",
          "short_description": "For Historical Manuscripts, limited availability of data a limiting factor in training OCR or Layout Detection models. In this project I propose the...",
          "slug": "renaissance-synthetic-text-generation-with-generative-models",
          "status": "in-progress",
          "student_name": "SaarthakGupta",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "renAIssance: Synthetic text generation with Generative Models"
        },
        {
          "code_url": null,
          "description": "Cultural heritage artifacts are often fragmented due to time, conflict, and environmental factors, making physical reconstruction challenging and sometimes impossible. This project, Healing Stones – Reconstructing digitized cultural heritage artifacts with AI, aims to build an automated pipeline to digitally reassemble such artifacts using 3D scanned point cloud data.\n\nThe solution involves preprocessing the data, performing pairwise fragment alignment using Iterative Closest Point (ICP), and chaining high-confidence matches into a complete global assembly. Post-processing steps like outlier removal, downsampling, and visualization will produce a clean and optimized 3D model.\n\nDeliverables include an automated reconstruction pipeline, alignment logs, a final .PLY model, and full documentation. The project will empower archaeologists and researchers with an open-source tool for preserving and studying cultural artifacts digitally.",
          "difficulty": null,
          "id": "proj_humanai_2025_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/hI7Ak1CO",
          "proposal_id": "qNUqUAJW",
          "short_description": "Cultural heritage artifacts are often fragmented due to time, conflict, and environmental factors, making physical reconstruction challenging and...",
          "slug": "healing-stones-reconstructing-digitized-cultural-heritage-artifacts-with-artificial-intelligence",
          "status": "in-progress",
          "student_name": "Satvik Nanda",
          "student_profile": null,
          "tags": [
            "ai",
            "cloud",
            "ui"
          ],
          "title": "Healing Stones – Reconstructing digitized cultural heritage artifacts with artificial intelligence"
        },
        {
          "code_url": null,
          "description": "This project aims to address the challenge of text recognition from historical Spanish printed sources dating back to the seventeenth century, a domain where existing Optical Character Recognition (OCR) tools often fail due to the complexity and variability of the texts. Leveraging hybrid end-to-end models based on a combination of \"Weighted CRNN architecture\" and \"CTC based beam-search decoding\", this project seeks to develop advanced machine learning techniques capable of accurately transcribing non-standard printed text. The final objective is to create an \"end-to-end solution/product\" for users, to directly scan a page and obtain its transcription using a smart AI tool.",
          "difficulty": "advanced",
          "id": "proj_humanai_2025_009",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/GjZqgamc",
          "proposal_id": "KHrIDNDT",
          "short_description": "This project aims to address the challenge of text recognition from historical Spanish printed sources dating back to the seventeenth century, a...",
          "slug": "automating-text-recognition-transliteration-of-historical-documents-with-weighted-crnn-models",
          "status": "in-progress",
          "student_name": "ShashankShekharSingh",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Automating text recognition & transliteration of historical documents with weighted CRNN models."
        },
        {
          "code_url": null,
          "description": "This project addresses the challenge of making advanced Transformer-based OCR technology for historical documents accessible to non-technical users on standard hardware. Despite significant advances in OCR accuracy for complex historical texts, current solutions remain inaccessible to many historians, archivists, and researchers due to technical barriers and hardware requirements.\n\nThe solution involves developing an optimized, user-friendly OCR system specifically for historical documents through three main approaches: (1) implementing advanced model optimization techniques for efficient CPU inference, including kernel fusion, weight pruning, and knowledge distillation; (2) creating cross-platform deployment options for mobile devices and web browsers; and (3) developing an intuitive application interface with preprocessing controls and interactive correction capabilities.\n\nDeliverables will include:\n\n1) A quantized OCR model achieving at least 4x speedup on CPU with <1% accuracy loss.\n2) Browser-based inference capability: An enhanced Streamlit application with batch processing, export options and 1 click OCR.\n3) A benchmark suite comparing performance across hardware configurations\n4) Comprehensive documentation and tutorials for non-technical users\nThis project will democratize access to cutting-edge OCR technology, enabling broader participation in historical document digitization and analysis without specialized technical expertise.",
          "difficulty": "advanced",
          "id": "proj_humanai_2025_010",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/SWLdu59R",
          "proposal_id": "9exeMlOt",
          "short_description": "This project addresses the challenge of making advanced Transformer-based OCR technology for historical documents accessible to non-technical users...",
          "slug": "text-recognition-with-transformer-models-for-efficient-deployment",
          "status": "in-progress",
          "student_name": "Utsav Rai",
          "student_profile": null,
          "tags": [
            "web",
            "mobile",
            "ml",
            "ai",
            "ui"
          ],
          "title": "Text Recognition with Transformer Models for Efficient Deployment"
        },
        {
          "code_url": null,
          "description": "This project aims to build an AI-driven behavioural monitoring system to detect mental health, suicide, and substance use crises in real time using social media data. It will analyse engagement patterns and crisis-related language using NLP (TextBlob, BERT, LDA) and geotag posts for mapping regional distress trends. Deliverables include a sentiment and risk classification pipeline, geospatial heatmaps, and an interactive dashboard to help public health teams proactively identify and respond to emerging crises.",
          "difficulty": null,
          "id": "proj_humanai_2025_011",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/w3ZCPSZb",
          "proposal_id": "EvNNMJGL",
          "short_description": "This project aims to build an AI-driven behavioural monitoring system to detect mental health, suicide, and substance use crises in real time using...",
          "slug": "ai-powered-behavioral-analysis-for-mental-health-crisis-detection-and-geospatial-trend-analysis",
          "status": "in-progress",
          "student_name": "Vishnu Sankhyan",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "AI-Powered Behavioral Analysis for Mental Health Crisis Detection and Geospatial Trend Analysis"
        },
        {
          "code_url": null,
          "description": "This project builds a fully explainable NLP pipeline to identify and classify Military-Involved Conflicts (MIC) from raw text articles. Unlike pretrained models, it uses a custom heuristic approach—extracting countries, actions, dates, fatalities, and sentiment based on rule-based logic. Though this results in longer processing times, it ensures complete transparency, flexibility, and interpretability, which is critical for social science and humanitarian research. The pipeline can later be scaled using models like BERT to enhance classification while retaining its explainable foundation.",
          "difficulty": null,
          "id": "proj_humanai_2025_012",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/Aec3lKEK",
          "proposal_id": "PrFGxrTN",
          "short_description": "This project builds a fully explainable NLP pipeline to identify and classify Military-Involved Conflicts (MIC) from raw text articles. Unlike...",
          "slug": "coding-actions-and-fatalities-in-militarized-interstate-confrontations",
          "status": "in-progress",
          "student_name": "wJoshua",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Coding Actions and Fatalities in Militarized Interstate Confrontations"
        },
        {
          "code_url": null,
          "description": "This project aims to enhance the analysis of multispectral paintings by detecting hidden images and understanding their structural characteristics. While previous GSoC efforts utilized CNN-based Siamese networks for layer similarity learning, such models often struggle to capture high-level semantic and structural relationships critical to interpreting overpainted or restored artworks.\n\nTo address this limitation, this project proposes a Graph Neural Network (GNN)-based Siamese architecture that models both local features and their spatial/spectral relationships in graph form. The pipeline will begin with preprocessing multispectral data into region-based graphs, followed by training a GNN-Siamese model on the Multispectral Imaging (MSI) dataset using weak supervision.\n\nThe model will then be generalized to unlabeled datasets (e.g., CAVE, Harvard) through few-shot adaptation, and further enhanced via self-supervised pretraining using large-scale RGB art datasets (e.g., WikiArt, NGA), with pseudo-label generation for semi-supervised learning.",
          "difficulty": null,
          "id": "proj_humanai_2025_013",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/7NT6U2W1",
          "proposal_id": "I90pCKLi",
          "short_description": "This project aims to enhance the analysis of multispectral paintings by detecting hidden images and understanding their structural characteristics....",
          "slug": "artextract",
          "status": "in-progress",
          "student_name": "YANG MING-CHUN",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "ArtExtract"
        },
        {
          "code_url": null,
          "description": "This project aims to develop an AI-powered system that supports early detection and ongoing monitoring of suicide, substance use, and mental health crises through social media analysis. By combining behavioral tracking, natural language processing (NLP), and geospatial trend mapping, the system will extract high-risk language patterns, identify regions of escalating distress, and visualize crisis trends over time. The final deliverables will include a structured crisis dataset, predictive risk indicators, and an interactive dashboard to help clinicians, nonprofits, and public health agencies make timely and informed decisions. This project addresses the limitations of delayed traditional health data by providing real-time insights into emerging community crises.",
          "difficulty": null,
          "id": "proj_humanai_2025_014",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/oiAp4mUW",
          "proposal_id": "RintC6Ym",
          "short_description": "This project aims to develop an AI-powered system that supports early detection and ongoing monitoring of suicide, substance use, and mental health...",
          "slug": "ai-powered-behavioral-analysis-for-crisis-detection-and-prevention",
          "status": "in-progress",
          "student_name": "Yixing (Spark) Fan",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "AI-Powered Behavioral Analysis for Crisis Detection and Prevention"
        },
        {
          "code_url": null,
          "description": "The objective of this project is to develop a robust, end-to-end OCR pipeline capable of achieving at least 80% accuracy in recognizing characters from early modern Spanish documents. The focus will be on leveraging recent advances in Handwritten Document Recognition (HDR), an emerging subfield of document analysis that integrates document layout and text recognition into a single model. By exploring both HDR-based and traditional approaches, the project aims to create a practical solution for historical document transcription as part of the RenAIssance initiative.",
          "difficulty": null,
          "id": "proj_humanai_2025_015",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/XCiS1TH7",
          "proposal_id": "IwIcjtSD",
          "short_description": "The objective of this project is to develop a robust, end-to-end OCR pipeline capable of achieving at least 80% accuracy in recognizing characters...",
          "slug": "end-to-end-historical-ocr-pipeline-with-80-accuracy",
          "status": "in-progress",
          "student_name": "Yukinori Yamamoto",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "End-to-End Historical OCR Pipeline with 80%+ Accuracy"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2025/organizations/humanai"
    }
  },
  "first_time": false,
  "contact": {
    "email": null,
    "guide_url": null,
    "ideas_url": "https://humanai.foundation/",
    "irc_channel": "https://app.gitter.im/#/room/#humanai-foundation:gitter.im",
    "mailing_list": "https://simba3.web.cern.ch/simba3/SelfSubscription.aspx?groupName=humanai-announce"
  },
  "social": {
    "blog": "http://humanai.foundation",
    "discord": null,
    "facebook": null,
    "github": null,
    "gitlab": null,
    "instagram": null,
    "linkedin": null,
    "mastodon": null,
    "medium": null,
    "reddit": null,
    "slack": null,
    "stackoverflow": null,
    "twitch": null,
    "twitter": null,
    "youtube": null
  },
  "meta": {
    "version": 1,
    "generated_at": "2026-01-25T15:28:53.240Z"
  }
}