{
  "id": "692251d753dd9d7326d33de3",
  "slug": "intermine",
  "name": "InterMine",
  "category": "Science and medicine",
  "description": "Integrating biological data sources, making it easy to query and analyse data",
  "image_url": "https://lh3.googleusercontent.com/nLqUlbCti7mF0bhmRLoB-4bZAICge6ScN_DbYRSz75qSIhEe0heDD-CSwZtKLjYBVYc_lphqiVku5vrZ5z4cXNejC9KZjOE",
  "img_r2_url": "https://pub-268c3a1efc8b4f8a99115507a760ca14.r2.dev/intermine.webp",
  "logo_r2_url": null,
  "url": "http://intermine.org/",
  "active_years": [
    2018,
    2019
  ],
  "first_year": 2018,
  "last_year": 2019,
  "is_currently_active": false,
  "technologies": [
    "python",
    "postgresql",
    "javascript",
    "java",
    "clojure",
    "r"
  ],
  "topics": [
    "open science",
    "genomics",
    "bioinformatics",
    "data science",
    "biology",
    "web",
    "data visualisation"
  ],
  "total_projects": 12,
  "stats": {
    "avg_projects_per_appeared_year": 6,
    "projects_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": 6,
      "year_2019": 6,
      "year_2020": null,
      "year_2021": null,
      "year_2022": null,
      "year_2023": null,
      "year_2024": null,
      "year_2025": null
    },
    "students_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": 6,
      "year_2019": 6,
      "year_2020": null,
      "year_2021": null,
      "year_2022": null,
      "year_2023": null,
      "year_2024": null,
      "year_2025": null
    },
    "total_students": 12
  },
  "years": {
    "year_2016": null,
    "year_2017": null,
    "year_2018": {
      "num_projects": 6,
      "projects": [
        {
          "code_url": "https://medium.com/intermine/google-summer-of-code-final-report-c60f44651872",
          "description": "<p><strong>Python Client</strong> is a software intended to make use of the data warehouses of <strong>InterMine</strong> in a more efficient manner. It is composed of a number of client libraries which <strong>allow users to write scripts to access InterMine data directly via the command line</strong>.</p>\n",
          "difficulty": null,
          "id": "proj_intermine_2018_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/6355185932697600/",
          "proposal_id": null,
          "short_description": "Python Client is a software intended to make use of the data warehouses of InterMine in a more efficient manner. It is composed of a number of client...",
          "slug": "python-client-expansion",
          "status": "completed",
          "student_name": "Nupur Gunwant",
          "student_profile": null,
          "tags": [
            "python"
          ],
          "title": "Python Client Expansion"
        },
        {
          "code_url": "https://github.com/AdrianBZG/InterMine-Data-Browser-Tool",
          "description": "<p>The existing query builder in InterMine requires some experience to obtain statistical data about the different mine categories, which can become overwhelming for new users. For instance, for a user interested on searching data in HumanMine using it’s query builder, he or she would need to browse through the different classes and attributes of the ontology, choosing between the available fields and adding different constraints over each of them in order to get the desired output. This requires the user to have a decent knowledge of the model schema in order to successfully build a correct query giving the expected query results. For new users, this workflow can become, indeed, overwhelming to search for specific information in the data.</p>\n<p>For this reason, the goal of this project, is to implement a faceted search tool to display the data from the InterMine database, allowing the users to search easily within the different mines available around it. without the requirement of having an extensive knowledge of the data model.</p>\n",
          "difficulty": null,
          "id": "proj_intermine_2018_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5100105220751360/",
          "proposal_id": null,
          "short_description": "The existing query builder in InterMine requires some experience to obtain statistical data about the different mine categories, which can become...",
          "slug": "intermine-data-browser-tool",
          "status": "completed",
          "student_name": "Adrián Rodríguez Bazaga",
          "student_profile": null,
          "tags": [
            "ai",
            "database",
            "ui"
          ],
          "title": "InterMine Data Browser Tool"
        },
        {
          "code_url": "https://intermineorg.wordpress.com/2018/08/10/gsoc-2018-improved-intermine-search-with-solr/",
          "description": "<p>Currently Intermine uses an old approach to handle bio data search. This project aims to improve the search feature using modern search engines like Apache Solr. The existing architecture in Intermine has to be modified to handle the new approach and it should reduce the complexity to the user. If succeeded, this will be enabled in all the intermines all over the world which are used to query bio data.</p>\n",
          "difficulty": "advanced",
          "id": "proj_intermine_2018_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/6233967996960768/",
          "proposal_id": null,
          "short_description": "Currently Intermine uses an old approach to handle bio data search. This project aims to improve the search feature using modern search engines like...",
          "slug": "intermine-solr-deep-bio-data-search",
          "status": "completed",
          "student_name": "Arunan Sugunakumar",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Intermine Solr deep bio data search"
        },
        {
          "code_url": "https://medium.com/@dwivedi.aman96/gsoc18-with-intermine-final-evaluation-1c8f58d0d62",
          "description": "<p>Currently, we have around 30+ mines (and still growing) all around the globe. All mines have\ntheir own separate APIs and their own separate portals. In order to search for a gene, a\nperson has to go to the separate mine portals and search for the gene. If someone wishes to\nfind a gene in multiple mines at the same time, there is no such tool which allows this\nfunctionality. The final product of this project will allow the user to search all or many mines\nat once and show the results with the respective details.</p>\n",
          "difficulty": null,
          "id": "proj_intermine_2018_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/4893017399885824/",
          "proposal_id": null,
          "short_description": "Currently, we have around 30+ mines (and still growing) all around the globe. All mines have\ntheir own separate APIs and their own separate portals....",
          "slug": "cross-intermine-search-tool",
          "status": "completed",
          "student_name": "Aman Dwivedi",
          "student_profile": null,
          "tags": [
            "api",
            "ai"
          ],
          "title": "Cross-Intermine Search Tool"
        },
        {
          "code_url": "https://medium.com/@lohani.1575/summarizing-gsoc-2018-with-intermine-90a1f98d3336",
          "description": "<p>The project is about building a search engine for life sciences data based on Bioschemas.org . The data is scraped from all the relevant websites and indexed in Apache Solr for querying.</p>\n",
          "difficulty": null,
          "id": "proj_intermine_2018_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5756433131896832/",
          "proposal_id": null,
          "short_description": "The project is about building a search engine for life sciences data based on Bioschemas.org . The data is scraped from all the relevant websites and...",
          "slug": "buzzbang-google-like-bio-data-search",
          "status": "completed",
          "student_name": "innovationchef",
          "student_profile": null,
          "tags": [
            "ios",
            "web",
            "ui"
          ],
          "title": "“Buzzbang Google-like bio data search”"
        },
        {
          "code_url": "https://github.com/intermine/intermine-nlp",
          "description": "<p>I hope to spend this summer providing much-needed additional functionality to InterMine, a software project which helps researchers create and manage genomic data for specific organisms. InterMine currently supports structured queries of these databases through a simple graphical interface, but this is a barrier of entry for many researchers (even for those with computing backgrounds). I'm proposing to create a natural language parser to generate structured PathQuery queries (JSON or XML) from English-language sentences, allowing a wider range of researchers to easily navigate InterMine databases. The project would largely be implemented in Clojure/ClojureScript, which are used at InterMine, possibly relying as well on 3rd-party NLP libraries or services.</p>\n",
          "difficulty": null,
          "id": "proj_intermine_2018_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5850362120503296/",
          "proposal_id": null,
          "short_description": "I hope to spend this summer providing much-needed additional functionality to InterMine, a software project which helps researchers create and manage...",
          "slug": "natural-language-queries-for-intermine-databases",
          "status": "completed",
          "student_name": "Jacob Macneal",
          "student_profile": null,
          "tags": [
            "ml",
            "database"
          ],
          "title": "Natural Language Queries for InterMine Databases"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2018/organizations/5222767339241472/"
    },
    "year_2019": {
      "num_projects": 6,
      "projects": [
        {
          "code_url": "https://intermineorg.wordpress.com/2019/08/22/intermine-cloud-making-intermine-cloud-native-and-easing-deployments/",
          "description": "<p>Intermine is a powerful data warehousing, integration and analysis tool used to store and share genomics data. However, setting up an instance of Intermine is a time consuming and error prone process. It also requires technical knowledge and some familiarity with Java, Postgres and shell scripts. These issues create a barrier for entry and friction in the adoption of intermine by the bioinformatics community. To solve these problems, Intermine team is planning to create a cloud platform that offers managed Intermine instances. This will remove the technical burden from the user and greatly simplify the creation of intermine instances. Also, the work done on Intermine cloud can easily be translated to simplify the creation of Intermines locally.\nThis project forms a part of the Intermine cloud project. It includes packaging of intermine and it’s components in docker containers,  cloud infrastructure setup, orchestration of containers, authentication, and authorization on the cloud.</p>\n",
          "difficulty": null,
          "id": "proj_intermine_2019_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/6575338673405952/",
          "proposal_id": null,
          "short_description": "Intermine is a powerful data warehousing, integration and analysis tool used to store and share genomics data. However, setting up an instance of...",
          "slug": "intermine-cloud-making-intermine-cloud-native-and-easing-deployments",
          "status": "completed",
          "student_name": "Ankur Kumar",
          "student_profile": null,
          "tags": [
            "java",
            "ai",
            "docker",
            "cloud",
            "ui"
          ],
          "title": "Intermine Cloud: Making Intermine cloud native and easing deployments"
        },
        {
          "code_url": "https://medium.com/intermine/gsoc-19-with-intermine-47d0ba96b914",
          "description": "<p><code>imjs</code> and <code>im-tables</code>, written in CoffeeScript are client-side libraries for querying mine instances and displaying data in tabular format respectively, which help in reducing boilerplate code for developers, looking to work with InterMine's services. The aim of this project would be overhauling these libraries, by upgrading their dependencies (last updated in 2015) and adding easily extensible mock responses (in <code>imjs</code>). Moreover, the test suite will be broken up into unit and integration tests. Support for querying with the Registry class will be added. Docs for both libraries will be added (adding end-user docs for <code>imjs</code> and developer docs for im-tables). Build system of both the libraries will be investigated, and the possibility of updating it will be discussed and implemented (possibly in the GSoC period itself, if feasible as per investigation). High priority issues, like adding support for <code>setConstraintLogic()</code> in <code>imjs</code> will also be resolved.</p>\n",
          "difficulty": null,
          "id": "proj_intermine_2019_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/6589315184852992/",
          "proposal_id": null,
          "short_description": "imjs and im-tables, written in CoffeeScript are client-side libraries for querying mine instances and displaying data in tabular format respectively,...",
          "slug": "upgrade-dependencies-of-imjs-and-im-tables-update-docs-add-helper-methods-and-improve-build-chain-of-these-libraries",
          "status": "completed",
          "student_name": "Laksh Singla",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Upgrade dependencies of imjs and im-tables, update Docs, add helper methods and improve build chain of these libraries"
        },
        {
          "code_url": "https://medium.com/intermine/google-summer-of-code-2019-final-report-27728a397337",
          "description": "<p>As Intermine is providing integrations with different biological data sources, Intermine has to work with different file formats to read data for the different data sources. In bioinformatics, many file formats are used for storing DNA and protein sequence information.\nEach file format has a formal specification and parser can be made by following the specification rules, But as most file formats are just simple text file that can be easily edited by anyone so its quite easy to make mistake and people may not comply with the standards while creating/editing file, that can lead to errors while parsing/or using that data.</p>\n<p>This project’s Idea is to create a standalone validation tool/library that can test the validity of a single or multiple biological file format. The project will provide full control over how one wants to perform validation, a user can use the project’s rich API to customize the behavior of the library. It will provide a generic validation library that can be further extended for any number of file format, A user can even provide its own validation implementation if he/she customize the behavior of the library.</p>\n",
          "difficulty": "beginner",
          "id": "proj_intermine_2019_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5525459217940480/",
          "proposal_id": null,
          "short_description": "As Intermine is providing integrations with different biological data sources, Intermine has to work with different file formats to read data for the...",
          "slug": "intermine-schema-validator",
          "status": "completed",
          "student_name": "deepak",
          "student_profile": null,
          "tags": [
            "api",
            "ui"
          ],
          "title": "InterMine Schema Validator"
        },
        {
          "code_url": "https://gist.github.com/rahul-y/5b2c812cec5e75e4b0688fd464e4e0d2",
          "description": "<p>In the current scenario, A user logs in the desired intermine and saves the results and the required data. The problem arises when the same user wants to access a different intermine, He/She will have to register again on this new mine and log in again.\nSo , Currently Intermine community does not have a single common sign-in mechanism and thus it is authenticating users with the help of tokens (temporary and permanent one) or using google and Elixir services to log in.\nThis project will modify the existing token mechanism by making the intermine as an OAuth2 provider with a single common Authorization server for all 30 mines so that user could access all the mines with the single set of credentials i.e just one time registration.</p>\n",
          "difficulty": null,
          "id": "proj_intermine_2019_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5260261898846208/",
          "proposal_id": null,
          "short_description": "In the current scenario, A user logs in the desired intermine and saves the results and the required data. The problem arises when the same user...",
          "slug": "intermine-single-sign-in",
          "status": "completed",
          "student_name": "Rahul-07",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "InterMine single sign-in"
        },
        {
          "code_url": "https://pkatgithub.github.io/GSoC-2019-Final-Evaluations/",
          "description": "<p>Presently InterMine uses Struts framework which is outdated. InterMine provides RESTful web-services which facilitates to execute custom or templated queries, search keywords, manage lists, discover metadata, perform enrichment statistics and manage user profiles. The main objective of this project is to migrate the web-services from Struts to Spring framework and document the APIs with Swagger in compliance with OpenAPI Specifications.</p>\n",
          "difficulty": null,
          "id": "proj_intermine_2019_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/6516793370214400/",
          "proposal_id": null,
          "short_description": "Presently InterMine uses Struts framework which is outdated. InterMine provides RESTful web-services which facilitates to execute custom or templated...",
          "slug": "migrate-restful-web-services-from-struts-to-spring",
          "status": "completed",
          "student_name": "Prabodh Kotasthane",
          "student_profile": null,
          "tags": [
            "web",
            "api",
            "ai"
          ],
          "title": "Migrate RESTful web services from Struts to Spring"
        },
        {
          "code_url": "https://github.com/akshatbhargava123/intermine-data-visualizations/blob/master/README.md",
          "description": "<p>The current Intermine’s viewer interface works on JavaServer Pages Technology and is planned to be discontinued in a few years. And, a new interface namely BlueGenes has already been developed. So, to allow developers to easily develop tools (any type of tool, visualisation, tables or anything that can be integrated on the gene / protein report page) for BlueGenes (the new interface), Intermine released a BlueGenes Tool API which defines specifications on how to build BlueGene compatible tool in JavaScript. Currently there exists two such tools - protovista and cytoscape-interaction-network-viewer. The BlueGenes ClojureScript application actually queries for all tools available before sending the report page to frontend and integrates the ones found. These tools are actually javascript applications following the specifications provided by the BlueGenes tool API and receive some initialisation input from BlueGenes like gene id in case of a gene report page.\nThe purpose of this project is to develop BlueGenes compatible visualisation tools which can help biologists and explorers have better insights via the report of a gene / protein on the report page.</p>\n",
          "difficulty": null,
          "id": "proj_intermine_2019_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/6518025354739712/",
          "proposal_id": null,
          "short_description": "The current Intermine’s viewer interface works on JavaServer Pages Technology and is planned to be discontinued in a few years. And, a new interface...",
          "slug": "javascript-data-visualisations",
          "status": "completed",
          "student_name": "Akshat Bhargava",
          "student_profile": null,
          "tags": [
            "java",
            "javascript",
            "api",
            "ai",
            "ui"
          ],
          "title": "Javascript Data Visualisations"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2019/organizations/6502123104108544/"
    },
    "year_2020": null,
    "year_2021": null,
    "year_2022": null,
    "year_2023": null,
    "year_2024": null,
    "year_2025": null
  },
  "first_time": false,
  "contact": {
    "email": "info@intermine.org",
    "guide_url": null,
    "ideas_url": null,
    "irc_channel": "http://chat.intermine.org/",
    "mailing_list": "https://intermine.readthedocs.io/en/latest/support/mailing-list/"
  },
  "social": {
    "blog": "https://intermineorg.wordpress.com/",
    "discord": null,
    "facebook": null,
    "github": null,
    "gitlab": null,
    "instagram": null,
    "linkedin": null,
    "mastodon": null,
    "medium": null,
    "reddit": null,
    "slack": null,
    "stackoverflow": null,
    "twitch": null,
    "twitter": "https://twitter.com/intermineorg/",
    "youtube": null
  },
  "meta": {
    "version": 1,
    "generated_at": "2026-01-25T15:28:53.268Z"
  }
}