{
  "id": "692251d753dd9d7326d33ddb",
  "slug": "ioos",
  "name": "IOOS",
  "category": "Science and medicine",
  "description": "Our eyes on the ocean, coasts, and Great Lakes",
  "image_url": "https://summerofcode.withgoogle.com/media/org/ioos/oe7caipkhwnizoyr-360.png",
  "img_r2_url": "https://pub-268c3a1efc8b4f8a99115507a760ca14.r2.dev/ioos.webp",
  "logo_r2_url": null,
  "url": "https://ioos.noaa.gov/",
  "active_years": [
    2021,
    2022,
    2024,
    2025
  ],
  "first_year": 2021,
  "last_year": 2025,
  "is_currently_active": true,
  "technologies": [
    "python",
    "big data science",
    "ocean technology",
    "ocean science",
    "java",
    "r",
    "Zarr",
    "NetCDF"
  ],
  "topics": [
    "open data",
    "data science",
    "earth sciences",
    "data discovery",
    "open science",
    "data management",
    "Oceanography",
    "Marine Biodiversity"
  ],
  "total_projects": 22,
  "stats": {
    "avg_projects_per_appeared_year": 5.5,
    "projects_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": null,
      "year_2019": null,
      "year_2020": null,
      "year_2021": 3,
      "year_2022": 4,
      "year_2023": null,
      "year_2024": 6,
      "year_2025": 9
    },
    "students_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": null,
      "year_2019": null,
      "year_2020": null,
      "year_2021": 3,
      "year_2022": 4,
      "year_2023": null,
      "year_2024": 6,
      "year_2025": 9
    },
    "total_students": 21
  },
  "years": {
    "year_2016": null,
    "year_2017": null,
    "year_2018": null,
    "year_2019": null,
    "year_2020": null,
    "year_2021": {
      "num_projects": 3,
      "projects": [
        {
          "code_url": "https://q1zeng.github.io",
          "description": "<p>ERDDAP is a data server widely used in many organizations over the world to upload and gather data sets on the ocean environment, but currently it only supports English and not all users are proficient in English. This project will create an automated tool to translate the user interface of ERDDAP into any target language, and also modify ERDDAP’s structure to allow one ERDDAP setup to display messages in multiple languages to enhance the accessibility of the oceanographic data for the scientific community.</p>\n",
          "difficulty": null,
          "id": "proj_ioos_2021_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5466532406099968/",
          "proposal_id": null,
          "short_description": "ERDDAP is a data server widely used in many organizations over the world to upload and gather data sets on the ocean environment, but currently it...",
          "slug": "translate-erddap-user-interface-into-different-languages",
          "status": "completed",
          "student_name": "Qi Zeng",
          "student_profile": null,
          "tags": [],
          "title": "Translate ERDDAP User Interface Into Different Languages"
        },
        {
          "code_url": "https://gist.github.com/callumrollo/ee28f7e1863d30162bdb041156314543",
          "description": "<p>This proposal will add griddap functionality to the <strong>erddapy</strong> package and simplify the API. Support for griddap will enable near real time access to gridded datasets such as climate models and weather forecasts via a simple Python API. This access will benefit oceanographers, search and rescue teams and the maritime industry at large. Additional tasks include enabling high level, simplified queries for easy access and improving the <strong>gliderpy</strong> package to make swathes of high resolution ocean glider data more readily available.</p>\n",
          "difficulty": "beginner",
          "id": "proj_ioos_2021_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6234338642886656/",
          "proposal_id": null,
          "short_description": "This proposal will add griddap functionality to the erddapy package and simplify the API. Support for griddap will enable near real time access to...",
          "slug": "erdappy-griddap-accessing-gridded-oceanographic-data-in-near-real-time",
          "status": "completed",
          "student_name": "Callum Rollo",
          "student_profile": null,
          "tags": [
            "python",
            "api",
            "ai"
          ],
          "title": "erdappy-griddap: Accessing gridded oceanographic data in near real time"
        },
        {
          "code_url": "https://lohithmunakala.medium.com/seafloor-sampling-and-data-demo-center-jupyter-book-migration-gsoc21-ioos-a9930abc4c42",
          "description": "<p>Sea Floor Sampling is a tedious job and requires a lot of manual work. This project intends to automate the process of labelling the videos using object detection and classification methods. This will reduce the amount of time taken drastically.</p>\n<p>IOOS Data Demo Center Migration to Jupyterbook. JupyterBook is a simple yet elegant way to show the documentation of one's work. It can be used for scientific purposes as it builds publication-quality books. The aim of the project is to move the existing Demo Data Center to a jupyterbook style and automate the process.</p>\n",
          "difficulty": null,
          "id": "proj_ioos_2021_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5205597170958336/",
          "proposal_id": null,
          "short_description": "Sea Floor Sampling is a tedious job and requires a lot of manual work. This project intends to automate the process of labelling the videos using...",
          "slug": "machine-learning-for-sea-floor-sampling-and-ioos-demo-data-center-migration-to-jupyterbook",
          "status": "completed",
          "student_name": "Lohith Munakala",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Machine Learning for Sea Floor Sampling and IOOS Demo Data Center migration to Jupyterbook"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2021/organizations/5159672092295168/"
    },
    "year_2022": {
      "num_projects": 4,
      "projects": [
        {
          "code_url": "https://github.com/fsspec/GSoC-kechunk-2022/blob/main/GSOC_monitor.md",
          "description": "The Kerchunk package provides a means to access legacy geospatial datasets, such as GRIB2, in a cloud performant manor by creating a reference file which maps to variables within the datasets, this allows direct access to many data chunks within various files in one go, reducing overall latency and allowing easy parallel access. At present the scan_grib module within Kerchunk does not work when considering GFS operational data  as GRIB data from different institutions can differ. I propose adapting the existing module to successfully access operational GFS forecast data before providing an example of the utility of Kerchunk to create a dictionary of lazy dimensional arrays containing all GFS variables.",
          "difficulty": "beginner",
          "id": "proj_ioos_2022_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/ms3uAtPQ/",
          "proposal_id": null,
          "short_description": "The Kerchunk package provides a means to access legacy geospatial datasets, such as GRIB2, in a cloud performant manor by creating a reference file...",
          "slug": "efficient-access-to-ioos-data-in-the-cloud-interfacing-wrf-forecast-grib2-data-to-zarray",
          "status": "completed",
          "student_name": "Peter Marsh",
          "student_profile": null,
          "tags": [
            "ai",
            "cloud"
          ],
          "title": "Efficient access to IOOS data in the cloud: interfacing WRF forecast grib2 data to zarray"
        },
        {
          "code_url": "https://github.com/OSOceanAcoustics/echoshader/wiki/Google-Summer-of-Code-2022",
          "description": "Echoshader, an open source project, aims to enhance the ability to interactively visualize large amounts of cloud-based data to accelerate the data exploration and discovery process. Ocean sonar data is generated from echopype, which handles the normalization, preprocessing and organization of echo data. Echoshader will be developed in parallel with the ongoing development of echopype.\n\nAs a participant of GSoC, I will develop the main APIs of echoshader based on the HoloViz suite of tools, test configuration for using echoshader widgets in Panel dashboards, and create Jupyter notebooks to demo use of the combination of tools. The main technology stacks used are Hvplot, Panel, folium and PyVista.",
          "difficulty": null,
          "id": "proj_ioos_2022_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/iWuQqugy/",
          "proposal_id": null,
          "short_description": "Echoshader, an open source project, aims to enhance the ability to interactively visualize large amounts of cloud-based data to accelerate the data...",
          "slug": "echoshader-interactive-visualization-of-ocean-sonar-data",
          "status": "completed",
          "student_name": "Dingrui Lei",
          "student_profile": null,
          "tags": [
            "api",
            "ai",
            "cloud",
            "ui"
          ],
          "title": "Echoshader: Interactive visualization of ocean sonar data"
        },
        {
          "code_url": "https://gist.github.com/vinisalazar/c2a5fc91667bf84ad7ac1ea49c553b61",
          "description": "The erddapy package provides a Python interface to the ERDDAP data server API. Currently, most of erddapy's functionality is concentrated into a single class, and the URL building features are implemented in that class along with the data transformation methods that process server responses into Python objects, such as Pandas DataFrames.\n\nThis project proposes to separate erddapy into core and object (or opinionated) layers. The former will hold the URL building and data transformation functionality, which will be reused by the rest of the library. The latter layer will provide high-level objects that will support a functional API that does not depend on the state of the underlying object (which is the case for the current version of erddapy). This functional API will provide cleaner iterative usage when querying multiple servers and datasets, and new classes implemented in the object layer will support serialization so that they can be pickled and passed on to other processes or machines.\n\nTo execute this project, I delineate two separate aims: refactoring the URL building and data transformation functionality into a new module containing minimal, standalone functions and reusing those functions in the existing primary class; and implementing an additional layer containing the high-level objects that will provide the basis for the functional API. Overall, this will greatly improve the flexibility and scalability of the package, and will help support its wide spectrum of users.",
          "difficulty": null,
          "id": "proj_ioos_2022_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/KuI0XBxq/",
          "proposal_id": null,
          "short_description": "The erddapy package provides a Python interface to the ERDDAP data server API. Currently, most of erddapy's functionality is concentrated into a...",
          "slug": "refactoring-of-erddapy-into-separate-core-and-object-layers",
          "status": "completed",
          "student_name": "Vini Salazar",
          "student_profile": null,
          "tags": [
            "python",
            "api",
            "ai",
            "ui"
          ],
          "title": "Refactoring of erddapy into separate core and object layers"
        },
        {
          "code_url": "https://ayushanand18.github.io/GSoC_design_documents",
          "description": "The goal of the project is to modify the pyobis python package to support the new OBIS API v3. This project also aims to improve tests coverage, diversify example usage, analyze and visualize fetched data from the updated package, and push the new version to PyPI.\nThe pyobis package is really powerful and can fetch huge ocean biodiversity data through the OBIS API.  It is interesting to note that OBIS also holds data for species even dating back to around 1078 AD, which makes pyobis even more essential to be maintained. \nAs an extended objective, I will also create a high-level module inside pyobis package that can allow users to visualize data directly.",
          "difficulty": null,
          "id": "proj_ioos_2022_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/aMwpR5uH/",
          "proposal_id": null,
          "short_description": "The goal of the project is to modify the pyobis python package to support the new OBIS API v3. This project also aims to improve tests coverage,...",
          "slug": "making-ocean-biodiversity-data-easily-accessible-with-python-pyobis-revamp",
          "status": "completed",
          "student_name": "Ayush Anand",
          "student_profile": null,
          "tags": [
            "python",
            "api",
            "ai"
          ],
          "title": "Making ocean biodiversity data easily accessible with python (pyobis revamp)"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2022/organizations/ioos/"
    },
    "year_2023": null,
    "year_2024": {
      "num_projects": 6,
      "projects": [
        {
          "code_url": "https://ayushsingh.hashnode.dev/gsoc-2024-ioos-erddap",
          "description": "Erddap is a data server used by many organizations as a way to\ndownload scientific data in various formats.\nHowever, adding these datasets to Erddap is by no means a simple\ntask and this project aims to improve that experience for all Erddap administrators\nwho wish to serve their datasets on their Erddap servers.\nThe primary focus of this project would be to improve the existing XML parser that Erddap uses to incorporate new features done by either exisiting libraries or by enhancing the parser source code. Other features that will be worked on are a better way to generate xml for a large number of datasets instead of just the current GenerateDatasetsXML script along with a notification system which tracks for problems while loading the datasets and mails them directly to the administrators.",
          "difficulty": null,
          "id": "proj_ioos_2024_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/VRUk5pC9/",
          "proposal_id": null,
          "short_description": "Erddap is a data server used by many organizations as a way to download scientific data in various formats. However, adding these datasets to Erddap...",
          "slug": "enhancements-for-erddap-administrators",
          "status": "completed",
          "student_name": "ayushsingh01042003",
          "student_profile": null,
          "tags": [
            "ml",
            "ai"
          ],
          "title": "Enhancements for Erddap administrators"
        },
        {
          "code_url": "https://gist.github.com/FloraSauerbronn/b83cb417c082d32dde490c76195cb1a5",
          "description": "The project focuses on improving the Gliderpy package by incorporating a pandas-flavor\n\nplotting interface. This interface will allow for the creation of interactive dashboards tai-\nlored to each glider, enhancing the user experience by providing quick data visualization\n\nand inspection capabilities. The project’s aim is to streamline the process of exploring and\nanalyzing sea glider data, making it more accessible to scientists who may not be familiar\n\nwith Python plotting libraries. By reducing code complexity and providing intuitive visu-\nalization tools, the project seeks to empower users to make informed decisions about data\n\ndownloads and gain valuable insights from their analyses. Through these enhancements,\nthe project ultimately aims to contribute to advancements in oceanographic research by\nmaking data analysis tasks more efficient and user-friendly.",
          "difficulty": "advanced",
          "id": "proj_ioos_2024_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/8h63Owzq/",
          "proposal_id": null,
          "short_description": "The project focuses on improving the Gliderpy package by incorporating a pandas-flavor plotting interface. This interface will allow for the creation...",
          "slug": "data-visualization-with-gliderpy",
          "status": "completed",
          "student_name": "Flora Sauerbronn",
          "student_profile": null,
          "tags": [
            "python",
            "ml",
            "ai",
            "ui"
          ],
          "title": "Data Visualization with Gliderpy"
        },
        {
          "code_url": "https://gist.github.com/Sakshamgupta90/38efedf28b279df3ee9a86d6627dd3c4",
          "description": "My proposal aims to improve the quality assurance and quality control (QA/QC) practices for underwater glider data within the ioos_qc library. Underwater gliders are important tools for ocean observation, providing valuable data for research. However, current QA/QC checks for glider data are limited.\n\nTo address this, I plan to create documentation and examples for glider-specific QA/QC checks and implement any missing checks in the ioos_qc library. This will enhance the library's ability to process and analyze glider data, improving its reliability for researchers and scientists.\n\nDeliverables:\n\n1. Comprehensive documentation for glider-specific QA/QC checks.\n2. Jupyter notebook examples demonstrating QA/QC checks for glider data.\n3. Implementation of missing QA/QC checks in the ioos_qc library.\n\nBy completing these deliverables, I aim to contribute to the improvement of ocean data quality assurance practices, benefiting the wider oceanographic research community.",
          "difficulty": null,
          "id": "proj_ioos_2024_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/eqZttvrN/",
          "proposal_id": null,
          "short_description": "My proposal aims to improve the quality assurance and quality control (QA/QC) practices for underwater glider data within the ioos_qc library....",
          "slug": "qaqc-for-glider-data",
          "status": "completed",
          "student_name": "RDX",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "QA/QC for glider data"
        },
        {
          "code_url": "https://gist.github.com/abdu558/e7d651a82207f5f4caeaef9863eeed54",
          "description": "Extend the capabilities of the Searvey Python package to retrieve on-demand oceanographic data from additional sources (Canadian Hydrographic Service, Australian Bureau of Meteorology) and expand the range of supported variables (currents, water temperature, salinity). This enhancement aims to improve the evaluation of numerical ocean models by providing researchers with a broader set of observational data.",
          "difficulty": null,
          "id": "proj_ioos_2024_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/tWUJtS4s/",
          "proposal_id": null,
          "short_description": "Extend the capabilities of the Searvey Python package to retrieve on-demand oceanographic data from additional sources (Canadian Hydrographic...",
          "slug": "enhancing-searvey-real-time-observational-data-unification-analysis-and-retrieval",
          "status": "completed",
          "student_name": "abdu558",
          "student_profile": null,
          "tags": [
            "python",
            "ai"
          ],
          "title": "Enhancing Searvey: Real-Time Observational Data Unification, Analysis, and Retrieval"
        },
        {
          "code_url": "https://github.com/Anu-Ra-g/GSoC2024_Kerchunk/blob/main/GSoC2024_kerchunk.md",
          "description": "Kerchunk is a python library which helps in streamline access to the climate modelling data stored in grib and other formats, by creating \"references\" for each file which maps to the acutal data stored in the cloud, without involving the overhead of downloading and local processing. The project encompasses building large aggregations by building an index table mapping from the references to every grib message in the idx files. This approach significantly reduces access time to the actual GRIB dataset, especially when dealing with large volumes of data stored in the cloud.",
          "difficulty": null,
          "id": "proj_ioos_2024_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/nLJFBbIV/",
          "proposal_id": null,
          "short_description": "Kerchunk is a python library which helps in streamline access to the climate modelling data stored in grib and other formats, by creating...",
          "slug": "kerchunk-enhancements-for-fast-nodd-grib-aggregations",
          "status": "completed",
          "student_name": "Anurag Nayak",
          "student_profile": null,
          "tags": [
            "python",
            "ml",
            "cloud",
            "ui"
          ],
          "title": "Kerchunk enhancements for fast NODD GRIB aggregations"
        },
        {
          "code_url": "https://gist.github.com/omkar-334/f5a3ec3a80f0a790178c61a5a7a32748",
          "description": "Developing a subsetting tool to access ocean forecast data is critical and addresses an immediate need for maximizing the utilization of STOFS model output. STOFS-2D global stands out as one of the most refined and high-resolution global ocean forecast datasets available. The STOFS Data Subsetting Tool project enhances the xarray-subset-grid library to efficiently subset STOFS and oceanographic data. Through Python libraries like Xarray, Zarr and Dask, it benchmarks performance, integrates with ocean modeling packages, and develops a service for on-demand subsetting via email or API. The project spans 12-16 weeks, focusing on method benchmarking, performance evaluation, optimization, service development, and the creation of a portal for subsetting datasets.",
          "difficulty": null,
          "id": "proj_ioos_2024_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/VxCwfSg0/",
          "proposal_id": null,
          "short_description": "Developing a subsetting tool to access ocean forecast data is critical and addresses an immediate need for maximizing the utilization of STOFS model...",
          "slug": "stofs-subsetting-tool",
          "status": "completed",
          "student_name": "Omkar Kabde",
          "student_profile": null,
          "tags": [
            "python",
            "api",
            "ai"
          ],
          "title": "STOFS Subsetting Tool"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2024/organizations/ioos/"
    },
    "year_2025": {
      "num_projects": 9,
      "projects": [
        {
          "code_url": null,
          "description": "MQTT is a lightweight messaging protocol which is used by IoT based devices as a way\nto transfer data at very high speeds. Adding its support to ERDDAP™  would enable it access near real time data and build datasets with it. This project will add support for ERDDAP™ to act as both, a MQTT client to connect with existing brokers and as a MQTT broker to collect real time data from sensors.",
          "difficulty": null,
          "id": "proj_ioos_2025_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/5tZcgSox",
          "proposal_id": "JX1KXaer",
          "short_description": "MQTT is a lightweight messaging protocol which is used by IoT based devices as a way to transfer data at very high speeds. Adding its support to...",
          "slug": "mqtt-protocol-support-for-erddap",
          "status": "in-progress",
          "student_name": "ayushsingh01042003",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "MQTT Protocol Support for ERDDAP"
        },
        {
          "code_url": null,
          "description": "This project aims to develop a user-friendly, browser-based interface for oceanographic data quality control tools. The goal is to create an interactive interface for oceanographers to validate and analyze their datasets. \nThe project will also include data visualizations to display the results of quality checks and compliance tests. Additionally, the users should be able to download the processed datasets.\n\nDeliverables:\n•\tA browser-based interface for uploading datasets and selecting quality checks.\n•\tIntegration of ioos-qc and compliance-checker with the browser.\n•\tVisualizations of quality control results.\n•\tFunctionality for users to download processed data.\n•\tDocumentation and a final report detailing the development process and outcomes.\n\nThe project will provide a convenient, accessible platform for oceanographers to validate and analyze their data, improving the efficiency and accuracy of their quality control workflows.",
          "difficulty": null,
          "id": "proj_ioos_2025_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/YR0AVIjH",
          "proposal_id": "pG6b3aHD",
          "short_description": "This project aims to develop a user-friendly, browser-based interface for oceanographic data quality control tools. The goal is to create an...",
          "slug": "build-web-ui-versions-for-ioos-tools-ioos-qc-and-compliance-checker",
          "status": "in-progress",
          "student_name": "Chiara Monforte",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "ui"
          ],
          "title": "Build web UI versions for IOOS tools (ioos-qc and compliance checker)"
        },
        {
          "code_url": null,
          "description": "CrocoLakeTools is a Python package designed to convert oceanographic datasets from various formats (like netCDF and CSV) into CrocoLake’s unified Parquet-based data lake. This allows researchers to work with clean, consistent data without dealing with technical format issues. In this project, I’ll be extending CrocoLakeTools by developing new converters for the Saildrones and GO-SHIP datasets—two widely used but structurally complex sources. The focus will be on building efficient conversion pipelines using tools like xarray and dask, while also improving testing, documentation, and overall usability. These additions will expand the tool’s dataset coverage and help researchers access and process ocean data more easily.",
          "difficulty": "advanced",
          "id": "proj_ioos_2025_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/mdb8VnRw",
          "proposal_id": "lMOVUPo4",
          "short_description": "CrocoLakeTools is a Python package designed to convert oceanographic datasets from various formats (like netCDF and CSV) into CrocoLake’s unified...",
          "slug": "extending-crocolakes-available-datasets",
          "status": "in-progress",
          "student_name": "David Nady",
          "student_profile": null,
          "tags": [
            "python",
            "ai",
            "ui"
          ],
          "title": "Extending Crocolake’s available datasets"
        },
        {
          "code_url": null,
          "description": "Proposal Summary\nThis project aims to modernize ERDDAP™ page rendering by migrating it to a templating framework. The current rendering process relies on manually constructed HTML, which makes it difficult to maintain and customize. By implementing a template-based system, we will improve code maintainability, enhance flexibility for customization, and support modern web development practices.\n\nDeliverables\nIdentify a suitable templating framework (e.g., FreeMarker, Thymeleaf, or another appropriate choice).\n\nRefactor ERDDAP™’s HTML generation logic to use the selected template engine.\n\nEnsure the new system maintains full feature parity with existing pages.\n\nImprove documentation on how to modify and extend ERDDAP™ templates.\n\nImplement tests to verify rendering consistency.\n\nThis upgrade will make ERDDAP™ more maintainable and adaptable for future development.",
          "difficulty": null,
          "id": "proj_ioos_2025_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/WFMQYGxF",
          "proposal_id": "IDW0XeVa",
          "short_description": "Proposal Summary This project aims to modernize ERDDAP™ page rendering by migrating it to a templating framework. The current rendering process...",
          "slug": "update-erddap-page-rendering-to-use-a-template-framework",
          "status": "in-progress",
          "student_name": "Harish Peddina",
          "student_profile": null,
          "tags": [
            "web",
            "ml",
            "ai",
            "ui"
          ],
          "title": "Update ERDDAP™ page rendering to use a template framework"
        },
        {
          "code_url": null,
          "description": "This GSoC project focuses on enhancing the usability and functionality of the phytoclass R package and its Shiny-based GUI, which are used to estimate phytoplankton abundance from HPLC pigment data. Key objectives include improving error handling, refining the user interface, adding support for regional variations in phytoplankton classification, and improving overall documentation and user guidance. These improvements aim to make phytoclass more accessible and accurate for marine researchers across diverse regions. With a solid foundation in R and Shiny, and a strong interest in applying tech to environmental challenges, I’m excited to contribute meaningful improvements to this impactful open-source project.",
          "difficulty": null,
          "id": "proj_ioos_2025_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/KQGtg0Ge",
          "proposal_id": "YLzLSWXE",
          "short_description": "This GSoC project focuses on enhancing the usability and functionality of the phytoclass R package and its Shiny-based GUI, which are used to...",
          "slug": "improving-usability-and-features-of-the-phytoclass-r-package-and-gui-for-phytoplankton-estimation",
          "status": "in-progress",
          "student_name": "Khan Mohd Aasim",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Improving Usability and Features of the Phytoclass R Package and GUI for Phytoplankton Estimation\""
        },
        {
          "code_url": null,
          "description": "This project addresses the issue of translating complex marine biodiversity data into actionable knowledge for ecosystem management in Florida. It makes use of existing biodiversity datasets (OBIS, GBIF) and ecosystem variables (e.g., temperature) to develop a collection of reproducible Jupyter Notebooks powered by Python packages like pyOBIS, GeoPandas, and machine learning packages. These notebooks are dedicated to showcasing the top environmental inquiries in areas like the Florida Keys, Rookery Bay, Tampa Bay, and the Gulf of Mexico—covering trends in Rice's Whale, birds, and seagrasses.\r\n\r\nThe solution combines species occurrence records and ecosystem information to generate visualizations, spatial models, and biodiversity metrics. Interactive maps, temporal trend plots, and model-based habitat predictions are products. Constructed with reproducibility and open science principles in mind, the tools will assist resource managers, researchers, and decision-makers in conservation planning.\r\n\r\nDeliverables include:\r\n\r\n 5 modular Jupyter Notebooks (e.g., habitat models, trend predictions),\r\n Reusable data pipeline functions (data ingestion, cleaning, analysis),\r\n Public Docker-supported GitHub repository,\r\nEasy-to-read documentation and automated testing framework.\r\n\r\nThe project facilitates environmental decision-making through data science and encourages collaboration through open, reproducible tools.",
          "difficulty": "beginner",
          "id": "proj_ioos_2025_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/Af6KBBl2",
          "proposal_id": "SpkMuLNk",
          "short_description": "This project addresses the issue of translating complex marine biodiversity data into actionable knowledge for ecosystem management in Florida. It...",
          "slug": "pyobis-for-stakeholders",
          "status": "in-progress",
          "student_name": "Mehraz Hossain Rumman",
          "student_profile": null,
          "tags": [
            "python",
            "docker",
            "ui"
          ],
          "title": "pyOBIS for stakeholders"
        },
        {
          "code_url": null,
          "description": "The Northeast Pacific Ocean hosts a diverse array of marine species, yet the absence of a standardized, international database for transboundary marine survey data impedes effective research and resource management. Building upon the existing efforts of the surveyjoin project, this project aims to migrate haul-level survey data from a data frame to a PostgreSQL-based relational database. This transition will facilitate the integration of life-history data, expand species coverage beyond the current 55 species, and enhance data accessibility. The project encompasses designing the database schema, developing data migration pipelines, optimizing query performance, and ensuring seamless integration with existing R workflows.",
          "difficulty": null,
          "id": "proj_ioos_2025_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/ewtYg3ZW",
          "proposal_id": "3dH8gL85",
          "short_description": "The Northeast Pacific Ocean hosts a diverse array of marine species, yet the absence of a standardized, international database for transboundary...",
          "slug": "migrating-surveyjoin-to-a-relational-database-for-scalability-and-improved-performance",
          "status": "in-progress",
          "student_name": "nityam",
          "student_profile": null,
          "tags": [
            "ml",
            "ai",
            "database",
            "ui"
          ],
          "title": "Migrating SurveyJoin to a Relational Database for Scalability and Improved Performance"
        },
        {
          "code_url": null,
          "description": "Autoval is a tool made for validation of STOFS models. In this project proposal I propose to enhance Autoval significantly. This includes three major additions / changes :- \n\n1.) Integration Of USGS Observation Data to enrich model validation.\n2.) Datum Conversion Functionalities for precise alignment across various datasets especially for the USGS dataset\n3.) Visualization Enhancements transitioning from static to dynamic representations, improving reports with better clarity and user experience\n\nAdditionally, other refinements to enhance ease of use for both professionals and future contributors will be made.\nBy focusing on data integration, datum conversion and smarter visualization this project will transform Autoval into a more powerful and efficient evaluation framework. These contributions will provide professionals with validated data and help them drive smarter and more actionable decisions in ocean and coastal management.",
          "difficulty": null,
          "id": "proj_ioos_2025_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/dbT37m5A",
          "proposal_id": "DHIN5BZG",
          "short_description": "Autoval is a tool made for validation of STOFS models. In this project proposal I propose to enhance Autoval significantly. This includes three major...",
          "slug": "autoval-enhancement-usgs-observation-data-integration-datum-conversion-smarter-visualization",
          "status": "in-progress",
          "student_name": "Siddharth_Chauhan",
          "student_profile": null,
          "tags": [],
          "title": "Autoval Enhancement: USGS Observation Data Integration, Datum Conversion & Smarter Visualization"
        },
        {
          "code_url": null,
          "description": "OCSMesh is a Python package designed for generating unstructured meshes tailored to ocean modeling. However, its current workflow, particularly the Digital Elevation Model (DEM) processing and JIGSAW mesh generation steps, remains highly time-consuming and not well-optimized for High Performance Computing (HPC) environments.\nTo address this bottleneck, I propose introducing parallelism into the most computationally intensive stages of the workflow: DEM processing and JIGSAW-based meshing. My approach involves leveraging parallel computing libraries such as Dask and mpi4py to scale these operations across multiple cores and nodes.\nFor the preprocessing stage, several components are already optimized for single-node performance and can be extended to work efficiently in an HPC setting. Regarding JIGSAW meshing, I plan to implement a domain decomposition strategy, partitioning the domain into smaller subdomains that can be meshed independently in parallel. These subdomain meshes will then be seamlessly merged to form the final unified mesh.\nThis parallelized workflow is expected to dramatically reduce mesh generation time, enabling more scalable and efficient processing for large-scale ocean modeling tasks. I aim to integrate mpi4py support into the key functions across the codebase, while using Dask specifically for raster windowing and DEM data handling.",
          "difficulty": null,
          "id": "proj_ioos_2025_009",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/9mj1dDWr",
          "proposal_id": "v60udfoz",
          "short_description": "OCSMesh is a Python package designed for generating unstructured meshes tailored to ocean modeling. However, its current workflow, particularly the...",
          "slug": "ocsmesh-parallelization",
          "status": "in-progress",
          "student_name": "Yashveer_Singh",
          "student_profile": null,
          "tags": [
            "python",
            "ml",
            "ai"
          ],
          "title": "OCSMesh Parallelization"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2025/organizations/ioos"
    }
  },
  "first_time": false,
  "contact": {
    "email": "ocefpaf@gmail.com",
    "guide_url": "https://github.com/ioos/gsoc/blob/main/contributor-guidance.md",
    "ideas_url": "https://github.com/ioos/gsoc/blob/main/2025/ideas-list.md",
    "irc_channel": "https://gitter.im/ioos",
    "mailing_list": "https://groups.google.com/g/ioos_tech/"
  },
  "social": {
    "blog": "https://ioos.github.io/notebooks_demos/",
    "discord": null,
    "facebook": null,
    "github": null,
    "gitlab": null,
    "instagram": null,
    "linkedin": null,
    "mastodon": null,
    "medium": null,
    "reddit": null,
    "slack": null,
    "stackoverflow": null,
    "twitch": null,
    "twitter": "https://x.com/usioosgov",
    "youtube": null
  },
  "meta": {
    "version": 1,
    "generated_at": "2026-01-25T15:28:53.252Z"
  }
}