{
  "id": "692251d953dd9d7326d33df5",
  "slug": "joomla",
  "name": "Joomla!",
  "category": "End user applications",
  "description": "The flexible platform empowering website creators.",
  "image_url": "https://summerofcode.withgoogle.com/media/org/joomla/dwntn9vfd52jkr9z.png",
  "img_r2_url": "https://pub-268c3a1efc8b4f8a99115507a760ca14.r2.dev/joomla.webp",
  "logo_r2_url": null,
  "url": "https://www.joomla.org/",
  "active_years": [
    2016,
    2017,
    2018,
    2019,
    2021,
    2022,
    2025
  ],
  "first_year": 2016,
  "last_year": 2025,
  "is_currently_active": true,
  "technologies": [
    "javascript",
    "html",
    "php",
    "css",
    "jquery",
    "mysql",
    "html5/css3",
    "cms"
  ],
  "topics": [
    "web",
    "cms",
    "object-oriented",
    "mvc",
    "web application",
    "web development",
    "web applications",
    "programming languages"
  ],
  "total_projects": 36,
  "stats": {
    "avg_projects_per_appeared_year": 5.14,
    "projects_by_year": {
      "year_2016": 5,
      "year_2017": 8,
      "year_2018": 7,
      "year_2019": 3,
      "year_2020": null,
      "year_2021": 5,
      "year_2022": 4,
      "year_2023": null,
      "year_2024": null,
      "year_2025": 4
    },
    "students_by_year": {
      "year_2016": 5,
      "year_2017": 8,
      "year_2018": 7,
      "year_2019": 3,
      "year_2020": null,
      "year_2021": 5,
      "year_2022": 4,
      "year_2023": null,
      "year_2024": null,
      "year_2025": 4
    },
    "total_students": 34
  },
  "years": {
    "year_2016": {
      "num_projects": 5,
      "projects": [
        {
          "code_url": "https://github.com/joomla-projects/gsoc16_recording-action-logs/commits/staging?author=muhakh",
          "description": "<h4>Motivation</h4>\n<p>To record actions of users within the CMS, to know who to blame when something wrong happens.</p>\n<h4>Project Description</h4>\n<p>This project is about making a Joomla! CMS extension to store the tasks performed by any user, informing those who did, where did when did and what made within the project.\nThis project has two main parts: capturing the log data and viewing the captured data. It will be a package that contains a plugin to store events and a component to view, filter and control them.</p>\n<h4>Implementation</h4>\n<p>I'll build a package that contains a component, plugin and module.\nThe plugin will have the logging system that will store users actions based on Joomla events.The component will be for viewing logs and controlling deleting and logging options. The module will be for viewing the logs of current user in the back-end.</p>\n",
          "difficulty": null,
          "id": "proj_joomla_2016_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/6627562692280320/",
          "proposal_id": null,
          "short_description": "Motivation\nTo record actions of users within the CMS, to know who to blame when something wrong happens.\nProject Description\nThis project is about...",
          "slug": "recording-actions-logs-accessible-by-super-admin",
          "status": "completed",
          "student_name": "Mohamed Karam",
          "student_profile": null,
          "tags": [
            "ml",
            "ai",
            "ui"
          ],
          "title": "Recording actions logs, accessible by super admin"
        },
        {
          "code_url": "https://github.com/joomla-projects/gsoc16_menu-for-article/pull/15/commits",
          "description": "<p>This project is mainly a project for the Joomla CMS.\nThis Joomla GSoC project aims to improve the workflow regarding creating articles &amp; menu buttons to those articles.\nIn Joomla 1.0 it was possible in the administrator back-end to create a menu link to an article from within the article edit view. In Joomla 3.x to create an article and menu item in the administrator back-end , one have to:</p>\n<ol>\n<li>Create an article.\n·         Go to content.\n·         Go to Articles.\n·         Select New option.</li>\n<li>Create a new menu item to that article.\n·         Select Menu option in the administrator back-end.\n·         Select a Menu from the drop down box.\n·         Select add New menu item.\n·         From the dialogue box select type as Single Article.\n·         Enter the link to the given article.\nThe purpose of this project is to improve the work flow in Joomla.\nFor new users Joomla's work flow can be confusing.\nIn Joomla we could make it easier (especially for new users) to create such menu items to single articles i.e. create a new option in Article Edit view to create a menu item to that article</li>\n</ol>\n",
          "difficulty": null,
          "id": "proj_joomla_2016_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5640554780033024/",
          "proposal_id": null,
          "short_description": "This project is mainly a project for the Joomla CMS.\nThis Joomla GSoC project aims to improve the workflow regarding creating articles &amp; menu...",
          "slug": "improving-the-menu-item-workflow-in-joomla",
          "status": "completed",
          "student_name": "Shubham Rajput",
          "student_profile": null,
          "tags": [
            "ml",
            "ai"
          ],
          "title": "Improving the menu item workflow in Joomla"
        },
        {
          "code_url": "https://github.com/joomla-projects/gsoc16_improved-multi-lingual/pulls?utf8=%E2%9C%93&q=is%3Apr%20author%3Ajreys%20",
          "description": "<p>The goal of my project is to improve a multi-lingual site's back-end, meaning that besides having several content (articles, menu items, categories, contacts, etc.) separated by default, one can associate content languages with those items side-by-side to avoid tedious replication tasks of going back and forth to apply changes.</p>\n",
          "difficulty": null,
          "id": "proj_joomla_2016_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/4715316819001344/",
          "proposal_id": null,
          "short_description": "The goal of my project is to improve a multi-lingual site's back-end, meaning that besides having several content (articles, menu items, categories,...",
          "slug": "improved-multi-lingual-content-management",
          "status": "completed",
          "student_name": "João Reys Santos",
          "student_profile": null,
          "tags": [],
          "title": "Improved multi-lingual content management‏"
        },
        {
          "code_url": "https://github.com/joomla-projects/gsoc16_js-unit-tests/commits/develop?author=Ruchiranga",
          "description": "<p>Since the Joomla core is written primarily in PHP the codebase currently has a comprehensive test coverage for PHP so far. What the codebase lacks is such a comprehensive test coverage for the collection of custom written JavaScript libraries. The project targets at introducing unit testing for those custom JavaScript libraries and automating the tests to run on Travis build triggered by a PR to the Github repository.</p>\n",
          "difficulty": null,
          "id": "proj_joomla_2016_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/6478555512832000/",
          "proposal_id": null,
          "short_description": "Since the Joomla core is written primarily in PHP the codebase currently has a comprehensive test coverage for PHP so far. What the codebase lacks is...",
          "slug": "project-x-javascript-unit-tests-project-proposal",
          "status": "completed",
          "student_name": "Ruchiranga Wickramasinghe",
          "student_profile": null,
          "tags": [
            "java",
            "javascript",
            "ml",
            "ui"
          ],
          "title": "Project X: JavaScript Unit Tests: Project Proposal"
        },
        {
          "code_url": "https://github.com/joomla-projects/gsoc16_browser-automated-tests/commits/staging?author=pritalpatel",
          "description": "<p>System development nowadays more than ever starts to look for automated test methods. \nThere are several main drivers for this trend -need for faster design‐develop‐test‐analysis cycle, push for higher quality, increasing complexity of systems and their integration and last but not least ever‐rising costs of manual testing. \nSoftware testing itself is very wide field with topics ranging from compliance frameworks.</p>\n<p>Automation Testing means using an automation tool to execute test case suite.\nThe automation software can also enter test data into the System Under Test, compare expected and actual results and generate detailed test reports.</p>\n<p>Test Automation demands considerable investments of money and resources. \nSuccessive development cycles will require execution of same test suite repeatedly. \nUsing a test automation tool it's possible to record this test suite and re-play it as required. \nOnce the test suite is automated, no human intervention is required.</p>\n<p>This project mainly a project for the <strong>Joomla CMS</strong>.</p>\n",
          "difficulty": "advanced",
          "id": "proj_joomla_2016_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/6002483084132352/",
          "proposal_id": null,
          "short_description": "System development nowadays more than ever starts to look for automated test methods. \nThere are several main drivers for this trend -need for faster...",
          "slug": "browser-automated-tests-for-joomla-cmscovering-users-and-content-features",
          "status": "completed",
          "student_name": "Prital Patel",
          "student_profile": null,
          "tags": [
            "ml",
            "ai",
            "ui"
          ],
          "title": "Browser Automated Tests for Joomla! CMS(covering Users and Content features)"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2016/organizations/6222406616088576/"
    },
    "year_2017": {
      "num_projects": 8,
      "projects": [
        {
          "code_url": "https://github.com/joomla-projects/media-manager-improvement/commits/gsoc17?author=kasvith",
          "description": "<p>Joomla! is an Open Source CMS which allows the user to create websites with ease. It is rich in features that helps even a novice to set up a fully functional and a secure CMS.</p>\n<p>Joomla! 3 is the current stable version which is available to users. Joomla! 4 will be the next generation which is going to use more modern technologies.</p>\n<p>Joomla! has a built in Media Manager to manage media files, such that even a novice can easily upload and use them in his articles etc. In Joomla! 4, the media manager will get rewritten from scratch with a JavaScript based (Vue.js) client and a REST like API as data endpoint. Through this endpoint it is possible to make GET, POST, PUT and DELETE requests to fetch and manipulate the media files. On the server side are the requests forwarded to an adapter, which processes the data.</p>\n<p>The aim of this project is to add more cloud based file adapter’s through the Joomla plugin system for the media manager which allow the other developers to extend the capability of it. They can add a cloud file system to Joomla! which allows the users to interact with media files the same way as with local files.</p>\n",
          "difficulty": null,
          "id": "proj_joomla_2017_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6438237581082624/",
          "proposal_id": null,
          "short_description": "Joomla! is an Open Source CMS which allows the user to create websites with ease. It is rich in features that helps even a novice to set up a fully...",
          "slug": "cloud-filesystem-for-media-manager",
          "status": "completed",
          "student_name": "Kasun Vithanage",
          "student_profile": null,
          "tags": [
            "vue",
            "java",
            "javascript",
            "web",
            "api"
          ],
          "title": "Cloud filesystem for Media Manager"
        },
        {
          "code_url": "https://github.com/isacandrei/joomla-testing/blob/container-test/readme_GSOC.md",
          "description": "<p>In the fast moving world of open source, PR requests are opened every day, which leads to the problem of testing. Time and resource needs to be put into testing the new submitted fix or feature. By doing this project I plan to finish and improve the work of my mentor by developing an automatic parallel testing environment integrated that will deliver fast results for the available unit tests. I believe that my education, work and project experience make me the perfect candidate for this project.\nThe general purpose of the project is getting early feedback for every newly submitted code. By creating a fully working environment to run tests for Joomla code, so that they can run in a parallel (container-based) environment, increasing speed and coverage of PHP and Joomla versions. The key requirement here is speed, it is crucial to get early feedback on new PRs. In order to achieve this, tests not dependent on each other will be run on different containers simultaneously.</p>\n",
          "difficulty": null,
          "id": "proj_joomla_2017_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6619408428433408/",
          "proposal_id": null,
          "short_description": "In the fast moving world of open source, PR requests are opened every day, which leads to the problem of testing. Time and resource needs to be put...",
          "slug": "automatic-parallel-testing-environment",
          "status": "completed",
          "student_name": "Flavius Andrei Isac",
          "student_profile": null,
          "tags": [
            "ml",
            "ai",
            "ui"
          ],
          "title": "Automatic Parallel Testing Environment"
        },
        {
          "code_url": "https://github.com/joomla-projects/gsoc17_helpscreens_on_jdocs/pull/10",
          "description": "<p>The purpose of this project is to make the Help Screen more manageable for the Volunteers which will require less time to keep the documentation up to date work in Joomla!.\nFor the Volunteers, the current Help System is becoming Unmanageable as they have to update the Help Screen for each Joomla Page and for every New version.  Keeping them up to date (content as well as numerous screenshots of the backend) is important for our users but it has become an impossible goal, even more, because they also need to be localized.</p>\n",
          "difficulty": null,
          "id": "proj_joomla_2017_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6632469155545088/",
          "proposal_id": null,
          "short_description": "The purpose of this project is to make the Help Screen more manageable for the Volunteers which will require less time to keep the documentation up...",
          "slug": "project-xi-refactoring-the-help-screens-localised-on-jdocs-and-served-in-the-joomla-backend-through-the-help-server-to-make-them-more-manageable-by-volunteers",
          "status": "completed",
          "student_name": "Shivam Rajput",
          "student_profile": null,
          "tags": [
            "ml",
            "ui",
            "backend"
          ],
          "title": "PROJECT XI: REFACTORING THE HELP SCREENS LOCALISED ON JDOCS AND SERVED IN THE JOOMLA! BACKEND THROUGH THE HELP SERVER TO MAKE THEM MORE MANAGEABLE BY VOLUNTEERS"
        },
        {
          "code_url": "https://github.com/joomla-projects/gsoc17_pr_testing_platform",
          "description": "<p>The main goal of this project is to build a platform with a Docker Compose (multi-container docker) that integrates with the github API in order to automatically get the Pull Request content, build a running Joomla application and provide the URL for testers to test that particular PR on the fly. It attempts to take away any problems and time while in the setup process for the Joomla build and make it substantially easier for people to test requiring almost no technical knowledge about github and Joomla and effort from the testers in order to test Joomla.</p>\n",
          "difficulty": null,
          "id": "proj_joomla_2017_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5424560606281728/",
          "proposal_id": null,
          "short_description": "The main goal of this project is to build a platform with a Docker Compose (multi-container docker) that integrates with the github API in order to...",
          "slug": "project-xiii-pr-testing-platform",
          "status": "completed",
          "student_name": "Ricardo Fusco",
          "student_profile": null,
          "tags": [
            "api",
            "ml",
            "ai",
            "docker",
            "ui"
          ],
          "title": "Project XIII - PR Testing Platform"
        },
        {
          "code_url": "https://gist.github.com/cokencorn/a8cf0091ad1f9fa97ba0286ec382f400",
          "description": "<p>This report communicates how we implemented various features to expand the Joomla Extension Manager which is a core component of Joomla, in terms of planning, design and application.</p>\n",
          "difficulty": null,
          "id": "proj_joomla_2017_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5570519030038528/",
          "proposal_id": null,
          "short_description": "This report communicates how we implemented various features to expand the Joomla Extension Manager which is a core component of Joomla, in terms of...",
          "slug": "project-ix-expanding-the-extension-manager",
          "status": "completed",
          "student_name": "Altay Adademir",
          "student_profile": null,
          "tags": [
            "ml"
          ],
          "title": "Project IX: Expanding the Extension Manager."
        },
        {
          "code_url": "https://github.com/joomla-projects/gsoc17_webservices/blob/master/manual/en-US/about-joomla/GSoC-submission.md",
          "description": "<p>Web services became a necessity in today’s web development world. It helps add other dimensions to the power of websites for example: a new website can sell their articles for other developers as APIs, also they can use Joomla! API to build a mobile application for their news and articles to help them reach more audiences.\nAs Joomla is one of the most famous CMSs in the world, with millions of websites that use it, It would be great that Joomla have the capability to provide APIs for websites owners.</p>\n<p>This project is to provide a REST interface for Joomla 4. As discussed by the mentors, it would be a stand alone web app that integrates with Joomla CMS extensions. This app will be built using Joomla! Framework as it’s a tool developed and managed by Joomla team and also Joomla 4 is coming with it.</p>\n<p>I’m thinking of the app as two parts, request and response handling. The request will be routed by the app router to reach the corresponding components and retrieve the data related to the user’s request. The response is when the component receives the request from the router, it will run its logic to respond to that request and then serialize the response to follow the REST specifications.</p>\n",
          "difficulty": null,
          "id": "proj_joomla_2017_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/4879367121403904/",
          "proposal_id": null,
          "short_description": "Web services became a necessity in today’s web development world. It helps add other dimensions to the power of websites for example: a new website...",
          "slug": "web-services-in-joomla-4",
          "status": "completed",
          "student_name": "Mohamed Karam",
          "student_profile": null,
          "tags": [
            "web",
            "mobile",
            "api",
            "ml",
            "ui"
          ],
          "title": "Web-Services in Joomla 4"
        },
        {
          "code_url": "https://docs.joomla.org/Publishing_Workflow",
          "description": "<h3>Project VI: Publishing Workflow in Joomla!</h3>\n<p>Main goal is to replace publishing states with flexible workflows. User should can create multiple states and define transitions between them with assign role acl. In the list of items on the back side should be something to perform selected transaction between defined state in item and defined in the transaction. Created component should filter states and transactions by given extension. User for each transaction could define which action of which component will invoke when the transaction is performed.</p>\n<h3>Milistones</h3>\n<ul>\n<li>Schema of database</li>\n<li>List of states</li>\n<li>Create, update, delete of state</li>\n<li>List of transactions</li>\n<li>Create, update, delete of transaction</li>\n<li>States to workflows in core components</li>\n<li>Role ACL to transaction</li>\n<li>Perform transaction</li>\n<li>Action invocation</li>\n<li>Component respect Joomla ACL</li>\n</ul>\n<p>*more in Google docs</p>\n",
          "difficulty": null,
          "id": "proj_joomla_2017_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5816391009566720/",
          "proposal_id": null,
          "short_description": "Project VI: Publishing Workflow in Joomla!\nMain goal is to replace publishing states with flexible workflows. User should can create multiple states...",
          "slug": "project-vi-publishing-workflow-in-joomla",
          "status": "completed",
          "student_name": "Jan Jaracz",
          "student_profile": null,
          "tags": [
            "ml",
            "ai",
            "database"
          ],
          "title": "Project VI: Publishing Workflow in Joomla!"
        },
        {
          "code_url": "https://github.com/joomla-projects/gsoc17_expand_extension_manager/tree/GSoC",
          "description": "<p>The main goal of this project is to improve the extension manager and give developers a better support in Joomla when developing their components.</p>\n",
          "difficulty": null,
          "id": "proj_joomla_2017_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5865716024606720/",
          "proposal_id": null,
          "short_description": "The main goal of this project is to improve the extension manager and give developers a better support in Joomla when developing their components.",
          "slug": "project-ix-expand-the-extension-manager",
          "status": "completed",
          "student_name": "NunoLopes",
          "student_profile": null,
          "tags": [
            "ml",
            "ai"
          ],
          "title": "Project IX: Expand the Extension Manager"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2017/organizations/5861923971137536/"
    },
    "year_2018": {
      "num_projects": 7,
      "projects": [
        {
          "code_url": "https://github.com/joomla-projects/gsoc18_automatic_multilingual_association/issues/8",
          "description": "<p>Proposal for project II: Automatic Multi-language Associations. I've made a blueprint of a better workflow on building multilingual sites with Joomla called \"Easy-Multilingual\". Its details are described in my draft proposal.</p>\n",
          "difficulty": "beginner",
          "id": "proj_joomla_2018_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5671018043539456/",
          "proposal_id": null,
          "short_description": "Proposal for project II: Automatic Multi-language Associations. I've made a blueprint of a better workflow on building multilingual sites with Joomla...",
          "slug": "proposal-for-gsoc-2018",
          "status": "completed",
          "student_name": "Wang Yuchao",
          "student_profile": null,
          "tags": [
            "ml",
            "ai",
            "ui"
          ],
          "title": "Proposal for GSoC 2018"
        },
        {
          "code_url": "https://github.com/joomla-projects/gsoc18_override_management/pulls?q=is%3Apr+author%3AAnu1601CS+is%3Aclosed",
          "description": "<p>This project adds the feature to Joomla which check for upgrades, if the template file is changed where an override exists, it notifies the user that one of core file of his template overrides is changed with the update, to avoid security issues or functionality issue and he can adjust his override before anyone can notice.</p>\n",
          "difficulty": null,
          "id": "proj_joomla_2018_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5055232610402304/",
          "proposal_id": null,
          "short_description": "This project adds the feature to Joomla which check for upgrades, if the template file is changed where an override exists, it notifies the user that...",
          "slug": "improve-override-management",
          "status": "completed",
          "student_name": "Anurag Kumar",
          "student_profile": null,
          "tags": [
            "ml"
          ],
          "title": "Improve Override Management"
        },
        {
          "code_url": "https://github.com/joomla-projects/gsoc18_adaptive_images/pulls?q=is%3Apr+author%3Aproman24+is%3Aclosed",
          "description": "<h5>The following major aspects are being covered in this project</h5>\n<ul>\n<li>The project deals with the smart resizing and cropping of the image.</li>\n<li>Based on the Author/Admin selection of important parts in the image, resizing and cropping are being carried out.</li>\n<li>API access to the feature is provided in this project.</li>\n<li>More personalized images are being sent to the devices.</li>\n<li>Device specific images are being cached. </li>\n<li>Supports fast loading of the webpage on mobile devices, as it reduces the size of the image to a great extent.</li>\n<li>The message associated with the image is preserved.</li>\n</ul>\n",
          "difficulty": null,
          "id": "proj_joomla_2018_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/4730036208795648/",
          "proposal_id": null,
          "short_description": "The following major aspects are being covered in this project\n\nThe project deals with the smart resizing and cropping of the image.\nBased on the...",
          "slug": "media-manager-adaptive-images",
          "status": "completed",
          "student_name": "Geetanshu Mathur",
          "student_profile": null,
          "tags": [
            "web",
            "mobile",
            "api"
          ],
          "title": "Media Manager - Adaptive Images"
        },
        {
          "code_url": "https://github.com/joomla/test-system/tree/gsoc18",
          "description": "<p>The Goal of the project is to increase coverage of System Tests for Joomla 4 using Codeception and Selenium, The project would be called success if Joomla 4 has a decent test coverage including multiple Integration scenarios, all the tests are running on a CI server for every Pull Request made against the Joomla 4 Branch.</p>\n",
          "difficulty": null,
          "id": "proj_joomla_2018_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/6110502719586304/",
          "proposal_id": null,
          "short_description": "The Goal of the project is to increase coverage of System Tests for Joomla 4 using Codeception and Selenium, The project would be called success if...",
          "slug": "system-testing-for-joomla-4-with-increased-coverage",
          "status": "completed",
          "student_name": "Samarth Sharma",
          "student_profile": null,
          "tags": [
            "ios",
            "ml",
            "ai"
          ],
          "title": "System Testing For Joomla 4 With Increased Coverage"
        },
        {
          "code_url": "https://github.com/isacandrei/gsoc18_webservices/blob/gsoc-submission/GSoC_submission.md",
          "description": "<p>In the fast moving world of web development, providing developers with cutting edge and easy to use functionalities for their preferred CMS is crucial. Just imagine being able do develop your own custom REST API for Joomla and integrate it in various other applications. Here, the Webservices project comes in.</p>\n",
          "difficulty": "beginner",
          "id": "proj_joomla_2018_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5847827620036608/",
          "proposal_id": null,
          "short_description": "In the fast moving world of web development, providing developers with cutting edge and easy to use functionalities for their preferred CMS is...",
          "slug": "webservices-project-proposal",
          "status": "completed",
          "student_name": "Flavius Andrei Isac",
          "student_profile": null,
          "tags": [
            "web",
            "api",
            "ml"
          ],
          "title": "WebServices Project Proposal"
        },
        {
          "code_url": "https://gist.github.com/bosunski/cf0f02cb53abaab2970034103cef240c",
          "description": "<p>The current state of things in Joomla! ensures that the major management of your Joomla! installation is done via the backend Administration. Which means that things like script updates, plugin updates, installation of extensions – modules, plugins and components can only be done through the Administrative panel of Joomla!. Getting all these done with this medium can be very cumbersome for System Integrators and for developers when testing just a very small thing on the Joomla! Installation. Added to all these problems is the speed in Access to perform these operations.\nThe Idea is to add a CLI Application to the Joomla! CMS, that can perform the updates without going to the administrative panel which:</p>\n<ul>\n<li>Provides basic commands needed to perform site wide administration</li>\n<li>Architecturally fits in into future releases(e.g Joomla! 4.x, 5.x, etc) of Joomla! as well as backward compatibility for \n  previous releases.</li>\n<li>Is extendable with a good plugin mechanism that allows future ideas to be integrated e.g Allowing commands to be \n added.     </li>\n<li>Allows not just updates to be done but also allows changing of some settings.</li>\n<li>Ensures Proper Error and Exception Handling.</li>\n</ul>\n",
          "difficulty": "medium",
          "id": "proj_joomla_2018_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/6284817188519936/",
          "proposal_id": null,
          "short_description": "The current state of things in Joomla! ensures that the major management of your Joomla! installation is done via the backend Administration. Which...",
          "slug": "joomla-cli-update",
          "status": "completed",
          "student_name": "Olatunbosun Egberinde",
          "student_profile": null,
          "tags": [
            "ml",
            "backend"
          ],
          "title": "Joomla! CLI Update"
        },
        {
          "code_url": "https://github.com/joomla-projects/gsoc18_enhance_users/blob/staging/README_GSoC_Enhance_Users.md",
          "description": "<p>The project asks for a com_users component that adheres to the current coding standards and that is extended with two views, one with the list of users and one with the public profile.</p>\n",
          "difficulty": null,
          "id": "proj_joomla_2018_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5158768568434688/",
          "proposal_id": null,
          "short_description": "The project asks for a com_users component that adheres to the current coding standards and that is extended with two views, one with the list of...",
          "slug": "proposal-for-project-vi-enhance-users",
          "status": "completed",
          "student_name": "Alexandra Ciobica",
          "student_profile": null,
          "tags": [],
          "title": "Proposal for Project VI: Enhance Users"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2018/organizations/6484151049912320/"
    },
    "year_2019": {
      "num_projects": 3,
      "projects": [
        {
          "code_url": "https://github.com/bahl24/GSoC-2019-Page-Builder-Work-Report",
          "description": "<p>Creating a Joomla 4.0 frontend template will be much easier by using an intuitive page builder. With this, users can desire the position of elements by a grid, buttons and drag'n'drop and select the information these elements should display. For a faster development the JavaScript framework Vue.js will be used, which provides a strong base for creating reactive components. The plan is to have one month for building the page builder and one for the implementation in Joomla. Final tests, integration and documentation is part of the third month. Years of experience in component, backend and frontend development helps to understand Joomla. Git and JS were part of past projects too. So let's give Joomla a page builder out of the box and give every user the possibilty to build customized templates.</p>\n",
          "difficulty": null,
          "id": "proj_joomla_2019_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/6410118596395008/",
          "proposal_id": null,
          "short_description": "Creating a Joomla 4.0 frontend template will be much easier by using an intuitive page builder. With this, users can desire the position of elements...",
          "slug": "pagebuilder-for-joomla-40",
          "status": "completed",
          "student_name": "FancyFranci",
          "student_profile": null,
          "tags": [
            "react",
            "vue",
            "java",
            "javascript",
            "ml"
          ],
          "title": "PageBuilder for Joomla 4.0"
        },
        {
          "code_url": "https://github.com/bahl24/GSoC-2019-Page-Builder-Work-Report",
          "description": "<p>Aim is to develop a Page Builder interface for frontend part in styles section using VueJS, with a Drag and Drop GUI for module positions. Using Bootstrap Grid System to make it easier to design web pages which would be responsive on all screen sizes. User will be able to fully customise the site template style, using interactive area to</p>\n<ol>\n<li>Drag and Drop module position box.</li>\n<li>Reordering/changing position Bootstrap classes based on input.</li>\n<li>Select module chrome for each position.</li>\n<li>Resize different positions, by changing BS classes. eg- <code>col-sm-3</code> to <code>col-sm-4</code>.</li>\n<li>Add new module position.</li>\n</ol>\n<p>Updating \"params\" column in <code>#_template_styles</code> and implementing page renderer in index.php to preview the style based on JSON input from \"params\"</p>\n",
          "difficulty": null,
          "id": "proj_joomla_2019_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5566303283183616/",
          "proposal_id": null,
          "short_description": "Aim is to develop a Page Builder interface for frontend part in styles section using VueJS, with a Drag and Drop GUI for module positions. Using...",
          "slug": "new-frontend-template-page-builder",
          "status": "completed",
          "student_name": "Nitish Bahl",
          "student_profile": null,
          "tags": [
            "vue",
            "web",
            "ai",
            "ui",
            "frontend"
          ],
          "title": "New frontend template: Page-builder"
        },
        {
          "code_url": "https://github.com/a-samoylov/joomla-cms/blob/GSoC_submission/GSoC_submission.md",
          "description": "<p>1) Web services in Joomla. Joomla is popular CMS, which is actively developing and it is very important to implement web services for further development. Web services will implemented for next components:</p>\n<p>com_content</p>\n<p>com_contact</p>\n<p>com_newsfeeds</p>\n<p>com_weblinks</p>\n<p>com_media (custom)</p>\n<p>com_menus</p>\n<p>com_categories</p>\n<p>com_contenthistory</p>\n<p>com_finder/com_search (read only as search and not CRUD)</p>\n<p>com_languages (both languages and content languages)</p>\n<p>com_messages</p>\n<p>com_modules/com_templates</p>\n<p>com_tags</p>\n<p>com_redirect</p>\n<p>com_plugins (edit settings only)</p>\n<p>com_config (edit settings only)</p>\n<p>2) Integrate entities layer (<a href=\"https://github.com/joomla-framework/entities\" target=\"_blank\">https://github.com/joomla-framework/entities</a>) in Joomla. The entity layer is a very important implementation for developers. Working with entity is more convenient than working with database directly. Since Joomla is an open source project, this implementation will help many developers.</p>\n",
          "difficulty": null,
          "id": "proj_joomla_2019_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/6294727723319296/",
          "proposal_id": null,
          "short_description": "1) Web services in Joomla. Joomla is popular CMS, which is actively developing and it is very important to implement web services for further...",
          "slug": "webservices-in-joomla",
          "status": "completed",
          "student_name": "Oleksandr Samoilov",
          "student_profile": null,
          "tags": [
            "web",
            "ml",
            "database"
          ],
          "title": "Webservices in Joomla"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2019/organizations/6743345328553984/"
    },
    "year_2020": null,
    "year_2021": {
      "num_projects": 5,
      "projects": [
        {
          "code_url": "https://github.com/joomla-projects/gsoc21_core-enhancements/blob/GSoC-21-readme/README_GSoC.md",
          "description": "<p>Joomla is a free open-source content management system that helps run thousands of businesses online and is backed by an awesome open source community striving to make the product better.</p>\n<h5>Aim of the Project</h5>\n<ul>\n<li>Integrate Workflows in the Modules Component</li>\n<li>Ease the process of placing modules on menus</li>\n<li>Merge view featured articles into article list</li>\n<li>Make it easier to place and edit modules in Article-Edit-View</li>\n</ul>\n",
          "difficulty": null,
          "id": "proj_joomla_2021_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6458534996213760/",
          "proposal_id": null,
          "short_description": "Joomla is a free open-source content management system that helps run thousands of businesses online and is backed by an awesome open source...",
          "slug": "joomla-core-feature-enhancements",
          "status": "completed",
          "student_name": "Yatharth Vyas",
          "student_profile": null,
          "tags": [
            "ml",
            "ai"
          ],
          "title": "Joomla Core Feature Enhancements"
        },
        {
          "code_url": "https://github.com/joomla-projects/gsoc21_media-manager/blob/final-submission/GSoC_README.md",
          "description": "<p>Using images in a website's content is incredibly necessary to help the users interact and feel at ease on it. But what’s much more critical is to optimize the images used in the content by correctly sizing them for different screens and not to use more than necessary. Unoptimized photos, instead, can increase the website's load time unnecessarily and drive users away.</p>\n<p>On the other hand, various media types must be used in different situations in web content. Therefore, users should be able to upload any media type they want and perform the required operations on it before publishing it on the website.</p>\n<p>Goals of this project:</p>\n<ul>\n<li>Implement responsive images with customizable breakpoints;</li>\n<li>Improve \"Add/Edit Image\" form to make image details editable in content editors;</li>\n<li>Add new features/plugins to make it possible for users to upload different media types and carry out some interactions with them.</li>\n</ul>\n",
          "difficulty": null,
          "id": "proj_joomla_2021_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5655883085774848/",
          "proposal_id": null,
          "short_description": "Using images in a website's content is incredibly necessary to help the users interact and feel at ease on it. But what’s much more critical is to...",
          "slug": "media-manager",
          "status": "completed",
          "student_name": "Eyvaz Ahmadzada",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "ui"
          ],
          "title": "Media Manager"
        },
        {
          "code_url": "https://github.com/rjharishabh/GSoC-2021-Work-Report",
          "description": "<p>The aim of the project is to create a cookie manager to manage cookies as required by GDPR and other privacy regulations. Nowadays it’s a need of each of the websites on the web.</p>\n<h5>Benefits of using cookie management system:</h5>\n<ol>\n<li>It gives users control and choice over their information.</li>\n<li>It allows users to decide whether or not business websites should be using\ntheir details.</li>\n<li>Business websites have transparency among customers.</li>\n</ol>\n",
          "difficulty": null,
          "id": "proj_joomla_2021_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5670403833331712/",
          "proposal_id": null,
          "short_description": "The aim of the project is to create a cookie manager to manage cookies as required by GDPR and other privacy regulations. Nowadays it’s a need of...",
          "slug": "cookie-management-system",
          "status": "completed",
          "student_name": "Rishabh Ranjan Jha",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "ui"
          ],
          "title": "Cookie Management System"
        },
        {
          "code_url": "https://github.com/joomla-projects/gsoc21_accessibility",
          "description": "<p>Implement and improve several accessibility functions in Joomla! Keyboard navigation.\nWeb accessibility means designing and developing your website so that people with disabilities can perceive, understand, navigate, and interact with, and contribute to the Web. Occasionally, the dispute over the definition of accessibility is revived.\nIn fact, there are no contradictions between the two approaches. Design that recognizes the needs of all people also serves people with disabilities. Designing, for people with disabilities, brings benefits to all people - also people without disabilities. However, the term \"accessibility\" was defined to draw the attention of designers, not just web designers, to the specific needs of people with disabilities.\nW3C set up a Web Accessibility Initiative whose mission is to ensure that the web is accessible to people with disabilities including auditory, cognitive, neurological, physical, speech, and visual disabilities.</p>\n",
          "difficulty": null,
          "id": "proj_joomla_2021_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5374852369743872/",
          "proposal_id": null,
          "short_description": "Implement and improve several accessibility functions in Joomla! Keyboard navigation.\nWeb accessibility means designing and developing your website...",
          "slug": "implement-and-improve-several-accessibility-functions-in-joomla-keyboard-navigation",
          "status": "completed",
          "student_name": "KUMAR SHIVAM",
          "student_profile": null,
          "tags": [
            "web",
            "ml"
          ],
          "title": "Implement and improve several accessibility functions in Joomla! Keyboard navigation"
        },
        {
          "code_url": "https://github.com/joomla-projects/gsoc21_frontend-inline-editing/issues/10",
          "description": "<p>The aim of this project is to allow users to quickly edit the content of different components and modules of their websites without having to leave the front-end or going to a different page. This will save time when small changes need to be made. Normally if there is a typo on the page, one has to first check whether it is in the article's heading, its content, module title, module's content, banner, etc. And then open the corresponding edit page of the component.</p>\n<p>Upon the completion of this project, it will be much easier to edit the text of almost any part of the website. This project will also be helpful when the user wants to see the end product while modifying the page.</p>\n<p><strong>To conclude, we want to minimize the use of pop-ups and page-reloads involved in editing the content.</strong></p>\n",
          "difficulty": null,
          "id": "proj_joomla_2021_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/4856717245939712/",
          "proposal_id": null,
          "short_description": "The aim of this project is to allow users to quickly edit the content of different components and modules of their websites without having to leave...",
          "slug": "frontend-inline-editing",
          "status": "completed",
          "student_name": "Rahul Saini",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "ui",
            "frontend"
          ],
          "title": "Frontend Inline editing"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2021/organizations/6265631002853376/"
    },
    "year_2022": {
      "num_projects": 4,
      "projects": [
        {
          "code_url": "https://github.com/joomla-projects/gsoc22_accessibility-plugin-script",
          "description": "Web accessibility means that websites are designed in such a way that people with any kind of disabilities can use them without any difficulties. Joomla! is an award-winning content management system that cares about all types of its users and therefore the accessibility plugin was integrated into Joomla! As Joomla! means altogether, it's committed to being accessible to the widest possible audience, regardless of ability or technology.\nEvery organization wants to design high-quality websites, and not exclude people from using their services. Therefore, accessibility plays a major role for both organizations/developers and end-users.\nThe project aims to improve the already existing accessibility plugin so that the Joomla! websites can have a solid foundation in keyboard support, focus support, ARIA markup, and other assistive technologies.",
          "difficulty": null,
          "id": "proj_joomla_2022_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/oCmES02Y/",
          "proposal_id": null,
          "short_description": "Web accessibility means that websites are designed in such a way that people with any kind of disabilities can use them without any difficulties....",
          "slug": "accessibility-plugin",
          "status": "completed",
          "student_name": "Shubham Verma",
          "student_profile": null,
          "tags": [
            "web",
            "ml",
            "ai"
          ],
          "title": "Accessibility Plugin"
        },
        {
          "code_url": "https://github.com/alisha-kamat/GSoC-2022-Work-Report",
          "description": "Review SEO features for the current Joomla! version. Define and propose new useful SEO features that can be included in future Joomla! versions.",
          "difficulty": null,
          "id": "proj_joomla_2022_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/7uMIihJR/",
          "proposal_id": null,
          "short_description": "Review SEO features for the current Joomla! version. Define and propose new useful SEO features that can be included in future Joomla! versions....",
          "slug": "seo-features-for-joomla-40",
          "status": "completed",
          "student_name": "Alisha Kamat",
          "student_profile": null,
          "tags": [
            "ml"
          ],
          "title": "SEO features for Joomla! 4.0"
        },
        {
          "code_url": "https://github.com/shazmasiddiqui/GSoC-2022-Schemaorg-project-report",
          "description": "Data is the new big thing for search engines in today’s time but it can be difficult for web crawlers to effectively interpret the context of the data. To deliver better search results, web crawlers need to have a context of the data and to understand the data better, structured data is used. Structured data is the data which conforms to a data model, has a well defined structure, follows a consistent order and can be easily accessed and used by a person or a computer program. It is used by search engines to generate rich snippets, which are small pieces of information that will then appear in search results making the search results more relevant.\nCurrently Joomla! has rich snippets implemented but it uses inline microdata to implement rich snippets which is difficult to modify from the backend as it is hard coded into the html. With this project I’ll be working on to making it easier for the user to dynamically integrate structured data from the backend. \nFor the dynamic integration of structured data I’ll be using schema.org which provides a universally recognized format for structuring data on the Web. There are different ways to implement schema markup but for this project I’ll be using JSON-LD as it can be inserted into the web page without disrupting other contents or HTML and it is easy to store in the database. This project will help user to add, update or delete schema markup on the articles from the backend. It will give user an option to select the type of schema from the available schema types and then insert values for the attributes of schema properties in the form. Some useful data which is already present in other forms will be fetched using AJAX Interface and it will be directly inserted into the JSON object. After saving the article, the generated schema will be pushed into the head element of the page.",
          "difficulty": "beginner",
          "id": "proj_joomla_2022_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/GgakrOEQ/",
          "proposal_id": null,
          "short_description": "Data is the new big thing for search engines in today’s time but it can be difficult for web crawlers to effectively interpret the context of the...",
          "slug": "schemaorg",
          "status": "completed",
          "student_name": "Shazma Siddiqui",
          "student_profile": null,
          "tags": [
            "web",
            "ml",
            "ai",
            "database",
            "backend"
          ],
          "title": "Schema.org"
        },
        {
          "code_url": "https://github.com/khu5h1/GSoC-2022-Guided-Tour-Report",
          "description": "For Joomla, the convenience of its users is on its priority list and Guided Tour is something that will definitely make it easy for its users to use Joomla. Those who use Joomla! will prefer a basic help text and interface over reading bulky documentation for any action they want to execute. Though it is properly detailed in an easy manner in the documentation, the user has to visit a separate link for documentation. It would be easy for the user if he/she can get that on the same page without any redirection and in the form of some iframes.\nIt could be better if this would be a complete tour of the click-through path as that will increase the convenience for users in a much more professional and better way and even to make this feature more user friendly, a user can create custom tours as per the requirement.\nAlso, this will allow third-party developers to ship their own tours with their extensions which will make it easier for the users, who will use the extension to be familiar with the same.",
          "difficulty": "beginner",
          "id": "proj_joomla_2022_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/XJwp022t/",
          "proposal_id": null,
          "short_description": "For Joomla, the convenience of its users is on its priority list and Guided Tour is something that will definitely make it easy for its users to use...",
          "slug": "guided-tour",
          "status": "completed",
          "student_name": "Khushi Rauniyar",
          "student_profile": null,
          "tags": [
            "ml",
            "ai",
            "ui"
          ],
          "title": "Guided Tour"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2022/organizations/joomla/"
    },
    "year_2023": null,
    "year_2024": null,
    "year_2025": {
      "num_projects": 4,
      "projects": [
        {
          "code_url": null,
          "description": "The project’s objective is to smoothly incorporate an AI module library into\nJoomla CMS so that site managers, developers, and content producers can take\nadvantage of AI-powered tools for improved user engagement, content management, and creation. A few of the varied use cases that will be made possible by the integration’s adaptable framework, which supports a number of AI models\nand providers are:\n• Text Generation.\n• Image Creation.\n• Content Analysis.\n• Intelligent Search.",
          "difficulty": null,
          "id": "proj_joomla_2025_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/5xSLuReL",
          "proposal_id": "qMbxlxcX",
          "short_description": "The project’s objective is to smoothly incorporate an AI module library into Joomla CMS so that site managers, developers, and content producers can...",
          "slug": "joomla-ai-framework",
          "status": "in-progress",
          "student_name": "CharviMehra",
          "student_profile": null,
          "tags": [
            "ml",
            "ai"
          ],
          "title": "Joomla! AI framework"
        },
        {
          "code_url": null,
          "description": "The project aims to improve Joomla's workflow system by enhancing its UI and functionality. The current workflow implementation is not intuitive, making it challenging for users to create, modify, and manage workflows effectively. The proposed solution includes a graphical workflow builder, predefined workflow templates, enhanced documentation, and thorough testing. The project will introduce drag-and-drop functionality, interactive flowcharts, and default workflow templates to streamline the process.",
          "difficulty": null,
          "id": "proj_joomla_2025_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/YX3u3lHq",
          "proposal_id": "ZiZInVpQ",
          "short_description": "The project aims to improve Joomla's workflow system by enhancing its UI and functionality. The current workflow implementation is not intuitive,...",
          "slug": "joomla-cms-workflow-enhancements",
          "status": "in-progress",
          "student_name": "Dileepadari",
          "student_profile": null,
          "tags": [
            "ml",
            "ai",
            "ui"
          ],
          "title": "Joomla CMS Workflow Enhancements"
        },
        {
          "code_url": null,
          "description": "The project is about making the Joomla! Weblinks tool work better with the newest Joomla! (version 5).\n\nFirst, I want to clean up the code so it follows the latest rules and is easier for other programmers to understand and work on. This means organizing the codebase using the standard way Joomla! 5 builds things.\n\nSecond, I want to make sure Weblinks is really reliable. To do this, I'll be writing a lot of automated tests using Cypress. These tests will check if everything is working correctly, so we can catch and fix problems easily. I'm aiming for really good test coverage – checking almost everything important.\n\nThird, I'll be looking at the list of problems people have reported with Weblinks and trying to fix them. This will make the tool much better for everyone who uses it.\n\nFinally, I'll be updating the instructions and explanations (the documentation) for Weblinks. This will help people understand how to use it and help other programmers contribute to it in the future.\n\nI've planned out how I'll do all this over the summer, step by step. I'll start by working on the main parts of the tool, then add the tests, fix the problems, and update the instructions. If I have time at the end, I might even try to add a new feature to help manage how weblinks are used.",
          "difficulty": null,
          "id": "proj_joomla_2025_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/xZ08EQgY",
          "proposal_id": "187L0OmX",
          "short_description": "The project is about making the Joomla! Weblinks tool work better with the newest Joomla! (version 5). First, I want to clean up the code so it...",
          "slug": "modernizing-and-enhancing-the-joomla-weblinks-extension",
          "status": "in-progress",
          "student_name": "Mahmoud Magdy",
          "student_profile": null,
          "tags": [
            "web",
            "ml",
            "ai",
            "ui"
          ],
          "title": "Modernizing and Enhancing the Joomla! Weblinks Extension"
        },
        {
          "code_url": null,
          "description": "Migrating content between different CMSs like Joomla, WordPress, and Drupal is challenging due to their distinct data structures. Traditional migration methods require custom tools for each CMS pair, leading to an O(n²) scalability problem. This project introduces a Common Content Model (CCM) as an intermediate format to simplify migrations to O(n) complexity. Using Model-Driven Engineering (MDE), we will dynamically adapt to various CMS schemas and automate migration script generation.\n\nThe solution will be a Joomla component acting as a universal mediator to extract and transform content between CMSs. It can be installed on any Joomla instance, either directly or as a temporary migration app to handle API-based content migration between any CMSs.\n\nThis project reduces development overhead, enables reusable migration structure, and positions Joomla as a central hub for content exchange across platforms.\n\nDeliverables:\n* CCM Joomla Component: A standalone migration component built for Joomla.\n* WordPress-to-Joomla Migration: Real implementation example using the CCM.\n* Testing Suite: Unit, integration, and E2E tests to ensure migration reliability.\n* Documentation: Clear guides for extending to other CMSs.",
          "difficulty": "advanced",
          "id": "proj_joomla_2025_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/n5xuzOro",
          "proposal_id": "xs69HGEp",
          "short_description": "Migrating content between different CMSs like Joomla, WordPress, and Drupal is challenging due to their distinct data structures. Traditional...",
          "slug": "content-migration-between-cmss-using-ccm-mde",
          "status": "in-progress",
          "student_name": "Reem Atalah",
          "student_profile": null,
          "tags": [
            "api",
            "ml",
            "ai",
            "ui"
          ],
          "title": "Content Migration Between CMSs Using CCM & MDE"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2025/organizations/joomla"
    }
  },
  "first_time": false,
  "contact": {
    "email": "gsoc@joomla.org",
    "guide_url": "https://docs.joomla.org/GSoC_2025",
    "ideas_url": "https://docs.joomla.org/GSoC_2025_Project_Ideas",
    "irc_channel": "https://joomlacommunity.cloud.mattermost.com/main/channels/gsoc-2025",
    "mailing_list": "https://forms.gle/BN9b3teutzxPetP29"
  },
  "social": {
    "blog": "https://community.joomla.org/",
    "discord": null,
    "facebook": null,
    "github": null,
    "gitlab": null,
    "instagram": null,
    "linkedin": null,
    "mastodon": null,
    "medium": null,
    "reddit": null,
    "slack": null,
    "stackoverflow": null,
    "twitch": null,
    "twitter": "https://twitter.com/joomla",
    "youtube": null
  },
  "meta": {
    "version": 1,
    "generated_at": "2026-01-25T15:28:53.305Z"
  }
}