{
  "id": "692251d853dd9d7326d33dee",
  "slug": "json-schema",
  "name": "JSON Schema",
  "category": "Data",
  "description": "We enable the reliable use of JSON data format.",
  "image_url": "https://summerofcode.withgoogle.com/media/org/json-schema/d3qfjxegxnlrfysi.png",
  "img_r2_url": "https://pub-268c3a1efc8b4f8a99115507a760ca14.r2.dev/json-schema.webp",
  "logo_r2_url": null,
  "url": "https://json-schema.org/",
  "active_years": [
    2024,
    2025
  ],
  "first_year": 2024,
  "last_year": 2025,
  "is_currently_active": true,
  "technologies": [
    "python",
    "javascript",
    "typescript",
    ".net",
    "JSON Schema"
  ],
  "topics": [
    "web",
    "apis",
    "standards",
    "data validation",
    "developer tooling"
  ],
  "total_projects": 14,
  "stats": {
    "avg_projects_per_appeared_year": 7,
    "projects_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": null,
      "year_2019": null,
      "year_2020": null,
      "year_2021": null,
      "year_2022": null,
      "year_2023": null,
      "year_2024": 8,
      "year_2025": 6
    },
    "students_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": null,
      "year_2019": null,
      "year_2020": null,
      "year_2021": null,
      "year_2022": null,
      "year_2023": null,
      "year_2024": 8,
      "year_2025": 6
    },
    "total_students": 14
  },
  "years": {
    "year_2016": null,
    "year_2017": null,
    "year_2018": null,
    "year_2019": null,
    "year_2020": null,
    "year_2021": null,
    "year_2022": null,
    "year_2023": null,
    "year_2024": {
      "num_projects": 8,
      "projects": [
        {
          "code_url": "https://github.com/JeelRajodiya/GSoC24-Final-Report",
          "description": "Tour of JSON Schema is an interactive guide for beginners to learn JSON Schema through examples and hands-on exercises. The project intends to help new users learn quickly and easily by taking them through step-by-step lessons on JSON Schema concepts and best practices. The platform has a simple interface and a built-in code editor, so users can learn by doing. Users will work with practical examples, validate their JSON Schema, and get feedback right away. By following carefully designed lessons and tasks, users will feel more confident in creating schemas.",
          "difficulty": "beginner",
          "id": "proj_json-schema_2024_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/zUHIbtvx/",
          "proposal_id": null,
          "short_description": "Tour of JSON Schema is an interactive guide for beginners to learn JSON Schema through examples and hands-on exercises. The project intends to help...",
          "slug": "a-tour-of-json-schema",
          "status": "completed",
          "student_name": "Zeel_Rajodiya",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "A Tour of JSON Schema"
        },
        {
          "code_url": "https://github.com/json-schema-org/upgrade-downgrade-rules",
          "description": "The goal of this GSOC program is to solve the problem of upgrading/downgrading JSON Schema between all the dialects using language agnostic rules so that any implementation in the future can modify and use rules accordingly. \n  The rules are meant to be declaratively stated in JSON files and format, making them simple to comprehend and apply in any programming language. Existing alter schema project supports upgrades from draft 04 to 2020-12 drafts and does not cover all the edge cases; this limitation will be taken up in GSoC revamp to implement both upgrades and downgrades between draft 0 and 2020-12 including openAPI schema too.",
          "difficulty": null,
          "id": "proj_json-schema_2024_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/OotP3B8B/",
          "proposal_id": null,
          "short_description": "The goal of this GSOC program is to solve the problem of upgrading/downgrading JSON Schema between all the dialects using language agnostic rules so...",
          "slug": "json-schema-upgradedowngrade-for-every-dialect",
          "status": "completed",
          "student_name": "Suprith KG",
          "student_profile": null,
          "tags": [
            "api"
          ],
          "title": "JSON Schema Upgrade/Downgrade for Every Dialect"
        },
        {
          "code_url": "https://gist.github.com/diyaayay/177173bc76abbac2cbb11bba5961017a",
          "description": "The Language Server Protocol (LSP) provides a way to write an IDE/editor extension that is compatible with any IDE/editor that supports the LSP. The project aims to address the limitations of the existing JSON Language server in Visual Studio Code (VSCode) by developing a comprehensive JSON Schema Language Server. Leveraging the Language Server Protocol (LSP), this project seeks to develop a Language Server Extension enhancing support for JSON Schema across a variety of platforms. The envisioned solution will fill the gaps in the current VSCode built-in server by introducing essential features such as schema linting, validation, JSON validation against a schema, and JSON linting based on schema. By packaging the language server as a .vsix file, it will be easily distributable and installable, facilitating widespread adoption among developers. Furthermore, the project includes the implementation of a robust automated testing system to ensure the reliability and quality of the language server, complemented by manual testing in both VSCode and Neovim environments to guarantee compatibility and usability.",
          "difficulty": null,
          "id": "proj_json-schema_2024_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/glRQNEok/",
          "proposal_id": null,
          "short_description": "The Language Server Protocol (LSP) provides a way to write an IDE/editor extension that is compatible with any IDE/editor that supports the LSP. The...",
          "slug": "json-schema-language-server-contributions",
          "status": "completed",
          "student_name": "Diya Solanki",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "JSON Schema Language Server Contributions"
        },
        {
          "code_url": "https://gist.github.com/adwait-godbole/14c58ac5db7d392de00bc74b828406ee",
          "description": "The JSON Schema test suite is a collection of JSON schemas, instances (data) and expected validation results -- meaning information about what result an implementation of JSON Schema is expected to produce. These \"known correct results\" are used by a huge number of implementations of JSON Schema in order to ensure they behave correctly under the JSON Schema specification. My proposal involves enhancing the functionality of Bowtie, a tool designed for comparing results from running the JSON Schema test suite across various implementations. Currently, Bowtie generates reports indicating test pass or fail rates for each implementation. The objective is to develop a feature that tracks how these results evolve over time due to bug fixes, new test additions, etc. This involves creating a new 'bowtie trend' command to aggregate and analyze results, enabling users to visualize trends in compliance numbers over time. By integrating this feature into the Bowtie website, users will be able to access graphical representations of failed tests over different time periods.\n\nDeliverables and plan:\n\nDevelopment of a new 'bowtie trend' command for aggregating and analyzing compliance results over time.\n\nIntegration of trend analysis into the Bowtie website to generate graphs illustrating changes in test outcomes.",
          "difficulty": null,
          "id": "proj_json-schema_2024_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/uyfrHnuP/",
          "proposal_id": null,
          "short_description": "The JSON Schema test suite is a collection of JSON schemas, instances (data) and expected validation results -- meaning information about what result...",
          "slug": "bowtie-trend-long-term-reporting-with-bowtie",
          "status": "completed",
          "student_name": "Adwait Godbole",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "ui"
          ],
          "title": "bowtie-trend - Long-Term Reporting With Bowtie"
        },
        {
          "code_url": "https://github.com/aialok/GSoC24-JSON-Schema-Final-Report",
          "description": "The project aims to enhance the current CI/CD workflow of the JSON Schema website, which currently operates with a basic setup, presenting limitations in securely integrating new features. The goal is to enable secure and efficient integration of new features by stabilizing, enhancing, and creating new workflows to ensure consistency and security.\n\nInitially, The focus will be on stabilizing and enhancing existing workflows while also introducing new ones. This will lay the foundation for a more robust and secure development process.\n\nIn the second phase, I will be implementing a comprehensive testing mechanism to facilitate the smooth integration of new features. This mechanism will help identify bugs and issues easily, ensure the project meets quality standards, and streamline the development process further.",
          "difficulty": null,
          "id": "proj_json-schema_2024_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/izshFtex/",
          "proposal_id": null,
          "short_description": "The project aims to enhance the current CI/CD workflow of the JSON Schema website, which currently operates with a basic setup, presenting...",
          "slug": "setting-up-the-cicd-pipeline-and-testing-for-the-json-schema-website",
          "status": "completed",
          "student_name": "Alok Gupta",
          "student_profile": null,
          "tags": [
            "web",
            "ml",
            "ai"
          ],
          "title": "Setting up the CI/CD Pipeline and Testing for the JSON Schema website"
        },
        {
          "code_url": "https://gist.github.com/DarhkVoyd/1c1c11a8e573d60178eca89902d62b2a",
          "description": "Building the JSON Schema Tooling View to improve both its design and functionality. The project involved a full transformation, making the view more dynamic and data-driven. Enhancements include advanced filtering options, better navigation, and a new data model. Key features now include integration with Bowtie for benchmarking, and tracking mechanisms to gather insights on user interactions and trends. This redesign aims to improve user experience, encourage wider adoption, and provide actionable metrics while respecting user privacy.",
          "difficulty": "advanced",
          "id": "proj_json-schema_2024_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/vHktheam/",
          "proposal_id": null,
          "short_description": "Building the JSON Schema Tooling View to improve both its design and functionality. The project involved a full transformation, making the view more...",
          "slug": "build-data-driven-tooling-view",
          "status": "completed",
          "student_name": "D V",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Build Data-Driven Tooling View"
        },
        {
          "code_url": "https://gist.github.com/pranayjoshi/887aba911ef70d15bc3f7dd61d020012",
          "description": "Creating a source generator for Corvus.JsonSchema, which adds the code produced by the tool to the user's source so that it can be compiled. By leveraging JSON Schema as a unified source of truth for data modelling, teams can generate code for their respective data models while adhering to a standardised data structure defined by JSON Schema.",
          "difficulty": null,
          "id": "proj_json-schema_2024_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/JBmyddo1/",
          "proposal_id": null,
          "short_description": "Creating a source generator for Corvus.JsonSchema, which adds the code produced by the tool to the user's source so that it can be compiled. By...",
          "slug": "source-generation-analyzer-powered-by-corvusjsonschema",
          "status": "completed",
          "student_name": "Pranay Joshi",
          "student_profile": null,
          "tags": [],
          "title": "Source Generation Analyzer Powered by Corvus.JsonSchema"
        },
        {
          "code_url": "https://gist.github.com/sudo-jarvis/c0c43fc283741716d646b87833498266",
          "description": "Bowtie is a meta-validator of the JSON Schema specification, giving users a way to use and compare implementations supported. Bowtie currently only supports validating instances against a given JSON Schema using the specified implementation and comparing implementations to one another on the basis of how correct an implementation is wrt the JSON Schema specification. This project primarily focuses on creating a performance tester for implementations and integrating it within Bowtie itself. This would allow implementations to be performance tested and also the comparison b/w the performance of implementations enabling performance optimisation of the various implementations giving users another dimension to compare different implementations on.",
          "difficulty": null,
          "id": "proj_json-schema_2024_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/uJvbPIIF/",
          "proposal_id": null,
          "short_description": "Bowtie is a meta-validator of the JSON Schema specification, giving users a way to use and compare implementations supported. Bowtie currently only...",
          "slug": "bowtie-perf-a-performance-tester-for-json-schema-implementations",
          "status": "completed",
          "student_name": "DhruvSingh",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "bowtie-perf: a Performance Tester for JSON Schema Implementations"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2024/organizations/json-schema/"
    },
    "year_2025": {
      "num_projects": 6,
      "projects": [
        {
          "code_url": null,
          "description": "JSON Schema validation errors are often cryptic and difficult to understand, making debugging frustrating for developers and end users.\nThis project aims to develop a JavaScript library that transforms raw JSON Schema validation outputs into clear, concise, and human-friendly error messages. It will maintain compatibility with the standard format while improving error readability, supporting multiple languages, and allowing customization.\nBy the end of the project, developers using standard-compliant JSON Schema validators will have access to a high-quality, user-centric Better JSON Schema errors—enhancing the developer experience and making debugging more intuitive for end users.",
          "difficulty": null,
          "id": "proj_json-schema_2025_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/eXZE2zjL",
          "proposal_id": "EC0DvpWX",
          "short_description": "JSON Schema validation errors are often cryptic and difficult to understand, making debugging frustrating for developers and end users. This project...",
          "slug": "better-json-schema-errors",
          "status": "in-progress",
          "student_name": "Arpit Kuriyal",
          "student_profile": null,
          "tags": [
            "java",
            "javascript",
            "ai",
            "ui"
          ],
          "title": "Better JSON Schema Errors"
        },
        {
          "code_url": null,
          "description": "The JSON Schema website currently relies on custom-developed UI components, which increases maintenance overhead and complicates updates. This project aims to modernize the site's design and functionality by integrating a modern UI component library (e.g., ShadCN/UI) and refactoring existing components into a modular, consistent system. By replacing legacy components and standardizing interactive elements, layout, navigation, and markdown processing, the project will enhance maintainability and provide a more cohesive user experience. Key deliverables include a fully themed UI library setup, refactored interactive and content components, an updated layout and navigation system with dark mode support, a modular markdown system, comprehensive documentation for future component integrations, and a post-project review to identify further enhancements.\n\nA core part of this effort is overhauling the site’s Markdown processing. We will split the monolithic StyledMarkdown.tsx into focused sub-components such as tables, tab groups, and a dynamic table-of-contents generator and replace custom overrides with UI-library equivalents.",
          "difficulty": null,
          "id": "proj_json-schema_2025_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/zBCXfgVo",
          "proposal_id": "DazBWcvn",
          "short_description": "The JSON Schema website currently relies on custom-developed UI components, which increases maintenance overhead and complicates updates. This...",
          "slug": "adaption-of-component-library-in-json-schema-website",
          "status": "in-progress",
          "student_name": "Idan levi",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "ui"
          ],
          "title": "Adaption of component library in JSON Schema website"
        },
        {
          "code_url": null,
          "description": "Understanding the relationships between JSON Schema properties, especially in cases of nested objects and complex structures, is crucial for learning and usability. However, new users often struggle to grasp the structure of JSON Schema effectively.\n    This project aims to visualize JSON Schema relationships using a graphical representation powered by Cytoscape.js, which is widely known for its predefined graph-based structures. For validation, we use AJV, a popular tool for JSON Schema validation, ensuring compliance with all JSON Schema dialects. The frontend is built with React.js, and no backend is required.\n    The primary focus of this project is to validate JSON Schema with strict compliance and visualize its structure accordingly. For future enhancements, we plan to integrate Monaco Editor for real-time schema editing, Tippy.js for interactive tooltips, and a dark mode for better accessibility—if time permits.",
          "difficulty": "advanced",
          "id": "proj_json-schema_2025_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/oelB8kma",
          "proposal_id": "ATI3eY5H",
          "short_description": "Understanding the relationships between JSON Schema properties, especially in cases of nested objects and complex structures, is crucial for learning...",
          "slug": "interactive-visualization-tool-for-json-schema",
          "status": "in-progress",
          "student_name": "Jagpreet Singh Rahi",
          "student_profile": null,
          "tags": [
            "react",
            "ai",
            "ui",
            "frontend",
            "backend"
          ],
          "title": "Interactive Visualization Tool For JSON Schema"
        },
        {
          "code_url": null,
          "description": "The project aims to improve the JSON Schema Linting by focusing on defining,\nstandardizing rules after reaching consensus on the anti-patterns and best practices\nacross dialects. The goal is to publish each rule with a stable URL, allowing any linter to\nlink to them when reporting failures on the JSON Schema website. Additionally, the\nproject will involve the implementation of these linting rules by extending the\nSourcemeta JSON Schema CLI and other tooling.\nBy building a comprehensive and scalable linting framework, we aim to provide developers with a clear, consistent set of rules that can be universally applied across JSON Schema projects. This will not only improve the overall quality and reliability of schemas but will also help developers adhere more closely to best practices and avoid common mistakes. With the implementation of standardized rules, the linting process will be automated and easily applicable at scale, making it easier for developers to ensure their schemas are error-free and production-ready.",
          "difficulty": null,
          "id": "proj_json-schema_2025_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/PjLfP7ZH",
          "proposal_id": "ZfKbEMNv",
          "short_description": "The project aims to improve the JSON Schema Linting by focusing on defining, standardizing rules after reaching consensus on the anti-patterns and...",
          "slug": "comprehensive-json-schema-linting-for-encouraging-best-practices-and-catching-anti-patterns-early",
          "status": "in-progress",
          "student_name": "Karan Palan",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "ui"
          ],
          "title": "Comprehensive JSON Schema linting for encouraging best practices and catching anti-patterns early"
        },
        {
          "code_url": null,
          "description": "The goal of this project is to build a Java wrapper for the sourcemeta/blaze library, a high-performance JSON Schema validator written in C++. Currently, Java developers cannot directly leverage Blaze's capabilities due to the language barrier.\n\nTo solve this, I will develop a Java wrapper using the Foreign Function & Memory (FFM) API, eliminating the need for traditional JNI. This approach offers better performance, improved safety, easier maintainability, and is more aligned with modern Java (Java 21+).\n\nDeliverables include:\n- A production-ready Java wrapper using FFM to interface with Blaze.\n- Java-friendly APIs with minimal overhead and easy integration.\n- Complete documentation, usage examples, and sample applications.\n- CI/CD workflows using GitHub Actions for cross-platform build and test automation.\n- Publishing the library to Maven Central for wider adoption.\n\nThis wrapper will enable Java developers to perform fast, standards-compliant JSON schema validation using Blaze, all while staying within the Java ecosystem.",
          "difficulty": "beginner",
          "id": "proj_json-schema_2025_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/c0uj8ubZ",
          "proposal_id": "D9xIs6Wp",
          "short_description": "The goal of this project is to build a Java wrapper for the sourcemeta/blaze library, a high-performance JSON Schema validator written in C++....",
          "slug": "build-a-java-wrapper-library-for-sourcemetablaze",
          "status": "in-progress",
          "student_name": "Madhav Dhatrak",
          "student_profile": null,
          "tags": [
            "java",
            "api",
            "ai",
            "ui"
          ],
          "title": "Build a Java wrapper library for sourcemeta/blaze"
        },
        {
          "code_url": null,
          "description": "The Simple Automated Badge Issuance System is designed to automate the process of issuing digital badges to users who complete the JSON Schema Tour. The utilizes\nGoogle Sheets for collecting user data and integrates with Badgr, a platform for\nmanaging digital badges. The objective is to create a lightweight, reliable, and\neasy-to-maintain solution that eliminates manual intervention while ensuring scalability.\nThe project involves developing a script that interacts with Google Sheets to fetch user completion data, communicates with the Badgr API to issue badges, and incorporates proper error handling and logging mechanisms. Cloudflare Workers or an alternative hosting solution will be explored to ensure efficient and  execution of the automation process. The final deliverable will include an open-source  on\nGitHub, complete with clear documentation to enable others to use and adapt the\nsystem",
          "difficulty": "beginner",
          "id": "proj_json-schema_2025_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/rdzjkCcT",
          "proposal_id": "zCoTyQUC",
          "short_description": "The Simple Automated Badge Issuance System is designed to automate the process of issuing digital badges to users who complete the JSON Schema Tour....",
          "slug": "automated-badge-issuance-system",
          "status": "in-progress",
          "student_name": "Prasanth S7",
          "student_profile": null,
          "tags": [
            "api",
            "ai",
            "cloud",
            "ui"
          ],
          "title": "Automated Badge Issuance System"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2025/organizations/json-schema"
    }
  },
  "first_time": false,
  "contact": {
    "email": "info@json-schema.org",
    "guide_url": "https://github.com/json-schema-org/community/blob/main/programs/mentoring/gsoc/CONTRIBUTOR-GUIDANCE.md",
    "ideas_url": "https://github.com/json-schema-org/community/blob/main/programs/mentoring/gsoc/gsoc-2025.md",
    "irc_channel": "https://json-schema.org/slack",
    "mailing_list": null
  },
  "social": {
    "blog": null,
    "discord": null,
    "facebook": null,
    "github": null,
    "gitlab": null,
    "instagram": null,
    "linkedin": null,
    "mastodon": null,
    "medium": null,
    "reddit": null,
    "slack": null,
    "stackoverflow": null,
    "twitch": null,
    "twitter": "https://twitter.com/jsonschema",
    "youtube": null
  },
  "meta": {
    "version": 1,
    "generated_at": "2026-01-25T15:28:53.291Z"
  }
}