{
  "id": "692251d953dd9d7326d33dfc",
  "slug": "keploy",
  "name": "Keploy",
  "category": "Programming languages",
  "description": "Unit, API test generation agent using AI & EBPF",
  "image_url": "https://summerofcode.withgoogle.com/media/org/keploy/txoec8qr8fyegtmv-360.png",
  "img_r2_url": "https://pub-268c3a1efc8b4f8a99115507a760ca14.r2.dev/keploy.webp",
  "logo_r2_url": null,
  "url": "https://keploy.io",
  "active_years": [
    2023,
    2024,
    2025
  ],
  "first_year": 2023,
  "last_year": 2025,
  "is_currently_active": true,
  "technologies": [
    "java",
    "golang",
    "node.js",
    "MERN",
    "epbf",
    "python",
    "ai"
  ],
  "topics": [
    "API Testing",
    "No code platform",
    "Dev Tool",
    "Functional Testing",
    "Mock and Stubs Generation",
    "AI/ML",
    "AI Testing Agent"
  ],
  "total_projects": 11,
  "stats": {
    "avg_projects_per_appeared_year": 3.67,
    "projects_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": null,
      "year_2019": null,
      "year_2020": null,
      "year_2021": null,
      "year_2022": null,
      "year_2023": 2,
      "year_2024": 3,
      "year_2025": 6
    },
    "students_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": null,
      "year_2019": null,
      "year_2020": null,
      "year_2021": null,
      "year_2022": null,
      "year_2023": 2,
      "year_2024": 3,
      "year_2025": 6
    },
    "total_students": 11
  },
  "years": {
    "year_2016": null,
    "year_2017": null,
    "year_2018": null,
    "year_2019": null,
    "year_2020": null,
    "year_2021": null,
    "year_2022": null,
    "year_2023": {
      "num_projects": 2,
      "projects": [
        {
          "code_url": "https://gist.github.com/Hermione2408/5ab360ca77c28ef6a38ad5a45316b755",
          "description": "My goal is to enhance the Keploy Typescript SDK's versatility and accommodate a wider range of developers and use cases. I aim to make it more flexible, allowing for easier future integration of additional technologies/databases by creating reusable code blocks.\n\nMajor deliverables:\n  1. Add support for Httpclients in TypeScript \n  2. Add support for popular SQL databases using Sequelize\n  3. Add support for MongoDB database\n  4. Add support for cloud storage services\n  5. Add support for Redis and Elasticsearch\n  6. Sample Project: Include a sample application that will contain all the above integrations in the Sample-Typescript repo for seamless testing of each implementation.",
          "difficulty": null,
          "id": "proj_keploy_2023_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/ESka3AAp",
          "proposal_id": "GODtc7bn",
          "short_description": "My goal is to enhance the Keploy Typescript SDK's versatility and accommodate a wider range of developers and use cases. I aim to make it more...",
          "slug": "keploy-typescriptjavascript-sdk",
          "status": "completed",
          "student_name": "Hermione Dadheech",
          "student_profile": null,
          "tags": [
            "java",
            "javascript",
            "typescript",
            "ml",
            "ai"
          ],
          "title": "Keploy Typescript/Javascript SDK"
        },
        {
          "code_url": "https://github.com/aerowisca/GSoC-2023-Report/blob/main/GSoC_2023_Report.md",
          "description": "This project aims to improve Keploy CLI workflow to make the user experience smooth. Since the UI has been deprecated, we need to make sure that the CLI is fully functional and easy to scale and modify in the upcoming years. For that, we need to have a stable API with the correct design decisions, since backwards compatibility for big projects is a must.\n\nThe secondary goal of this project is to make the developer experience smooth as well. Keploy works, but the code is all over the place, unit test logic is embedded with actual code, there are lots of internal context on functions that should be better documented, etc.\n\nThe last goal is to make it easy for the maintainers of the project to accept contributions from outsiders. Currently, one of the maintainers needs to manually test the changes locally to ensure that no regression has been caused. We need to automate this process, requiring stricter unit tests (which would only be feasible for newcomers if we have the framework in place).",
          "difficulty": "beginner",
          "id": "proj_keploy_2023_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/m3NRu5wa",
          "proposal_id": "BlmlfoAf",
          "short_description": "This project aims to improve Keploy CLI workflow to make the user experience smooth. Since the UI has been deprecated, we need to make sure that the...",
          "slug": "keploy-cli-refactoring",
          "status": "completed",
          "student_name": "Mahfooz Alam",
          "student_profile": null,
          "tags": [
            "api",
            "ai",
            "ui"
          ],
          "title": "Keploy CLI Refactoring"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2023/organizations/keploy"
    },
    "year_2024": {
      "num_projects": 3,
      "projects": [
        {
          "code_url": "https://gist.github.com/Akash-Singh04/9aa25a2bef7121a78dc80dc4cc5f5d20",
          "description": "The absence of a concrete platform to integrate Keploy to the developer environment, which is an extreme necessity for a testing tool meant to work alongside other testing frameworks in larger projects necessitates the development of cross platform extensions for Keploy to enhance the developer experience and allow ease of integration of Keploy in a development environment.\n\nThis project aims to address the growing need for enhanced usability, accessibility, and seamless integration of Keploy within modern development environments. By developing extensions for popular Integrated Development Environments (IDEs) such as Visual Studio Code (VS Code) and IntelliJ IDEA. This initiative seeks to streamline the process of testing applications throughout the Software Development Life Cycle (SDLC), whilst establishing secure pipelines for Continuous Integration, Testing, and Deployment of these extensions.",
          "difficulty": null,
          "id": "proj_keploy_2024_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/XKj0YXC7/",
          "proposal_id": null,
          "short_description": "The absence of a concrete platform to integrate Keploy to the developer environment, which is an extreme necessity for a testing tool meant to work...",
          "slug": "cross-platform-extensions-keploy-ide-integration",
          "status": "completed",
          "student_name": "Akash_Singh04",
          "student_profile": null,
          "tags": [
            "ml",
            "ai"
          ],
          "title": "Cross Platform Extensions : Keploy IDE Integration"
        },
        {
          "code_url": "https://github.com/Aditya-eddy/GSOC_REPORT/blob/master/Gsoc_2024_report.md",
          "description": "Writing unit test cases can be challenging and sometimes not an efficient process. Keploy creates backend API tests with built-in-mocks or stubs by recording your application network calls making your testing process not only faster than unit tests but also incredibly efficient.This project aims to develop a console with keploy which will allow user to have hands on experience with keploy.Capturing the test-cases , replaying the captured test-cases and testing with your favourite library is allowed in the console using keploy. Also Interactive guide will be provided to the user distributed in different parts so that the user can follow through the process easily. Additionaly there will be web-stories so that the user get acquainted with the latest news about Keploy.",
          "difficulty": null,
          "id": "proj_keploy_2024_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/65M3jBMd/",
          "proposal_id": null,
          "short_description": "Writing unit test cases can be challenging and sometimes not an efficient process. Keploy creates backend API tests with built-in-mocks or stubs by...",
          "slug": "implementing-a-react-ui-console-for-test-generation-demonstration",
          "status": "completed",
          "student_name": "Aditya-eddy",
          "student_profile": null,
          "tags": [
            "react",
            "web",
            "api",
            "ai",
            "ui"
          ],
          "title": "Implementing a React UI Console for Test Generation demonstration"
        },
        {
          "code_url": "https://github.com/AhmedLotfy02/My-GSoC-Journey",
          "description": "-Integration of Contract Testing into Keploy,  \n-Implement functionality within Keploy for recording tests and mocks for all related microservices simultaneously. This feature would capture both ingress and egress traffic, utilizing process identification (PID) for filtering. The primary goal is to ensure that tests and mocks remain synchronized across all services, thereby maintaining consistency and accuracy in testing environments.\n-Automated Change Management for API Chains\n-In Keploy, testing multiple services via API chaining emphasizes enabling contract testing to ensure seamless interactions among services. This ensures that all communications across services meet predefined expectations, enhancing the reliability of interconnected systems.\n-Contract testing is a method focused on verifying interactions between microservices, applications, or systems, ensuring correct communication through predefined contracts. It facilitates early issue identification and reduces complex end-to-end testing needs.",
          "difficulty": "advanced",
          "id": "proj_keploy_2024_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/AaKiskqW/",
          "proposal_id": null,
          "short_description": "-Integration of Contract Testing into Keploy, -Implement functionality within Keploy for recording tests and mocks for all related microservices...",
          "slug": "multiple-services-using-keploy-api-chaining",
          "status": "completed",
          "student_name": "Ahmed Lotfy",
          "student_profile": null,
          "tags": [
            "api",
            "ml",
            "ai"
          ],
          "title": "Multiple services using keploy (API chaining)"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2024/organizations/keploy/"
    },
    "year_2025": {
      "num_projects": 6,
      "projects": [
        {
          "code_url": null,
          "description": "Keploy currently needs an automated way to detect idempotency violations and handle noisy fields in test cases. This leads to inconsistencies in test results and potential flaky tests, making it difficult for users to validate API behavior reliably.\n\nThe solution introduces an idempotency request replayer that verifies if an API request produces consistent responses across multiple replays. It also implements noise detection and configuration mechanisms to identify and manage dynamic fields that can cause flaky tests.",
          "difficulty": null,
          "id": "proj_keploy_2025_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/BzgWKdu5",
          "proposal_id": "E7zRuZHf",
          "short_description": "Keploy currently needs an automated way to detect idempotency violations and handle noisy fields in test cases. This leads to inconsistencies in test...",
          "slug": "testsuite-idempotency-checker",
          "status": "in-progress",
          "student_name": "Ahmed Mamdouh",
          "student_profile": null,
          "tags": [
            "api",
            "ui"
          ],
          "title": "TestSuite Idempotency Checker"
        },
        {
          "code_url": null,
          "description": "The project aims to develop an intelligent code review agent that integrates with GitHub and other version control systems (VCS). This tool will provide automated, insightful feedback on code quality by combining traditional static analysis with AI-powered insights.\n\nProblem Being Solved\nCode reviews are often time-consuming and inconsistent, especially when identifying complex issues such as security vulnerabilities, performance bottlenecks, and maintainability concerns. This project addresses these challenges by automating the review process while providing actionable, contextual feedback.\n\nProposed Solution\nThe solution employs a modular webhook-based architecture with the following components:\n1. A webhook receiver to capture GitHub events (e.g., pull request creations/updates).\n2. A code fetcher to retrieve and parse changed files.\n3. An orchestrator to coordinate multiple analysis tools.\n4. A result aggregator to combine findings and remove duplicates.\n5. A response handler to post intelligent comments directly on pull requests.\n\nKey Deliverables\n1. A system that provides actionable, contextual feedback rather than merely flagging issues.\n2. Support for multiple programming languages (initially Go, JavaScript, and Python).\n3. Implementation of dependency vulnerability detection.\n4. An AI-powered layer to enhance basic linter outputs.\n5. Extensibility for future language support and additional features.",
          "difficulty": "advanced",
          "id": "proj_keploy_2025_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/lViOdKco",
          "proposal_id": "ZNHpOyPt",
          "short_description": "The project aims to develop an intelligent code review agent that integrates with GitHub and other version control systems (VCS). This tool will...",
          "slug": "ai-powered-open-source-code-review-agent-using-any-cicd-workflow",
          "status": "in-progress",
          "student_name": "Gaurav ( euclid )",
          "student_profile": null,
          "tags": [
            "python",
            "java",
            "javascript",
            "web",
            "ai"
          ],
          "title": "AI-Powered Open-Source Code Review Agent (Using any CI/CD workflow)"
        },
        {
          "code_url": null,
          "description": "The project tackles inefficiencies in API contract testing for microservices, focusing on schema management, validation, and consistency across distributed systems, which often cause bugs and delays due to fragmented schemas and poor versioning. I propose enhancing Keploy’s contract testing by implementing local schema storage as a mock registry, unifying schemas into a single service contract, adding advanced comparison with dependency resolution and real-time validation, and introducing provider-driven testing with contract publishing and rollback capabilities. My solution builds on a Go-based prototype, utilizing tools like Cobra, YAML, and Docker, with extensibility to S3. Deliverables include an integrated CLI with versioning and multi-format support, schema merging with diffing and real-time validation, and a provider-driven testing framework with rollback, all supported by comprehensive documentation and tests. This will streamline microservice interactions, ensuring scalability and consistency for developers.",
          "difficulty": "advanced",
          "id": "proj_keploy_2025_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/xqiYOsI7",
          "proposal_id": "XkVHtju5",
          "short_description": "The project tackles inefficiencies in API contract testing for microservices, focusing on schema management, validation, and consistency across...",
          "slug": "api-contract-matching-adding-features-and-platform-support",
          "status": "in-progress",
          "student_name": "Harsh Vashishtha Sharma",
          "student_profile": null,
          "tags": [
            "api",
            "ml",
            "docker",
            "ui"
          ],
          "title": "API contract matching - Adding Features and Platform support"
        },
        {
          "code_url": null,
          "description": "Keploy - OSS Code Indexer for Efficient Retrieval. (Project-2)\n\nProblem solved - Current AI models struggle to generate high-quality Unit Tests for large codebases without a deep, structured understanding of the source code.\n\nSolution Plan- \n1. I implemented code parsing using tree-sitter to create semantic chunks, preserving essential context.\n2. Then generating embeddings for these chunks with Gemini, openAI, huggigface and store them in a Milvus vector database.\n3. I'm utilizing HNSW indexing within Milvus for efficient semantic similarity search.\n4. Then I have extracted code relationships (function calls, class inheritance etc.) and store them as a knowledge graph in Neo4j.\n5. Embeddings are generated with Gemini :- https://huggingface.co/spaces/mteb/leaderboard\n6. I have developed a dynamic indexing mechanism (using file watching/Git hooks, potentially enhanced by Difftastic) to keep both Milvus and Neo4j synchronized with code changes.\n7. Then I build a hybrid retrieval system querying both Milvus (for semantic relevance) and Neo4j (for structural context).\n8. Then I integrated this combined context into Keploy's existing Unit Test Generation (UTG) workflow, feeding it to the Gemini API for test creation.\n9.  Then I need further suggestion to implement an LLM-as-a-judge component to evaluate the generated tests.\n\nDeliverables:- A robust GraphRAG system integrated into Keploy. This includes codebase indexing (vector embeddings in Milvus, structural graph in Neo4j), dynamic index updates, hybrid context retrieval, and integration with the Gemini, leading to substantially improved Unit Test Generation quality and relevance for users with large or complex codebases.\n\nThanks.\nRegards\nSparsh.",
          "difficulty": "advanced",
          "id": "proj_keploy_2025_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/wIsioRXL",
          "proposal_id": "HsWu1rF1",
          "short_description": "Keploy - OSS Code Indexer for Efficient Retrieval. (Project-2) Problem solved - Current AI models struggle to generate high-quality Unit Tests for...",
          "slug": "oss-code-indexer-for-efficient-retrieval",
          "status": "in-progress",
          "student_name": "Sparshh",
          "student_profile": null,
          "tags": [
            "api",
            "ai",
            "database",
            "ui"
          ],
          "title": "OSS Code Indexer for Efficient Retrieval"
        },
        {
          "code_url": null,
          "description": "Building upon a comprehensive Proof of Concept (POC) [https://poc-frontend-beta.vercel.app/] developed before the GSoC application, this proposal aims to transform the existing prototype into a robust, open-source dashboard solution for Keploy. The project will leverage the foundation of the POC repositories (Backend: github.com/Swapnendu003/poc-backend, Frontend: github.com/Swapnendu003/poc-frontend) to create a comprehensive platform that transforms complex software development metrics into intuitive, customizable visualizations. By developing a modular, real-time dashboard with advanced widget systems, intelligent data processing, and flexible template configurations, the project will empower development teams to gain unprecedented insights into their code merge and test activities. Utilizing Next.js, Go, and modern web technologies, the dashboard will provide a scalable, extensible tool that adapts to diverse project needs, offering real-time updates, in-depth analytics, and a user-friendly interface for tracking and analyzing software development performance.",
          "difficulty": "advanced",
          "id": "proj_keploy_2025_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/4QMWwr8y",
          "proposal_id": "OGQdqSf9",
          "short_description": "Building upon a comprehensive Proof of Concept (POC) [https://poc-frontend-beta.vercel.app/] developed before the GSoC application, this proposal...",
          "slug": "keploy-dashboard-modular-metrics-visualization-platform",
          "status": "in-progress",
          "student_name": "Swapnendu Banerjee",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "ui",
            "frontend",
            "backend"
          ],
          "title": "Keploy Dashboard - Modular Metrics Visualization Platform"
        },
        {
          "code_url": null,
          "description": "The Keploy Blog serves as a hub for tutorials, case studies, and community updates, helping developers understand and engage with Keploy more effectively. This project focuses on enhancing the blog platform’s codebase for better performance, maintainability, and developer experience. Key goals include refactoring the codebase using modern React practices, optimizing page load times, improving accessibility, and ensuring a seamless reading experience across devices. Additionally, efforts will be made to streamline the content management process and improve developer onboarding for contributors to the blog. These improvements aim to make the Keploy's blogging platform more scalable, performant, and user-friendly—empowering both developers and readers to explore and contribute to Keploy's ecosystem.",
          "difficulty": null,
          "id": "proj_keploy_2025_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/XxAVrIBL",
          "proposal_id": "aL145jek",
          "short_description": "The Keploy Blog serves as a hub for tutorials, case studies, and community updates, helping developers understand and engage with Keploy more...",
          "slug": "improve-keploys-blogging-platform",
          "status": "in-progress",
          "student_name": "Yaten Dhingra",
          "student_profile": null,
          "tags": [
            "react",
            "ml",
            "ai"
          ],
          "title": "Improve Keploy's Blogging Platform"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2025/organizations/keploy"
    }
  },
  "first_time": false,
  "contact": {
    "email": "hello@keploy.io",
    "guide_url": "https://github.com/keploy/keploy/blob/main/CONTRIBUTING.md",
    "ideas_url": "https://github.com/keploy/gsoc/tree/main/2025",
    "irc_channel": "https://join.slack.com/t/keploy/shared_invite/zt-2poflru6f-_VAuvQfCBT8fDWv1WwSbkw",
    "mailing_list": null
  },
  "social": {
    "blog": "https://keploy.io/blog",
    "discord": null,
    "facebook": null,
    "github": null,
    "gitlab": null,
    "instagram": null,
    "linkedin": null,
    "mastodon": null,
    "medium": null,
    "reddit": null,
    "slack": "https://join.slack.com/t/keploy/shared_invite/zt-2poflru6f-_VAuvQfCBT8fDWv1WwSbkw",
    "stackoverflow": null,
    "twitch": null,
    "twitter": "https://twitter.com/Keployio",
    "youtube": null
  },
  "meta": {
    "version": 1,
    "generated_at": "2026-01-25T15:28:53.321Z"
  }
}