{
  "id": "692251da53dd9d7326d33e02",
  "slug": "kotlin-foundation",
  "name": "Kotlin Foundation",
  "category": "Programming languages",
  "description": "Advance the Kotlin programming language",
  "image_url": "https://summerofcode.withgoogle.com/media/org/kotlin-foundation/2wyghqyy8nvvl4cq-360.png",
  "img_r2_url": "https://pub-268c3a1efc8b4f8a99115507a760ca14.r2.dev/kotlin-foundation.webp",
  "logo_r2_url": null,
  "url": "https://kotlinfoundation.org/",
  "active_years": [
    2023,
    2024,
    2025
  ],
  "first_year": 2023,
  "last_year": 2025,
  "is_currently_active": true,
  "technologies": [
    "gradle",
    "kotlin",
    "jvm",
    "Parsers & Compilers",
    "Multiplatform"
  ],
  "topics": [
    "compilers",
    "programming languages",
    "software development",
    "libraries",
    "Programming & Build Tools"
  ],
  "total_projects": 16,
  "stats": {
    "avg_projects_per_appeared_year": 5.33,
    "projects_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": null,
      "year_2019": null,
      "year_2020": null,
      "year_2021": null,
      "year_2022": null,
      "year_2023": 4,
      "year_2024": 4,
      "year_2025": 8
    },
    "students_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": null,
      "year_2019": null,
      "year_2020": null,
      "year_2021": null,
      "year_2022": null,
      "year_2023": 4,
      "year_2024": 4,
      "year_2025": 8
    },
    "total_students": 16
  },
  "years": {
    "year_2016": null,
    "year_2017": null,
    "year_2018": null,
    "year_2019": null,
    "year_2020": null,
    "year_2021": null,
    "year_2022": null,
    "year_2023": {
      "num_projects": 4,
      "projects": [
        {
          "code_url": "https://github.com/buenaflor/KFlogger",
          "description": "The project aims to create a Kotlin Multiplatform Library version of Flogger, which is a popular logging library for Java. The new library will work on multiple platforms including JVM/Android, Kotlin/Native (iOS), and Kotlin/JS. The goal is to provide a commonly-needed logging tool that works across various platforms, making it easier for developers to write better and more readable logging code. The project will involve designing and delivering a Kotlin Multiplatform library, with a greater priority on JVM/Android and Kotlin/Native (iOS) than other targets. Additionally, the project includes implementing integration with Logcat on Android, providing readable documentation with examples on how to use the library, and publishing the library on Maven Central.",
          "difficulty": null,
          "id": "proj_kotlin-foundation_2023_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/O3J16iTy",
          "proposal_id": "bc1kxU4f",
          "short_description": "The project aims to create a Kotlin Multiplatform Library version of Flogger, which is a popular logging library for Java. The new library will work...",
          "slug": "kotlin-multiplatform-library-version-of-flogger",
          "status": "completed",
          "student_name": "Giancarlo Buenaflor",
          "student_profile": null,
          "tags": [
            "java",
            "android",
            "ios",
            "ai"
          ],
          "title": "Kotlin Multiplatform Library Version of Flogger"
        },
        {
          "code_url": "https://gist.github.com/wldeh/cf92dcd0550b640145732e55d883fe57",
          "description": "This proposal focuses on enhancing the kotlinx-benchmark library API and user experience, fostering community growth and collaboration in Kotlin multiplatform development. The kotlinx-benchmark library is an open-source solution for benchmarking Kotlin code across multiple platforms. Although it provides a foundational structure, it currently lacks several essential quality-of-life features that would streamline its usage.\n\nThis project aims to address these limitations by introducing fine-grained benchmark configuration options, ensuring feature parity between JVM and Kotlin/Native benchmarking, developing a command-line API, and integrating modern Gradle support. Furthermore, the project will enhance the library's documentation, integration tests, and examples to provide a comprehensive user experience.\n\nThe anticipated outcomes of this project encompass:\n- Comprehensive documentation with practical usage examples\n- A user-friendly API that simplifies the benchmarking process\n- Versatile options for benchmarking Kotlin/JVM code across various platforms\n\nTo successfully execute this project, proficiency in Kotlin and an understanding of Gradle internals are essential. By undertaking this project for Google Summer of Code, I aim to contribute significantly to the Kotlin ecosystem and promote a thriving open-source community centered around multiplatform development.",
          "difficulty": null,
          "id": "proj_kotlin-foundation_2023_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/nvBREuSR",
          "proposal_id": "5FEmLvxF",
          "short_description": "This proposal focuses on enhancing the kotlinx-benchmark library API and user experience, fostering community growth and collaboration in Kotlin...",
          "slug": "enhance-the-kotlinx-benchmark-library-api-and-user-experience",
          "status": "completed",
          "student_name": "HenokW",
          "student_profile": null,
          "tags": [
            "api",
            "ml",
            "ai"
          ],
          "title": "Enhance the kotlinx-benchmark library API and user experience"
        },
        {
          "code_url": "https://gist.github.com/D0zee/90b63a9cfd2edb7a039f111e2406f5b8",
          "description": "Project focused on improving the user experience of editing Gradle Kotlin Scripts (KTS) in Eclipse. With contributions to the Gradle Eclipse plugin, users will benefit from improved code error highlighting, code completion, and Ctrl-Click to definition functionality. By improving support for editing KTS in Eclipse, developers will be able to work more efficiently, resulting in faster and higher quality software development.",
          "difficulty": null,
          "id": "proj_kotlin-foundation_2023_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/yzuvb693",
          "proposal_id": "w8srC8TI",
          "short_description": "Project focused on improving the user experience of editing Gradle Kotlin Scripts (KTS) in Eclipse. With contributions to the Gradle Eclipse plugin,...",
          "slug": "eclipse-gradle-kts-editing",
          "status": "completed",
          "student_name": "Nikolai Vladimirov",
          "student_profile": null,
          "tags": [],
          "title": "Eclipse Gradle KTS editing"
        },
        {
          "code_url": "https://medium.com/@raehatsinghnanda/parallel-stacks-for-kotlin-coroutines-in-the-debugger-d3099eb3a9c2",
          "description": "This project is focused on enhancing the functionality of Kotlin Coroutines by developing parallel stacks for use in the debugger. The goal is to provide developers with an effective means of debugging their asynchronous and concurrent code. To achieve this objective, an IntelliJ IDEA plugin will be developed that will communicate with the Kotlin compiler during a debugging session. The plugin will be able to retrieve relevant information about coroutines at any state of the program and leverage this information to generate a parallel stacks view. This will provide developers with a comprehensive overview of the execution flow of their coroutines, allowing them to more effectively identify and resolve issues in their code. Overall, this project represents a significant advancement in the toolset available to Kotlin developers, enabling them to build more reliable and performant coroutine-based applications.",
          "difficulty": null,
          "id": "proj_kotlin-foundation_2023_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/PVTFNSvL",
          "proposal_id": "1yzGi9cy",
          "short_description": "This project is focused on enhancing the functionality of Kotlin Coroutines by developing parallel stacks for use in the debugger. The goal is to...",
          "slug": "parallel-stacks-for-kotlin-coroutines-in-the-debugger",
          "status": "completed",
          "student_name": "Raehat Singh Nanda",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Parallel stacks for Kotlin Coroutines in the debugger"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2023/organizations/kotlin-foundation"
    },
    "year_2024": {
      "num_projects": 4,
      "projects": [
        {
          "code_url": "https://community.gradle.org/events/gsoc/2024/gradle-build-server-android/",
          "description": "This project enhanced Gradle Build Server for Android development by implementing composite build support, improving Java Home handling, and providing support for Android Java projects. These enhancements significantly improve the development experience for Android developers using Text Editors/IDEs that utilize the Build Server Protocol (BSP). By bridging the gap between Android Studio and Gradle Build Server, this project contributes to a more productive development workflow. This is a start to let developers benefit from the powerful capabilities of Android Studio within their preferred development environments.",
          "difficulty": null,
          "id": "proj_kotlin-foundation_2024_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/Guphkt1v/",
          "proposal_id": null,
          "short_description": "This project enhanced Gradle Build Server for Android development by implementing composite build support, improving Java Home handling, and...",
          "slug": "gradle-build-server-adding-support-for-android-projects",
          "status": "completed",
          "student_name": "Tanish Ranjan",
          "student_profile": null,
          "tags": [
            "java",
            "android",
            "ui"
          ],
          "title": "Gradle Build Server – adding support for Android projects"
        },
        {
          "code_url": "https://gist.github.com/kx412764776/234fab4ee9c33fe004b5db2965e7f00f",
          "description": "This GSoC 2024 Kotlin project proposal aims to enable kotlinx-benchmark support for the Android platform. The project will enhance the kotlinx-benchmark library to detect and adapt to the Android runtime environment, enable existing kotlinx.benchmark functionality to run on the android platform, and allow customisation of benchmark configurations via annotations or in build.gradle. The main deliverables include an updated version of the kotlinx-benchmark library for Android, sample code, updated README documentation, and tutorials for using it on the android platform.",
          "difficulty": null,
          "id": "proj_kotlin-foundation_2024_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/d7VH8Um1/",
          "proposal_id": null,
          "short_description": "This GSoC 2024 Kotlin project proposal aims to enable kotlinx-benchmark support for the Android platform. The project will enhance the...",
          "slug": "support-android-target-in-kotlinx-benchmark",
          "status": "completed",
          "student_name": "Qizhao Chen",
          "student_profile": null,
          "tags": [
            "android",
            "ai",
            "ui"
          ],
          "title": "Support Android target in kotlinx-benchmark"
        },
        {
          "code_url": "https://github.com/Kotlin/Storytale",
          "description": "This project aims to address the challenge of testing and ensuring consistency across @Composable components in Compose Multiplatform projects. The proposed solution is to develop a Compose Multiplatform component gallery generator that allows developers to design and verify comprehensive component systems within their applications.\n\nThe deliverables for this project will include:\n\n1. A Gradle plugin: The main purpose of this Gradle plugin is to generate a runnable app showcasing the Story components written by the developer, tailored for their target platform. This plugin will facilitate the automatic generation of user interfaces for testing components.\n\n2. A Runtime Library: The Runtime Library enables developers to define the specifications of the @Composable components they want to test. This will include an annotation system to mark components as Story items, with the ability to specify component properties and target platforms.\n\nIn practice, developers can integrate this tool into their project structure, which will encompass common and platform-specific modules such as commonMain, androidMain, and desktopMain etc... our Gradle tasks will offer a streamlined process to create an app per platform to display all Story components.",
          "difficulty": null,
          "id": "proj_kotlin-foundation_2024_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/ukbrVzY3/",
          "proposal_id": null,
          "short_description": "This project aims to address the challenge of testing and ensuring consistency across @Composable components in Compose Multiplatform projects. The...",
          "slug": "compose-multiplatform-component-gallery-generator",
          "status": "completed",
          "student_name": "WhiteScent23",
          "student_profile": null,
          "tags": [
            "android",
            "ml",
            "ai"
          ],
          "title": "Compose Multiplatform component gallery generator"
        },
        {
          "code_url": "https://github.com/JetBrains/kotlin/tree/yakovlev/incremental_base",
          "description": "Incremental compilation is a technique that helps increase compilation speed by recompiling only changed files instead of your whole program (also known as performing a clean build). By the time of this project, the Kotlin/Wasm compiler supports only clean builds. This project enhances the Kotlin/Wasm compiler to support incremental compilation, thereby improving the development experience by reducing build times and increasing productivity.",
          "difficulty": null,
          "id": "proj_kotlin-foundation_2024_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/CRQfPZXS/",
          "proposal_id": null,
          "short_description": "Incremental compilation is a technique that helps increase compilation speed by recompiling only changed files instead of your whole program (also...",
          "slug": "incremental-compilation-for-the-kotlinwasm-compiler",
          "status": "completed",
          "student_name": "Osama Ahmad",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "Incremental Compilation for the Kotlin/Wasm Compiler"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2024/organizations/kotlin-foundation/"
    },
    "year_2025": {
      "num_projects": 8,
      "projects": [
        {
          "code_url": null,
          "description": "This project aims to modernize Jenkins plugin development using Gradle by updating the existing Gradle JPI plugin and introducing a new convention plugin. The primary goal is to achieve feature parity with Maven workflows, improve compliance with Jenkins hosting requirements, and enhance developer experience. Key deliverables include migrating the codebase from Groovy to Kotlin DSL, integrating Jenkins-specific tools like Plugin Compatibility Tester (PCT) and Bill of Materials (BOM), and simplifying build, test, and release processes for Jenkins plugins. This initiative will strengthen the Gradle ecosystem while improving the reliability and efficiency of Jenkins plugins.",
          "difficulty": null,
          "id": "proj_kotlin-foundation_2025_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/3ujOIGDx",
          "proposal_id": "EQxVYxe2",
          "short_description": "This project aims to modernize Jenkins plugin development using Gradle by updating the existing Gradle JPI plugin and introducing a new convention...",
          "slug": "gradle-convention-plugin-for-developing-jenkins-plugins",
          "status": "in-progress",
          "student_name": "Aarav Mahajan",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Gradle Convention Plugin for Developing Jenkins Plugins"
        },
        {
          "code_url": null,
          "description": "This project aims to build a high-performance, build-system agnostic Kotlin Language Server using the Kotlin Analysis API. The goal is to replace the unmaintained and inefficient open-source LSP with a modern implementation that supports the full LSP 3.17 spec, works across editors like VSCode and Neovim, and delivers IDE-grade language features like diagnostics, completions, and navigation without depending on kotlinc. By the end of GSoC, this project will provide Kotlin developers with a powerful alternative for writing and maintaining code outside JetBrains tooling.",
          "difficulty": null,
          "id": "proj_kotlin-foundation_2025_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/Y8cK79RJ",
          "proposal_id": "QF6Y9zyL",
          "short_description": "This project aims to build a high-performance, build-system agnostic Kotlin Language Server using the Kotlin Analysis API. The goal is to replace the...",
          "slug": "build-a-modern-compiler-integrated-kotlin-language-server",
          "status": "in-progress",
          "student_name": "Hemram",
          "student_profile": null,
          "tags": [
            "api",
            "ai",
            "ui"
          ],
          "title": "Build a Modern, Compiler-Integrated Kotlin Language Server"
        },
        {
          "code_url": null,
          "description": "Currently, setting up Kotlin Multiplatform projects in Bazel is cumbersome and error-prone. By adding a kt_multiplatform() macro, enhancing expect/actual handling, and enabling platform-specific dependency resolution through Gradle metadata, this project seeks to improve Bazel's support for Kotlin Multiplatform (KMP). Through the automation of source set management, native resolution of platform-specific dependencies within Bazel, and handling of expect/actual declarations, this work will simplify the developer experience. Deliverables include a new Bazel macro, a complete example project, comprehensive documentation, and CI-tested rules, providing a robust, user-friendly solution for building KMP projects in Bazel.",
          "difficulty": null,
          "id": "proj_kotlin-foundation_2025_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/ndgAJh0J",
          "proposal_id": "rSDK6aka",
          "short_description": "Currently, setting up Kotlin Multiplatform projects in Bazel is cumbersome and error-prone. By adding a kt_multiplatform() macro, enhancing...",
          "slug": "add-kotlin-multiplatform-support-in-bazel",
          "status": "in-progress",
          "student_name": "mruchika29",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "Add Kotlin Multiplatform support in Bazel"
        },
        {
          "code_url": null,
          "description": "This project aims to improve Gradle's build performance by enhancing Configuration Cache support and reducing resource contention in key plugins like android, kotlin, and java. The goal is to embed the Configuration Cache Report tool into Gradle Profiler to analyze cache behavior and identify areas of contention where multiple processes compete for shared resources, slowing down builds. The project will focus on optimizing cache utilization and minimizing contention, resulting in faster builds. Key deliverables include integrating the report tool, profiling Gradle plugins, implementing optimizations, and providing benchmarks comparing performance before and after improvements.",
          "difficulty": null,
          "id": "proj_kotlin-foundation_2025_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/chp2Sbei",
          "proposal_id": "tUUKJ4MO",
          "short_description": "This project aims to improve Gradle's build performance by enhancing Configuration Cache support and reducing resource contention in key plugins like...",
          "slug": "improving-configuration-cache-and-lock-contention-in-key-gradle-plugins",
          "status": "in-progress",
          "student_name": "Nouran Atef",
          "student_profile": null,
          "tags": [
            "java",
            "android",
            "ai",
            "ui"
          ],
          "title": "Improving Configuration Cache and lock contention in key  Gradle plugins"
        },
        {
          "code_url": null,
          "description": "This project aims to address the challenge of creating a seamless and efficient integration between Gemini and Vertex AI in Firebase for Android and iOS platforms using Kotlin Multiplatform (KMP). The proposed solution is to develop an open-source KMP library that will support Gemini with Vertex AI in Firebase, focusing on best practices for creating KMP libraries and ensuring robust production implementation across both Android and iOS platforms.\n\nThe deliverables for this project will include:\n1.  Kotlin Multiplatform Library: This library will provide seamless integration between Gemini and Vertex AI in Firebase, supporting Android and iOS. \n\n2.  Sample Code and Documentation: Along with the library, sample code and thorough documentation will be provided to assist developers in utilizing the library effectively for their own projects.\n\nIn practice, developers can integrate this library into their Kotlin Multiplatform applications. Our library will offer a seamless process of integrating Vertex AI into Firebase apps for both iOS and Android.",
          "difficulty": null,
          "id": "proj_kotlin-foundation_2025_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/Ow6J6ami",
          "proposal_id": "0zCXorBE",
          "short_description": "This project aims to address the challenge of creating a seamless and efficient integration between Gemini and Vertex AI in Firebase for Android and...",
          "slug": "support-android-and-ios-targets-in-kotlin-multiplatform-for-gemini-using-vertex-ai-in-firebase",
          "status": "in-progress",
          "student_name": "SeanChinJunKai",
          "student_profile": null,
          "tags": [
            "android",
            "ios",
            "ml",
            "ai"
          ],
          "title": "Support Android and iOS targets in Kotlin Multiplatform for Gemini using Vertex AI in Firebase"
        },
        {
          "code_url": null,
          "description": "As developers, we always favor tools that enhance and streamline the programming process, including plugins that provide error reporting and insights to improve the code quality. Kotlin developers using Gradle rely on tools like Detekt and Ktlint to enforce code quality. While Detekt and Ktlint offer reporting in various formats like (HTML, SARIF), their current integration with IDEs can be fragmented, requiring developers to switch contexts and manually review findings, which disrupts the coding workflow and slows down their development process. This project aims to implement a unified and actionable code quality reporting system through the integration of the recently introduced Gradle new Problems API. This API provides structured and rich information about the problems happening during a build. The information provided can be used by different interfaces such as Gradle’s console output, build scans, or IDEs to communicate any issues. With this API integration and structured format of the generated report, developers can experience faster issue identification, streamline debugging, and have improved code maintainability. This project will provide value to the Kotlin development community by upgrading the quality of their error reporting.",
          "difficulty": null,
          "id": "proj_kotlin-foundation_2025_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/4UqgKDMe",
          "proposal_id": "4Ml2E7RP",
          "short_description": "As developers, we always favor tools that enhance and streamline the programming process, including plugins that provide error reporting and insights...",
          "slug": "enhanced-kotlin-code-quality-reporting-with-gradle-problem-api-integration-with-detekt-and-ktlint",
          "status": "in-progress",
          "student_name": "Vanessa Johnson",
          "student_profile": null,
          "tags": [
            "api",
            "ml",
            "ai",
            "ui"
          ],
          "title": "Enhanced Kotlin Code Quality Reporting with Gradle Problem API: Integration with Detekt and Ktlint"
        },
        {
          "code_url": null,
          "description": "The IntelliJ Platform Gradle Plugin, the official Gradle plugin for building, testing, verifying, configuring environments, and publishing plugins for IntelliJ IDEs, includes a VerifyPluginTask that verifies a plugin against one or multiple IDEs. Currently, reporting is managed by the Verifier CLI, which employs its custom reporting system to generate verification reports; however, the VerifyPluginTask could benefit from Gradle's Reporting API for more configurable reports. Additionally, integrating Gradle's Worker API for parallel execution of the verifyPlugin task could enhance the IDE plugin development experience. The goal of this project is to assess the benefits and ultimately implement the necessary changes to the verifyPlugin task. Lastly, explore further optimizations to enhance the plugin development workflow.",
          "difficulty": null,
          "id": "proj_kotlin-foundation_2025_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/lJoAo8B7",
          "proposal_id": "9QxU9UOP",
          "short_description": "The IntelliJ Platform Gradle Plugin, the official Gradle plugin for building, testing, verifying, configuring environments, and publishing plugins...",
          "slug": "intellij-platform-gradle-plugin-gradle-reporting-and-parallel-verifications",
          "status": "in-progress",
          "student_name": "Victoria Chuks Alajemba",
          "student_profile": null,
          "tags": [
            "api",
            "ai",
            "ui"
          ],
          "title": "IntelliJ Platform Gradle Plugin – Gradle Reporting and Parallel Verifications"
        },
        {
          "code_url": null,
          "description": "The migration to Maven Central's new API instance has introduced significant changes, requiring specialized support in Gradle plugins for seamless publishing. \n\nThis project aims to develop a new Gradle plugin compatible with the updated APIs, simplifying the process with Kotlin DSL extensions and automating tasks like GPG signing and artifact packaging.\n\nDeliverables include a fully functional plugin, comprehensive documentation, and robust test coverage.",
          "difficulty": null,
          "id": "proj_kotlin-foundation_2025_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/zCRWjfpd",
          "proposal_id": "cvEIbQPz",
          "short_description": "The migration to Maven Central's new API instance has introduced significant changes, requiring specialized support in Gradle plugins for seamless...",
          "slug": "maven-central-publishing-plugin-for-gradle-with-new-apis",
          "status": "in-progress",
          "student_name": "Yongjun Hong",
          "student_profile": null,
          "tags": [
            "api",
            "ml",
            "ai",
            "ui"
          ],
          "title": "Maven Central publishing plugin for Gradle with new APIs"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2025/organizations/kotlin-foundation"
    }
  },
  "first_time": false,
  "contact": {
    "email": "gsoc@kotlinfoundation.org",
    "guide_url": "https://kotlinlang.org/docs/gsoc-overview.html",
    "ideas_url": "https://kotlinlang.org/docs/gsoc-2025.html",
    "irc_channel": "https://slack-chats.kotlinlang.org/c/gsoc",
    "mailing_list": null
  },
  "social": {
    "blog": "https://blog.jetbrains.com/kotlin/",
    "discord": null,
    "facebook": null,
    "github": null,
    "gitlab": null,
    "instagram": null,
    "linkedin": null,
    "mastodon": null,
    "medium": null,
    "reddit": null,
    "slack": null,
    "stackoverflow": null,
    "twitch": null,
    "twitter": "https://twitter.com/kotlin",
    "youtube": null
  },
  "meta": {
    "version": 1,
    "generated_at": "2026-01-25T15:28:53.337Z"
  }
}