{
  "id": "692251db53dd9d7326d33e0f",
  "slug": "liquid-galaxy-project",
  "name": "Liquid Galaxy project",
  "category": "Data",
  "description": "We code immersive and interactive apps with GEarth",
  "image_url": "https://summerofcode.withgoogle.com/media/org/liquid-galaxy-project/idbd8hebl6j7ajxn-360.png",
  "img_r2_url": "https://pub-268c3a1efc8b4f8a99115507a760ca14.r2.dev/liquid-galaxy-project.webp",
  "logo_r2_url": null,
  "url": "https://www.liquidgalaxy.eu",
  "active_years": [
    2016,
    2017,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "first_year": 2016,
  "last_year": 2025,
  "is_currently_active": true,
  "technologies": [
    "javascript",
    "ros",
    "gis",
    "cesium",
    "cesiumjs",
    "python",
    "android",
    "node.js",
    "maps api",
    "java",
    "html",
    "vue",
    "arduino",
    "machinelearning",
    "linux",
    "flutter",
    "Google Earth"
  ],
  "topics": [
    "virtual reality",
    "graphics",
    "geospatial",
    "visualisation",
    "webvr",
    "visualization",
    "data",
    "cluster",
    "geo",
    "machine learning",
    "data visualization",
    "maps",
    "linux",
    "google earth",
    "networking",
    "ux",
    "artificial intelligence"
  ],
  "total_projects": 75,
  "stats": {
    "avg_projects_per_appeared_year": 8.33,
    "projects_by_year": {
      "year_2016": 4,
      "year_2017": 3,
      "year_2018": null,
      "year_2019": 7,
      "year_2020": 8,
      "year_2021": 11,
      "year_2022": 9,
      "year_2023": 11,
      "year_2024": 11,
      "year_2025": 11
    },
    "students_by_year": {
      "year_2016": 4,
      "year_2017": 3,
      "year_2018": null,
      "year_2019": 7,
      "year_2020": 8,
      "year_2021": 11,
      "year_2022": 9,
      "year_2023": 11,
      "year_2024": 11,
      "year_2025": 11
    },
    "total_students": 70
  },
  "years": {
    "year_2016": {
      "num_projects": 4,
      "projects": [
        {
          "code_url": "https://github.com/LiquidGalaxyLAB/DLP/blob/master/GSOC2016.md",
          "description": "<p>Main object of the project is the continuity of the FAED code, converting it to DLP, bug stabilizing it and documenting correctly.</p>\n<p>The aim of the DLP Project is to be a platform which acts as a logistic distribution platform and the visualization of the information relative with this project in the Galaxy Liquid platform.</p>\n<p>DLP project will generate a massive quantity of information that is very useful to have the opportunity to display it in the Galaxy Liquid technology.</p>\n<p>Project DLP data that will display Galaxy Liquid:</p>\n<p>The points where drone will use to land or take off which are drop points, drone hangars.\nWeather information focused in the weather that can be dangerous for the drone like rain, wind, snow…\nThe current position of the drone and its flying plan.</p>\n",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2016_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5247075109306368/",
          "proposal_id": null,
          "short_description": "Main object of the project is the continuity of the FAED code, converting it to DLP, bug stabilizing it and documenting correctly.\nThe aim of the DLP...",
          "slug": "visualization-dlp-drone-logistics-platform",
          "status": "completed",
          "student_name": "Xavi Cobos",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Visualization DLP (Drone Logistics Platform)"
        },
        {
          "code_url": "https://github.com/LiquidGalaxyLAB/asherat666-lg-potree/commits/master?author=asherat",
          "description": "<p>This project will join the capabilities of Cloud Point visualization and the high-resolution capabilities of Liquid Galaxy. Different middlewares will be reviewed and tested into the Liquid Galaxy and the best solution will be configured and implemented.\nIn this project we will have the possibility of used different Cloud Point scanning devices such as Project Tango and LIDAR.\nA management tool will also be implemented to manage the visualization of different Cloud Point .files</p>\n",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2016_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/4508230675857408/",
          "proposal_id": null,
          "short_description": "This project will join the capabilities of Cloud Point visualization and the high-resolution capabilities of Liquid Galaxy. Different middlewares...",
          "slug": "cloud-point-visualization-for-liquid-galaxy",
          "status": "completed",
          "student_name": "Ismael Arroyo",
          "student_profile": null,
          "tags": [
            "cloud",
            "ui"
          ],
          "title": "Cloud Point Visualization for Liquid Galaxy"
        },
        {
          "code_url": "https://github.com/abhishekvp/cesium-lg/commits?author=abhishekvp",
          "description": "<p>Enabling other applications for Liquid Galaxy would greatly benefit the open source community, thereby nurturing the open source culture and encouraging inter-community bonding. This project aims at enabling Cesium - an open source virtual globe for Liquid Galaxy. The Liquid Galaxy project started off by making use of Google Earth for the panoramic system. The idea of this project is to enable Cesium to run across the multiple displays, providing an immersive and a riveting experience to the users. This project focuses on endowing Cesium with features such as Camera Synchronization, Content Synchronization across the displays and Space Navigation Camera Control.</p>\n",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2016_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/4553593583566848/",
          "proposal_id": null,
          "short_description": "Enabling other applications for Liquid Galaxy would greatly benefit the open source community, thereby nurturing the open source culture and...",
          "slug": "enabling-cesium-for-liquid-galaxy",
          "status": "completed",
          "student_name": "abhishekp",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Enabling Cesium for Liquid Galaxy"
        },
        {
          "code_url": "https://github.com/LiquidGalaxyLAB/PILT/blob/master/GSOC16.md",
          "description": "<p>PILT project wants to create a standard to display static and dynamic information over the LG system. We are going to build a system that creates different layers of information in order to display useful representations in the system.</p>\n<p>The goal will be create a server that handles synchronous and asynchronous information and translates it into KML, moreover we will represent different uses cases like adding integrations with other Liquid Galaxy projects that has to send KML into the system.</p>\n",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2016_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5762247578091520/",
          "proposal_id": null,
          "short_description": "PILT project wants to create a standard to display static and dynamic information over the LG system. We are going to build a system that creates...",
          "slug": "pilt-panoramic-interactive-live-tracker",
          "status": "completed",
          "student_name": "MarcGC",
          "student_profile": null,
          "tags": [
            "ml",
            "ui"
          ],
          "title": "PILT (Panoramic Interactive Live Tracker)"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2016/organizations/6555183903408128/"
    },
    "year_2017": {
      "num_projects": 3,
      "projects": [
        {
          "code_url": "https://github.com/calv00/SAVT-Dashboard/blob/master/docs/GSOC17.md",
          "description": "<p>SAVT will be a software engine to visualize data of crop fields to Liquid Galaxy, allowing you to track his state.\nThis image data, collected by drones, planes or satellites, can be among others : vegetation map, vigor map, nitrogen map, irrigation sectors, dose of fertilizer and variability map.</p>\n<p>We plan to have access also to data collected by drone, and by different IoT (Internet of Things) platforms, with sensor arrays on the crop field. We'll also use the platform to visualize this data overlaid on the maps and with explanations in almost real time, such as temperature, hygrometry, wind, and others upon availability.</p>\n<p>The management interface will have the ability to show the analyzed data from a specific client, land or area.\nLikewise, it will also be possible to collect data from various sources and import images with their coordinates to show them to Liquid Galaxy where each crop field will show a pop-up balloon with all the information about it.</p>\n<p>Another functionality is the system integration with google assistant using actions SDK to make voice requests and having a conversational UI experience.</p>\n",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2017_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6707810934980608/",
          "proposal_id": null,
          "short_description": "SAVT will be a software engine to visualize data of crop fields to Liquid Galaxy, allowing you to track his state.\nThis image data, collected by...",
          "slug": "savt-smart-agro-visualization-tool",
          "status": "completed",
          "student_name": "Javier Calvo García",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "SAVT (Smart Agro Visualization Tool)"
        },
        {
          "code_url": "https://github.com/LiquidGalaxyLAB/FlOYBD/blob/master/docs/GSOC17.md",
          "description": "<p>The aim this project is to develop a system that, making use of the Liquid Galaxy capacity to display information over an interactive map obtained from a big data analytics and mining process.\nFirstly, the data will be gathered from public data APIs and stored in a database to be processed later. This information will be related to historical weather conditions, water and energy reservoirs, earthquakes and other weather related information.\nSecondly, the data will be analysed under some kind of data analysis algorithm such clustering with K-Means algorithm or Regression Models making use of a Spark Uni-Node System running on the cloud and Python ( pySpark library).\nThe conclusions obtained from this data analysis will be shown on a external interface, such a website running in a server connected to the Liquid Galaxy.\nThis website will offer to the end-user, the possibility to seamlessly display the chosen information into Liquid Galaxy. Then the system will automatically send the corresponding KML files to Liquid Galaxy in order to display this information  in a descriptive and visual way, for example percentual polygons, polylines, etc.</p>\n",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2017_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6074492237381632/",
          "proposal_id": null,
          "short_description": "The aim this project is to develop a system that, making use of the Liquid Galaxy capacity to display information over an interactive map obtained...",
          "slug": "fly-over-your-big-data",
          "status": "completed",
          "student_name": "Ivan Josa Llovera",
          "student_profile": null,
          "tags": [
            "python",
            "web",
            "api",
            "ml",
            "ai"
          ],
          "title": "Fly Over Your Big Data"
        },
        {
          "code_url": "https://github.com/LiquidGalaxyLAB/WikimediaDataProject/blob/master/docs/GSoC17.md",
          "description": "<p>Mainly the project has the purpose of showing some data in Liquid Galaxy (different options to choose by the user). The presentation will be so visual in the Liquid Galaxy monitors, and the information will be represented in a bubble and different shapes. There will also be the possibility to make a tour according to which is the chosen option. There will be many options, and the user interaction will be so funny and interesting.</p>\n<p>The point of communication between the user and the application will be necessary to develop a fluid interface. This interface will handle the connection with the API to obtain the data (SPARQL queries), then the treatment of data and classifying them according to the type, and at last sending to the Liquid Galaxy (KML file) to visualize the data in a map point.</p>\n<p>An important point is to know the data to be treated from the Wikimedia API. The data will have to be processed and save the values that will be useful. There are different use cases and according to these, we will work with some types of data or with others. At the end, the important is that the Liquid Galaxy visualization of the data will be simple and so the user obtains what he has requested.</p>\n",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2017_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5863566930345984/",
          "proposal_id": null,
          "short_description": "Mainly the project has the purpose of showing some data in Liquid Galaxy (different options to choose by the user). The presentation will be so...",
          "slug": "wikimedia-data-liquid-galaxy",
          "status": "completed",
          "student_name": "Guillem Barbosa",
          "student_profile": null,
          "tags": [
            "api",
            "ml",
            "ai",
            "ui"
          ],
          "title": "Wikimedia Data Liquid Galaxy"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2017/organizations/5279287632461824/"
    },
    "year_2018": null,
    "year_2019": {
      "num_projects": 7,
      "projects": [
        {
          "code_url": "https://github.com/Marcelpv96/GSOC-2019-Dronecoria",
          "description": "<p>The reforestation is a problem that affects a lot of countries nowadays, due to this project tries to be a system able to automatically reforestation using three popular technologies: Liquid Galaxy (as interface that the user will interact with), Neuronal Networks(to detect the burnt zone) and drones (to do the reforestation).</p>\n",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2019_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/6458206325309440/",
          "proposal_id": null,
          "short_description": "The reforestation is a problem that affects a lot of countries nowadays, due to this project tries to be a system able to automatically reforestation...",
          "slug": "forest-analysis-and-visualization",
          "status": "completed",
          "student_name": "Marcel Porta Vallés",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "Forest analysis and visualization"
        },
        {
          "code_url": "https://github.com/moreaf/AirMashup",
          "description": "<p>AirMashup for Liquid Galaxy is a project that helps to comprehend how airspace is structured. Displaying in Liquid Galaxy airways, airports, flights levels and other elements that keep airspace structured is an attractive way to study these concepts.</p>\n",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2019_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5110650471186432/",
          "proposal_id": null,
          "short_description": "AirMashup for Liquid Galaxy is a project that helps to comprehend how airspace is structured. Displaying in Liquid Galaxy airways, airports, flights...",
          "slug": "airmashup-for-liquid-galaxy",
          "status": "completed",
          "student_name": "Albert Morea",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "AirMashup for Liquid Galaxy"
        },
        {
          "code_url": "https://github.com/LiquidGalaxyLAB/LGxEDU/blob/master/GSOC19.md",
          "description": "<p>Liquid Galaxy for Education is a project which consists of bringing Liquid Galaxy to children by using Chromebooks as screens and a tablet as a controller. By that this project aims to introduce children the benefits of Liquid Galaxy and a completely new learning method for subjects like Geography and History.</p>\n<p>The Liquid Galaxy for Education project has three parts:</p>\n<ol>\n<li>Google Crostini: Linux distro to run Liquid Galaxy on Chromebooks.</li>\n<li>An Android Application designed for tablets from 7 to 10 inches that runs the educational app.</li>\n<li>Inside the Android Application from point 2 there will also be included the fully Liquid Galaxy Controller functionality on a separate menu.</li>\n</ol>\n",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2019_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5357479104348160/",
          "proposal_id": null,
          "short_description": "Liquid Galaxy for Education is a project which consists of bringing Liquid Galaxy to children by using Chromebooks as screens and a tablet as a...",
          "slug": "liquid-galaxy-for-education",
          "status": "completed",
          "student_name": "Ivan Colomer Vallejo",
          "student_profile": null,
          "tags": [
            "android",
            "ai",
            "ui",
            "ux"
          ],
          "title": "Liquid Galaxy For Education"
        },
        {
          "code_url": "https://github.com/LiquidGalaxyLAB/New-tools-for-the-liquid-galaxy-GSoC-2019",
          "description": "<p>When we are working with a dataset with geolocation, we need a tool to display it. The idea is build this tool. We will be able to upload the kml or json data, we are going to select the data type and which row will be the geolocation. We will be able to choose the legend and build new ones.</p>\n",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2019_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5379934049009664/",
          "proposal_id": null,
          "short_description": "When we are working with a dataset with geolocation, we need a tool to display it. The idea is build this tool. We will be able to upload the kml or...",
          "slug": "new-tools-for-the-liquid-galaxy",
          "status": "completed",
          "student_name": "Eric Monné Mesalles",
          "student_profile": null,
          "tags": [
            "ml",
            "ui"
          ],
          "title": "New tools for the liquid galaxy"
        },
        {
          "code_url": "https://github.com/LiquidGalaxyLAB/Renato-Fernandes-GSoC2019",
          "description": "<p>Liquid Galaxy is a interactive environment with many processing nodes and screens. This proposal aims to create a new JavaScript library to acquire data from sensors to be displayed in Liquid Galaxy, making the connection between the installation and the said sensors standardized. The library aims to facilitate the development and the deployment of new ways for displaying information in Liquid galaxy. The library will also support the creation of mock data for installation where the sensors are not yet available.</p>\n",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2019_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/6104686828978176/",
          "proposal_id": null,
          "short_description": "Liquid Galaxy is a interactive environment with many processing nodes and screens. This proposal aims to create a new JavaScript library to acquire...",
          "slug": "javascript-library-for-data-simulation-and-acquisition",
          "status": "completed",
          "student_name": "Renato Aurelio Totti",
          "student_profile": null,
          "tags": [
            "java",
            "javascript",
            "ai",
            "ui"
          ],
          "title": "JavaScript library for data simulation and acquisition"
        },
        {
          "code_url": "https://github.com/LiquidGalaxyLAB/PythonLibraryForRealTimeDataVisualizationGSoC2019--API-nodeJs",
          "description": "<p>I will develop a library to acquire data from external sources mainly through forms on an Android application, store them on a local database and handling the conversion to KML data format to be shown on the LG.</p>\n",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2019_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5852299384061952/",
          "proposal_id": null,
          "short_description": "I will develop a library to acquire data from external sources mainly through forms on an Android application, store them on a local database and...",
          "slug": "python-library-for-real-time-data-visualization",
          "status": "completed",
          "student_name": "Mihaela Claudia Diosan",
          "student_profile": null,
          "tags": [
            "python",
            "android",
            "ml",
            "ai",
            "database"
          ],
          "title": "Python library for real time data visualization"
        },
        {
          "code_url": "https://gist.github.com/Sreyas-108/85820b7ac07a06ec09e075e4ea87f158",
          "description": "<p>A redefined application developed on flutter containing various tools for controlling the LG screen. Touch gesture based navigation to control the LG screen. Tours, POIs and guide modules to assist the user with common usages. Enhanced connection settings with automatic trouble shooting procedures. This application will be a perfect tool for a naive user to control the LG screen. Ability to draw elements like paths, polygons, etc directly over an imitation of LG screen on the controller app and a direct-sharing add-on will provide additional ease in usability. It will also provide an easy interface for using the LG screen in educational and commercial purposes.</p>\n",
          "difficulty": "beginner",
          "id": "proj_liquid-galaxy-projec_2019_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5157825855094784/",
          "proposal_id": null,
          "short_description": "A redefined application developed on flutter containing various tools for controlling the LG screen. Touch gesture based navigation to control the LG...",
          "slug": "liquid-galaxy-controller-application-redesign",
          "status": "completed",
          "student_name": "Sreyas",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Liquid Galaxy Controller Application Redesign"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2019/organizations/4783124586692608/"
    },
    "year_2020": {
      "num_projects": 8,
      "projects": [
        {
          "code_url": "https://github.com/LiquidGalaxyLAB/Presentation-Tool",
          "description": "<p>The presentation tool idea is to create an interface that is capable to create different sets of data configuration to be displayed on a Liquid Galaxy. The project consists of two main parts: an API and a web application.\nThe web application will give the user the possibility to upload the wanted media and to select the displaying location, the chosen screen and the time interval each media will occupy. \nThe API main function is to receive media and execute it in a Liquid Galaxy, it will get the created presentation and parse the sent data to run scripts that will execute on the Liquid Galaxy what the user planned in the web application.</p>\n",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2020_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/6375757422526464/",
          "proposal_id": null,
          "short_description": "The presentation tool idea is to create an interface that is capable to create different sets of data configuration to be displayed on a Liquid...",
          "slug": "liquid-galaxy-presentations-tool",
          "status": "completed",
          "student_name": "Karine Pistili",
          "student_profile": null,
          "tags": [
            "web",
            "api",
            "ai",
            "ui"
          ],
          "title": "Liquid Galaxy Presentations Tool"
        },
        {
          "code_url": "https://github.com/rascundampelcuf/Seasight-Forecasting",
          "description": "<p>This project will shows a sea surface temperature chart of a selected region on seas or oceans.\nThree options will be abailable for showing the content.\nFirst, you will be able to see the historic SST through a dataset with the data.\nSecond, you will be able to see the current SST through an API.\nAnd third, you will be able to see a SST prediction through a Deep Learning model.</p>\n",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2020_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5425394003476480/",
          "proposal_id": null,
          "short_description": "This project will shows a sea surface temperature chart of a selected region on seas or oceans.\nThree options will be abailable for showing the...",
          "slug": "seasight-forecasting",
          "status": "completed",
          "student_name": "Gabriel Izquierdo",
          "student_profile": null,
          "tags": [
            "api",
            "ai"
          ],
          "title": "Seasight Forecasting"
        },
        {
          "code_url": "https://github.com/LiquidGalaxyLAB/3D_Visualization_API",
          "description": "<p>My project goal for this project is to create a software library that can be integrated in Liquid Galaxy, that allows third parties to easily apply common features in Computer Graphics directly to a Liquid Galaxy format. This would include really commonly used properties in graphics, modelling a geometric object, applying lightning, animation, shaders and even textures.</p>\n",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2020_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5443608087363584/",
          "proposal_id": null,
          "short_description": "My project goal for this project is to create a software library that can be integrated in Liquid Galaxy, that allows third parties to easily apply...",
          "slug": "3d-visualization-library",
          "status": "completed",
          "student_name": "Sara Caballero Bruno",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "3D Visualization Library"
        },
        {
          "code_url": "https://docs.google.com/document/d/1qWEogjHxxKFm0sqYzb1oQyUhLMhoXAi00s6tFumv93I/edit?usp=sharing",
          "description": "<p>In the project SIMPLE CMS I am going to develop and Android application that will act as User interface and backend, with the following features:</p>\n<ol>\n<li>Adapt Earth KML Liquid Galaxy drawing primitives and movement primitives, based on code from other already LG developed project such as new tools for the Liquid Galaxy, such as single points with metadata to be shown in balloons, lines and polygonal shapes, a place, change camera angles, and Orbit.</li>\n<li>Create simple storyboards, with the following functionalities,  such as the user will be able to select a location from google maps on the tablet, inserting the lat and long, fill up the place with the aforementioned graphic primitives,  the metadata to be shown on the place, add a timer in seconds to leave the camera there after arriving. </li>\n<li>Store the StoryBoard, locally and optionally on google drive. The file will be saved in a json file, making it Interchangeable with other users.</li>\n<li>Show the data received from this data sites, through an Api Connection or making a web scraping of Meetup.com Google Developers community and Tech Conference List.\nThe user will be able to select different data available and show it up on the \nscreen.</li>\n</ol>\n",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2020_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5089447164510208/",
          "proposal_id": null,
          "short_description": "In the project SIMPLE CMS I am going to develop and Android application that will act as User interface and backend, with the following features:\n...",
          "slug": "simplecms",
          "status": "completed",
          "student_name": "Diego Riveros",
          "student_profile": null,
          "tags": [
            "android",
            "web",
            "api",
            "ml",
            "ai"
          ],
          "title": "SimpleCMS"
        },
        {
          "code_url": "https://github.com/LiquidGalaxyLAB/GSoC2020_HomelessAidPanoramicInteractiveSystem",
          "description": "<p>Mainly the project will be developed in Android and it will make use of of the Liquid Galaxy capacity to display information over an interactive map, displays data obtained from a Firebase database.</p>\n<p>I will develop and Android Application:\n. Able to create different profile setups, users and administrators. \n. Able to display a location address through the Liquid Galaxy technology \n. Able to display on Liquid Galaxy tours, orbit over a POI so as the FlyTo function</p>\n<ul>\n<li>With a forms based sections to enter or access to the personal data </li>\n<li>With multi-idiom support </li>\n<li>Able to collect data from third parties (APIs)</li>\n<li>Integrated with the YouTube Android Player API </li>\n<li>A Firebase database (running on Google Cloud)</li>\n<li>Data visualization on the LG</li>\n</ul>\n",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2020_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/6262292271857664/",
          "proposal_id": null,
          "short_description": "Mainly the project will be developed in Android and it will make use of of the Liquid Galaxy capacity to display information over an interactive map,...",
          "slug": "hapis-homeless-aid-panoramic-interactive-system",
          "status": "completed",
          "student_name": "Mihaela Claudia Diosan",
          "student_profile": null,
          "tags": [
            "android",
            "api",
            "ai",
            "database",
            "cloud"
          ],
          "title": "HAPIS (Homeless Aid Panoramic Interactive System)"
        },
        {
          "code_url": "https://docs.google.com/document/d/1L3De7pT--0PAN_WPsGAGwpgR-Uefg-zB5E6Fwcxug6o/edit?usp=sharing",
          "description": "<p>The idea of ​​the project is to develop an Arduino controller for Liquid Galaxy, following the ideas already developed, integrating them into a single code and also providing the necessary hardware and assembly schemes.\nAn optimized code for reading various types of sensors and actuators will be developed, sensors such as:\nUltrasonic sensors, gyroscopes, accelerometers, a keyboard with configurable navigation buttons and also simple voice modules, which will allow navigation through voice commands.\nAn Android application will also be developed that will allow setups and reconfigurations on the Arduino board without the need to write a new programming code.</p>\n",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2020_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/4643809276723200/",
          "proposal_id": null,
          "short_description": "The idea of ​​the project is to develop an Arduino controller for Liquid Galaxy, following the ideas already developed, integrating them into a...",
          "slug": "arduino-controller-for-liquid-galaxy",
          "status": "completed",
          "student_name": "Otávio  Oliveira",
          "student_profile": null,
          "tags": [
            "android",
            "ui"
          ],
          "title": "Arduino Controller for Liquid Galaxy"
        },
        {
          "code_url": "https://github.com/LiquidGalaxyLAB/FPVT",
          "description": "<p>The project idea is to build a platform for detecting free parking spaces from surveillance video camera footage in public areas. Using integration with local security cameras, the goal of the project is to detect the number of free parking spaces in public parking lots using deep learning and visualize them in real-time in a web/mobile application and a liquid galaxy. The image recognition model will be developed using the Kornia (OpenCV) library and deployed in multiple interfaces.</p>\n",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2020_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/6565873076142080/",
          "proposal_id": null,
          "short_description": "The project idea is to build a platform for detecting free parking spaces from surveillance video camera footage in public areas. Using integration...",
          "slug": "free-parking-visualization-tool",
          "status": "completed",
          "student_name": "Charanya Chandrasekaran",
          "student_profile": null,
          "tags": [
            "web",
            "mobile",
            "ui"
          ],
          "title": "Free parking Visualization Tool"
        },
        {
          "code_url": "http://github.com/LiquidGalaxyLAB/Gesture-Controller",
          "description": "<p>Currently, the Liquid Galaxy project has only space navigator, touch screen and voice to controls it, but it would be\ninteresting to see more ways to interact with Google Earth, so my proposal is to develop a controller based on hand gestures.</p>\n<p>It will be made using Tensorflow Lite and Python to develop a software that can classify the gestures and send the corresponding command to a local NodeJs server to actually interact with Liquid Galaxy. Also, Dialogflow and \nJavascript to create the Google Assistant app.</p>\n<p>The smartphone running the app, using the camera, will watch the hand movements of the user and with the trained \nmodel will check if it corresponds with any of the dataset gestures, all of this will be done in real-time.</p>\n",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2020_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5999567243313152/",
          "proposal_id": null,
          "short_description": "Currently, the Liquid Galaxy project has only space navigator, touch screen and voice to controls it, but it would be\ninteresting to see more ways to...",
          "slug": "gesture-controller-to-liquid-galaxy",
          "status": "completed",
          "student_name": "Bruno Faé Faion",
          "student_profile": null,
          "tags": [
            "python",
            "java",
            "javascript",
            "ai",
            "ui"
          ],
          "title": "Gesture Controller to Liquid Galaxy"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2020/organizations/6406567974404096/"
    },
    "year_2021": {
      "num_projects": 11,
      "projects": [
        {
          "code_url": "https://docs.google.com/document/d/1_fAQDEsCKxJplXi3In13HkArZVgT51elc_i1bOv5z_4/edit?usp=sharing",
          "description": "<p>Creating an android application which is \nable to mimics the functionality of Google Earth Studio and gives response in .esp format,create a feature which makes animation in spiral, orbit, zoom to views and\ncreate a record button that will capture the current view LiquidGalaxy screen and short description about it.</p>\n",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2021_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6663634549211136/",
          "proposal_id": null,
          "short_description": "Creating an android application which is \nable to mimics the functionality of Google Earth Studio and gives response in .esp format,create a feature...",
          "slug": "simplecms-es",
          "status": "completed",
          "student_name": "Goutam Verma",
          "student_profile": null,
          "tags": [
            "android",
            "ui"
          ],
          "title": "SimpleCMS E.S."
        },
        {
          "code_url": "https://github.com/moreaf/OrbitSatelliteVisualizer",
          "description": "<p>Orbit Satellite visualizer and other space related concepts displayed in Liquid Galaxy ecosystem.</p>\n",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2021_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5659142429081600/",
          "proposal_id": null,
          "short_description": "Orbit Satellite visualizer and other space related concepts displayed in Liquid Galaxy ecosystem.",
          "slug": "orbit-satellite-visualizer-for-liquid-galaxy",
          "status": "completed",
          "student_name": "Albert Morea",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "Orbit Satellite Visualizer for Liquid Galaxy"
        },
        {
          "code_url": "https://github.com/gfelis/cropDoc",
          "description": "<p>The main objective of this project is to develop a tool for companies or competent authorities to help them visualize certain crop illnesses on the terrain, displaying photographs and locations of plants’ leaves, fruits or trunks on a Liquid Galaxy system. The tool will be developed as an Android app designed for tablets, able to control what is being displayed on the system. The problem that has inspired this project is the fire blight, although other kinds of illnesses can also be displayed.</p>\n",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2021_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5667681595817984/",
          "proposal_id": null,
          "short_description": "The main objective of this project is to develop a tool for companies or competent authorities to help them visualize certain crop illnesses on the...",
          "slug": "crop-doc",
          "status": "completed",
          "student_name": "Guillem Felis",
          "student_profile": null,
          "tags": [
            "android",
            "ai",
            "ui"
          ],
          "title": "Crop Doc"
        },
        {
          "code_url": "https://github.com/MCDeu/EMB",
          "description": "<p>The main objective of this project is to create a visualization therefore farmers can control the state and weather of their crop analyzing atmospheric and ground magnitudes such as temperature, humidity, wind… with an Arduino microcontroller and a django restframework server.</p>\n",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2021_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5671936398458880/",
          "proposal_id": null,
          "short_description": "The main objective of this project is to create a visualization therefore farmers can control the state and weather of their crop analyzing...",
          "slug": "electronics-monitor-board-emb",
          "status": "completed",
          "student_name": "Albert Font",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Electronics Monitor Board (EMB)"
        },
        {
          "code_url": "https://docs.google.com/document/d/1wmf3RlnG6OPCinq2i24hmwCivorzR_RFPMEAJcPpmOw/edit?usp=sharing",
          "description": "<p>This project has as main objective the development of a navigation system for the Liquid Galaxy project, using only voice commands, with a voice recognition API and audio transcription, all programming and code development must be done in LattePanda Board .\nThis project should have a simple and easy-to-use interface, so it can be used by older people, who don't understand technology. Must operate online.\nIt will also be possible to use this interface via an HDMI cable, connecting it to a TV, or using it with a standard Liquid Galaxy installation, connecting it via a network cable to the same network as the cluster of computers.\nUse cases:\nCase 1 (using in a Liquid Galaxy installation) - This device can be connected using network information and send commands to Liquid Galaxy.\nCase 2 (Using as a standalone device) - This device can be connected to a TV using an HDMI cable, after connecting the user will see Google Earth on their TV and can start to navigate the world using voice commands.\nTechnologies: LattePanda Board, Python 3, SpeechRecognition, Pyaudio, SSH, voice recognition API, GTTS, Geopy, graphical interface in python, SHELL script to install all dependencies.</p>\n",
          "difficulty": "beginner",
          "id": "proj_liquid-galaxy-projec_2021_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5708041537716224/",
          "proposal_id": null,
          "short_description": "This project has as main objective the development of a navigation system for the Liquid Galaxy project, using only voice commands, with a voice...",
          "slug": "visit-the-world",
          "status": "completed",
          "student_name": "Otávio Oliveira",
          "student_profile": null,
          "tags": [
            "python",
            "api",
            "ai",
            "ui"
          ],
          "title": "Visit the World"
        },
        {
          "code_url": "https://docs.google.com/document/d/1O3HeAYWhZxJVLKGbJdmPJMjYKpV4SAEldE6Wz_e5vh0/edit?usp=sharing",
          "description": "<p>This project is about visualizing Stellarium in a liquid galaxy setup. I have divided this project into two tasks.</p>\n<p>task-1: Setting of view-matrix offset for slaves according to their positions with respect to the master.</p>\n<p>task-2: I have identified 16 data parameters which should be shared among cluster in real-time via socket connection.</p>\n<p>Each of these tasks is explained in detail in the proposal.</p>\n",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2021_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/4973951196856320/",
          "proposal_id": null,
          "short_description": "This project is about visualizing Stellarium in a liquid galaxy setup. I have divided this project into two tasks.\ntask-1: Setting of view-matrix...",
          "slug": "liquid-galaxy-stellarium",
          "status": "completed",
          "student_name": "Mithil",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Liquid Galaxy Stellarium"
        },
        {
          "code_url": "https://github.com/LiquidGalaxyLAB/reforestation-assistant-simulator",
          "description": "<p>The Reforestation Assistant &amp; Simulator idea is to create an app to help on reforestation of degraded areas of the planet by drone or manually. The project will consist of an Android App where users can plan the reforesting missions, by defining areas of seeding, specific seed/tree location, drone landing points, fly zones and other helpful metrics. All the gathered information will be dynamically displayed on the Liquid Galaxy cluster using KMLs and also on the app with the help of graphics and text to bring users a great and immersive overview of the mission panorama.</p>\n",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2021_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5003433328771072/",
          "proposal_id": null,
          "short_description": "The Reforestation Assistant & Simulator idea is to create an app to help on reforestation of degraded areas of the planet by drone or manually. The...",
          "slug": "reforestation-assistant-simulator",
          "status": "completed",
          "student_name": "Karine Pistili",
          "student_profile": null,
          "tags": [
            "android",
            "ml",
            "ui"
          ],
          "title": "Reforestation Assistant & Simulator"
        },
        {
          "code_url": "https://gist.github.com/leoruas/ec2de571a1ba8f61858eaf38baf2f800",
          "description": "<p>The idea of playing games on the Liquid Galaxy has already been explored by some developers, there are currently two classic retro games that have been implemented: pong and snake, but there is no easy way to install and run these games on a Liquid Galaxy. By creating a basic app with icons representing each game any person with a tablet could easily control which game is being displayed on the screens and even quickly switch between them.</p>\n<p>Besides that, the Pac-Man game is another classic retro game that has been around or over 40 years and is one of the most famous of all time. What if there was a remake of the game for a more modern and multiplayer version on the Liquid galaxy to be included in this new app? Not only would it bring nostalgia to people all over the world, but also bring a lot of visibility to the Liquid Galaxy in a more fun and casual way.</p>\n",
          "difficulty": "beginner",
          "id": "proj_liquid-galaxy-projec_2021_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5561093929304064/",
          "proposal_id": null,
          "short_description": "The idea of playing games on the Liquid Galaxy has already been explored by some developers, there are currently two classic retro games that have...",
          "slug": "liquid-galaxy-retro-gaming",
          "status": "completed",
          "student_name": "Leonardo Coelho Ruas",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "Liquid Galaxy Retro Gaming"
        },
        {
          "code_url": "https://github.com/ainhoamguardiola/VisitTheWorldHomeEdition.git",
          "description": "<p>The objective of the Visit the World Home edition project is to facilitate access to Liquid Galaxy or a private TV via voice commands, using an independent platform running on a Raspberry Pi4.The user in this case is intended for the elderly, and can use the platform to send KML to a normal Liquid Galaxy installation connected to the same network, or use this device connected to their TV through an HDMI cable, as a system independent.This device should be as simple as possible so that the user does not have doubts or difficulties when using it. To turn the device on and off, an easy-to-see and accessible button will be applied, later the idea is that it works as a voice assistance for Liquid Galaxy, it will only receive voice commands and it will not need more information from the user.</p>\n",
          "difficulty": "beginner",
          "id": "proj_liquid-galaxy-projec_2021_009",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5627667499450368/",
          "proposal_id": null,
          "short_description": "The objective of the Visit the World Home edition project is to facilitate access to Liquid Galaxy or a private TV via voice commands, using an...",
          "slug": "visit-the-world-home-edition",
          "status": "completed",
          "student_name": "Ainhoa Maestro",
          "student_profile": null,
          "tags": [
            "ml",
            "ui"
          ],
          "title": "VISIT THE WORLD HOME EDITION"
        },
        {
          "code_url": "https://github.com/LiquidGalaxyLAB/image-satellite-visualizer",
          "description": "<p>Liquid Galaxy as a meaningful presentation tool has a lot of information that can be displayed for diverse purposes like an educational tool, or for a monitoring system. With that in mind, the idea of ​​the project is the real time visualization of satellite images that would be attached as layers of google earth, besides being able to have diverse information of the earth being graphically generated as storms, fires, masses of heat and water vapor, a synchronous earth visualization will allow for more complex interactions.\nFrom there, the entire application would be controlled through a script responsible for managing calls made to the satellite's external APIs (e.g. NASA API and Copernicus) that responses with the metadata necessary for the kml creation and a tablet application that would give the user control of which layers or information would like to be displayed and responsible for handling the API calls, manipulate KMLs and sending them to Liquid Galaxy through Bash scripts. The application’s front end will be developed with Flutter and the image selected by the user will be generated based on selected options</p>\n",
          "difficulty": "advanced",
          "id": "proj_liquid-galaxy-projec_2021_010",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5160157792698368/",
          "proposal_id": null,
          "short_description": "Liquid Galaxy as a meaningful presentation tool has a lot of information that can be displayed for diverse purposes like an educational tool, or for...",
          "slug": "liquid-galaxy-image-satellite-visualizer",
          "status": "completed",
          "student_name": "Octávio H. Müller Barrio",
          "student_profile": null,
          "tags": [
            "api",
            "ml",
            "ui"
          ],
          "title": "Liquid Galaxy Image Satellite Visualizer"
        },
        {
          "code_url": "https://github.com/ferrydelgado/CropDoc.git",
          "description": "<p>This project will be focused on the control and monitoring of plant pests and diseases. Especially focused on agriculture, for the detection and geolocation of these infections, and avoid their spread. The objective will be to create a device for manual use that, through a photographic system, will be able to examine the leaves of the plants looking for any defects caused by these diseases.The device will use an AI programmed to compare miles of photos of plant leaves with their various defects and will give the result of the health evaluation. This data could be reflected by different types of LED’s through the device or by an application that could provide more information.These results will be processed and sent to a geographic platform to locate the infected plants in the territory with the purpose of quickly combating these pests with the least possible waste. This will be compatible with liquid galaxy technology for a better interaction and visualization of the contaminated terrain.</p>\n",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2021_011",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5209681282203648/",
          "proposal_id": null,
          "short_description": "This project will be focused on the control and monitoring of plant pests and diseases. Especially focused on agriculture, for the detection and...",
          "slug": "crop-doc-terminal-tpu",
          "status": "completed",
          "student_name": "Ferran Delgado Garcia",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Crop Doc Terminal TPU"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2021/organizations/5964067927228416/"
    },
    "year_2022": {
      "num_projects": 9,
      "projects": [
        {
          "code_url": "https://pablosanchi.github.io/",
          "description": "Use of Hydra-Space in order to make an asynchronous chess game, so two-player could play from different places so we will use satellites communications.\r\nThe first idea is to adapt the chess logic using the already existing GNU Chess so we will need to implement the game communications. About the front-end, we will display the Chess game in the LG-rig, just like the LG-Retro-Gaming games (Snake, Pong, …)",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2022_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/zcj3VxzC/",
          "proposal_id": null,
          "short_description": "Use of Hydra-Space in order to make an asynchronous chess game, so two-player could play from different places so we will use satellites...",
          "slug": "lg-space-chess",
          "status": "completed",
          "student_name": "Pablo Sanchidrian",
          "student_profile": null,
          "tags": [],
          "title": "LG Space Chess"
        },
        {
          "code_url": "https://github.com/LiquidGalaxyLAB/asteroids-lg-retro-gaming",
          "description": "Until today, playing games has become an activity loved by many, mainly due to the fun and competitiveness offered to those who play them. In Liquid Galaxy, a few games were developed that are supported by the cluster system, such as the Galaxy Pong, Galaxy Snake and more, in which lots of them were based on old famous games.\nOne of the first major hits of arcade games was Asteroids, released in November 1979 by Atari, Inc. The player controls a spaceship in an asteroid field and the objective of the game is to increase the score by shooting and destroying the asteroids and saucers, while not colliding with either or being hit by the saucers' shot. The game gets harder as new asteroids spawn.\n\nFollowing this logic, the project's idea is to remake the original Asteroids game, with a modern design and new features, such as the multiplayer mode. It would be really nostalgic and fun to be able to play it again, especially for those who played it back in the 80's and 90's. Moreover, due to its complexity, uniqueness and system support, the project may be a part of the Liquid Galaxy demonstration, bringing more emphasis to the lab.",
          "difficulty": "advanced",
          "id": "proj_liquid-galaxy-projec_2022_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/W5iole2x/",
          "proposal_id": null,
          "short_description": "Until today, playing games has become an activity loved by many, mainly due to the fun and competitiveness offered to those who play them. In Liquid...",
          "slug": "galaxy-asteroids",
          "status": "completed",
          "student_name": "Leticia CR",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Galaxy Asteroids"
        },
        {
          "code_url": "https://docs.google.com/document/d/14DEJ7QUfUwplxrVIs-03MRNCCEHnuXz7oXNm-ehoA8c/edit",
          "description": "Liquid Galaxy is a visualization system that helps users to interact with/use applications like Google Earth in an immersive and interactive way. It uses master-slave architecture and multiple displays to create an immersive environment. This project is based on an android app where users can plan the reforesting missions, by defining areas of seeding, specific seed/tree location, drone landing points, fly zones, and other helpful metrics. All the gathered information is dynamically displayed on the Liquid Galaxy cluster using KMLs and also on the app with the help of graphics and text to bring users a great and immersive overview of the mission panorama. This project will help in developing the next generation of this android app which includes advanced features like Flight Plan Tools and Drone Visualization. We'll also be adding the ability to import data from external storage services and the ability for the app to work with different languages. We'll be building the new UI for the seamless integration of these features and by the end of the GSOC period, we'll be delivering an android app that has all these new abilities listed above.",
          "difficulty": "advanced",
          "id": "proj_liquid-galaxy-projec_2022_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/ygjnwJrh/",
          "proposal_id": null,
          "short_description": "Liquid Galaxy is a visualization system that helps users to interact with/use applications like Google Earth in an immersive and interactive way. It...",
          "slug": "dronecoria-ras-version-2",
          "status": "completed",
          "student_name": "Syed Ali Ahmed",
          "student_profile": null,
          "tags": [
            "android",
            "ml",
            "ui"
          ],
          "title": "Dronecoria RAS Version 2"
        },
        {
          "code_url": "https://docs.google.com/document/d/1zUR-_JD9rVjYK8aAel4UVYQqgon1oHZHt8vZKzb1rf0/edit?usp=sharing",
          "description": "This project aims to build an android application from scratch. Which gets information about satellites, stations, and packets from the TinyGS telemetry channel and displays it on tablet(android) and Liquid Galaxy screens. This project will be built with android java and divided into three: getting mined data from TinyGS, Visualization of it over Liquid Galaxy rigs, and building of local TinyGS.",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2022_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/Ft7KP8Dj/",
          "proposal_id": null,
          "short_description": "This project aims to build an android application from scratch. Which gets information about satellites, stations, and packets from the TinyGS...",
          "slug": "tinygs-data-visualization-for-liquid-galaxy",
          "status": "completed",
          "student_name": "Goutam Verma",
          "student_profile": null,
          "tags": [
            "java",
            "android",
            "ai",
            "ui"
          ],
          "title": "TinyGS data visualization for Liquid Galaxy"
        },
        {
          "code_url": "https://docs.google.com/document/d/1lLE_qWeqxlHgSe_jQJVEC1_QGFWCJ3zV9yIqMApLu6s/edit?usp=sharing",
          "description": "I plan to develop a Volcano Eruption Tracking tool made with the help of the Dart native package called web_scraper 0.1.4 that collects all the data related to La Palma Volcano Eruption from various sites, such as COPERNICUS, GDACS, etc.\nThis web scraping happens in our Flutter app, and then we convert the scraped JSON/String data to KML format. We segregate the KML data into the various tracks to get a more neat visualisation of the different Map data, such as Lava flow, Historic flow, Earthquake Magnitude, Detected events, Located events, Affected areas, etc. Then we write the code to send KML data from our Flutter app to the Liquid Galaxy to visualise this data on the Liquid Galaxy rig. We store all the web scraped data in the assets so web scraping is no longer needed once data of all tracks is gathered. Also, for a user-friendly interaction experience, the movements we do on the Google Maps is detected and Google Earth of the Liquid Galaxy can be moved. Other important features are the multi-language plugin and day/night theme that gives a better user-experience.",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2022_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/YsfWtGqw/",
          "proposal_id": null,
          "short_description": "I plan to develop a Volcano Eruption Tracking tool made with the help of the Dart native package called web_scraper 0.1.4 that collects all the data...",
          "slug": "350h-la-palma-volcano-eruption-tracking-tool",
          "status": "completed",
          "student_name": "Yash Raj",
          "student_profile": null,
          "tags": [
            "web",
            "api",
            "ml",
            "ui"
          ],
          "title": "350h La Palma Volcano Eruption tracking tool"
        },
        {
          "code_url": "https://github.com/GuillemCamats/CropDocForAndroid",
          "description": "The main objective of this project is to develop an Android application to help companies or competent authorities and farmers to detect certain crop illnesses on the terrain and display the localization of the trees and terrains affected by the crop illness on the liquid galaxy to help them monitor the evolution of such illnesses throughout the territory.\n\nThe problem will be solved through an android application with a machine learning model that will detect the illness of the samples. After that, the location of the sample will be recorded, and the coordinates will be displayed on the liquid galaxy. \nThe deliverable will be an android app that will do anything that has already been commented on.",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2022_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/UlSbQdDT/",
          "proposal_id": null,
          "short_description": "The main objective of this project is to develop an Android application to help companies or competent authorities and farmers to detect certain crop...",
          "slug": "cropdoc-for-android",
          "status": "completed",
          "student_name": "GuillemCF",
          "student_profile": null,
          "tags": [
            "android",
            "ai",
            "ui"
          ],
          "title": "CropDoc for Android"
        },
        {
          "code_url": "https://github.com/LiquidGalaxyLAB/SatNOGS-Visualization-Tool",
          "description": "The goal of this project is to create a mobile app that makes it possible for people to look for a satellite. Using the NORAD id from the satellite, the app will show all the data captured from a SatNOGS ground station. With this, not only the client will be given the position of the satellite, but also the contents of the signal that the ground station is able to capture.\n\nAll the information is included in the SatNOGS (Satellite Networked Open Ground Station) database. The ground stations are antennas that capture transmissions from satellites. Using this network, SatNOGS created a database with all the information captured since its creation. We will use this database to get the information we need, since it is open and free. It contains information about the satellites, the data received in the communication, the protocols of transmission accepted and more.",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2022_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/8TUw3N9s/",
          "proposal_id": null,
          "short_description": "The goal of this project is to create a mobile app that makes it possible for people to look for a satellite. Using the NORAD id from the satellite,...",
          "slug": "liquid-galaxy-satnogs-visualization-tool-lg-svt",
          "status": "completed",
          "student_name": "Michell Algarra",
          "student_profile": null,
          "tags": [
            "mobile",
            "ai",
            "database",
            "ui"
          ],
          "title": "Liquid Galaxy SatNOGS Visualization Tool  (LG S.V.T.)"
        },
        {
          "code_url": "https://github.com/LiquidGalaxyLAB/BIM-Liquid-Galaxy-Visualizer",
          "description": "This project aims to build a platform to see BIM models and their corresponding metadata both in an android 10’ tablet and on the Liquid Galaxy Cluster. The models will be shown in a scene created with the Unity Engine, that is a game development engine.\n\nWith the tablet it will be possible to look and interact with the scene using augmented reality.\n\nThe android app will also allow you to open the scene on the Galaxy cluster and when this option is chosen a new screen will be opened with a controller for the scene.\n\nThe scene that will be running on the galaxy will be a WebGL scene, so for that a chromium based project will be developed using Node Js. The node app will interact with the Liquid Galaxy using web sockets and in this way it will be possible to synchronize the displays.",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2022_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/v3W6m6tQ/",
          "proposal_id": null,
          "short_description": "This project aims to build a platform to see BIM models and their corresponding metadata both in an android 10’ tablet and on the Liquid Galaxy...",
          "slug": "bim-liquid-galaxy-visualizer",
          "status": "completed",
          "student_name": "Vinícius Cavalcanti",
          "student_profile": null,
          "tags": [
            "android",
            "web",
            "ai",
            "ui"
          ],
          "title": "BIM Liquid Galaxy Visualizer"
        },
        {
          "code_url": "https://github.com/Alexevers/Alejandro-Android-Application-Refurbishment",
          "description": "I want to help you refurbishing some past proyects that couldn't be validated on play store. \nI'm familiar with play store and i like so much Android SO.\nI give you a link with the proporsal as Liquid Galaxy Organization request\nhttps://docs.google.com/document/d/1Da79HhEOI1mkWjjWZfo9y7FsZjH8h90Hvyp7wdJrPlk/edit?usp=sharing",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2022_009",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/KEqnvisL/",
          "proposal_id": null,
          "short_description": "I want to help you refurbishing some past proyects that couldn't be validated on play store. I'm familiar with play store and i like so much Android...",
          "slug": "alejandro-illán-marcos-gsoc-2022-android-application-refurbishment",
          "status": "completed",
          "student_name": "Alejandro Illán Marcos",
          "student_profile": null,
          "tags": [
            "android",
            "ui"
          ],
          "title": "Alejandro Illán Marcos GSoC 2022 - Android Application refurbishment"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2022/organizations/liquid-galaxy-project/"
    },
    "year_2023": {
      "num_projects": 11,
      "projects": [
        {
          "code_url": "https://gist.github.com/soCallmeAdityaKumar/47419801a0c22f743eddd4f15f82b76f",
          "description": "Many members of Google Developers Groups are available on Meetup . So I want to develop a platform which will make developers easily to get all upcoming meets and last 7 day meets . All previous events photos will be available on the app. Maps will show the concentration of the developers globally . User can show all updates on events on the app itself.",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2023_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/7mnhMUjo",
          "proposal_id": "R638ekHb",
          "short_description": "Many members of Google Developers Groups are available on Meetup . So I want to develop a platform which will make developers easily to get all...",
          "slug": "google-developers-community-visualization-tool",
          "status": "completed",
          "student_name": "AdityaKumar",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Google Developers Community Visualization Tool"
        },
        {
          "code_url": "https://github.com/Na1au/COVID19_data_explorer",
          "description": "The project is a data visualizer about COVID 19, it aims to analyze the data obtained about the virus through an API, calculate its evolution using an AI and show possible contamination and mutation statistics, thus showing the past data and possible future data in a Liquid Galaxy cluster. Thus, it will be possible for the user to filter the data about the virus and view its trajectory around the world based on its evolution through filters chosen by him, such as country, date and variant.",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2023_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/UTsePWCM",
          "proposal_id": "V0nrBL5C",
          "short_description": "The project is a data visualizer about COVID 19, it aims to analyze the data obtained about the virus through an API, calculate its evolution using...",
          "slug": "covid-19-data-explorer",
          "status": "completed",
          "student_name": "Ana Laura",
          "student_profile": null,
          "tags": [
            "api",
            "ai",
            "ui"
          ],
          "title": "COVID-19 data explorer"
        },
        {
          "code_url": "https://docs.google.com/document/d/1O2xYHiNRehPv2lAI_7w9kVmLUspu-7Ib3AwGxcu0mwU/edit",
          "description": "The purpose of this project is to create a dashboard application that allows better control of their fields, to all farmers who want to take their business to a more technological environment.\nThanks to the appearance of the new farming robots, we will be able to improve the control of the harvest and the state of the field.",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2023_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/096FweCs",
          "proposal_id": "CnSebRgw",
          "short_description": "The purpose of this project is to create a dashboard application that allows better control of their fields, to all farmers who want to take their...",
          "slug": "agro-robot-swarm-dashboard-for-liquid-galaxy",
          "status": "completed",
          "student_name": "Artur Culleres",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "Agro Robot Swarm dashboard for Liquid Galaxy"
        },
        {
          "code_url": "https://gist.github.com/savitore/e26c444d907df5e8f6008150e8a6ff1e",
          "description": "This project represents the orbit of a satellite orbiting earth on an Arduino-controlled pointer and a Liquid Galaxy rig through a mobile application. The application offers a unique way to visualize satellite orbits using the Liquid Galaxy rig (Google Earth) and a real-world Arduino-controlled pointer. It also provides insights into satellites' movements and access to vital satellite information seamlessly within the app.\n\nI plan to develop this by getting all the satellite data from SatNOGS database through API calls. Then, we use SGP-4 model to convert TLE of a satellite to get the state (position and velocity). Then we convert the satellite state to KML format. We segregate the KML data into the various tracks to get a neater visualization of the satellite's orbit data. Then, we write the code to send KML data from our Flutter app to the Liquid Galaxy to visualize this data on the Liquid Galaxy rig.  \n\nNext, we make Arduino controlled pointer which emits green laser in the direction of satellite, which is controlled by the app.  First, we 3D print the STL files of the 3D projector. Then, we assemble all the components of the Arduino-controlled pointer. Then, for the application, we use flutter_bluetooth_serial package to connect and send data to HC-05 module. Then, we use SGP-4 model to get the servo motor angles for the Arduino pointer. Then, we upload code to Arduino to receive data.",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2023_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/f6b4xoXN",
          "proposal_id": "PLag5Wh4",
          "short_description": "This project represents the orbit of a satellite orbiting earth on an Arduino-controlled pointer and a Liquid Galaxy rig through a mobile...",
          "slug": "steam-celestial-satellite-tracker-in-real-time",
          "status": "completed",
          "student_name": "Krishna Agrawal",
          "student_profile": null,
          "tags": [
            "mobile",
            "api",
            "ml",
            "database",
            "ui"
          ],
          "title": "STEAM Celestial Satellite tracker in real time"
        },
        {
          "code_url": "https://medium.com/@mahinouralaa2002/google-summer-of-code-2023-with-liquid-galaxy-organization-f9dd550f6bc1",
          "description": "Introduction:\n\nThe main idea of HAPIS Refurbishment is to have a simple functional application that is able to connect those who need something with those willing to offer it through an android mobile application where the user can simply fill in a form or view the list of seekers & givers any place in the world. Things offered can fall in any category such as food, clothes, electronics, books...etc.\n\nWe will use the technology of Liquid Galaxy in order to visualize all Humanitarian actions all around the world by viewing on the LG the number of people currently offering something, or seeking something as well as some statistics such as the number of successful donations that happened either locally or globally. Controlling the LG would be through an android tablet application.\n\n\nDeliverables:\n\n- The mobile application fully functional \n- The tablet application fully functional and published on the Play Store under the Liquid Galaxy LAB account\n- Full documentation and code on GitHub",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2023_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/Fv4ImOa2",
          "proposal_id": "UXE8BYIN",
          "short_description": "Introduction: The main idea of HAPIS Refurbishment is to have a simple functional application that is able to connect those who need something with...",
          "slug": "hapis-refurbishment-humanitarian-aid-panoramic-interactive-system",
          "status": "completed",
          "student_name": "Mahinour Elsarky",
          "student_profile": null,
          "tags": [
            "android",
            "mobile",
            "api",
            "ai",
            "ui"
          ],
          "title": "HAPIS Refurbishment \"Humanitarian Aid Panoramic Interactive System\""
        },
        {
          "code_url": "https://gist.github.com/SagittariusA11/1042d88f5e560366770307be8a9db108",
          "description": "I am planning to build the app using flutter for frontend and calling APIs using dart package called “retrofit” for collecting data of rocket launches from APIs such as “https://www.rocketlaunch.live/api” and “https://docs.spacexdata.com/” and “https://spaceflightnewsapi.net/” this API to access different news articles and related information about the launch to show on the app also Celestrak API “https://celestrak.org/” for satellite data. We use “google_maps_flutter” for the live location of the user, “google_directions_api” for finding routes to the nearest launch site and “geocoding” to convert the named launch site location to coordinates. After calling the API it will return data in JSON format which we will convert to KML format file and store it locally using “shared_preferences” and then will send it to Liquid Galaxy for visualisation. There will be a map screen as well in the app to visualise the launch in the app itself if it is not connected to Liquid Galaxy. I will use embedded code sent to LG Rig using the KML format of placemarkers of the launch site with a YouTube live video link pasted by users (of which instructions will be mentioned) in the input text field which will telecast live launch video on LG alongside visualisation.",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2023_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/5ZScXUZt",
          "proposal_id": "g1VmuLNM",
          "short_description": "I am planning to build the app using flutter for frontend and calling APIs using dart package called “retrofit” for collecting data of rocket...",
          "slug": "manash-kumar_proposal_rocket-launcher-visualizer-spacex-rocket-visualizer_350-hours-duration",
          "status": "completed",
          "student_name": "Manash Kumar",
          "student_profile": null,
          "tags": [
            "api",
            "ml",
            "ui",
            "frontend"
          ],
          "title": "Manash Kumar_Proposal_Rocket Launcher Visualizer / SpaceX Rocket Visualizer_350 Hours Duration"
        },
        {
          "code_url": "https://github.com/MurilonND/LiquidArt_AI/tree/main",
          "description": "The LiquidArt AI is a mobile application developed in Flutter that allows users to generate images using a text or an audio to text prompt and a selection of  APIs (NightCafe, a local server of Stable Diffusion, AI Art Maker, Dall-e), a multi-screen system for displaying geographic information. The application uses a Node js server to connect to the Liquid Galaxy system and a custom API  to display the images on the screens. The project also includes a new local machine for the LG project that has a GPU and the ability to create AI art based on stable diffusion.",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2023_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/cCYnzu24",
          "proposal_id": "o9qlXb9s",
          "short_description": "The LiquidArt AI is a mobile application developed in Flutter that allows users to generate images using a text or an audio to text prompt and a...",
          "slug": "the-liquidart-ai",
          "status": "completed",
          "student_name": "Murilo Nogueira Duarte",
          "student_profile": null,
          "tags": [
            "mobile",
            "api",
            "ai",
            "ui"
          ],
          "title": "The LiquidArt AI"
        },
        {
          "code_url": "https://gist.github.com/Prayag-X/d436610ff922b9c6434797eb842da916",
          "description": "The idea of the project is to utilize the space that Liquid Galaxy gives us to show the features of Smart Cities in a better way. There will be a mobile app which will interact with Liquid Galaxy to show various details of the Smart Cities like how much power the city produces and consumes, the amount of pollution in the air, waste management etc, through a dashboard and markers on the Liquid Galaxy.",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2023_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/wC8xPFRk",
          "proposal_id": "BMPxbSk9",
          "short_description": "The idea of the project is to utilize the space that Liquid Galaxy gives us to show the features of Smart Cities in a better way. There will be a...",
          "slug": "smart-city-dashboard-for-liquid-galaxy",
          "status": "completed",
          "student_name": "Prayag X",
          "student_profile": null,
          "tags": [
            "mobile",
            "ai",
            "ui"
          ],
          "title": "Smart City Dashboard for Liquid Galaxy"
        },
        {
          "code_url": "https://docs.google.com/document/d/10pF6yFT35_TvV1RgtrKNj4I8XoyquvbY7CIpSRbbrdE/edit?usp=sharing",
          "description": "In this project, I am going to make a neural network which is going to predict the probability that one satellite will collide with another. With this information, I am going to compute what area of ​​the earth may be affected by this collision.",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2023_009",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/o4g0AJgd",
          "proposal_id": "1WFgxo9i",
          "short_description": "In this project, I am going to make a neural network which is going to predict the probability that one satellite will collide with another. With...",
          "slug": "satellite-space-collision-prevision",
          "status": "completed",
          "student_name": "Rafel Salgueiro",
          "student_profile": null,
          "tags": [],
          "title": "Satellite Space Collision prevision"
        },
        {
          "code_url": "https://github.com/Sudhanyo/LG-Gesture-And-Voice-Control",
          "description": "The LG Gesture and Voice Control Project aims to improve the control of the Liquid Galaxy Rig by providing a more comprehensive solution using voice commands, body poses, and hand gestures. The project will consist of two parts: the LG Gesture and Voice Control App and the LG Gesture and Voice Control Library. The core technology used to make the above would be Flutter (Dart), and incorporate various APIs, especially ML Kit and Geocoding.\n\nThe app will offer a more intuitive approach for users to interact with the Liquid Galaxy setup, making it simpler to explore and navigate. Users will be able to control the Liquid Galaxy without physically touching any devices, increasing the immersive experience. \n\nThe LG Gesture and Voice Control Library will allow for the implementation of the app's key functionalities in other Liquid Galaxy apps and projects, providing a wider range of situations for implementation. One potential application for the library is incorporating it into the previously built Liquid Galaxy Controller to provide additional functionality for voice and gesture control, enhancing the user experience.",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2023_010",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/q7XviTSE",
          "proposal_id": "FILeEsR1",
          "short_description": "The LG Gesture and Voice Control Project aims to improve the control of the Liquid Galaxy Rig by providing a more comprehensive solution using voice...",
          "slug": "lg-gesture-and-voice-control",
          "status": "completed",
          "student_name": "Sudhanyo Chatterjee",
          "student_profile": null,
          "tags": [
            "api",
            "ml",
            "ai",
            "ui"
          ],
          "title": "LG Gesture and Voice Control"
        },
        {
          "code_url": "https://docs.google.com/document/d/1zlpWdz4w3vOLVkALyRG4Yp7DE8aV8ru_h5QBwbnCMDY/edit?usp=sharing",
          "description": "To the existing Liquid Galaxy Controller on Google Play Store, I am:\n1.  Adding the voice functionality: For default POIs via AI generated voice mp3 files saved on storage. And using Text-To-Speech API by Android for providing voice functionality to  AI generated places.\n2. Adding the sound functionality: Adding sound effects for all the POIs belonging to a particular category using mp3 files saved on the local storage. Example: Bells sound for Cathedrals.\n3. Improving the User Experience: Making the app responsive.\n4. Removal of the Physical Beacon integration.\n5. Adding AI support for context sensing perhaps using Google BARD(if published in the near future) or OpenAI ChatGPT. Example: Showing nearby places near Eiffel Tower.\n6. Other additional AI integrations possible.",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2023_011",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/n3hWZbED",
          "proposal_id": "CJDgVKLw",
          "short_description": "To the existing Liquid Galaxy Controller on Google Play Store, I am: 1. Adding the voice functionality: For default POIs via AI generated voice mp3...",
          "slug": "located-voice-cms",
          "status": "completed",
          "student_name": "Vedant Singh",
          "student_profile": null,
          "tags": [
            "android",
            "api",
            "ai",
            "ui"
          ],
          "title": "Located Voice CMS"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2023/organizations/liquid-galaxy-project"
    },
    "year_2024": {
      "num_projects": 11,
      "projects": [
        {
          "code_url": "https://www.liquidgalaxy.eu/2024/08/work-product-submission-from-google.html#mahinour",
          "description": "Seeking an escape from daily life chores, many turn to travel as a means of relaxation, renewal, and exploration. However, planning a trip can be overwhelming especially with the abundance of information available online that involves navigating multiple websites, guidebooks and apps to research. Furthermore, discovering the most touristic places in a foreign city or country, along with the best dining spots, shopping locales, and natural vistas, can be a daunting task. \n\nThe main purpose of this application is to simplify the travel planning experience and inspire users to embark on memorable journeys and discover the most captivating point of interests (POIs) tailored to their preferences. The POIs would be generated by running GEMMA, one of the latest open-source generative text AI models, locally on the AI server in Lleida Lab utilizing Docker technology. Utilizing the liquid galaxy technology, the user would be able to visualize their entire trip on the LG rig with 3 or more screens where the tours along with their info would be sent through KML (keyhole markup language) that will help build beautiful and unique visualizations on the LG rig. In case of unavailability of an LG rig, the user would still have a captivating experience through the app and the integrated google maps. \n\nDeliverables - The model trained on the cloud and ready to be inferred in Lleida Lab AI local server. - The new App published on the Play Store under the Liquid Galaxy LAB account. - Full documentation and code on Liquid galaxy lab GitHub.",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2024_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/hSET07zW/",
          "proposal_id": null,
          "short_description": "Seeking an escape from daily life chores, many turn to travel as a means of relaxation, renewal, and exploration. However, planning a trip can be...",
          "slug": "ai-based-touristic-information-tool-for-lg-based-on-gemma-model-running-locally",
          "status": "completed",
          "student_name": "Mahinour Elsarky",
          "student_profile": null,
          "tags": [
            "web",
            "ml",
            "ai",
            "docker",
            "cloud"
          ],
          "title": "AI-based Touristic Information Tool for LG (based on GEMMA model running locally)"
        },
        {
          "code_url": "https://www.liquidgalaxy.eu/2024/08/work-product-submission-from-google.html#shiven",
          "description": "Imagine a captivating journey through iconic destinations brought to life by a fictional travel itinerary generator. In this concept, the application immerses users in a narrative adventure, creating fictional stories of a traveler exploring specific Points of Interest (POIs). The goal is to inspire users' travel itineraries by presenting vivid stories that unfold paragraph by paragraph, each focusing on a different place within the chosen location. In this version of our application, we generate fictional stories by running one of the fastest open-source Generative text AI models, in this case we’ll use Groq.",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2024_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/DHnK9nZW/",
          "proposal_id": null,
          "short_description": "Imagine a captivating journey through iconic destinations brought to life by a fictional travel itinerary generator. In this concept, the application...",
          "slug": "ai-fictional-travel-itinerary-generator-for-lg-based-on-groqs-api",
          "status": "completed",
          "student_name": "Nevish_302",
          "student_profile": null,
          "tags": [
            "api",
            "ai"
          ],
          "title": "AI Fictional Travel Itinerary Generator for LG, based on Groq’s API"
        },
        {
          "code_url": "https://www.liquidgalaxy.eu/2024/08/work-product-submission-from-google.html#rohit",
          "description": "Planning a vacation can be quite a task. One of the challenges is finding some engaging details about destinations to explore. Often when we look into places to visit, we come across a range of options, which may result in making incorrect decisions and overspending. This situation can be disheartening for travelers like me. That's why there should be a method that enables us to explore travel spots, with just one prompt. Such a system would enhance the experience of planning a trip making it more delightful and fulfilling.\n\nResolving this I came up with a tool (A Flutter App) that helps users plan travel adventures. By using one of the fastest Generative text AI models, Groq, it builds exciting tales of travelers exploring specific Points of Interest (POIs) selected by the user. The app creates a storyline around sub-POIs. Using the LG Rig the app presents the story in paragraphs each focusing on a sub-POI for a visually immersive experience. It also suggests tour recommendations on the screen to keep users engaged. And the Use cases of this tool is not just limited to travelers but also in education. Additionally, our app includes an accessibility feature to generate voice narration making sure all users can enjoy the experience.",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2024_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/knnm59jc/",
          "proposal_id": null,
          "short_description": "Planning a vacation can be quite a task. One of the challenges is finding some engaging details about destinations to explore. Often when we look...",
          "slug": "ai-fictional-travel-itinerary-generator-for-lg",
          "status": "completed",
          "student_name": "Rohit_Kumar_",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "AI Fictional Travel Itinerary Generator for LG"
        },
        {
          "code_url": "https://www.liquidgalaxy.eu/2024/08/work-product-submission-from-google.html#gerard",
          "description": "The project will be a responsive Flutter application designed for tablets, which through an SSH connection and API calls, we will be able to represent the desired information on the LG. Additionally, the application will be autonomous, and without being connected to the LG, it will be able to represent and display information on the mobile device itself. The project will consist of two parts:\n\nThe first part is intended to represent past forest fires, to see all the affected areas, the development of the forest fire, and all the information represented on the Liquid Galaxy.\n\nThe second part will be to visualize real-time fires, whether they are forest fires or house fires, on the Liquid Galaxy and see their information.",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2024_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/SLnTEOe6/",
          "proposal_id": null,
          "short_description": "The project will be a responsive Flutter application designed for tablets, which through an SSH connection and API calls, we will be able to...",
          "slug": "wildfire-tracker-for-liquid-galaxy",
          "status": "completed",
          "student_name": "Gerard Monsó",
          "student_profile": null,
          "tags": [
            "mobile",
            "api",
            "ui"
          ],
          "title": "Wildfire Tracker for Liquid Galaxy"
        },
        {
          "code_url": "https://www.liquidgalaxy.eu/2024/08/work-product-submission-from-google.html#davit",
          "description": "A Flutter tool made to be able to control agronomical robots from a distance, with a database with data on different plants' ideal cycle: planting dates, transplanting dates, harvesting dates...",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2024_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/VifALBEf/",
          "proposal_id": null,
          "short_description": "A Flutter tool made to be able to control agronomical robots from a distance, with a database with data on different plants' ideal cycle: planting...",
          "slug": "agro-task-manager",
          "status": "completed",
          "student_name": "Davit Mas",
          "student_profile": null,
          "tags": [
            "database"
          ],
          "title": "Agro Task Manager"
        },
        {
          "code_url": "https://www.liquidgalaxy.eu/2024/08/work-product-submission-from-google.html#sidharth",
          "description": "The project aims to develop an AI-based Flutter application that will be connected to the Liquid Galaxy system and will allow users to ask the app any question about tourism in a simple chat-like manner or voice. The app will show the user itinerary, and recommended tourist places and will also show the history and significance of each place in both mobile as well as Liquid Galaxy system.",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2024_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/6q7HffsP/",
          "proposal_id": null,
          "short_description": "The project aims to develop an AI-based Flutter application that will be connected to the Liquid Galaxy system and will allow users to ask the app...",
          "slug": "gemini-based-ia-based-touristic-tool",
          "status": "completed",
          "student_name": "Sidharth Mudgil",
          "student_profile": null,
          "tags": [
            "mobile",
            "ai",
            "ui"
          ],
          "title": "Gemini based IA based Touristic tool"
        },
        {
          "code_url": "https://www.liquidgalaxy.eu/2024/08/work-product-submission-from-google.html#oscar",
          "description": "This project aims to recode, test, and publish applications developed by contributors of the Liquid Galaxy community during the 2023-2024 period, including those created for GSoC Task 2 and the Flutter Kiss Contest. The primary objectives include reviewing and updating the existing applications, publishing them on the Play Store, and uploading them to GitHub for wider accessibility. Testing will be conducted against the Liquid Galaxy and the AI server for apps with Docker-based models. The methodology involves collecting the apps, testing them on tablets, and ensuring compliance before uploading to the Play Store and GitHub. The timeline includes research, preparation, bonding. The ultimate goal is to enhance accessibility and understanding of Liquid Galaxy applications for the community.",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2024_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/phiEg2xz/",
          "proposal_id": null,
          "short_description": "This project aims to recode, test, and publish applications developed by contributors of the Liquid Galaxy community during the 2023-2024 period,...",
          "slug": "android-chrome-and-ai-application-management",
          "status": "completed",
          "student_name": "OscarPena",
          "student_profile": null,
          "tags": [
            "android",
            "ai",
            "docker",
            "ui"
          ],
          "title": "Android, Chrome and AI Application management"
        },
        {
          "code_url": "https://github.com/LiquidGalaxyLAB/LG-AI-Touristic-explorer",
          "description": "The application aims to provide users with an immersive and informative experience, showcasing the essence of a city through mesmerizing visualizations and a beautiful user interface. By utilizing Google's new Gemma open-source LLM model and the Bark voice model by Suno AI for narration, the app will offer engaging storytelling about the city's geographical, historical, and cultural characteristics. With the implementation of various Dart packages and Flutter plugins, it will ensure a smooth experience for the users. For instance, with the Google Maps API, the app will provide interactive maps and location-based features, ensuring a seamless user experience. Overall, the application strives to offer a rich and educational experience for users interested in exploring the spirit of a city.",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2024_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/p7WO4nQ1/",
          "proposal_id": null,
          "short_description": "The application aims to provide users with an immersive and informative experience, showcasing the essence of a city through mesmerizing...",
          "slug": "ai-educational-touristic-explorer-for-lg",
          "status": "completed",
          "student_name": "Manas Manoj Dalvi",
          "student_profile": null,
          "tags": [
            "api",
            "ml",
            "ai"
          ],
          "title": "AI Educational Touristic Explorer for LG"
        },
        {
          "code_url": "https://www.liquidgalaxy.eu/2024/08/work-product-submission-from-google.html#rofayda",
          "description": "This project utilizes open AIS data to create a real-time visualization tool on Google Earth and Liquid Galaxy rigs. The goal is to provide users with detailed information about maritime activities along the Norwegian coastline, including vessel positions, routes, and other relevant data.\nThe application will allow users to customize their viewing experience through a controller flutter app, with features like vessel selection, detailed vessel information display, historical route playback, future route prediction and collision risk management using machine learning, region-specific vessel tracking, and filter options based on vessel type and country.",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2024_009",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/NaX6fUKu/",
          "proposal_id": null,
          "short_description": "This project utilizes open AIS data to create a real-time visualization tool on Google Earth and Liquid Galaxy rigs. The goal is to provide users...",
          "slug": "ais-visualization-for-liquid-galaxy",
          "status": "completed",
          "student_name": "Rofayda",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "AIS Visualization for Liquid Galaxy"
        },
        {
          "code_url": "https://www.liquidgalaxy.eu/2024/08/work-product-submission-from-google.html#mattia",
          "description": "Space Visualizations for Liquid Galaxy is an application that showcases the Mars 2020 NASA mission and some of the most famous Earth orbits. The application uses the Liquid Galaxy platform to provide immersive space exploration experiences. In the Mars mission section, users can interactively learn about the mission by visualizing 3D models, technical data, and the path of the Perseverance rover and Ingenuity drone. Users can see Mars from the perspective of the Perseverance rover with more than 220000 photos available. The photos can also be displayed on all Liquid Galaxy screens, providing a very immersive experience.\n\nIn the Earth orbit section, a list of orbits can be displayed in both the application and, with a realistic representation, on Liquid Galaxy Google Earth. Users can interact with these orbits and learn more about them.",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2024_010",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/oIJG0x9B/",
          "proposal_id": null,
          "short_description": "Space Visualizations for Liquid Galaxy is an application that showcases the Mars 2020 NASA mission and some of the most famous Earth orbits. The...",
          "slug": "space-visualizations-for-liquid-galaxy",
          "status": "completed",
          "student_name": "Baggini Mattia",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Space Visualizations for Liquid Galaxy"
        },
        {
          "code_url": "https://www.liquidgalaxy.eu/2024/08/work-product-submission-from-google.html#aritra",
          "description": "This project aims to create a brand new de-facto Liquid Galaxy Controller that will master all the previous controller apps made for Liquid Galaxy. It aims to create an ultimate umbrella controller application for the Liquid Galaxy Rig, which gives access to all the features of the different controllers that have been developed over time with significant improvements to their features.\nSome of the features implemented include: Easy POI visualization, Generation and playing of Voice Excerpts, Educational GeoQuest game, Smart-tour planning and visualization, Context-aware recommendation of nearby POIs, Touchless controllers like Face detection, Hand gestures and Voice commands, etc.\nThe ultimate objective of this application is to make the usage of Liquid Galaxy simple, convenient, and enjoyable for all different types of users.\nThe application shall encompass every requirement needed from a Liquid Galaxy rig with a professional, elegant, and tasteful interface.",
          "difficulty": "beginner",
          "id": "proj_liquid-galaxy-projec_2024_011",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/RRJe0whD/",
          "proposal_id": null,
          "short_description": "This project aims to create a brand new de-facto Liquid Galaxy Controller that will master all the previous controller apps made for Liquid Galaxy....",
          "slug": "super-liquid-galaxy-controller",
          "status": "completed",
          "student_name": "Aritra Biswas",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Super Liquid Galaxy Controller"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2024/organizations/liquid-galaxy-project/"
    },
    "year_2025": {
      "num_projects": 11,
      "projects": [
        {
          "code_url": null,
          "description": "GeoVisionAI aims to enhance the Liquid Galaxy platform by integrating AI to analyze and visualize geographic data in real-time. This project will enable users to interact with the system through two main methods: text-based queries, where users can ask questions like “Show me deforestation trends in the Amazon” and receive relevant insights, and voice commands, allowing users to simply say, “Find recent earthquake in Japan,” with the system generating a response. The goal is to make geospatial data more accessible and understandable for all users, whether they are researchers, students, or policymakers. AI will provide contextual narratives, not only displaying data but also explaining its significance—like summarizing key temperature shifts when asked about climate change. Using the Web Speech API, users will be able to ask about locations and visualize geographic data on the Liquid Galaxy screens. To further enhance the experience, AI-generated audio soundscapes will simulate real-world scenarios, such as background wind and fire sounds for wildfire data. This project will provide a practical, interactive, and immersive way to gain insights from geospatial data and will be submitted to Google Labs for future development and evaluation.",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2025_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/HQ7rA7b9",
          "proposal_id": "dtR5XnTo",
          "short_description": "GeoVisionAI aims to enhance the Liquid Galaxy platform by integrating AI to analyze and visualize geographic data in real-time. This project will...",
          "slug": "geovisionai-ai-powered-geospatial-storytelling-on-liquid-galaxy",
          "status": "in-progress",
          "student_name": "_Anishka_",
          "student_profile": null,
          "tags": [
            "ios",
            "web",
            "api",
            "ai",
            "ui"
          ],
          "title": "GeoVisionAI: AI-Powered Geospatial Storytelling on Liquid Galaxy"
        },
        {
          "code_url": null,
          "description": "RoboStream is a comprehensive solution designed to address the challenge of monitoring and visualizing complex robotic telemetry in real time. As robots become increasingly integral to various industries, the need for an intuitive, immersive interface to track sensor data and live video streams grows ever more critical. Our project integrates advanced simulation tools and real robots with a responsive, cross-platform mobile application built in Flutter. This combination lets us capture, process, and transmit detailed telemetry directly into the immersive Liquid Galaxy multi-screen environment.",
          "difficulty": "advanced",
          "id": "proj_liquid-galaxy-projec_2025_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/R7s4YYln",
          "proposal_id": "oMrFQX4P",
          "short_description": "RoboStream is a comprehensive solution designed to address the challenge of monitoring and visualizing complex robotic telemetry in real time. As...",
          "slug": "robostream-real-time-telemetry-vision-platform",
          "status": "in-progress",
          "student_name": "alexbernaldo",
          "student_profile": null,
          "tags": [
            "mobile",
            "ai",
            "ui"
          ],
          "title": "RoboStream: Real-Time Telemetry & Vision Platform."
        },
        {
          "code_url": null,
          "description": "The Robotics Simulation for Liquid Galaxy 2025 Project is an innovative addition to the ever growing Liquid Galaxy Ecosystem. This project aims to combine  multi-display synchronous visualization with advanced robotics simulation which is aimed to be controllable through a smartphone. This project bridges the powerful networking and visualization capabilities of Liquid Galaxy with cutting-edge robotic technologies such as ROS (Robot Operating System) and Gazebo, a popular simulation tool for testing and developing robotic systems in virtual environments.",
          "difficulty": "advanced",
          "id": "proj_liquid-galaxy-projec_2025_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/GsIU6Hvc",
          "proposal_id": "12yxPOuh",
          "short_description": "The Robotics Simulation for Liquid Galaxy 2025 Project is an innovative addition to the ever growing Liquid Galaxy Ecosystem. This project aims to...",
          "slug": "robotics-simulation-for-liquid-galaxy",
          "status": "in-progress",
          "student_name": "Debanjan Naskar",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Robotics Simulation For Liquid Galaxy"
        },
        {
          "code_url": null,
          "description": "This project modernizes the classic Kennedy Approach air traffic control game by rebuilding it as a custom, multi-screen interactive experience on the Liquid Galaxy platform. Rather than emulating the original Commodore 64 version, the game is being ported from scratch, allowing for enhanced features and seamless integration across multiple synchronized displays.\n\nThe system is designed around a master-slave architecture, where the master node handles game logic and display rendering. The visual output is split and distributed to multiple slave nodes on the network, creating a panoramic and immersive gameplay view across multiple screens using the Liquid Galaxy setup.\n\nPlayers interact with the game using a mobile controller app built in Flutter, which communicates with the master system over a local network. A Node.js backend on the master node manages incoming control commands via WebSockets/Socket.IO, ensuring smooth, real-time interactivity.\n\nOptional UI dashboards built in React or Next.js can be used for monitoring system status, visualizing live data, or enabling multiplayer interaction.",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2025_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/aTEtH65S",
          "proposal_id": "UMm28lLk",
          "short_description": "This project modernizes the classic Kennedy Approach air traffic control game by rebuilding it as a custom, multi-screen interactive experience on...",
          "slug": "kennedy-approach-porting-to-liquid-galaxy",
          "status": "in-progress",
          "student_name": "DEV T GADANI",
          "student_profile": null,
          "tags": [
            "react",
            "web",
            "mobile",
            "ml",
            "ai"
          ],
          "title": "Kennedy Approach porting to Liquid Galaxy"
        },
        {
          "code_url": null,
          "description": "The Open Buildings Visualization project aims to create a geospatial visualization platform that synergistically integrates Google Earth Engine (GEE) and Liquid Galaxy (LG) through a Flutter-based mobile application. The project will provide an interactive, high-performance interface for navigating and analyzing building footprint data at scale. Users will be able to select specific regions through a dynamic, grid-based map, which will trigger real-time data retrieval from GEE. The geospatial data will be processed and transmitted to LG through SSH, where it will be visualized through KML overlays, offering an immersive, multi-screen 3D experience.",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2025_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/rCU0P9NY",
          "proposal_id": "5JRh3yOk",
          "short_description": "The Open Buildings Visualization project aims to create a geospatial visualization platform that synergistically integrates Google Earth Engine (GEE)...",
          "slug": "google-research-open-buildings-data-visualization",
          "status": "in-progress",
          "student_name": "JaivardhanShukla",
          "student_profile": null,
          "tags": [
            "mobile",
            "ml",
            "ai",
            "ui"
          ],
          "title": "Google Research - Open Buildings Data Visualization"
        },
        {
          "code_url": null,
          "description": "This project proposes developing a robot control system through the Liquid Galaxy system. Integrating immersive visualization with speech recognition and robotics allows users to control and monitor the robot’s behavior in real-time.\n\nThe system enables human-robot interaction through English voice commands, which are transcribed, interpreted, and converted into instructions that a robot can execute. \n\nThe architecture involves different AI techniques, employing Speech-to-Text, Large Language Models, and Decision-Making algorithms to define the set of actions that the robot will execute.",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2025_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/gdisJu5n",
          "proposal_id": "cAtfhuBO",
          "short_description": "This project proposes developing a robot control system through the Liquid Galaxy system. Integrating immersive visualization with speech recognition...",
          "slug": "voice-driven-robot-goal-assignment-system-with-liquid-galaxy",
          "status": "in-progress",
          "student_name": "JavierMancho",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Voice-Driven Robot Goal Assignment System with Liquid Galaxy"
        },
        {
          "code_url": null,
          "description": "The GSoC program provides students from around the world with the opportunity to work on their own projects with the help of experienced mentors. However, new students who may not be familiar with how the Liquid Galaxy works may have difficulties understanding how to structure their code, how their project should look like for the average user, how many screens their application should have, etc.\nThe aim of this project is to bridge this gap by creating a comprehensive master document whose intention is to be used as a structured guide for future GSoC students. This will provide them with a solid idea of where to start, how the code structure should look like, coding mistakes to avoid and how to do it, useful tips, etc. This document will be elaborated by reviewing the code of multiple past GSoC projects and finding the common aspects between them to create a structure that future students can follow. The goal is that this project will act as both a coding guide and a proposal reference, making sure that future students can achieve their own expectations.\nThis project will not require deep technical expertise in a particular programming language, but it will be necessary a basic understanding of how coding languages and GitHub work. The main challenge lies in being able to synthesize information from different sources (and different codes) to be able to structure it into a coherent, comprehensive and useful guide.",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2025_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/tyU5Ps7c",
          "proposal_id": "D1i4p8Ip",
          "short_description": "The GSoC program provides students from around the world with the opportunity to work on their own projects with the help of experienced mentors....",
          "slug": "liquid-galaxy-master-web-and-flutter-application",
          "status": "in-progress",
          "student_name": "Lucia Fernandez",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "ui"
          ],
          "title": "Liquid Galaxy Master Web and Flutter Application"
        },
        {
          "code_url": null,
          "description": "DATA Spaces FrontEnd For Liquid Galaxy is a project designed to enhance data visualization using Liquid Galaxy, an immersive multi-screen system. This project will provide an interactive and scalable solution for displaying real-time or synthetic data retrieved from Fiware. The main goal is to create a Flutter App that allows users to select, filter, and visualize urban and environmental data on Liquid Galaxy.",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2025_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/LJbiQZL7",
          "proposal_id": "c9xfqB7G",
          "short_description": "DATA Spaces FrontEnd For Liquid Galaxy is a project designed to enhance data visualization using Liquid Galaxy, an immersive multi-screen system....",
          "slug": "marc-bañeres-farrán-data-spaces-frontend-for-liquid-galaxy-gsoc2025",
          "status": "in-progress",
          "student_name": "Marc Bañeres Farrán",
          "student_profile": null,
          "tags": [
            "ai",
            "ui",
            "frontend"
          ],
          "title": "Marc Bañeres Farrán-DATA Spaces FrontEnd For Liquid Galaxy-GSoC2025"
        },
        {
          "code_url": null,
          "description": "The project aims to provide real-time and historical climate data visualization from Mars \n on Liquid Galaxy through an engaging and interactive experience. A Flutter-based mobile app will retrieve and process atmospheric data from the Mars Climate Database (MCD), presenting it with compelling visualizations on Liquid Galaxy.",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2025_009",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/t0R7jKR6",
          "proposal_id": "gfbLdGxK",
          "short_description": "The project aims to provide real-time and historical climate data visualization from Mars on Liquid Galaxy through an engaging and interactive...",
          "slug": "martian-climate-dashboard",
          "status": "in-progress",
          "student_name": "Mohit_Sharma",
          "student_profile": null,
          "tags": [
            "mobile",
            "ai",
            "database",
            "ui"
          ],
          "title": "Martian Climate Dashboard"
        },
        {
          "code_url": null,
          "description": "The Catastrophe Visualizer is a real-time disaster monitoring application designed to work seamlessly with the Liquid Galaxy system. It fetches live data from APIs tracking global events such as earthquakes, hurricanes, and wildfires. This data is displayed on interactive Google Maps with severity-based markers and informative pop-ups, giving users an immediate sense of impact and location",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2025_010",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/s3oP5apd",
          "proposal_id": "yI7K4L5k",
          "short_description": "The Catastrophe Visualizer is a real-time disaster monitoring application designed to work seamlessly with the Liquid Galaxy system. It fetches live...",
          "slug": "catastrophe-visualizer",
          "status": "in-progress",
          "student_name": "Saniya_Singh",
          "student_profile": null,
          "tags": [
            "api",
            "ml",
            "ui"
          ],
          "title": "Catastrophe Visualizer"
        },
        {
          "code_url": null,
          "description": "This project provides a master interface that showcases a dashboard of expansive forests around the globe and allows users to explore them. Its primary aim is to create an interactive and immersive geospatial visualization system that allows users to explore in-depth major forested land masses affected by recent environmental changes.\nThe application exploits the Liquid Galaxy rig to achieve its visualization while gliding through a smooth user experience.",
          "difficulty": null,
          "id": "proj_liquid-galaxy-projec_2025_011",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/5LWWagWD",
          "proposal_id": "6yKRizrU",
          "short_description": "This project provides a master interface that showcases a dashboard of expansive forests around the globe and allows users to explore them. Its...",
          "slug": "eco-explorer-for-liquid-galaxy",
          "status": "in-progress",
          "student_name": "Shuvam Swapnil Dash",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Eco Explorer for Liquid Galaxy"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2025/organizations/liquid-galaxy-project"
    }
  },
  "first_time": false,
  "contact": {
    "email": "liquidgalaxylab@gmail.com",
    "guide_url": "https://www.liquidgalaxy.eu/2024/11/unique-post-for-gsoc-2025-at-liquid.html",
    "ideas_url": "https://www.liquidgalaxy.eu/2024/11/unique-post-for-gsoc-2025-at-liquid.html",
    "irc_channel": "https://liquidgalaxy.slack.com/",
    "mailing_list": "https://discord.gg/peGA5K8tJU"
  },
  "social": {
    "blog": "https://www.liquidgalaxy.eu/#main-wrapper",
    "discord": null,
    "facebook": null,
    "github": null,
    "gitlab": null,
    "instagram": null,
    "linkedin": null,
    "mastodon": null,
    "medium": null,
    "reddit": null,
    "slack": "https://liquidgalaxy.slack.com/",
    "stackoverflow": null,
    "twitch": null,
    "twitter": "https://twitter.com/_liquidgalaxy",
    "youtube": null
  },
  "meta": {
    "version": 1,
    "generated_at": "2026-01-25T15:28:53.386Z"
  }
}