{
  "id": "692251db53dd9d7326d33e18",
  "slug": "machine-learning-for-science-ml4sci",
  "name": "Machine Learning for Science (ML4SCI)",
  "category": "Science and medicine",
  "description": "Machine learning applications in science",
  "image_url": "https://summerofcode.withgoogle.com/media/org/machine-learning-for-science-ml4sci/rs5cxhuyh9dpwekt-360.png",
  "img_r2_url": "https://pub-268c3a1efc8b4f8a99115507a760ca14.r2.dev/machine-learning-for-science-ml4sci.webp",
  "logo_r2_url": null,
  "url": "https://ml4sci.org/",
  "active_years": [
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "first_year": 2021,
  "last_year": 2025,
  "is_currently_active": true,
  "technologies": [
    "python",
    "c",
    "c++",
    "machine learning",
    "data analysis",
    "artificial intelligence"
  ],
  "topics": [
    "machine learning",
    "science and medicine",
    "algorithms",
    "physics",
    "astronomy"
  ],
  "total_projects": 119,
  "stats": {
    "avg_projects_per_appeared_year": 23.8,
    "projects_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": null,
      "year_2019": null,
      "year_2020": null,
      "year_2021": 19,
      "year_2022": 20,
      "year_2023": 23,
      "year_2024": 26,
      "year_2025": 31
    },
    "students_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": null,
      "year_2019": null,
      "year_2020": null,
      "year_2021": 19,
      "year_2022": 20,
      "year_2023": 23,
      "year_2024": 26,
      "year_2025": 31
    },
    "total_students": 102
  },
  "years": {
    "year_2016": null,
    "year_2017": null,
    "year_2018": null,
    "year_2019": null,
    "year_2020": null,
    "year_2021": {
      "num_projects": 19,
      "projects": [
        {
          "code_url": "https://github.com/ML4SCI/MLMapper/tree/main/Lunar_Prospector/ML_for_Planetary_Albedo_Sofia_Strukova",
          "description": "<p>The goal of the project is to use ML techniques to identify relationships between planetary mapped datasets, with the goal of providing deeper understanding of planetary surfaces and to have predictive power for planetary surfaces with incomplete datasets.\nThere are three main proposals for the stated problem:</p>\n<ol>\n<li>Explore various ML models, adjust the parameters  and compare their performance. During the preliminary work, I already explored several basic ML models; however, we should try more advanced ones and perform a deeper comparison depending on the parameters and metrics.</li>\n<li>Predict chemicals from chemicals. Based on preliminary work, we see that although in Mercury the correlation between albedo and chemicals is low, the correlationships between some chemicals are pretty high. Thus, in order to fill the \"gaps\" in the chemical maps, we could try to predict one chemical based on some others. </li>\n<li>Perform convolutional prediction. Rather than using only one corresponding pixel for the prediction, we could include the surrounding pixels since they might offer additional information.</li>\n</ol>\n",
          "difficulty": "advanced",
          "id": "proj_machine-learning-for_2021_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6388424486944768/",
          "proposal_id": null,
          "short_description": "The goal of the project is to use ML techniques to identify relationships between planetary mapped datasets, with the goal of providing deeper...",
          "slug": "machine-learning-model-for-the-planetary-albedo",
          "status": "completed",
          "student_name": "Sofia Strukova",
          "student_profile": null,
          "tags": [
            "ml",
            "ai"
          ],
          "title": "Machine Learning Model for the Planetary Albedo"
        },
        {
          "code_url": "https://github.com/ML4SCI/DeepLense/tree/main/Equivariant_Neural_Networks_for_DeepLense_Apoorva_Singh",
          "description": "<p>The study of substructures in the dark matter has shown signs of promise to deliver on the open-ended and long-standing problem of the identity of dark matter. To probe these substructures, strong gravitational lensing has been used in the past and provided some interesting results. The approaches based on deep learning have the ability to identify and differentiate among these substructures using images from the simulation of strong gravitational lensing. This project explores the scope of use of equivariant neural networks that can benefit from inherent symmetry present in natural images. We will be implementing and benchmarking the results of equivariant neural networks on the available DeepLens simulated dataset. We will also integrate all these architectures with the DeepLens pipeline to provide a high-level interface for future work.</p>\n",
          "difficulty": null,
          "id": "proj_machine-learning-for_2021_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6390539322130432/",
          "proposal_id": null,
          "short_description": "The study of substructures in the dark matter has shown signs of promise to deliver on the open-ended and long-standing problem of the identity of...",
          "slug": "equivariant-neural-networks-for-dark-matter-morphology-with-strong-gravitational-lensing",
          "status": "completed",
          "student_name": "Apoorva Vikram Singh",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Equivariant Neural Networks for Dark Matter Morphology with Strong Gravitational Lensing"
        },
        {
          "code_url": "https://github.com/ekurtgl/GSoC-2021-GNN_for_Trigger",
          "description": "<p>The Compact Muon Solenoid (CMS) is a detector at the Large Hadron Collider (LHC) located\nnear Geneva, Switzerland. The CMS experiment detects the resulting particles from the collusion and measures their kinematics using various sub detectors working in concert. High momentum muons are significant objects for many physics analyses at CMS. Therefore, an accurate momentum assignment scheme differentiating low momentum muons (background) from high momentum muons (signal) is crucial to the Endcap Muon Track Finder (EMTF) trigger. The first algorithm implemented in the trigger system was a discretized boosted decision tree. In this study, we will study the use of deep learning algorithms at the trigger level that requires microsecond level latency and therefore highly optimized inference. We will develop and benchmark the graph neural networks (GNN) for momentum regression in the trigger system. As deliverables, we will present the benchmarkings of deep network model inference for muon momentum assignment for prompt and displaced particles.</p>\n",
          "difficulty": null,
          "id": "proj_machine-learning-for_2021_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6452511203917824/",
          "proposal_id": null,
          "short_description": "The Compact Muon Solenoid (CMS) is a detector at the Large Hadron Collider (LHC) located\nnear Geneva, Switzerland. The CMS experiment detects the...",
          "slug": "graph-neural-networks-for-particle-momentum-estimation-in-the-cms-trigger-system",
          "status": "completed",
          "student_name": "Emre Kurtoglu",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "Graph Neural Networks for Particle Momentum Estimation in the CMS Trigger System"
        },
        {
          "code_url": "https://github.com/ML4SCI/DeepFalcon/tree/main/GNN_for_Fast_Detector_Simulation_Ali_Hariri",
          "description": "<p>The Large Hadron Collider (LHC) at CERN is the world's highest energy particle accelerator, delivering the highest energy proton-proton collisions ever recorded in the laboratory, permitting a detailed exploration of elementary particle physics at the energy frontier. Simulating the particle showers and interactions in the LHC detectors is both time consuming and computationally expensive. Present fast simulation approaches based on non-parametric techniques can improve the speed of the full simulation chain but suffer from lower levels of fidelity. For this reason, alternative methods based on machine learning can provide faster solutions, while maintaining a high level of fidelity. The main goal of a fast simulator is to map the events from the generation level directly to the reconstruction level. That being said, we aim to investigate the efficiency of deep generative models in simulating event reconstructions in a given detector, hence potentially replacing conventional complex algorithms.</p>\n",
          "difficulty": "advanced",
          "id": "proj_machine-learning-for_2021_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6686993836146688/",
          "proposal_id": null,
          "short_description": "The Large Hadron Collider (LHC) at CERN is the world's highest energy particle accelerator, delivering the highest energy proton-proton collisions...",
          "slug": "on-the-potential-of-graph-based-models-in-high-energy-physics",
          "status": "completed",
          "student_name": "Ali A. Hariri",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "On the potential of graph-based models in High Energy Physics"
        },
        {
          "code_url": "https://github.com/ML4SCI/MLMapper/pull/2",
          "description": "<p>Using Deep Learning techniques in order to model the relationship between the planetary albedo and chemical composition of Mercury.</p>\n",
          "difficulty": null,
          "id": "proj_machine-learning-for_2021_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5666647045570560/",
          "proposal_id": null,
          "short_description": "Using Deep Learning techniques in order to model the relationship between the planetary albedo and chemical composition of Mercury.",
          "slug": "machine-learning-model-for-the-albedo-of-mercury",
          "status": "completed",
          "student_name": "Georgios Pipilis",
          "student_profile": null,
          "tags": [],
          "title": "Machine Learning Model for the Albedo of Mercury"
        },
        {
          "code_url": "https://github.com/ML4SCI/DeepLense/tree/main/DeepLense_Regression_Yurii_Halychanskyi",
          "description": "<p>Currently, DeepLense supports the following models for unsupervised dark matter classification:</p>\n<pre><code> - Adversarial Autoencoder\n - Convolutional Variational Autoencoder\n - Deep Convolutional Autoencoder\n - Restricted Bolzmann Machine\n</code></pre>\n<p>Most of the listed models are surrogate base approaches. While surrogate approaches have become the mainstream method for anomaly detection in recent years and have shown promising results, it is hard to ensure that the surrogate tasks share a consistent optimization direction with anomaly detection. \nThe proposal offers to return to a direct objective function for anomaly detection, which maximized the distance between normal and anomalous data in terms of the joint distribution for image and feature representation. The above objective function is decomposed into the following fours components:</p>\n<pre><code>  - Mutual information between image space and latent space of normal data.\n  - Entropy of normal data in latent space.\n  - Expectations of cross-entropy between normal and anomalous samples in latent space.\n  - Distribution distance between normal and anomalous samples in image space.\n</code></pre>\n",
          "difficulty": null,
          "id": "proj_machine-learning-for_2021_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5719965138681856/",
          "proposal_id": null,
          "short_description": "Currently, DeepLense supports the following models for unsupervised dark matter classification:\n - Adversarial Autoencoder\n - Convolutional...",
          "slug": "direct-objective-function-for-anomaly-detection",
          "status": "completed",
          "student_name": "Yurii Halychanskyi",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Direct Objective Function for Anomaly Detection"
        },
        {
          "code_url": "https://github.com/ML4SCI/MLBender/tree/main/Anomaly_Detection_with_Normalizing_Flows_Muhammad_Ehsan_ul_Haq",
          "description": "<p><strong>Neural AutoRegressive Flows</strong> are one of the most recent addition to the family of autoregressive flows. By using NAFs, probability density estimation in the domain of scientific exploration can yield amazing results. For example if the background data of a particular device is modelled using NAFs, it can lead to the discovery of new phenomena with very little supervision.\nMain goals of the project include creating basic reusable building blocks for NAFs, <em>implementing NAFs</em> on the given High Energy Physics data obtained from various experimentation devices, <em>hyperparameter tuning</em> of the NAF model for optimum performance, providing <em>API for training plus inference</em> and finally <em>documenting</em> the API and various components of the system. Final product obtained will not only be easy to use but also easy to extend.</p>\n",
          "difficulty": "beginner",
          "id": "proj_machine-learning-for_2021_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5731919643279360/",
          "proposal_id": null,
          "short_description": "Neural AutoRegressive Flows are one of the most recent addition to the family of autoregressive flows. By using NAFs, probability density estimation...",
          "slug": "background-estimation-with-neural-autoregressive-flows",
          "status": "completed",
          "student_name": "Muhammad Ehsan ul Haq",
          "student_profile": null,
          "tags": [
            "api",
            "ai",
            "ui"
          ],
          "title": "Background Estimation with Neural AutoRegressive Flows"
        },
        {
          "code_url": "https://medium.com/@purva.chaudhari02/google-summer-of-code-2021-5cf8ef45d2d2",
          "description": "<p>One of the important aspects of searches for new physics at the Large Hadron Collider (LHC) involves the identification and reconstruction of single particles, jets and event topologies of interest in collision events. The End-to-End Deep Learning (E2E) project in the CMS experiment focuses on the development of these reconstruction and identification tasks with innovative deep learning approaches.</p>\n<p>This project focuses on the integration of E2E code with the CMSSW inference engine for use in reconstruction algorithms in offline and high-level trigger systems of the CMS experiment.</p>\n",
          "difficulty": null,
          "id": "proj_machine-learning-for_2021_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5752881768038400/",
          "proposal_id": null,
          "short_description": "One of the important aspects of searches for new physics at the Large Hadron Collider (LHC) involves the identification and reconstruction of single...",
          "slug": "end-to-end-deep-learning-reconstruction-for-cms-experiment",
          "status": "completed",
          "student_name": "Purva Chaudhari",
          "student_profile": null,
          "tags": [],
          "title": "End-to-End Deep Learning Reconstruction for CMS Experiment"
        },
        {
          "code_url": "https://github.com/Shra1-25/GSoC2021_BoostedTopJets",
          "description": "<p>This project focuses on the study and implementation of Graph Neural Networks (GNNs) for low-momentum Tau Particle Identification using the CMS Open Data. The algorithm will further be deployed on CMSSW (CMS Software) inference engine for use in reconstruction algorithms in offline and high level trigger systems of the CMS Experiment. The project also aims to compare the results of GNN based algorithms with the CNN (Convolutional Neural Network) based algorithms for tau particle identification. Finally, the graph neural network algorithm will be scaled to multiple GPUs and optimised accordingly for efficient training and inference using heterogeneous computing. The final inference performance on the CMSSW inference engine will be benchmarked facilitating the end-to-end low-momentum tau particle identification.</p>\n",
          "difficulty": null,
          "id": "proj_machine-learning-for_2021_009",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5481164319490048/",
          "proposal_id": null,
          "short_description": "This project focuses on the study and implementation of Graph Neural Networks (GNNs) for low-momentum Tau Particle Identification using the CMS Open...",
          "slug": "graph-neural-networks-for-end-to-end-particle-identification-with-the-cms-experiment",
          "status": "completed",
          "student_name": "Shravan Chaudhari",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Graph Neural Networks for End-to-End Particle Identification with the CMS Experiment"
        },
        {
          "code_url": "https://github.com/ML4SCI/DeepFalcon/pull/1",
          "description": "<p>DeepFalcon is an ultra-fast non-parametric detector simulation package. This project aims to extend DeepFalcon by adding functionality for Graph Normalizing Flows (GNFs) to it.</p>\n<p>While previous work on DeepFalcon has focused on other Deep Generative Models and Graph Neural Networks to simulate detector event reconstructions, we aim to use GNFs to create generative models for graph structures that can better approximate detector reconstructions.</p>\n",
          "difficulty": null,
          "id": "proj_machine-learning-for_2021_010",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5274521866600448/",
          "proposal_id": null,
          "short_description": "DeepFalcon is an ultra-fast non-parametric detector simulation package. This project aims to extend DeepFalcon by adding functionality for Graph...",
          "slug": "normalizing-flows-for-fast-detector-simulation",
          "status": "completed",
          "student_name": "Aditya Ahuja",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Normalizing Flows for Fast Detector Simulation"
        },
        {
          "code_url": "https://github.com/ML4SCI/QMLHEP/tree/main/Quantum_GAN_for_HEP_Chi_Lung_Cheng",
          "description": "<p>The proposed project \"Quple - Quantum GAN\" serves as an extension to the 2020 GSoC project \"Quple\" with a major focus on the implementation of Quantum Generative Adversarial Networks (QGAN). In this proposal, the quantum version of various popular GAN algorithms such as deep convolutional GAN (DCGAN) and Wasserstein GAN (possibly with gradient penalty) will be developed. Various quantum data encoding methods and neural network structures such as hybrid quantum-classical layers and multi-quantum layers will be explored. Their performance will be evaluated based on real physical data from high energy physics experiments. The core components of QGAN will be based on the Google TensorFlow  quantum library. Nevertheless, interfaces to common quantum computing libraries such as IBM Qiskit and Amazon Braket will be introduced to the framework to allow for more versatility and to cater to the need of users from different communities.</p>\n",
          "difficulty": null,
          "id": "proj_machine-learning-for_2021_011",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/4792725857107968/",
          "proposal_id": null,
          "short_description": "The proposed project \"Quple - Quantum GAN\" serves as an extension to the 2020 GSoC project \"Quple\" with a major focus on the implementation of...",
          "slug": "quple-quantum-gan",
          "status": "completed",
          "student_name": "Chi Lung Cheng",
          "student_profile": null,
          "tags": [],
          "title": "Quple - Quantum GAN"
        },
        {
          "code_url": "https://github.com/ML4SCI/CGM/tree/main/Dimensionality_Reduction_for_CGM_Jakub_Rybak",
          "description": "<p>This project will seek to identify dimensionality-reduction methods that achieve a reduction in the number of features while maintaining predictive performance of the relevant models. This will be done in the context of astrophysical data, however, the problem of many features is common in many areas, including genomics, economics and imaging.</p>\n",
          "difficulty": null,
          "id": "proj_machine-learning-for_2021_012",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/4819159568875520/",
          "proposal_id": null,
          "short_description": "This project will seek to identify dimensionality-reduction methods that achieve a reduction in the number of features while maintaining predictive...",
          "slug": "dimensionality-reduction-for-studying-diffuse-circumgalactic-medium",
          "status": "completed",
          "student_name": "Jakub Rybak",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Dimensionality Reduction for Studying Diffuse Circumgalactic Medium"
        },
        {
          "code_url": "https://github.com/eraraya-ricardo/qcnn-hep",
          "description": "<p>One of the challenges in High-Energy Physics (HEP) is events classification, which is to predict whether an image of particle jets belongs to events being sought after or just background signals. Classical Convolutional Neural Network (CNN) has been proven a powerful algorithm in image classification, including jets image. As quantum computers promise many advantages over classical computing, comes a question on whether quantum machine learning (QML) can give any improvement in solving the problem. This project aims to demonstrate quantum machine learning's potential, specifically Quantum Convolutional Neural Network (QCNN), in HEP events classification from image data. The code used in the research is wrapped as an open-source package to ease future research in this field.</p>\n",
          "difficulty": null,
          "id": "proj_machine-learning-for_2021_013",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/4853064678244352/",
          "proposal_id": null,
          "short_description": "One of the challenges in High-Energy Physics (HEP) is events classification, which is to predict whether an image of particle jets belongs to events...",
          "slug": "quantum-convolutional-neural-networks-for-high-energy-physics-analysis-at-the-lhc",
          "status": "completed",
          "student_name": "Eraraya Ricardo Muten",
          "student_profile": null,
          "tags": [
            "ml",
            "ai"
          ],
          "title": "Quantum Convolutional Neural Networks for High-Energy Physics Analysis at the LHC"
        },
        {
          "code_url": "https://github.com/ML4SCI/MLBender/tree/main/Normalizing_Flows_for_Background_Estimation_Sinan_Gen%C3%A7o%C4%9Flu",
          "description": "<p>Data-driven background estimation is crucial for many scientific searches, including searches for new phenomena in experimental datasets. Neural autoregressive flows (NAF) is a deep generative model that can be used for general transformations and is therefore attractive for this application.\nThe MLBENDER project focuses on studying how to develop such transformations that can be learned and applied to a region of interest.\nIn this project the main aim is implementing a Neural Autoregressive Flow (NAF) model to estimate the background distribution and apply it to a representative physics analysis searching for a resonance excess over a smooth background.</p>\n",
          "difficulty": null,
          "id": "proj_machine-learning-for_2021_014",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/4909112927715328/",
          "proposal_id": null,
          "short_description": "Data-driven background estimation is crucial for many scientific searches, including searches for new phenomena in experimental datasets. Neural...",
          "slug": "background-estimation-with-neural-autoregressive-flows-proposal",
          "status": "completed",
          "student_name": "Sinan Gençoğlu",
          "student_profile": null,
          "tags": [
            "ml",
            "ai"
          ],
          "title": "Background Estimation with Neural Autoregressive Flows Proposal"
        },
        {
          "code_url": "https://github.com/ML4SCI/TurbulentFluidDynamics/tree/main/ML_for_Turbulent_Fluid_Dynamics_Amey_Varhade",
          "description": "<p>Our understanding of Turbulence is still not very clear, studying fluid transitions to turbulence still poses challenging problems. The <strong>Navier-Stokes</strong> equations describe fluids in general and are based on Newtonian Mechanics. However, solving them for the general cases and understanding the solution behavior numerically and physically is quite complex. \nObtaining numerical solutions for turbulent flow is quite difficult. Solving turbulent flows using laminar solvers doesn’t give steady solutions. We find the solutions using spectral simulations of the Navier-Stokes equations and apply <strong>dimensionality reduction techniques</strong>  including but not limited to <strong>Autoencoders</strong> to study turbulence. Here, we aim at developing a statistical theory to well explain the transition of fluid to turbulence. The discussion and work will be limited to Newtonian and Incompressible fluids.</p>\n",
          "difficulty": "advanced",
          "id": "proj_machine-learning-for_2021_015",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5841879664427008/",
          "proposal_id": null,
          "short_description": "Our understanding of Turbulence is still not very clear, studying fluid transitions to turbulence still poses challenging problems. The Navier-Stokes...",
          "slug": "machine-learning-for-turbulent-fluid-dynamics",
          "status": "completed",
          "student_name": "Amey Varhade",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Machine Learning for Turbulent Fluid Dynamics"
        },
        {
          "code_url": "https://github.com/ML4SCI/E2E/tree/main/E2E_Regression_Anis_Ismail",
          "description": "<p>Experiments conducted at the Large Hadron Collider (LHC) are the source of the most important discoveries in new physics. One of the most prominent experiments is the Compact Solenoid (CMS), whose results rely on the reconstruction and detection of particles, jets, and topologies from low-level detector data using an End-to-End Deep Learning (E2E) model. This project intends to investigate the use of multiple Deep Learning architectures to learn the properties of simulated top quark pair events and successfully integrate the best performing architecture into the E2E CMSSW prototype.</p>\n",
          "difficulty": null,
          "id": "proj_machine-learning-for_2021_016",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5944488077295616/",
          "proposal_id": null,
          "short_description": "Experiments conducted at the Large Hadron Collider (LHC) are the source of the most important discoveries in new physics. One of the most prominent...",
          "slug": "end-to-end-deep-learning-regression-for-measurements-with-the-cms-experiment",
          "status": "completed",
          "student_name": "Anis Ismail",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "End-to-End Deep Learning Regression for Measurements with the CMS Experiment"
        },
        {
          "code_url": "https://github.com/Anantha-Rao12/Decoding-Quantum-States-with-NMR",
          "description": "<p>At low temperatures, many materials transition into an electronic phase which cannot be classified as a simple metal or insulator, and quantum phases of matter, like superconductors and spin liquids, are hard to study due to their fragile nature, making non-intrusive and indirect measurements important. Scientists hence use NMR (Nuclear Magnetic resonance) to probe these materials externally. NMR is an experimental technique mainly used in quality control and scientific research to determine the molecular structure, purity, and content of any sample. The GSoC project idea is to explore the connection between electronic phases and nuclei in these materials via simulations of NMR, analyze the time-evolution of nuclear spins in external magnetic pulses, and classify them using suitable Machine Learning and Deep Learning models. We also aim to optimize an applied magnetic pulse sequence to best estimate a specific physical parameter from a given material.</p>\n",
          "difficulty": null,
          "id": "proj_machine-learning-for_2021_017",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5981431137828864/",
          "proposal_id": null,
          "short_description": "At low temperatures, many materials transition into an electronic phase which cannot be classified as a simple metal or insulator, and quantum phases...",
          "slug": "decoding-quantum-states-through-nuclear-magnetic-resonance",
          "status": "completed",
          "student_name": "Anantha Rao",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Decoding quantum states through Nuclear Magnetic Resonance"
        },
        {
          "code_url": "https://github.com/ML4SCI/DeepLense/tree/main/Domain_Adaptation_for_DeepLense_Marcos_Tidball",
          "description": "<p>Dark matter is one of the biggest questions in current cosmology, and many different theories were created to try to explain it. One of the challenges of studying dark matter is actually finding it, as it is only noticeable due to gravitational interactions. Fortunately, recent results have shown that strong gravitational lensing can be used as a probe for studying dark matter’s substructure. Unsupervised learning algorithms are particularly interesting in this field because they allow for the identification of dark matter substructure without a prior theoretical model assumption. While the performance of these algorithms is very promising, there is still a large gap when compared to supervised learning algorithms. One promising possibility is to use domain adaptation techniques to fine tune the models trained on simulation data with real data. Thus, this project will focus on using domain adaptation to account for the differences in the modelling and available real observation data, while also improving the interface with PyAutoLens, the software used for creating the strong lens simulations.</p>\n",
          "difficulty": null,
          "id": "proj_machine-learning-for_2021_018",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6297273905971200/",
          "proposal_id": null,
          "short_description": "Dark matter is one of the biggest questions in current cosmology, and many different theories were created to try to explain it. One of the...",
          "slug": "domain-adaptation-for-decoding-dark-matter-with-strong-gravitational-lensing",
          "status": "completed",
          "student_name": "Marcos Tidball",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Domain Adaptation for Decoding Dark Matter with Strong Gravitational Lensing"
        },
        {
          "code_url": "https://github.com/ML4SCI/LOX/tree/main/Thermonuclear_Supernova_Classification_Sophia_He",
          "description": "<p>Fundamental questions about Thermonuclear Supernovae (Type-Ia or SNeIa), the beacons visible across the universe, remain unanswered. Using the currently-available extensive library of detailed supernova simulation data, I aim to identify machine learning and computational techniques suitable for this project, produce a cluster-predict model that identifies cluster classes based on observable parameters, characterize the degree of confidence of the model, and ultimately establish classification metrics for Type-Ia supernovae to prepare for future nuclear astrophysics investigations, advancing our understanding of these beacons of the cosmos.</p>\n",
          "difficulty": null,
          "id": "proj_machine-learning-for_2021_019",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5167133490675712/",
          "proposal_id": null,
          "short_description": "Fundamental questions about Thermonuclear Supernovae (Type-Ia or SNeIa), the beacons visible across the universe, remain unanswered. Using the...",
          "slug": "uncovering-the-enigma-of-type-ia-supernovae-thermonuclear-supernova-classification-via-their-nuclear-signatures",
          "status": "completed",
          "student_name": "Sophia He",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Uncovering the Enigma of Type-Ia Supernovae: Thermonuclear Supernova Classification via their Nuclear Signatures"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2021/organizations/5101210708738048/"
    },
    "year_2022": {
      "num_projects": 20,
      "projects": [
        {
          "code_url": "https://gist.github.com/Torus403/b98799102002cf463f49e75fb259665f",
          "description": "Finding Exoplanets with Astronomical Observations.\nThe aim of this of this project would be to apply machine learning / deep learning methods on astronomical observations in order to predict (or not) the presence of exoplanets.\nThe datasets used for this are widely available such as the Kaggle \"Exoplanet Hunting in Deep Space\" dataset. \nUsing various established methodologies such as K-nearest neighbors, principal component analysis, and convolutional neural networks, as well as promising new algorithms such as Spiking Neural Networks, we will hope to find or at least confirm occurences of exoplanets.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2022_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/y2IVgVAJ/",
          "proposal_id": null,
          "short_description": "Finding Exoplanets with Astronomical Observations. The aim of this of this project would be to apply machine learning / deep learning methods on...",
          "slug": "finding-exoplanets-with-astronomical-observations",
          "status": "completed",
          "student_name": "Jack Mcnish",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Finding Exoplanets with Astronomical Observations"
        },
        {
          "code_url": "https://github.com/abzsd/GSoC-ML4SCI",
          "description": "One of the challenges in High-Energy Physics(HEP) is fast simulation of particle transport, and hence various deep neural network methods have been studied for reducing the time-consumption. The Generative Adversarial Networks(GANs) have achieved similar performance as the full Monte Carlo based simulation, but with reduced time taken. As quantum computers promise many advantages over classical computing, comes a question on whether quantum machine learning (QML) can give any improvement in solving the problem. This project aims to demonstrate quantum machine learning's potential, specifically Quantum Generative Adversarial Network (QGAN), in HEP events data generation and classification from image data. Although many previous works have tried to classify images with QGAN, none of them is fully quantum. This project will be aimed at producing new 'accurate' data with a fully quantum implementation of QGAN, along with integrating it with the Physics channel of the LHC e.g. the Higgs-Boson production event.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2022_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/QzBcIxrS/",
          "proposal_id": null,
          "short_description": "One of the challenges in High-Energy Physics(HEP) is fast simulation of particle transport, and hence various deep neural network methods have been...",
          "slug": "implementation-of-qgans-to-perform-high-energy-physics-analysis-at-the-lhc",
          "status": "completed",
          "student_name": "Abhay Kamble",
          "student_profile": null,
          "tags": [
            "ml",
            "ai"
          ],
          "title": "Implementation of QGANs to Perform High Energy Physics Analysis at the LHC"
        },
        {
          "code_url": "https://github.com/ML4SCI/Anomaly-Detection",
          "description": "Anomaly detection is the process of identifying data points, events, and observations that differ from a dataset's expected behavior, called (outliers).\nResearchers are interested in searching for rare events (new physics), a key feature of particle physics. When detecting these events using various methodologies, it is vital to have real-time and accurate models.\nAutoencoders and Deep Learning models play a core role in detecting anomalies with high efficiency. \nTherefore, this project aims to examine and evaluate different autoencoder models for detecting anomalies. And to compare their results with the Contrastive Learning.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2022_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/XIkPphMz/",
          "proposal_id": null,
          "short_description": "Anomaly detection is the process of identifying data points, events, and observations that differ from a dataset's expected behavior, called...",
          "slug": "anomalies-detection",
          "status": "completed",
          "student_name": "Amal Saif",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Anomalies Detection"
        },
        {
          "code_url": "https://mahdiboulila.medium.com/google-summer-of-code-2022-finding-exoplanets-with-astronomical-observations-985d8cd26b34",
          "description": "The purpose of this project is to use publicly available data from astronomical observations intended to identify exoplanets in order to determine whether or not a given stellar system contains one or more exoplanets using machine-learning.\nAs is exemplified by the Kepler Mission, identifying exoplanets – using any method – relies on massive datasets and signals that can be subtle and noisy. Machine \nlearning may be a useful avenue for systematically, accurately, and quickly identifying \nplanets and avoiding such situations. With the proposed guideline on how to treat, filter, and create easily managed datasets, the machine learning model can accurately identify exoplanets.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2022_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/LxYh0Jtq/",
          "proposal_id": null,
          "short_description": "The purpose of this project is to use publicly available data from astronomical observations intended to identify exoplanets in order to determine...",
          "slug": "finding-exoplanets-with-astronomical-observations",
          "status": "completed",
          "student_name": "Mahdi Boulila",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Finding Exoplanets with Astronomical Observations"
        },
        {
          "code_url": "https://github.com/ML4SCI/DeepLense/tree/main/DeepLense_Gravitational_Lensing_Mriganka_Nath",
          "description": "Machine learning techniques are regarded to have the potential to help researchers better comprehend dark matter. Convolutional Neural Networks (CNNs) have previously been used to successfully distinguish between distinct types of substructures such as no substructure, vortex substructure, and spherical substructure. In this task, we'll classify images based on whether or not they have a strong lensing effect. Strong Gravitational Lensing allows us to analyse the substructure of dark matter, allowing us to gain a deeper understanding of its underlying nature. The observed strong lens images may be utilized in the Deeplense pipeline for dark matter substructure classification, anomaly detection, and interpretation. Images may be processed using a variety of algorithms. We'll try out several types of models, fine-tune them to obtain good outcomes, and compare them. Because a single model may not be sufficient, we can combine the findings of several models using ensembling to obtain a more robust and better outcome. We'll document and record every outcome as we experiment with our models. We will also provide starter notebooks  describing how to train and test the models so that it will be easy for anyone to understand our work.",
          "difficulty": "beginner",
          "id": "proj_machine-learning-for_2022_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/Bc0tUyhL/",
          "proposal_id": null,
          "short_description": "Machine learning techniques are regarded to have the potential to help researchers better comprehend dark matter. Convolutional Neural Networks...",
          "slug": "gravitational-lens-finding-for-dark-matter-substructure-pipeline",
          "status": "completed",
          "student_name": "Mriganka Nath",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Gravitational Lens Finding for Dark Matter Substructure Pipeline"
        },
        {
          "code_url": "https://github.com/Amey-2002/GSoC_2022_QMLHEP",
          "description": "One of the problems in High Energy Physics experiments is that particle collisions give rise to novel subatomic particles which need to be detected but these collisions produce large amounts of data which proves to be a heavy load for detectors to distinguish between actual data (signal events) and other data(background events). This is where Machine Learning proves to be useful for such classification tasks. The proposed project introduces an novel approach for Quantum Generative Adversarial Networks, a quantum machine learning technique to solve high energy physics problems like regeneration and classification of large data. This project aims to demonstrate quantum machine learning's potential in solving critical high energy physics problems that seem to be intractable using classical techniques. The QGAN models introduced in this project are developed using Google TensorFlow Quantum library and Cirq framework.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2022_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/jp4vG7tW/",
          "proposal_id": null,
          "short_description": "One of the problems in High Energy Physics experiments is that particle collisions give rise to novel subatomic particles which need to be detected...",
          "slug": "quantum-generative-adversarial-neural-networks-for-high-energy-physics-analysis-at-the-lhc",
          "status": "completed",
          "student_name": "Amey Bhatuse",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Quantum Generative Adversarial Neural Networks for High Energy Physics Analysis at the LHC"
        },
        {
          "code_url": "https://github.com/ML4SCI/DeepLense/tree/main/Updating_the_DeepLense_Pipeline__Saranga_K_Mahanta",
          "description": "The study of dark matter substructures has shown promise in addressing the open-ended and long-standing challenge of identifying the true nature of dark matter. Strong gravitational lensing is a potential way to learn more about dark matter's basic nature by probing its substructure. Deep learning approaches can properly recognize images with substructure and distinguish WIMP particle dark matter from other well-motivated models including dark matter condensates, superfluids, and vortex substructure. The DeepLense pipeline combines state-of-the-art deep learning models with strong lensing simulations based on lenstronomy. The focus of this project will be training and testing deep learning models with various architectures on new dark matter simulations (e.g. WDM and SIDM) in order to update the previous results of classification, regression, anomaly detection, etc. for the DeepLense Pipeline.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2022_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/nZV4B8Xz/",
          "proposal_id": null,
          "short_description": "The study of dark matter substructures has shown promise in addressing the open-ended and long-standing challenge of identifying the true nature of...",
          "slug": "updating-the-deeplense-pipeline",
          "status": "completed",
          "student_name": "Saranga Kingkor Mahanta",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Updating the DeepLense Pipeline"
        },
        {
          "code_url": "https://github.com/dc250601/GSOC",
          "description": "The project aims to use Vision Transformer-based architectures to classify high-energy particles. The data consists of multi-channel simulated images from the calorimeter itself. The photos are used to classify the collision events. Previously various CNN-based architectures were built for the same, but in this project, we will try to use Visual Image Transformer-based architectures to classify the high-energy particle showers. We will experiment with various ViT-based architectures to find the highest possible validation metrics. We will also experiment with various advanced techniques used by contemporary deep-learning researchers to give a bleeding edge to the project. ViT is a much more powerful algorithm in comparison to the vanilla CNNs and if trained properly with a large amount of data often performs much better compared to CNNs. The main outcome of this project will be a Transformer based image classification architecture than can outperform CNNs in the classification of high energy particle images.",
          "difficulty": "advanced",
          "id": "proj_machine-learning-for_2022_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/ZlIvAjlo/",
          "proposal_id": null,
          "short_description": "The project aims to use Vision Transformer-based architectures to classify high-energy particles. The data consists of multi-channel simulated images...",
          "slug": "vision-transformers-for-end-to-end-particle-reconstruction-for-the-cms-experiment",
          "status": "completed",
          "student_name": "Diptarko Choudhury",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Vision Transformers for End-to-End Particle Reconstruction for the CMS Experiment"
        },
        {
          "code_url": "https://github.com/ML4SCI/DeepLense/tree/main/Transformers_Classification_DeepLense_Kartik_Sachdev",
          "description": "Strong gravitational lensing is a phenomenon where the light of distant galaxies is bent and distorted by the gravity of massive galaxy clusters, which contain dark matter. Strong gravitational lensing has proven to be an effective method for detecting the substructures of dark matter halos. A substructure provides essential information for the identification of the true nature of dark matter. Recently, Deep Learning techniques have been quite successful in classifying different substructures and predicting the mass densities using images from the simulation of strong gravitational lensing. DeepLense is one of the projects that uses state-of-the-art Deep Learning methods to exploit this information from the underlying substructures. \n\nThis project will, thus, focus on the further development of the DeepLense pipeline to integrate Vision Transformers as another approach to the existing implementations of ResNets and Equivariant Networks. We will be implementing and benchmarking various versions of Vision Transformers to achieve a robust architecture with high metrics for classification tasks respectively on the simulated strong lensing images.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2022_009",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/L557jFPL/",
          "proposal_id": null,
          "short_description": "Strong gravitational lensing is a phenomenon where the light of distant galaxies is bent and distorted by the gravity of massive galaxy clusters,...",
          "slug": "transformers-for-dark-matter-morphology-with-strong-gravitational-lensing",
          "status": "completed",
          "student_name": "Kartik Sachdev",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Transformers for Dark Matter Morphology with Strong Gravitational Lensing"
        },
        {
          "code_url": "https://github.com/ML4SCI/EXXA/tree/main/KINEMATIC_APPROACH",
          "description": "The ultimate purpose of this project is to train image-based deep learning models to detect planets embedded in protoplanetary disks. This will be done using a kinematic analysis of the disk, i.e., observing how the material inside of it is moving. Given the relative sparsity of high-quality kinematic observations of these disks, training data will be a combination of actual observations and synthetic images generated from hydrodynamics simulations.  Models will not only be evaluated based on their performance as quantified via typical measures, but they will also be evaluated on their ability to locate planets through the intensity of their activations. A performant model will confidently predict the presence, or lack-thereof, of a planet and precisely highlight it when activated.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2022_010",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/ifDd82zk/",
          "proposal_id": null,
          "short_description": "The ultimate purpose of this project is to train image-based deep learning models to detect planets embedded in protoplanetary disks. This will be...",
          "slug": "finding-exoplanets-with-astronomical-observations",
          "status": "completed",
          "student_name": "Jason Terry",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Finding Exoplanets with Astronomical Observations"
        },
        {
          "code_url": "https://github.com/BoGGoG/SYMBA",
          "description": "Calculating squared amplitudes and cross sections of a Feynman Diagram in high-energy physics is a tedious task. While software like MARTY (A Modern Artificial Theoretical Physicist) exist, the calculations can still take very long, even on the order of days or weeks for one single diagram.\nHowever, there are applications where it would be of great benefit to be able to quickly calculate many squared amplitudes. The project I propose here is about using Machine Learning—in particular Natural Language Processing—to achieve exactly this: A fast prediction of squared amplitudes and cross sections.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2022_011",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/pb2tY6OB/",
          "proposal_id": null,
          "short_description": "Calculating squared amplitudes and cross sections of a Feynman Diagram in high-energy physics is a tedious task. While software like MARTY (A Modern...",
          "slug": "symbolic-empirical-representation-of-squared-amplitudes-in-high-energy-physics",
          "status": "completed",
          "student_name": "Marco Knipfer",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "Symbolic empirical representation of squared amplitudes in high-energy physics"
        },
        {
          "code_url": "https://github.com/ML4SCI/QMLHEP/tree/main/Quantum_AE_for_HEP_Tom_Magorsch",
          "description": "In the search for physics beyond the standard model physics, the growing amount of data and the evasive of the signals that are being searched for, calls for new methods. A prominent method is the use of autoencoders to search for anomalous events in an unsupervised manner. In project I implement a quantum autoencoder to perform anomaly detection on jet images. The goal is to distinguish QCD jets from anomalous jets with a different production mechanism. I train the quantum autoencoder on standard model data and compare it's performance as an anomaly tagger to a classical autoencoder, to study the potential use of quantum machine learning methods to enhance HEP analyses.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2022_012",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/ePnjKlJs/",
          "proposal_id": null,
          "short_description": "In the search for physics beyond the standard model physics, the growing amount of data and the evasive of the signals that are being searched for,...",
          "slug": "quantum-variational-autoencoders-for-hep-analysis-at-the-lhc",
          "status": "completed",
          "student_name": "ToMago",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Quantum Variational Autoencoders for HEP Analysis at the LHC"
        },
        {
          "code_url": "https://medium.com/@JaiBardhan/google-summer-of-code-2022-with-ml4sci-e2e-top-mass-regression-using-graph-neural-networks-3268a091660b",
          "description": "Graph Neural Networks for End-to-End Particle Identification with the CMS Experiment:   \n\nThe goal of the project would be to develop, train, test, and benchmark GNNs (Graph Neural Networks) for low momentum tau identification. The GNN (Graph Neural Networks) would work with an E2E framework and work on raw collider data.  \n\nTau leptons play a crucial role in the search for new Physics, and in the search for new particles. Tau leptons decay into hadrons and lighter leptons, these analyses require efficient tagging of tau leptons for obtaining good signal to background ratios for discovery/exclusion. There has been recent work by CMS that incorporates DNNs (Deep Neural Networks) for performing tau identification that shows encouraging results. An E2E GNN working directly on the raw collider data may be able to provide better results.  \n\nThe goal may be tackled in the following steps: \n\n1. Exploration and analysis of different strategies for graph construction: This would include the node construction and edge construction, which would further include pruning, preprocessing, and input representations. \n\n2. Developing different graph architectures: This step would firstly include exploratory testing between different GNN architectures. Then taking ideas from the exploratory analysis novel architectures can be experimented with. \n\n3. Testing and benchmarking GNN performance: Once a model architecture with hyperparameters is decided, a sweep may be performed to obtain the best performance of the model. Further testing and benchmarking will be performed in terms of the inference speeds, compute requirements, and performance on different cases (and possibly robustness). \n\nDeliverables: \n\n1. Trained Model for the E2E low momentum tau identification \n2. Analysis of the design choices \n3. Analysis and Benchmark of the performance of the model",
          "difficulty": null,
          "id": "proj_machine-learning-for_2022_013",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/5rp25PJB/",
          "proposal_id": null,
          "short_description": "Graph Neural Networks for End-to-End Particle Identification with the CMS Experiment: The goal of the project would be to develop, train, test, and...",
          "slug": "graph-neural-networks-for-end-to-end-particle-identification-with-the-cms-experiment",
          "status": "completed",
          "student_name": "Jai Bardhan",
          "student_profile": null,
          "tags": [
            "ios",
            "ai",
            "ui"
          ],
          "title": "Graph Neural Networks for End-to-End Particle Identification with the CMS Experiment"
        },
        {
          "code_url": "https://github.com/Purva-Chaudhari/RecoE2E",
          "description": "One of the important aspects of searches for new physics at the Large Hadron Collider (LHC) involves the identification and reconstruction of single particles, jets and event topologies of interest in collision events. The End-to-End Deep Learning (E2E) project in the CMS experiment focuses on the development of these reconstruction and identification tasks with innovative deep learning approaches.\n\nThis project focuses on the integration of E2E code with the CMSSW inference engine for use in reconstruction algorithms in offline and high-level trigger systems of the CMS experiment.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2022_014",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/zT2XkLRX/",
          "proposal_id": null,
          "short_description": "One of the important aspects of searches for new physics at the Large Hadron Collider (LHC) involves the identification and reconstruction of single...",
          "slug": "end-to-end-deep-learning-reconstruction-for-cms-experiment",
          "status": "completed",
          "student_name": "Purva Chaudhari",
          "student_profile": null,
          "tags": [],
          "title": "End-to-End Deep Learning Reconstruction for CMS Experiment"
        },
        {
          "code_url": "https://github.com/ML4SCI/DeepLense/tree/main/DeepLense_Classification_Transformers_Archil_Srivastava",
          "description": "Since Dark Matter was discovered, physicists have been trying to understand its composition. In practice, the best method to detect substructure is from strong gravitational lensing images. Given the huge success of deep learning algorithms in computer vision across various fields, it seems a promising path to use these algorithms on gravitational lensing images to classify the Dark Matter substructure. In recent years, attention-based networks like Vision Transformers have shown immense promise in Computer Vision tasks. Hence, the intention is to use them for classifying Dark Matter substructure from gravitational lensing images.\n\nDeepLense is a deep learning pipeline for particle dark matter searches with strong gravitational lensing. This project will focus on implementing Vision Transformers in the DeepLense pipeline, which is expected to immensely boost the current performance of the system.\n\nThe overall deliverables of this project are:\n- A Python module implementing Vision Transformers (ViT).\n- Training/evaluation scripts to train this ViT model on gravitational lensing dataset.\n- Pre-trained, ready-to-use ViT models for other pipelines using lensing datasets.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2022_015",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/iFKJMj0t/",
          "proposal_id": null,
          "short_description": "Since Dark Matter was discovered, physicists have been trying to understand its composition. In practice, the best method to detect substructure is...",
          "slug": "transformers-for-dark-matter-morphology-with-strong-gravitational-lensing",
          "status": "completed",
          "student_name": "Archil Srivastava",
          "student_profile": null,
          "tags": [
            "python",
            "ai"
          ],
          "title": "Transformers for Dark Matter Morphology with Strong Gravitational Lensing"
        },
        {
          "code_url": "https://github.com/Allyyi/ML4SCI-GSOC-GNN",
          "description": "In recent years, the convolutional neural network has been successfully applied in particle physics identification tasks. Despite its great success, the existing image-based methods for particle suffers from data sparsity. Motivated by this question, we plan to represent the particles data in graph and find the most suitable graph representation method in this project. Then, we will build various graph neural networks for end-to-end tau identification with the cutting-edge methods in current graph deep learning research. Furthermore, we will analyze the model performance from multiple perspectives and try to interpret what the networks have learned through training. Lastly, we will benchmark model inference on GPU and provide user guidance through documentation and code. This project will give some insights into the application of Graph Neural Network in tau particle identification and is expected to help the ML4SCI community conduct research in future work.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2022_016",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/MB5Hx1cQ/",
          "proposal_id": null,
          "short_description": "In recent years, the convolutional neural network has been successfully applied in particle physics identification tasks. Despite its great success,...",
          "slug": "graph-neural-networks-for-end-to-end-particle-identification-with-the-cms-experiment",
          "status": "completed",
          "student_name": "Xin Yi",
          "student_profile": null,
          "tags": [
            "ml",
            "ai",
            "ui"
          ],
          "title": "Graph Neural Networks for End-to-End Particle Identification with the CMS Experiment"
        },
        {
          "code_url": "https://github.com/ML4SCI/DeepLense/tree/main/DeepLense_Regression_Yurii_Halychanskyi",
          "description": "Convolutional Neural Networks require large receptive fields in order to track long-range dependencies within an image, which in practice involves large kernels or long sequences of convolutional layers at the cost of losing efficiency. The problem can be mitigated by using Equivariant Transformers. Attention layers can directly replace the convolutions, so they will be able to attend to a larger receptive field than regular convolutions. In addition, the equivariant part of the model can replace the manual augmentation applied on every batch during training.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2022_017",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/58Y5QOU4/",
          "proposal_id": null,
          "short_description": "Convolutional Neural Networks require large receptive fields in order to track long-range dependencies within an image, which in practice involves...",
          "slug": "equivariant-transformers-for-decoding-dark-matter-with-strong-gravitational-lensing",
          "status": "completed",
          "student_name": "Yurii Claus",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Equivariant Transformers for Decoding Dark Matter with Strong Gravitational Lensing"
        },
        {
          "code_url": "https://github.com/ML4SCI/QMLHEP/tree/main/Quantum_CNN_for_HEP_Gopal_Ramesh_Dahale",
          "description": "This study aims to show the capabilities of QML especially QCNN for classifying the HEP image datasets. QCNN can be completely quantum or can be a hybrid with classical. The aim is to implement both. We will use quantum variational classification instead of the final FC classical layers in the quantum setting. This will give more depth about the quantum power that can be used in the near-term future.\n\nI summarize the required deliverables that will be achieved before the official end.\n\nImplementation of some chosen classical ML models as a baseline using TensorFlow.\n\nImplementing QCNN for fully quantum and hybrid architectures including different data encoding schemes (angle, amplitude encoding etc.). Jupyter notebooks will be used as a testing environment but the final python modules will have a .py extension. These notebooks will then be extended as a form of documentation for beginner contributors.\n\nComparison of classical ML baseline models with QCNN and documenting the results.",
          "difficulty": "beginner",
          "id": "proj_machine-learning-for_2022_018",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/0gbpQgKv/",
          "proposal_id": null,
          "short_description": "This study aims to show the capabilities of QML especially QCNN for classifying the HEP image datasets. QCNN can be completely quantum or can be a...",
          "slug": "quantum-convolutional-neural-networks-for-high-energy-physics-analysis-at-the-lhc",
          "status": "completed",
          "student_name": "Gopal Ramesh Dahale",
          "student_profile": null,
          "tags": [
            "python",
            "ml",
            "ai",
            "ui"
          ],
          "title": "Quantum Convolutional Neural Networks for High Energy Physics Analysis at the LHC"
        },
        {
          "code_url": "https://github.com/ML4SCI/FASEROH",
          "description": "This proposal regards mapping histogram data to its underlying function; both of which can be represented as sequences and hence a transformer can and will be used to represent the mapping. This project involves both generating functions and histograms to use as a dataset and implementing and training a transformer to perform the mapping.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2022_019",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/f5Oq08iH/",
          "proposal_id": null,
          "short_description": "This proposal regards mapping histogram data to its underlying function; both of which can be represented as sequences and hence a transformer can...",
          "slug": "fast-accurate-symbolic-empirical-representation-of-histograms",
          "status": "completed",
          "student_name": "Aaron Mayer",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Fast Accurate Symbolic Empirical Representation of Histograms"
        },
        {
          "code_url": "https://medium.com/@gg884691896/gsoc-2021-with-ml4sci-deep-regression-exploration-34d5d8fb4643",
          "description": "Using Deep Regression techniques to decode Dark Matter with Strong Gravitational Lensing. Try to use the SOTA deep model (such as transformers) to do the regression task.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2022_020",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/lnptRFqq/",
          "proposal_id": null,
          "short_description": "Using Deep Regression techniques to decode Dark Matter with Strong Gravitational Lensing. Try to use the SOTA deep model (such as transformers) to do...",
          "slug": "deep-regression-exploration",
          "status": "completed",
          "student_name": "Zhongchao Guan",
          "student_profile": null,
          "tags": [],
          "title": "Deep Regression Exploration"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2022/organizations/machine-learning-for-science-ml4sci/"
    },
    "year_2023": {
      "num_projects": 23,
      "projects": [
        {
          "code_url": "https://github.com/ML4SCI/DeepFalcon",
          "description": "Particle colliders such as the Large Hadron Collider (LHC) play a crucial role in advancing our understanding of fundamental particles and their interactions. To achieve their desired performance, these experiments rely on accurate simulations of high-energy physics (HEP) events. However, simulating HEP events required for these experiments with traditional approaches such as Monte Carlo simulation is time-consuming and computationally expensive because of which there is a need to explore different approaches. \r\n\r\nDeepFalcon is a generative ultra-fast non-parametric detector simulation package. This project aims to extend DeepFalcon by adding functionality for Diffusion models to it. The proposed project will build upon existing research on diffusion models and leverage the advancements in deep learning techniques to explore the application of diffusion models for fast simulation of HEP events in particle detectors and potentially improve the accuracy and efficiency of the simulations.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2023_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/QDPyBSbO",
          "proposal_id": "DleO3qxe",
          "short_description": "Particle colliders such as the Large Hadron Collider (LHC) play a crucial role in advancing our understanding of fundamental particles and their...",
          "slug": "diffusion-models-for-fast-detector-simulation",
          "status": "completed",
          "student_name": "Akshit Choudhari",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Diffusion Models for Fast Detector Simulation"
        },
        {
          "code_url": "https://medium.com/@anthony_iytrzx/test-title-gsoc-2023-92732bff3e57",
          "description": "This project focuses on developing and evaluating end-to-end Graph Neural Network (GNN) models for low-momentum tau identification in the context of particle physics experiments, such as the Compact Muon Solenoid (CMS) at CERN. The project aims to improve tau identification performance by leveraging GNNs' ability to capture complex relationships between jet constituents. Additionally, this project will test and benchmark GNN inference on Graphics Processing Units (GPUs) to assess the potential for real-time analysis and integration with existing systems. Key tasks include literature review, data preprocessing, graph construction, model selection, implementation, training, evaluation, optimization, GPU inference testing, benchmarking, and documentation. The expected outcomes of the project are a trained end-to-end GNN model tailored for low-momentum tau identification, a comprehensive evaluation and optimization of the model, and a thorough benchmark of GNN inference on GPUs.",
          "difficulty": "advanced",
          "id": "proj_machine-learning-for_2023_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/69elZR8R",
          "proposal_id": "VXTNJNPv",
          "short_description": "This project focuses on developing and evaluating end-to-end Graph Neural Network (GNN) models for low-momentum tau identification in the context of...",
          "slug": "graph-neural-networks-for-end-to-end-particle-identification-with-the-cms-experiment",
          "status": "completed",
          "student_name": "Anthony Song",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Graph Neural Networks for End-to-End Particle Identification with the CMS Experiment"
        },
        {
          "code_url": "https://medium.com/@zhontiandong/equivariant-quantum-neural-networks-be4ba231c457",
          "description": "This project aims to explore the development and application of equivariant quantum neural networks (EQNNs) for continuous symmetry in high-energy physics data. This type of network architecture will respect certain underlying symmetry of the input data. While several studies for discrete symmetry such as permutation symmetries have been done recently. Research for continuous symmetry is still limited. I will begin by implementing EQNNs on a toy model related to a simple continuous group. Afterward, I will apply the proposed EQNNs to high-energy physics data and compare the results with classical machine learning methods.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2023_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/Pzd5EZBm",
          "proposal_id": "QfSTKWjr",
          "short_description": "This project aims to explore the development and application of equivariant quantum neural networks (EQNNs) for continuous symmetry in high-energy...",
          "slug": "equivariant-quantum-neural-networks-for-continuous-symmetry-in-high-energy-physics",
          "status": "completed",
          "student_name": "Cosmos Dong",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Equivariant Quantum Neural Networks for Continuous Symmetry in High Energy Physics"
        },
        {
          "code_url": "https://medium.com/@cdiptarko/invariant-nets-and-particle-showers-b6ac21275d86",
          "description": "Symmetry is one of the most beautiful and interesting phenomena in physics. Particle Physics is dominated by Lorentz symmetry. It is seen that Equivariant networks are more expressive and sample efficient than conventional Neural Networks. The project aims to build a Lorentz Equivariant Neural network to analyse particle collision data obtained from CMS Open Data. The project also aims to compare the results of the Lorentz Equivariant model with other Equivariant models(symmetry groups) and conventional CNNs and ViTs in terms of performance, speed and sample efficiency.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2023_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/OZd31ChO",
          "proposal_id": "hAmeBnIX",
          "short_description": "Symmetry is one of the most beautiful and interesting phenomena in physics. Particle Physics is dominated by Lorentz symmetry. It is seen that...",
          "slug": "exploring-the-underlying-symmetries-in-particle-physics-with-equivariant-neural-networks",
          "status": "completed",
          "student_name": "Diptarko Choudhury",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Exploring the underlying symmetries in particle physics with equivariant neural networks"
        },
        {
          "code_url": "https://medium.com/@eric0reinhardt/gsoc-2023-with-ml4sci-reconstruction-and-classification-of-particle-collisions-with-masked-bab8b38958df",
          "description": "In high energy physics, much research revolves around the study of particles produced by colliding protons at near the speed of light. The Higgs boson which is a heavy and highly unstable elementary particle is not present in nature but is generated in high energy collisions. Because it’s unstable and decays before reaching the edge of the detector, we study it by observing its decay products which tend to form conical jets and then reconstruct the Higgs bosons from these observations. One technique we might use to reconstruct these particles is to pass the kinematic variables (momentum, energy, etc.) to a transformer autoencoder while masking either subsets of kinematics or the kinematics for an entire particle. This could lead to improvements of reconstruction for more difficult to reconstruct particles such as neutrinos.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2023_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/SQ6YkFc3",
          "proposal_id": "arKvYz98",
          "short_description": "In high energy physics, much research revolves around the study of particles produced by colliding protons at near the speed of light. The Higgs...",
          "slug": "prediction-of-high-energy-particle-kinematics-via-masked-autoencoding",
          "status": "completed",
          "student_name": "Eric Reinhardt",
          "student_profile": null,
          "tags": [],
          "title": "Prediction of High Energy Particle Kinematics via Masked Autoencoding"
        },
        {
          "code_url": "https://medium.com/@eyupb.unlu/cd9ed594e4a2",
          "description": "Transformer-based models are gaining more and more traction in many fields, including physics. However, they are particularly known to require enormous computational resources. Moreover, as the data and the complexity of models grow, so does the computational resources required to operate and train. Supplying this increasing demand might be unsustainable in future. Large Hadron Collider (LHC) data is a good example of this phenomenon in physics with the large amount of data it produces especially in the high luminosity phase of the LHC. Quantum machine learning might be a viable solution to this problem by decreasing the time complexity of the computation significantly. I propose implementing a proof of concept Quantum Visual Transformer model to classify a synthetic dataset of jets produced via Pythia8.",
          "difficulty": "advanced",
          "id": "proj_machine-learning-for_2023_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/ooYoBWbw",
          "proposal_id": "JWWJQg2J",
          "short_description": "Transformer-based models are gaining more and more traction in many fields, including physics. However, they are particularly known to require...",
          "slug": "quantum-transformer-for-high-energy-physics-analysis-at-the-lhc",
          "status": "completed",
          "student_name": "Eyup",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Quantum transformer for High Energy Physics Analysis at the LHC"
        },
        {
          "code_url": "https://github.com/kingjuno/GSoC-23/",
          "description": "Strong gravitational lensing is a promising probe of the substructure of dark matter to better understand its underlying nature. Deep learning methods have the potential to accurately identify images containing substructure and differentiate WIMP particle dark matter from other well-motivated models, including vortex substructure of dark matter condensates and superfluids.  However, accurately identifying images containing substructure and differentiating between various dark matter models can be challenging. Deep learning methods, particularly equivariant neural networks, provide a promising approach to addressing these challenges.\nThis project will focus on the further development of the DeepLense pipeline that combines state-of-the-art deep learning models with strong lensing simulations based on lenstronomy . The focus of this project is using equivariant neural networks for the classification and regression of dark matter particle candidates (e.g. CDM, WDM, axions, SIDM).",
          "difficulty": null,
          "id": "proj_machine-learning-for_2023_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/QA2XXRFh",
          "proposal_id": "ZsZq7B95",
          "short_description": "Strong gravitational lensing is a promising probe of the substructure of dark matter to better understand its underlying nature. Deep learning...",
          "slug": "equivariant-neural-networks-for-dark-matter-morphology-with-strong-gravitational-lensing",
          "status": "completed",
          "student_name": "Geo Jolly",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Equivariant Neural Networks for Dark Matter Morphology with Strong Gravitational Lensing"
        },
        {
          "code_url": "https://github.com/ML4SCI/QMLHEP/pull/9",
          "description": "The LHC at CERN contains large detectors which are made up of numerous small detectors that capture the hundreds of particles produced during collisions. It’s one of the most difficult tasks in High Energy Physics (HEP) to determine whether the jet particles correspond to the signal or background. Graph Neural Networks (GNNs) have recently gained popularity and shown to exhibit higher AUC scores for jet tagging. Quantum Machine learning has shown interesting applications in HEP. \n\nI aim to explore Quantum Graph Neural Networks (QGNNs) for event classification. QGNNs can leverage the power of quantum computing to perform more efficient and accurate analyses of large datasets in HEP. I will evaluate the performance of our QGNN- based approach and compare it with traditional methods for event classification in HEP. This project has the potential to significantly advance our understanding of the fundamental particles and forces that govern our universe",
          "difficulty": null,
          "id": "proj_machine-learning-for_2023_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/sRqbxQyq",
          "proposal_id": "EqIQR6sV",
          "short_description": "The LHC at CERN contains large detectors which are made up of numerous small detectors that capture the hundreds of particles produced during...",
          "slug": "quantum-graph-neural-networks-for-high-energy-physics-analysis-at-the-lhc",
          "status": "completed",
          "student_name": "Gopal Ramesh Dahale",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Quantum Graph Neural Networks for High Energy Physics Analysis at the LHC"
        },
        {
          "code_url": "https://github.com/ML4SCI/EXXA/tree/5120b8c29af5c0fa87288afa17d61ab1f7152d9c/ANOMALY_DETECTION/EXXA_Final_JTerry",
          "description": "Planets form in complex, dynamic environments. The physics behind the process is not well-understood, and the limited high-quality observational data is difficult to interpret. Using high-fidelity hydrodynamical simulations of protoplanetary disk evolution under a variety of physical and observational conditions, machine learning models will be trained that can identify and quantify the physical processes that influence the protoplanetary disk. This will speed up and improve the analysis of observations, furthering our understanding of the environments and processes that are responsible for planets.",
          "difficulty": "advanced",
          "id": "proj_machine-learning-for_2023_009",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/MYYJDFU9",
          "proposal_id": "CMTipocB",
          "short_description": "Planets form in complex, dynamic environments. The physics behind the process is not well-understood, and the limited high-quality observational data...",
          "slug": "identifying-the-physical-process-of-planet-formation-exxa",
          "status": "completed",
          "student_name": "Jason Terry",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Identifying the Physical Process of Planet Formation (EXXA)"
        },
        {
          "code_url": "https://github.com/ML4SCI/DeepLense/tree/main/Super_Resolution_Pranath_Reddy",
          "description": "Strong gravitational lensing is a promising probe of the substructure of dark matter to better understand its underlying nature. Deep learning methods have the potential to accurately identify images containing substructure, and differentiate WIMP particle dark matter from other well-motivated models, including axions and axion-like particles, cold dark matter etc. Gravitational lensing data is often collected at low resolution due to limitations of the instruments or observing conditions. Image super-resolution techniques can be used to enhance the resolution of these images with machine learning, allowing for more precise measurements of the lensing effects and a better understanding of the distribution of matter in the lensing system. This can improve our understanding of the mass distribution of the lensing galaxy and its environment, as well as the properties of the background source being lensed. This project will focus on the development of deep learning-based image super-resolution techniques to enhance the resolution of gravitational lensing data. Furthermore, we will also investigate leveraging the super-resolution models for other strong lensing tasks such as regression and lens finding.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2023_010",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/Rh8kJLr4",
          "proposal_id": "ScNICqpw",
          "short_description": "Strong gravitational lensing is a promising probe of the substructure of dark matter to better understand its underlying nature. Deep learning...",
          "slug": "super-resolution-for-strong-gravitational-lensing",
          "status": "completed",
          "student_name": "K Pranath Reddy",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Super-Resolution for Strong Gravitational Lensing"
        },
        {
          "code_url": "https://github.com/ML4SCI/E2E/tree/main/E2E_Visual_Image_Transformer_Ka_Wa_Ho",
          "description": "The goal of the project is to apply and develop “end-to-end” vision transformer (ViT)-based networks for jet-flavor identification with the CMS open data and to benchmark their accuracy performance. This is expected to improve both the accuracy and computational cost of convolutional neural networks (CNN) developed previously for similar tasks. The networks developed would also expand previous works from a binary \"light quark vs gluon jets\" tagger to multi-class \"b quark vs c quark vs light quark vs gluon jets\" tagger. The “end-to-end” here refers to a direct use of images recorded by the particle sub-detectors at the CMS for classification. It strips away the complex reconstruction algorithms and object definitions used by the CMS and paths a way to invite ideas outside of the particle physics community to tackle the difficult task of particle identification at the Large Hadron Collider.",
          "difficulty": "advanced",
          "id": "proj_machine-learning-for_2023_011",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/Oosr0bT3",
          "proposal_id": "T0qyt79t",
          "short_description": "The goal of the project is to apply and develop “end-to-end” vision transformer (ViT)-based networks for jet-flavor identification with the CMS open...",
          "slug": "vision-transformers-for-end-to-end-particle-reconstruction-for-the-cms-experiment",
          "status": "completed",
          "student_name": "Ka Wa Ho",
          "student_profile": null,
          "tags": [],
          "title": "Vision Transformers for End-to-End Particle Reconstruction for the CMS Experiment"
        },
        {
          "code_url": "https://github.com/ML4SCI/DeepLense/tree/main/Transformers_Classification_DeepLense_Kartik_Sachdev",
          "description": "Supervised learning might be challenging in cases where there are extremely few known instances in a given category. This is a common occurrence in the case of Strong gravitational lensing images when samples from one or more classes are scarcer than others. On the other hand, when there are few data labels available for supervision, Self-Supervised Learning (SSL) has been shown to perform better than conventional supervised learning. SSL can also create meaningful representations from very vast unlabelled datasets that would be challenging or impossible to label manually. Additionally, transformer-based architectures recently have emerged as a paradigm to solve a wide range of tasks in computer vision from image classification to object detection. They have a number of advantages over traditional methods, including dynamic weight adjustment based on input features, global context, and improved generalization. Thus, the project aims to train transformer architecture in Self-Supervised Learning fashion to learn generic features. These features could then be used in different downstream tasks such as image classification or regression.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2023_012",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/vOCJj7R0",
          "proposal_id": "WF74jIVS",
          "short_description": "Supervised learning might be challenging in cases where there are extremely few known instances in a given category. This is a common occurrence in...",
          "slug": "self-supervised-learning-for-strong-gravitational-lensing",
          "status": "completed",
          "student_name": "Kartik Sachdev",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Self-Supervised Learning for Strong Gravitational Lensing"
        },
        {
          "code_url": "https://medium.com/@lucas.jose.veloso.de.souza/lensiformer-a-relativistic-physics-informed-vision-transformer-architecture-for-dark-matter-a119f6d0dc0d",
          "description": "We introduce Lensiformer, a state-of-the-art transformer architecture that incorporates the principles of relativistic physics for the classification of dark matter morphologies through gravitational lensing observations. This unique model combines the strengths of Transformer models in NLP with the analytical rigor of Physics-Informed Neural Networks (PINNs). Leveraging relativistic equations and Singular Isothermal Spherical models, Lensiformer accurately approximates the gravitational potential exerted by lensing galaxies and dark matter. These physics-based features are integrated into a Vision Transformer (ViT) neural network, providing a nuanced understanding of different dark matter structures like Cold Dark Matter and No-Substructure Dark Matter, and their associated gravitational imprints on light paths and galaxy distortions. To validate the model, we generate a specialized dataset using real galaxy images as source objects and benchmark Lensiformer against other leading models, confirming its superior performance in discerning different kinds of dark matter morphologies.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2023_013",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/eNzfLWS9",
          "proposal_id": "tdJv6pzl",
          "short_description": "We introduce Lensiformer, a state-of-the-art transformer architecture that incorporates the principles of relativistic physics for the classification...",
          "slug": "lensiformer-a-physics-informed-vision-transformer-architecture-for-dark-matter-morphology",
          "status": "completed",
          "student_name": "Lucas José",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Lensiformer: A Physics-Informed Vision Transformer Architecture for Dark Matter Morphology"
        },
        {
          "code_url": null,
          "description": "This project aims to develop quantum transformer architectures for high energy physics (HEP) analysis at the Large Hadron Collider (LHC). The focus will be on creating hybrid and fully quantum transformer and vision transformer models. Transformers have proven to be extremely powerful, revolutionizing the field of artificial intelligence and significantly impacting the world with their wide range of applications. By merging the remarkable capabilities of transformers with the emerging field of quantum machine learning, this project aims to make significant advancements in both areas. To ensure accessibility, an engaging visual guide will be provided, helping a wider audience understand the subject and fostering interest in quantum machine learning. The outcomes of the project are expected to benefit the open-source community and contribute to scientific advancements, inspiring further research and innovation in these exciting fields.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2023_014",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/t0AHVDEG",
          "proposal_id": "0QUhS7vw",
          "short_description": "This project aims to develop quantum transformer architectures for high energy physics (HEP) analysis at the Large Hadron Collider (LHC). The focus...",
          "slug": "quantum-transformers-for-hep-analysis-at-the-lhc",
          "status": null,
          "student_name": "Marçal Comajoan Cara",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Quantum Transformers for HEP Analysis at the LHC"
        },
        {
          "code_url": "https://medium.com/@mihirtripathi97/exxa-detecting-planets-in-dusty-disks-bd5a7db30cc8",
          "description": "Protoplanetary disks are birthplaces of planetary systems. Newly forming planets inside a protoplanetary disk interact with gas and dust in the disks and as a result of these interactions various substructures (gaps, rings, azimuthally asymmetric emissions, spirals) form in the disk's dust density distributions. While with current instruments, we can not directly observe these young planets, we can image the protoplanetary disks at very high angular resolutions and can study the morphology of substructures. \n\nThis project aims to develop an ML model that can predict the presence of forming protoplanets and their properties from the images of protoplanetary disks.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2023_015",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/ZH6drPWV",
          "proposal_id": "MRDPz4RS",
          "short_description": "Protoplanetary disks are birthplaces of planetary systems. Newly forming planets inside a protoplanetary disk interact with gas and dust in the disks...",
          "slug": "finding-exoplanets-with-astronomical-observations",
          "status": "completed",
          "student_name": "Mihir Tripathi",
          "student_profile": null,
          "tags": [
            "angular",
            "ml",
            "ai"
          ],
          "title": "Finding Exoplanets with Astronomical Observations"
        },
        {
          "code_url": "https://medium.com/@neerajanandfirst/my-journey-to-google-summer-of-code-2023-with-ml4sci-8822ce64464a",
          "description": "In particle physics, a cross section is a measure of the likelihood that particles will interact or scatter with one another when they collide. It is a fundamental quantity that is used to describe the probability of certain interaction occurring between particles.\nThe determination of cross-sectional area necessitates the computation of the squared amplitude, as well as the averaging and summation over the internal degrees of freedom of the particles involved.\nThis project aims to apply symbolic machine learning techniques to predict the squared amplitudes and cross section for high energy physics.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2023_016",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/DLza6brS",
          "proposal_id": "xtPQU7lz",
          "short_description": "In particle physics, a cross section is a measure of the likelihood that particles will interact or scatter with one another when they collide. It is...",
          "slug": "symbolic-empirical-representation-of-squared-amplitudes-in-high-energy-physics",
          "status": "completed",
          "student_name": "Neeraj Anand",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Symbolic empirical representation of squared amplitudes in high-energy physics"
        },
        {
          "code_url": "https://pushpdeep.medium.com/gsoc-2023-with-ml4sci-faseroh-1d2bb96d727e",
          "description": "The problem involves creating a seq2seq model for mapping histograms to empirical function sequences. I propose to tackle this in two steps. Step 1 involves creating random functions and normalizing them to get a set of function sequences, then generating histogram data and best-fit parameters for the function. This dataset is proposed to have a million examples. Step 2 involves experimenting with different seq2seq models like LSTMs, Transformers, and Pre-trained Transformers and training/evaluating their performance for our task. It also involves tuning hyperparameters and exploring the use of other transformer architectures like TabTransformer for this task. I also propose of stretch goal - checking the robustness of our model to distribution shift in the data.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2023_017",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/5kE1mg0m",
          "proposal_id": "DuUNAMoK",
          "short_description": "The problem involves creating a seq2seq model for mapping histograms to empirical function sequences. I propose to tackle this in two steps. Step 1...",
          "slug": "faseroh-building-seq2seq-model-for-mapping-histograms-to-empirical-symbolic-representations",
          "status": "completed",
          "student_name": "Pushpdeep Singh",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "FASEROH : Building seq2seq model for mapping histograms to empirical symbolic representations"
        },
        {
          "code_url": "https://royforestano.github.io/blog/2023/2023-gsoc-ml4sci-qmlhep/",
          "description": "Machine learning algorithms are heavily relied on to understand the data generated at the European Council for Nuclear Research's (CERN) Large Hadron Collider (LHC) which produces immense amounts of data through the measurement of the products of particle collisions. Since data from these events can typically be formed into a graph structure, deep geometric methods, such as graph neural networks (GNNs), have been used as an approach to various HEP anlysis tasks. One such task is jet tagging, where jets are viewed as point clouds with distinct features and edge connections between their constituent particles. To enhance the validity and robustness of deep networks, embedded symmetries, which are present in many physically realizable datasets and fundamental physical theories, can also be discovered by the model through the use of invariant I(n) and equivariant networks E(n). However, due to the increasing size and complexity of these datasets, as well as the models which process them, an involved yet computationally inexpensive approach must be utilized. To handle an increase in the complexity of the data, I suggest the implementation of a classical attention (AT) transformer with the necessary modifications to incorporate, invariant or equivariant, and GNN layers. As the extension of classical algorithms via bit-wise processes to quantum algorithms via qubit-wise processes has been rapidly developing over the last few years, I propose the full development of general quantum invariant and equivariant graph attention transformer (QIGAT or Quantum Informer, QEGAT or Quantum Equiformer) architectures to meet the demands of requiring these machine learning algorithms to offer enhanced robustness through the adherence to fundamental physical principles while reducing their computational cost.",
          "difficulty": "advanced",
          "id": "proj_machine-learning-for_2023_018",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/1ERZ3hp2",
          "proposal_id": "nHtmbbIr",
          "short_description": "Machine learning algorithms are heavily relied on to understand the data generated at the European Council for Nuclear Research's (CERN) Large Hadron...",
          "slug": "invariant-and-equivariant-quantum-graph-attention-transformers-for-hep-analysis-at-the-lhc",
          "status": "completed",
          "student_name": "Roy T. Forestano",
          "student_profile": null,
          "tags": [
            "api",
            "cloud",
            "ui"
          ],
          "title": "Invariant and Equivariant Quantum Graph Attention Transformers for HEP Analysis at the LHC"
        },
        {
          "code_url": "https://medium.com/@dsandeepan995/gsoc23-with-ml4sci-deriving-planetary-surface-composition-from-orbiting-observations-from-46f81885c9be",
          "description": "Multiple robotic spacecraft have been sent by NASA to collect orbital remote sensing data, which is used to analyze surface composition. Gamma-ray spectrometers are among the sensors used for this task. They collect position-dependent energy spectra whose shape is a function of the components from different elements present in the area observed by the sensor at a particular time.\r\nThis data can be used to infer the relative abundance of each element (through a process called unmixing) and to map their distribution across a planet’s surface. However, accurately deriving abundance just from gamma-ray spectra is an intractable problem. \r\nMachine learning (ML) has been widely used to address intractable problems, including the unmixing of spectral signatures in the visible and near-infrared (VNIR) region of the electromagnetic spectrum. Therefore, this proposal outlines the development of an ML model for estimating elements from gamma-ray spectra. This goal consists of two sub-objectives: (i) identification of the best model/architecture using data from the Lunar Prospector Gamma-Ray Spectrometer (GRS); (ii) a trained model for estimating elemental abundances from GRS data.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2023_019",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/AVoivIHy",
          "proposal_id": "7zehUC8c",
          "short_description": "Multiple robotic spacecraft have been sent by NASA to collect orbital remote sensing data, which is used to analyze surface composition. Gamma-ray...",
          "slug": "deriving-planetary-surface-composition-from-orbiting-observations-from-spacecraft",
          "status": "completed",
          "student_name": "Sandeepan Dhoundiyal",
          "student_profile": null,
          "tags": [
            "ml",
            "ai"
          ],
          "title": "Deriving planetary surface composition from orbiting observations from spacecraft"
        },
        {
          "code_url": "https://medium.com/@saranga.boo/updating-the-deeplense-pipeline-part-2-gsoc-2023-with-ml4sci-299a48d0dd23",
          "description": "Studying the substructures of dark matter holds promise in solving the longstanding problem of determining the true nature of dark matter. By using strong gravitational lensing, it may be possible to gain insights into the fundamental properties of dark matter and its substructures. Advanced deep learning techniques can accurately identify images with substructures and distinguish between different models of dark matter, such as WIMP particle dark matter, dark matter condensates, superfluids, and vortex substructures. The DeepLense pipeline combines cutting-edge deep learning models with strong lensing simulations using lenstronomy. The project's goal is to train and test deep learning models with various architectures on new dark matter simulations (such as WDM and SIDM) to improve the previous classification, regression, and anomaly detection results of the DeepLense Pipeline.",
          "difficulty": "advanced",
          "id": "proj_machine-learning-for_2023_020",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/i3gCtDUx",
          "proposal_id": "hncGxsns",
          "short_description": "Studying the substructures of dark matter holds promise in solving the longstanding problem of determining the true nature of dark matter. By using...",
          "slug": "updating-the-deeplense-pipeline",
          "status": "completed",
          "student_name": "Saranga Kingkor Mahanta",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Updating the DeepLense Pipeline"
        },
        {
          "code_url": null,
          "description": "An important part of the analysis pipeline of high energy physics experiments is the generation of expected data from first principles. For decades, sophisticated monte carlo simulations have been performed, which are computationally very expensive and therefore pose one of the major bottlenecks in data analyses at CERN experiments. In recent years there has\nbeen an effort to explore the application of novel deep learning techniques to speed up the\nsimulation by means of generative models. With the rise of Noisy Intermediate scale Quantum Computing (NISQ), the question comes up, if quantum machine learning can enhance\nexisting methods. In this project we therefore explore the applicability of quantum machine\nlearning to event simulation by means of a quantum Generative Adversarial Network.",
          "difficulty": "medium",
          "id": "proj_machine-learning-for_2023_021",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/ggoiGDQ5",
          "proposal_id": "sl5lRXxr",
          "short_description": "An important part of the analysis pipeline of high energy physics experiments is the generation of expected data from first principles. For decades,...",
          "slug": "quantum-generative-adversarial-networks-for-hep-event-generation-the-lhc",
          "status": null,
          "student_name": "ToMago",
          "student_profile": null,
          "tags": [],
          "title": "Quantum Generative Adversarial Networks for HEP event generation the LHC"
        },
        {
          "code_url": null,
          "description": "The interaction cross-section is an important quantity in high-energy physics, serving as a bridge between abstract theory and experiment. Is is also quite difficult to compute for physical processes involving many final-state particles. The SYMBA project utilizes machine learning, specifically a sequence-to-sequence (seq2seq) transformer model, to symbolically calculate a crucial component of the cross-section - the squared amplitude - from the amplitude for a given process. The goal of this project is to improve upon the current SYMBA results with a seq2seq transformer which takes advantage of the rich structure of Feynman Integrals, allowing one to directly input a Feynman Integral for a general process/theory and obtain an accurate symbolic representation of its squared amplitude.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2023_022",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/A1tU7p7j",
          "proposal_id": "IQZgYYPp",
          "short_description": "The interaction cross-section is an important quantity in high-energy physics, serving as a bridge between abstract theory and experiment. Is is also...",
          "slug": "symba-symbolic-empirical-representation-of-squared-amplitudes-in-high-energy-physics",
          "status": null,
          "student_name": "VBaules",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "SYMBA - Symbolic empirical representation of squared amplitudes in high-energy physics"
        },
        {
          "code_url": "https://yaashwardhan.medium.com/self-supervised-learning-for-strong-gravitational-lensing-part1-5a049e976b51",
          "description": "Problem Statement: An unprecedented amount of lensing data is available, however manually labeling it is unsustainable. Hence an approach must be implemented to develop a network capable of creating an embedding space in a self-supervised manner to detect dark matter traces by learning representations possibly beyond existing theories.\nA hybrid Twin model is proposed to be implemented, consisting of Equivariant Group Convolutions along with Swin and ViT transformer blocks to learn representations from two different augmentations of images (Gaussian noise and Rotations) using self-supervised learning. A denoising autoencoder is implemented for one twin, with a reconstruction loss which is then summed up with the contrastive loss of the second twin. Hyperparameter tuning is employed and the network is then finetuned for other tasks.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2023_023",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/TBOsy4MA",
          "proposal_id": "iDCIi1UT",
          "short_description": "Problem Statement: An unprecedented amount of lensing data is available, however manually labeling it is unsustainable. Hence an approach must be...",
          "slug": "self-supervised-learning-for-strong-gravitational-lensing",
          "status": "completed",
          "student_name": "yaashwardhan",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Self-Supervised Learning for Strong Gravitational Lensing"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2023/organizations/machine-learning-for-science-ml4sci"
    },
    "year_2024": {
      "num_projects": 26,
      "projects": [
        {
          "code_url": "https://github.com/ML4SCI/QMLHEP/tree/main/Quantum_SSL_for_HEP_Sanya_Nanda",
          "description": "This project investigates the fusion of classical data encoding onto quantum models using contrastive learning techniques. The objective is to develop a function for encoding classical data onto quantum feature spaces, enabling their representation in a format compatible with quantum processing. By contrasting positive (similar) and negative (dissimilar) pairs in the feature space, contrastive learning facilitates representation learning. The trained embeddings will be assessed against standard encoding approaches using quantum machine learning (QML) models, providing insights into their performance. Through this exploration, the aim is to evaluate the efficacy of quantum embeddings for classical data and compare them with traditional encoding techniques. By harnessing the capabilities of quantum computing and contrastive learning, this endeavor contributes to advancing classical data encoding on quantum platforms, potentially unlocking novel applications in quantum-enhanced machine learning.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2024_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/IDScJm9Z/",
          "proposal_id": null,
          "short_description": "This project investigates the fusion of classical data encoding onto quantum models using contrastive learning techniques. The objective is to...",
          "slug": "learning-quantum-representations-of-classical-high-energy-physics-data-with-contrastive-learning",
          "status": "completed",
          "student_name": "Sanya Nanda",
          "student_profile": null,
          "tags": [
            "ml",
            "ai"
          ],
          "title": "Learning quantum representations of classical  high energy physics data with contrastive learning"
        },
        {
          "code_url": "https://github.com/DarthRevan07/DeepFalcon",
          "description": "The quest for new physics has encompassed and intrigued physicists for decades. At CERN LHC, high-energy\r\nproton-proton collisions can create new, unstable particles, which then further decay to produce\r\nsprays of outgoing particles. These ”collision events” act as a bases to identify events involving\r\nnovel, uncharted physical processes (Higgs Boson, 2012).\r\nThe topology of these events is governed by the underlying particle production mechanism. A momentum conserving spray of particles - called Jets, is an event topology governed by Quantum Chormodynamics (QCD).\r\nA collision event contains multiple such jets, a core task of data analytics at CERN\r\nexperiments revolves around the task of jet-tagging. The Machine Learning Revolution, propelled by dedicated and streamlined Neural Computation has revolutionized this field of tying particle jets to their originator particle.\r\n\r\nOver time the analytical, QCD-driven approaches for tagging have been replaced by deep-learning based approaches. Using different input representations of particle jets - particularly images, sequences, trees, sets and graphs, most notably deep neural networks (DNNs) - CNNs, RNNs etc. have been used to build new jet-tagging algorithms automatically from simulated samples (from Pythia and\r\nDelphes) and even real data.\r\nThrough this GSoC cohort, I propose a novel scheme to achieve the task of jet-tagging by exploiting\r\nthe most naturally sound, robust representation scheme - that of unordered structures of constituent particles of a jet, and methods to act upon them - namely through Graph Neural Networks (GNNs) that utilize attention-based/hypergraph methods to account for long-distance correlations.\r\nAfter viewing a jet as a Particle Cloud, we utilize a plethora of novel schemes and also a customized Neural Architecture to achieve learning over the dataset of Particle Jets.\r\nWe also work robustly at the inference level, extracting meaningful measures of optimality and correctness of the used approach.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2024_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/d1G8ygJr/",
          "proposal_id": null,
          "short_description": "The quest for new physics has encompassed and intrigued physicists for decades. At CERN LHC, high-energy proton-proton collisions can create new,...",
          "slug": "non-local-gnns-for-jet-classification",
          "status": "completed",
          "student_name": "Tanmay Bakshi",
          "student_profile": null,
          "tags": [
            "ml",
            "ai",
            "cloud",
            "ui"
          ],
          "title": "Non-local GNNs for Jet Classification"
        },
        {
          "code_url": "https://medium.com/@tesi.alessandro88/gsoc-24-quantum-transformer-for-high-energy-physics-analysis-at-ml4sci-ab8a86acdab0",
          "description": "This proposal sets out to implement several kinds of Quantum Vision Transformers (QViT) for High Energy Physics (HEP) analysis at the Large Hadron Collider (LHC), inspired by the seminal work of Cherrat et al., which introduces three innovative quantum transformer architectures: Orthogonal Patch-wise Neural Network, Quantum Orthogonal Transformer, and Quantum Compound Transformer. Despite the groundbreaking nature of their research, the absence of released source code has left a significant gap in practical application and reproducibility. Furthermore, attempts by last year's contributors, Marçal Comajoan Cara and Eyup B. Unlu, to implement the Quantum Orthogonal Transformer faced challenges; Marçal encountered training issues due to NaN values, and Eyup's implementation did not proceed to the training phase of transformers, highlighting the difficulties in realizing these models. This project aims to address these gaps by developing QViT models within the TensorFlow Quantum framework, leveraging this technology to bridge theoretical insights with practical application, thereby marking a potential first in applying these models for the analysis of particle jet images in HEP.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2024_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/JLeQwG3r/",
          "proposal_id": null,
          "short_description": "This proposal sets out to implement several kinds of Quantum Vision Transformers (QViT) for High Energy Physics (HEP) analysis at the Large Hadron...",
          "slug": "quantum-transformer-for-high-energy-physics-analysis-at-the-lhc",
          "status": "completed",
          "student_name": "Alessandro Tesi",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Quantum transformer for High Energy Physics Analysis at the LHC"
        },
        {
          "code_url": "https://medium.com/@guptaatal/single-image-super-resolution-using-denoising-auto-encoder-f05facda6485",
          "description": "The \"Superresolution for Strong Gravitational Lensing\" project aims to enhance the resolution of astronomical images through advanced deep learning techniques. Gravitational lensing magnifies distant galaxies, offering insights into the universe's dark matter structure. However, the limited resolution of these images constrains our understanding. This project will develop superresolution models based on conditional diffusion models to transform low-resolution gravitational lensing images into high-resolution counterparts. These models will be tailored for astronomical data's unique challenges and integrated into the DeepLense framework for broader scientific use. Deliverables include a prototype superresolution model, integration tools and documentation for DeepLense, and comprehensive model development documentation. This effort will improve gravitational lensing image quality, aiding in the study of cosmic structures and dark matter.",
          "difficulty": "advanced",
          "id": "proj_machine-learning-for_2024_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/3YAQgkHr/",
          "proposal_id": null,
          "short_description": "The \"Superresolution for Strong Gravitational Lensing\" project aims to enhance the resolution of astronomical images through advanced deep learning...",
          "slug": "superresolution-for-strong-gravitational-lensing",
          "status": "completed",
          "student_name": "Atal",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Superresolution for Strong Gravitational Lensing"
        },
        {
          "code_url": "https://medium.com/@vishak.bhat5/gsoc24-with-ml4sci-graph-neural-networks-for-particle-momentum-estimation-in-the-cms-trigger-e67e3f43a292",
          "description": "This project aims to apply Deep Learning algorithms specifically Graph Neural Networks (GNN) for momentum regression in the trigger system. Estimating the momentum precisely helps in distinguishing high momentum (signal) muons from the overwhelming low momentum (background) muons which is crucial for the efficiency of the trigger. A muon traveling through the endcap detectors has a chance to leave hits in sequential stations which records the data. This data will be converted into a Graph Data using 3 approaches where each station, each variable , and patches of the matrix are taken as the nodes of the Graph. Edges are formed using KNN or by forming edges between adjacent stations. I will be experimenting with different types of Message Passing Layers(custom and pre-defined like GCNConv, SAGEConv, GATConv, and more) and deliver tested and most accurate algorithms to estimate the momentum. The demo notebooks and the documentation of the same will also be delivered.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2024_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/IvXRHeSE/",
          "proposal_id": null,
          "short_description": "This project aims to apply Deep Learning algorithms specifically Graph Neural Networks (GNN) for momentum regression in the trigger system....",
          "slug": "graph-neural-networks-for-particle-momentum-estimation-in-the-cms-trigger-system",
          "status": "completed",
          "student_name": "Vishak K Bhat",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Graph Neural Networks for Particle Momentum Estimation in the CMS Trigger System"
        },
        {
          "code_url": "https://yaashwardhan.medium.com/self-supervised-learning-for-strong-gravitational-lensing-part1-5a049e976b51",
          "description": "Deep learning has transformed the analysis of supervised lensing data, utilizing feature spaces to uncover latent variables related to dark matter. This approach, essential due to the vast amount of data, evolved from manual labeling to using unsupervised methods, like variational autoencoders, for unbiased dark matter analysis. Recently, self-supervised learning, an innovative technique that generates its own supervisory signals, has shown promise. Stein et al. applied this method using a convolutional neural network (CNN) on simulated strong gravitational lens images, outperforming traditional supervised methods. This was supported by research I contributed to in the DeepLense project during Google Summer of Code (GSoC) 2023. However, the application to real images remains underexplored. My GSoC project proposal aims to bridge this gap by applying advanced Self-Supervised Learning (SSL) techniques to real-world datasets and comparing these findings with those from simulated datasets. This will assess the reliability of simulated data for deep learning inference, marking a significant step towards leveraging real datasets for similar studies.",
          "difficulty": "advanced",
          "id": "proj_machine-learning-for_2024_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/GNfjYVmg/",
          "proposal_id": null,
          "short_description": "Deep learning has transformed the analysis of supervised lensing data, utilizing feature spaces to uncover latent variables related to dark matter....",
          "slug": "learning-representation-through-self-supervised-learning-on-real-gravitational-lensing-images",
          "status": "completed",
          "student_name": "yaashwardhan",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Learning Representation Through Self-Supervised Learning on Real Gravitational Lensing Images"
        },
        {
          "code_url": "https://github.com/ML4SCI/QMLHEP/tree/main/EQNN_for_HEP_Lazaro_Diaz_Lievano",
          "description": "The investigation of symmetries has long been a cornerstone in analyzing physical systems. As formalized by Noether’s theorem, conserved quantities are inherently linked to the symmetries present within the system. In high-energy physics, the study of symmetries has played a key role in shaping the Standard Model, which elucidates three of the four fundamental forces in nature. Recent research has showcased the efficacy of Equivariant Quantum Neural Networks (EQNNs) in leveraging symmetries within variational quantum machine learning (VQML), thereby augmenting model performance and efficiency.\n\nThis project is dedicated to building Equivariant Quantum Neural Networks (EQNN) and Equivariant Hybrid Quantum-Classical Neural network architectures that leverage symmetries commonly present in image data, specifically roto-reflection symmetries. By incorporating symmetries such as rotations and reflections into the quantum neural network’s design, we can significantly reduce the number of trainable parameters, thereby decreasing the model’s complexity and improving its efficiency. This method enhances learning capabilities with smaller datasets while also promoting better generalization. We evaluate the performance of our model using standard benchmark datasets for image classification and compare it against other quantum models.",
          "difficulty": "advanced",
          "id": "proj_machine-learning-for_2024_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/3nRhnPRb/",
          "proposal_id": null,
          "short_description": "The investigation of symmetries has long been a cornerstone in analyzing physical systems. As formalized by Noether’s theorem, conserved quantities...",
          "slug": "equivariant-quantum-neural-networks-for-high-energy-physics-analysis-at-the-lhc",
          "status": "completed",
          "student_name": "Lazaro Raul Diaz Lievano",
          "student_profile": null,
          "tags": [
            "api",
            "ml",
            "ai",
            "ui"
          ],
          "title": "Equivariant quantum neural networks for High Energy Physics Analysis at the LHC"
        },
        {
          "code_url": "https://github.com/ML4SCI/E2E/tree/main/E2E_MAE_Lokesh_Badisa",
          "description": "The goal of this project is to develop Masked Vision Transformer for reconstruction and compression of CMS data. It is much easy to procure unlabelled data than labelled data and ViT-MAE makes use of this unlabelled data for pre-training. Currently, there has been an increasing trend in pre-training the vision transformers on auxiliary task and then fine-tuning it for downstream tasks. This resulted in score increment of downstream tasks along with some emergent properties. With the benefits of pre-training, we would like to see how this converts to CMS data. Earlier the data has been shared either through parquet/hdf5 file format. Using ViT-MAE for compression of data would reduce the challenges associated with working with larger datasets. Earlier methods have used swin transformers of different window sizes without any pre-training and achieved substantial score. However, this project employs self-supervised pre-training for a better score in downstream tasks.",
          "difficulty": "beginner",
          "id": "proj_machine-learning-for_2024_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/4KpQiVr8/",
          "proposal_id": null,
          "short_description": "The goal of this project is to develop Masked Vision Transformer for reconstruction and compression of CMS data. It is much easy to procure...",
          "slug": "masked-auto-encoders-for-efficient-e2e-particle-reconstruction-compression-for-cms-experiment",
          "status": "completed",
          "student_name": "Lokesh Badisa",
          "student_profile": null,
          "tags": [
            "ai",
            "ux"
          ],
          "title": "Masked Auto-Encoders for Efficient E2E Particle Reconstruction & Compression for CMS Experiment"
        },
        {
          "code_url": "https://medium.com/@anirudhshankar99/physics-informed-unsupervised-super-resolution-of-lensing-images-gsoc-2024-x-ml4sci-51cedc1cfb00",
          "description": "Inferences using machine learning methods are becoming increasingly necessary in probing dynamical systems with complex and imperfect datasets. This project seeks to develop a Physics-Informed anomaly detection framework to identify outliers in lensing images that incorporates the strong lensing equation in training to enhance robustness to noisy and gappy data. In addition, it will allow the deduction of physical constants of the system.",
          "difficulty": "advanced",
          "id": "proj_machine-learning-for_2024_009",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/AvlaMMJJ/",
          "proposal_id": null,
          "short_description": "Inferences using machine learning methods are becoming increasingly necessary in probing dynamical systems with complex and imperfect datasets. This...",
          "slug": "resilient-physics-informed-anomaly-detection-and-inference-of-lensing-images-on-sparse-datasets",
          "status": "completed",
          "student_name": "Anirudh Shankar",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Resilient Physics-Informed Anomaly Detection and Inference of Lensing Images on Sparse Datasets"
        },
        {
          "code_url": "https://jogisuda.github.io/posts/2024/07/lie-eqgnn/",
          "description": "Discovering new phenomena, like the Higgs boson, involves the identification of rare signals that could shed light into unanswered questions about our universe. On the other hand, at the Large Hadron Collider (LHC), large amounts of data are generated from particle collisions. This project aims to develop a Quantum Lie-Equivariant Graph Neural Network (QLie-EGNN), a quantum model that not only is data efficient, but also has symmetry-preserving properties from any arbitrary Lie algebra that can be learned directly from the data.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2024_010",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/Yul5lU5e/",
          "proposal_id": null,
          "short_description": "Discovering new phenomena, like the Higgs boson, involves the identification of rare signals that could shed light into unanswered questions about...",
          "slug": "quantum-graph-neural-networks-for-high-energy-physics-analysis-at-the-lhc",
          "status": "completed",
          "student_name": "Jogi Suda Neto",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Quantum Graph Neural Networks for High Energy Physics Analysis at the LHC"
        },
        {
          "code_url": "https://github.com/duydl/gsoc24-qml-workspace",
          "description": "QMLHEP3, or \"Learning quantum representations of classical high energy physics data with contrastive learning,\" aims to study an intersection of quantum computing and representation learning. Inspired by the principle of contrastive loss in deep learning, the project aims to develop quantum representation learning models capable of discerning intrinsic data relationships, as well as to understand the behaviors of PQC systems at three integration levels, quantum embedding with classical preprocessing layers, hybrid quantum-classical encoders, and full variational quantum circuits. We will also relate to previous work of QMLHEP, such as benchmarking against quantum autoencoder or exploring the contrastive approach in quantum GAN.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2024_011",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/4hPKaqPv/",
          "proposal_id": null,
          "short_description": "QMLHEP3, or \"Learning quantum representations of classical high energy physics data with contrastive learning,\" aims to study an intersection of...",
          "slug": "qmlhep3-learning-quantum-representations-of-classical-hep-data-with-contrastive-learning",
          "status": "completed",
          "student_name": "duydl",
          "student_profile": null,
          "tags": [
            "ml",
            "ai",
            "ui"
          ],
          "title": "QMLHEP3: Learning quantum representations of classical HEP data with contrastive learning"
        },
        {
          "code_url": "https://docs.google.com/document/d/1K_cv7PbCubY-_vpb3Gc2EyGaN9kaNrc4qkqRB9j3K4M/edit?usp=sharing",
          "description": "Understanding the architecture of planetary systems is crucial for insights into their formation and evolution. This project aims to leverage the power of equivariant vision networks to predict the number of planets and their orbital configurations within observed systems. Equivariant networks are uniquely suited for this task due to their inherent ability to handle the rotational and reflectional symmetries common in astronomical images, thus maintaining predictive accuracy regardless of orientation changes in spatial data.\r\n\r\nThe project will unfold over 175 hours, meticulously planned across several phases to ensure a thorough approach from conceptualization to deployment. Starting with a comprehensive review of current equivariant neural network architectures and their potential application in analyzing astronomical data, the project will proceed to curate a dataset from existing astronomical surveys. This dataset will include systems with known numbers of planets to serve as a foundation for model training and validation.\r\n\r\nBy developing a model that can accurately regress on the number of planets in a system, this project seeks to create a robust tool capable of adapting to the complexities inherent in observational data, such as direct images, transit data, and radial velocity measurements. The ultimate goal is to provide astronomers with a novel method for analyzing the spatial configurations of planetary systems, thereby enriching our understanding of the universe's myriad worlds.\r\n\r\nExpected outcomes include a highly accurate equivariant computer vision model, comprehensive performance evaluation, and extensive documentation to support further research and potential real-world applications in exoplanet discovery and characterization. Through this endeavor, we aim to not only advance the field of astrophysics but also to demonstrate the transformative potential of machine learning in uncovering the secrets of the cosmos.",
          "difficulty": "advanced",
          "id": "proj_machine-learning-for_2024_012",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/9kvha0VA/",
          "proposal_id": null,
          "short_description": "Understanding the architecture of planetary systems is crucial for insights into their formation and evolution. This project aims to leverage the...",
          "slug": "equivariant-vision-networks-for-predicting-planetary-systems-architectures",
          "status": "completed",
          "student_name": "Alexandra Murariu",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Equivariant Vision Networks for Predicting Planetary Systems' Architectures"
        },
        {
          "code_url": "https://github.com/ML4SCI/DeepLense/tree/main/DeepLense_Physics_Informed_Neural_Network_for_Dark_Matter_Morphology_Ashutosh_Ojha",
          "description": "The project aims to develop a physics-informed neural network framework in order to do the inference for the properties and distribution of dark matter in the lensing galaxy that does the strong gravitational lensing. The main purpose of the project is to improve the accuracy and the efficiencies of the previous studies that have been done on the dark matter by using the insights gained from the study of the phenomenon and physics behind it hence integrating formulas and physical constraints into the model architecture.\nI propose to do the physics-guided data augmentation on the images of strong gravitational lensing and then train various encoder-decoder networks where the encoder does the feature encoding to learn from the images to give a feature vector which can be then used as a constant for various formulas associated with the strong gravitational lensing then we use that formula and constraints related to strong gravitational lensing to create the output of physics guided encoder.\nFinally, we pass the output from physics physics-guided encoder to the decoder which also accepts the initial input of observed images of strong gravitational lensing. \nThe output of the decoder is then passed to a linear layer for classification and regression purposes.\nI plan to create various physics-informed neural networks by integrating physics with different types of model architecture, then compare their performances and fine-tune their hyperparameters in order to fully utilize their potential.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2024_013",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/HjZq0wjG/",
          "proposal_id": null,
          "short_description": "The project aims to develop a physics-informed neural network framework in order to do the inference for the properties and distribution of dark...",
          "slug": "physics-guided-machine-learning",
          "status": "completed",
          "student_name": "Ashutosh Ojha",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Physics-Guided Machine Learning"
        },
        {
          "code_url": "https://github.com/ML4SCI/SYMBA",
          "description": "Symbolic Regression refers to discovering a function that accurately fits a given dataset. Evolutionary/genetic algorithms have been dominating this field since the beginning and much recently deep learning is being used to solve the problem. However, there is a significant lack of collaboration between the GP and ML communities with reference to symbolic regression.\nI propose to develop a hybrid method which combines evolutionary algorithm with transformers to solve this contemporary problem. During the coding period I will also develop a library (compilation of various algorithms) which can be used as a ready-to-use tool for symbolic regression. And, I will also benchmark the methods on a high energy physics dataset.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2024_014",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/fIWFP5zW/",
          "proposal_id": null,
          "short_description": "Symbolic Regression refers to discovering a function that accurately fits a given dataset. Evolutionary/genetic algorithms have been dominating this...",
          "slug": "evolutionary-and-transformer-models-for-symbolic-regression",
          "status": "completed",
          "student_name": "Aryamaan Thakur",
          "student_profile": null,
          "tags": [
            "ml"
          ],
          "title": "Evolutionary and Transformer Models for Symbolic Regression"
        },
        {
          "code_url": "https://reyguadarrama.github.io/posts/GSoC-2024.html",
          "description": "This project aims to improve the efficiency and accuracy of Monte Carlo simulations by leveraging Quantum Generative Adversarial Networks (QGANs). Monte Carlo simulations rely on accurate probability distributions to generate meaningful results, but selecting incorrect distributions can lead to inaccuracies and require extensive computational resources. QGANs use variational quantum circuits to learn implicit probability distributions from datasets and encode them as quantum states. The quantum generator then produces synthetic data following the learned distribution, which is combined with real datasets and fed into a classical discriminator to distinguish between real and generated data. By exploiting the randomness of quantum systems, the project seeks to enhance the efficiency and accuracy of Monte Carlo simulations. Key goals include implementing QGANs, training them on various datasets relevant to Monte Carlo simulations, exploring different QGAN architectures for optimal performance, and benchmarking against standard Monte Carlo simulations to assess improvements.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2024_015",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/HnazN3SK/",
          "proposal_id": null,
          "short_description": "This project aims to improve the efficiency and accuracy of Monte Carlo simulations by leveraging Quantum Generative Adversarial Networks (QGANs)....",
          "slug": "quantum-generative-adversarial-networks-for-monte-carlo-simulations",
          "status": "completed",
          "student_name": "Luis Rey",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Quantum Generative Adversarial Networks for Monte Carlo Simulations"
        },
        {
          "code_url": "https://github.com/ML4SCI/DeepLense/tree/main/DeepLense_Diffusion_Rishi",
          "description": "My project focuses on utilizing Diffusion Models for Gravitational Lensing Simulation, encompassing two primary tasks. The first task involves exploring diffusion models to generate strong gravitational lensing images, wherein I plan to investigate both DDPM and DDIM architectures. The second task consists of Creating a diverse dataset of simulated gravitational lensing images under various astrophysical conditions. I intend to implement conditional diffusion models and astronomical conditional gravitation lensing images with CLIP latent. The project's deliverables will include the code for all experiments, accessible through a GitHub repository.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2024_016",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/WG4tmCv7/",
          "proposal_id": null,
          "short_description": "My project focuses on utilizing Diffusion Models for Gravitational Lensing Simulation, encompassing two primary tasks. The first task involves...",
          "slug": "diffusion-models-for-gravitational-lensing-simulation",
          "status": "completed",
          "student_name": "J Rishi",
          "student_profile": null,
          "tags": [],
          "title": "Diffusion Models for Gravitational Lensing Simulation"
        },
        {
          "code_url": "https://github.com/Amey-2002/GSoC_2024_QMLHEP",
          "description": "In this project, we introduce quantum contrastive learning, a quantum machine learning technique to enhance performance of models involving high energy physics data for tasks such as signal and background classification. Contrastive learning is a way of producing effective representations of complex data such that it can be used for other downstream applications with minimal issues and increased throughput. High energy physics has several subtle aspects that usual images from other domains do not express, hence we conjecture that quantum computing might help getting improved representations for such data using entanglement and interference effects inherent to quantum mechanics.",
          "difficulty": "advanced",
          "id": "proj_machine-learning-for_2024_017",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/nyIWIGtE/",
          "proposal_id": null,
          "short_description": "In this project, we introduce quantum contrastive learning, a quantum machine learning technique to enhance performance of models involving high...",
          "slug": "learning-quantum-representations-of-classical-high-energy-physics-data-with-contrastive-learning",
          "status": "completed",
          "student_name": "Amey Bhatuse",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Learning quantum representations of classical high energy physics data with contrastive learning"
        },
        {
          "code_url": "https://medium.com/@swheatdreamz/whos-at-loss-0b921b3e1bb4",
          "description": "The project aims to implement different GAN architectures ranging from classical models to fully quantum models, including hybrid models as well. And compare their performance with the goal of proving the quantum advantage. We work with different datasets that belong to High energy physics to prove the practicality of these quantum models in the NISQ era. We will explore different encoding techniques, Loss functions, Gradient algorithms and network evaluation methods.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2024_018",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/OKkyXUkV/",
          "proposal_id": null,
          "short_description": "The project aims to implement different GAN architectures ranging from classical models to fully quantum models, including hybrid models as well. And...",
          "slug": "implementation-of-quantum-generative-adversarial-networks-to-perform-hep-analysis-at-lhc",
          "status": "completed",
          "student_name": "Adithya Penagonda",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Implementation of Quantum Generative Adversarial Networks to Perform HEP Analysis at LHC"
        },
        {
          "code_url": "https://medium.com/@shuklag554/exoplanet-atmosphere-characterization-gsoc24-ml4sci-part-2-96392e3ba190",
          "description": "This project intends to develop cutting-edge machine-learning tools for spectral analysis to characterize the atmospheres of exoplanets. The project will explore various state-of-the-art and recent techniques to build a robust and general model with strong regressional properties. The resultant models from our study will be benchmarked against pre-existing baselines based on the principles of statistics and atmospheric sciences. Additionally, relevant tutorials and documentation will be provided, keeping future developments in mind.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2024_019",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/ir53unkD/",
          "proposal_id": null,
          "short_description": "This project intends to develop cutting-edge machine-learning tools for spectral analysis to characterize the atmospheres of exoplanets. The project...",
          "slug": "exoplanet-atmosphere-characterization",
          "status": "completed",
          "student_name": "Gaurav Shukla",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Exoplanet Atmosphere Characterization"
        },
        {
          "code_url": "https://medium.com/@mashapotatoes/gsoc-quantum-diffusion-model-for-high-energy-physics-part-ii-6e693d625931",
          "description": "Classical diffusion models (DMs) have experienced rapid growth in usability, availability, and research. The classical DM algorithm consists of two main parts: a forward diffusion process and a learned denoising step. The forward diffusion process consists of discretely applying noise to an image until it is unrecognizable. The denoising process reverses the noise, predicting the original image. The latter is the biggest bottleneck in model training and is likely to benefit from the implementation of parametric quantum circuits (PQCs), creating a hybrid quantum DM. This model would be trained on multiple high energy physics (HEP) datasets, such as the Quark-Gluon dataset for generating quark and gluon jets, alongside a classical DM, and the results could be evaluated taking into account resources, time, and quality.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2024_020",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/sCNGAri6/",
          "proposal_id": null,
          "short_description": "Classical diffusion models (DMs) have experienced rapid growth in usability, availability, and research. The classical DM algorithm consists of two...",
          "slug": "quantum-diffusion-model-for-high-energy-physics",
          "status": "completed",
          "student_name": "Masha",
          "student_profile": null,
          "tags": [
            "api",
            "ai",
            "ui"
          ],
          "title": "Quantum Diffusion Model for High Energy Physics"
        },
        {
          "code_url": "https://github.com/iyersreehari/DeepLense/tree/deeplense_ssl_sreehari_iyer_branch/DeepLense_SSL_from_real_dataset_Sreehari_Iyer",
          "description": "Strong gravitational lensing provides a means to probe dark matter substructure. In recent years, machine learning techniques, particularly supervised learning, are being utilized for substructure detection, and other regression and classification tasks on the lensing dataset. With strong gravitational lensing, the available labeled training data is scarce, and moreover some classes have fewer samples than others. But, supervised learning require abundant labeled training data and can be biased by class imbalances in the training dataset. To circumvent this, previous works have utilized simulated lensing dataset for supervised learning. However, this approach may result in diminished performance on running inferences with real datasets. In computer vision, self-supervised learning (SSL) has emerged as a potent solution, particularly effective in scenarios with abundant unlabeled data and scarce labeled data. Recent works have studied convolutional neural network (CNN) based SSL with simulated lensing data. This project will focus on the development of self-supervised learning techniques with Transformers utilizing real-world strong gravitational lensing dataset.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2024_021",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/LvO4hLFt/",
          "proposal_id": null,
          "short_description": "Strong gravitational lensing provides a means to probe dark matter substructure. In recent years, machine learning techniques, particularly...",
          "slug": "learning-representation-through-self-supervised-learning-on-real-gravitational-lensing-images",
          "status": "completed",
          "student_name": "Sreehari Iyer",
          "student_profile": null,
          "tags": [
            "ios",
            "ai",
            "ui"
          ],
          "title": "Learning Representation Through Self-Supervised Learning on Real Gravitational Lensing Images"
        },
        {
          "code_url": "https://medium.com/@shuklashashankshekhar863/masked-autoencoders-for-efficient-end-to-end-particle-reconstruction-and-compression-for-the-cms-fdd7b941a2bb",
          "description": "Proposal Summary:\nThe project aims to achieve two primary objectives: efficient and precise particle identification and the development of effective lossless data compression techniques for the CMS Experiment at the Large Hadron Collider (LHC).\n\nEfficient and Precise Particle Identification:\n\nTraditional particle identification methods involve complex algorithms analyzing data from the CMS detector.\nRecent advancements suggest using convolutional neural networks (CNNs) directly on raw detector images, known as the \"end-to-end\" approach, for streamlined processing and competitive identification efficiency.\nThe project seeks to explore and enhance vision transformers (ViTs) for particle reconstruction, benchmarking against established CNN models.\n\n\nDevelopment of Effective Lossless Data Compression Techniques:\n\nThe CMS experiment generates massive amounts of data from particle collisions, posing challenges in processing and storage.\nData compression techniques are crucial for extracting relevant information while reducing data volume for efficient processing and analysis.\nThe project aims to develop innovative masked auto-encoders (MAEs) with vision-transformer-based encoders for efficient data compression, enhancing downstream tasks' performance.\n\nOverall, the project endeavors to contribute to advancing particle physics research by improving particle identification accuracy and optimizing data handling through innovative data compression techniques.",
          "difficulty": "advanced",
          "id": "proj_machine-learning-for_2024_022",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/BVlo7Qca/",
          "proposal_id": null,
          "short_description": "Proposal Summary: The project aims to achieve two primary objectives: efficient and precise particle identification and the development of effective...",
          "slug": "masked-auto-encoders-for-end-to-end-particle-reconstruction-and-compression-for-the-cms-experiment",
          "status": "completed",
          "student_name": "Shashank Shekhar Shukla",
          "student_profile": null,
          "tags": [
            "ml",
            "ai"
          ],
          "title": "Masked Auto-Encoders for End-to-End Particle Reconstruction and Compression for the CMS Experiment"
        },
        {
          "code_url": "https://github.com/ML4SCI/E2E/tree/main/E2E_IJEPA_Riccardo_Tripodi",
          "description": "The End-to-End Deep Learning project within the CMS experiment at the Large Hadron Collider plays a critical role in identifying and reconstructing single particles, jets, and event topologies in collision events. This proposal aims to leverage state-of-the-art Self-Supervised Learning (SSL) techniques to develop robust models that outperform existing supervised baselines. By exploiting unlabelled data, these SSL approaches can allow models to learn rich representations enhancing the efficiency and accuracy of particle reconstruction and identification tasks at fine-tuning stage with labelled data.\n\nI-JEPA (Joint-Embedding Predictive Architecture) is a new approach, which aims to improve the semantic level of self-supervised representations without relying on extra prior knowledge encoded through image trans- formations. Given a context block, I-JEPA is trained predicting missing information in an abstract representation space. The targets are representation blocks obtained by dividing the input into non-overlapping patches and encoding them with a target-encoder. A subset of these representations is randomly sampled for loss computation. The context block, on the other hand, is derived from a single block randomly sampled from the input and processed through a context encoder. Overlapping regions between context and target blocks are removed to maintain a non-trivial prediction task. This approach represents a novel direction in self-supervised learning, addressing limitations of previous methods in producing high-level semantic representations suitable for various downstream tasks. I-JEPA has shown to be computationally efficient and outstanding results in image classification by linear probing its learnt representations.\n\nDeliverables:\n-Implemented SSL training pipeline.\n-SSL pre-trained model.\n-Fine tuned models on specific tasks.\n-Preprocessed datasets ready for training and evaluation.\n-Documentation covering implementation details, and experimental results",
          "difficulty": null,
          "id": "proj_machine-learning-for_2024_023",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/Jl6UUy9k/",
          "proposal_id": null,
          "short_description": "The End-to-End Deep Learning project within the CMS experiment at the Large Hadron Collider plays a critical role in identifying and reconstructing...",
          "slug": "self-supervised-learning-for-end-to-end-particle-reconstruction-for-the-cms-experiment",
          "status": "completed",
          "student_name": "3podi",
          "student_profile": null,
          "tags": [
            "ml",
            "ai",
            "ui"
          ],
          "title": "Self-Supervised Learning for End-to-End Particle Reconstruction for the CMS Experiment"
        },
        {
          "code_url": "https://github.com/SamyakJha114/GSOC-24-SR",
          "description": "Symbolic Regression serves as a powerful tool for uncovering symbolic expressions that encapsulate data patterns, such as physical laws. This project centers on the development of a hybrid methodology that merges transformer-based techniques with genetic programming. Specifically, we aim to explore two distinct strategies for integrating transformers as sequence generators within the genetic programming framework, tailoring the training process accordingly.\nThe primary objective of this project is to establish an effective hybrid approach that combines the strengths of transformers and genetic programming, offering a novel solution for symbolic regression tasks. Additionally, this endeavor seeks to provide a benchmarking framework for evaluating the performance of the proposed approach on both synthetic and high-energy datasets. By leveraging this hybrid methodology, we anticipate achieving superior results in discovering symbolic expressions and advancing the state-of-the-art in symbolic regression",
          "difficulty": null,
          "id": "proj_machine-learning-for_2024_024",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/AgKltyEl/",
          "proposal_id": null,
          "short_description": "Symbolic Regression serves as a powerful tool for uncovering symbolic expressions that encapsulate data patterns, such as physical laws. This project...",
          "slug": "evolutionary-and-transformer-models-for-symbolic-regression",
          "status": "completed",
          "student_name": "Samyak Jha",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Evolutionary and Transformer Models for Symbolic Regression"
        },
        {
          "code_url": "https://www.linkedin.com/posts/ritesh-bhalerao_gsoc-activity-7256869917877026816-2TCY?utm_source=share&utm_medium=member_desktop",
          "description": "In particle physics, a cross section is a measure of the likelihood that particles will interact or scatter with one another when they collide. It is a fundamental quantity and its computation can become time intensive. This project aims to apply state-of-the-art machine learning techniques, particularly transformer-based models, for the generation of symbolic representations of the squared amplitudes in HEP. The proposed sequence-to-sequence system aims to improve upon the existing time-intensive processes of calculations of the squared amplitude . By harnessing the power of transformers, this project seeks to optimize the process of converting symbolic amplitudes to squared representations.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2024_025",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/0Oa841IT/",
          "proposal_id": null,
          "short_description": "In particle physics, a cross section is a measure of the likelihood that particles will interact or scatter with one another when they collide. It is...",
          "slug": "transformer-models-for-symbolic-calculations-of-squared-amplitudes-in-hep",
          "status": "completed",
          "student_name": "Ritesh Bhalerao",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Transformer Models for Symbolic Calculations of Squared Amplitudes in HEP"
        },
        {
          "code_url": "https://medium.com/@haemanth10/quantum-graph-neural-networks-9cde9613a8d5",
          "description": "The Large Hadron Collider (LHC) built by CERN is the world’s largest and\nthe most powerful particle accelerator, which generates about 1 billion parti-\ncle collisions per second. Jet tagging, which is the process of determining\nthe elementary particle that produced a jet, is of key interest at CERN and to\nparticle physics, in general, to distinguish useful signals from background pro-\ncesses and other less interesting signals. Several machine learning approaches\nhave been employed to handle the vast amounts of data generated by LHC. Due\nto the sparse, irregular and heterogeneous nature of the data produced at the\nLHC, Graph Neural Networks (GNNs) are well-suited and widely studied for\njet tagging. In fact, GNNs have also produced state-of-the-art AUC for jet\ntagging.\nSince quantum computing seems to offer a promising solution to efficiently\nhandle large data with inherent parallelism, the goal of this project is to utilize\nquantum capabilities to improve GNNs for jet tagging. We shall focus on both\nhybrid quantum-classical and fully quantum approaches and carry out a detailed\nanalysis to understand the pros and cons of both methods.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2024_026",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/iREEAOx9/",
          "proposal_id": null,
          "short_description": "The Large Hadron Collider (LHC) built by CERN is the world’s largest and the most powerful particle accelerator, which generates about 1 billion...",
          "slug": "quantum-graph-neural-networks-for-high-energy-physics-analysis-at-the-lhc",
          "status": "completed",
          "student_name": "Haemanth V",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Quantum Graph Neural Networks for High Energy Physics Analysis at the LHC"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2024/organizations/machine-learning-for-science-ml4sci/"
    },
    "year_2025": {
      "num_projects": 31,
      "projects": [
        {
          "code_url": null,
          "description": "Current deep learning models for CMS particle reconstruction are often task-specific. This project aims to develop versatile foundation models by pre-training deep neural networks on unlabeled CMS End-to-End (E2E) detector data using various Self-Supervised Learning (SSL) strategies (MAE, I-JEPA, CAE, VAE). These models learn robust, general-purpose representations of particle interactions. We will then comprehensively benchmark these foundation models by adapting them for diverse downstream tasks including Particle Identification (Classification), Kinematics Estimation (Regression), Detector Super-Resolution, and High-Fidelity Event Generation (investigating VAEs and conditional Diffusion Models). Deliverables include the open-source codebase with reproducible pipelines, pre-trained model weights, detailed benchmarking results/analysis, and user-friendly documentation.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2025_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/qZDekrLE",
          "proposal_id": "GSkyXouP",
          "short_description": "Current deep learning models for CMS particle reconstruction are often task-specific. This project aims to develop versatile foundation models by...",
          "slug": "foundation-models-for-end-to-end-event-reconstruction",
          "status": "in-progress",
          "student_name": "Aaditya Porwal",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Foundation models for End-to-End event reconstruction"
        },
        {
          "code_url": null,
          "description": "This project develops an open-source, unsupervised super-resolution (SR) pipeline for enhancing the resolution of gravitational lensing images, particularly those constructed from real galaxy observations. High-resolution lensing data is often limited, especially with the expected influx of lower-resolution data from upcoming surveys like Euclid and LSST. An unsupervised SR approach helps address this by learning directly from unpaired or unlabeled data.\n\nThe pipeline begins with simulated lensing images to build a baseline model. Domain adaptation techniques, including feature alignment and style transfer, are used to generalize the model to real telescope data. The project also integrates tools for analyzing the lenses and their substructures in the super-resolved images.\n\nDeliverables include:\n\n    - An unsupervised SR model for simulated and real lensing data\n\n    - Domain adaptation methods to bridge the sim-to-real gap\n\n    - Analysis tools for lens structure and morphology\n\n    - Full documentation and final report",
          "difficulty": null,
          "id": "proj_machine-learning-for_2025_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/0Dpx7PkX",
          "proposal_id": "9BB8gWtG",
          "short_description": "This project develops an open-source, unsupervised super-resolution (SR) pipeline for enhancing the resolution of gravitational lensing images,...",
          "slug": "unsupervised-super-resolution-and-analysis-of-real-lensing-images",
          "status": "in-progress",
          "student_name": "Aleksandr Duplinskii",
          "student_profile": null,
          "tags": [
            "ai",
            "ui",
            "ux"
          ],
          "title": "Unsupervised Super-Resolution and Analysis of Real Lensing Images"
        },
        {
          "code_url": null,
          "description": "This proposal aims to build upon and expand the progress made in recent years on Quantum Vision Transformers (QViTs) for High Energy Physics (HEP) analysis. Specifically, the project will adapt and extend the state-of-the-art Particle Transformer architecture, which has already demonstrated excellent performance in jet classification tasks, by integrating it with quantum components.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2025_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/1MGPehm9",
          "proposal_id": "eaJnSjKY",
          "short_description": "This proposal aims to build upon and expand the progress made in recent years on Quantum Vision Transformers (QViTs) for High Energy Physics (HEP)...",
          "slug": "quantum-particle-transformer-for-high-energy-physics-analysis-at-the-lhc",
          "status": "in-progress",
          "student_name": "Alessandro Tesi",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Quantum Particle transformer for High Energy Physics Analysis at the LHC"
        },
        {
          "code_url": null,
          "description": "This project tackles the challenge of learning hidden symmetries in complex, high-dimensional physics data using modern machine learning techniques. In particular, we aim to discover symmetries directly from raw CMS calorimeter data using a semi-supervised learning pipeline—without relying on pre-defined augmentation strategies or prior knowledge of symmetry transformations.\r\n\r\nWe will build on recent advances in symmetry discovery such as adversarial learning, Lie algebra-based models, and general equivariant MLP construction. The proposed approach begins with a supervised baseline using known augmentations to validate the pipeline, followed by implementing a GAN-based or contrastive method to infer latent group actions and conserved quantities. Discovered symmetries will then be used to construct equivariant neural networks that are robust, interpretable, and data-efficient.\r\n\r\nBy the end of the project, we aim to deliver a fully working, open-source pipeline for symmetry discovery and equivariant modeling on CMS data—benchmarking its performance and generalization against traditional models. This work will contribute to the broader mission of physics-aware machine learning and enable more principled modeling of detector data in high-energy physics.",
          "difficulty": "advanced",
          "id": "proj_machine-learning-for_2025_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/SiAABTM9",
          "proposal_id": "9hIX9FDS",
          "short_description": "This project tackles the challenge of learning hidden symmetries in complex, high-dimensional physics data using modern machine learning techniques....",
          "slug": "discovering-hidden-symmetries-in-cms-calorimetric-data-via-semi-supervised-learning",
          "status": "in-progress",
          "student_name": "Alexandra Murariu",
          "student_profile": null,
          "tags": [
            "ml",
            "ai",
            "ui"
          ],
          "title": "Discovering Hidden Symmetries in CMS Calorimetric Data via Semi-Supervised Learning"
        },
        {
          "code_url": null,
          "description": "Machine learning based analyses are proving to be very potent in understanding complex physical systems. This project aims to develop a reinforcement learning - CNN hybrid machinery that will perform unsupervised super-resolution and study of observed strong gravitational lensing images. The developed machinery will be useful in the study of data releases of upcoming lensing surveys.",
          "difficulty": "advanced",
          "id": "proj_machine-learning-for_2025_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/FN4tGXDE",
          "proposal_id": "wcoImMz7",
          "short_description": "Machine learning based analyses are proving to be very potent in understanding complex physical systems. This project aims to develop a reinforcement...",
          "slug": "unsupervised-super-resolution-and-analysis-of-observed-lensing-images",
          "status": "in-progress",
          "student_name": "Anirudh Shankar",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Unsupervised super-resolution and analysis of observed lensing images"
        },
        {
          "code_url": null,
          "description": "This project focuses on developing a new machine learning approach called Quantum Model-Agnostic Meta-Learning (Q-MAML) specifically for high-energy physics (HEP) experiments like those at the Large Hadron Collider (LHC). These experiments produce massive amounts of data that change over time, making it challenging to train machine learning models effectively.\n\nQ-MAML uses quantum computing techniques with variational quantum circuits to enable \"few-shot learning.\" This means the models can quickly adapt to new data with very little retraining, which is crucial for the dynamic environment of particle colliders. The goal is to improve tasks like identifying particle collision patterns (event topology classification) and finding rare signals.\n\nThe project will develop a modular, open-source Q-MAML workflow that is compatible with both quantum simulators and actual quantum hardware, utilizing platforms like Qiskit and PennyLane. The performance of Q-MAML will be rigorously benchmarked against classical MAML and standard variational quantum algorithm (VQA) classifiers on physics-inspired tasks. These benchmarks will include detailed evaluations of training curves, adaptation behaviors, and resource analysis. The deliverables will consist of a fully documented codebase, interactive Jupyter notebooks for ease of use, and reproducible benchmarking tools. This work aims to establish a practical foundation for hybrid quantum-classical learning in scientific applications, particularly within the field of high-energy physics.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2025_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/dHEy5F8z",
          "proposal_id": "AVvumE5d",
          "short_description": "This project focuses on developing a new machine learning approach called Quantum Model-Agnostic Meta-Learning (Q-MAML) specifically for high-energy...",
          "slug": "q-maml-for-variational-quantum-algorithms-for-high-energy-physics-analysis-at-the-lhc",
          "status": "in-progress",
          "student_name": "arnavsinghal09",
          "student_profile": null,
          "tags": [
            "ml",
            "ai",
            "ui"
          ],
          "title": "Q-MAML for Variational Quantum Algorithms for High Energy Physics Analysis at the LHC"
        },
        {
          "code_url": null,
          "description": "The project aims to develop a physics-informed neural network framework to infer the properties and distribution of dark matter in the lensing galaxy that undergoes strong gravitational lensing.  The most important part of the project is to create a model that works for real galaxies as well.  All work done so far has been on simulated datasets, and last year’s work was also limited to simulated datasets, not those generated from real datasets. This year’s work will focus more on  real simulated datasets, which cannot be classified by normal convolutional neural networks.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2025_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/IfQvKrOC",
          "proposal_id": "q99zIUs9",
          "short_description": "The project aims to develop a physics-informed neural network framework to infer the properties and distribution of dark matter in the lensing galaxy...",
          "slug": "physics-guided-machine-learning-on-real-lensing-images",
          "status": "in-progress",
          "student_name": "Ashutosh Ojha",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Physics Guided Machine Learning on Real Lensing Images"
        },
        {
          "code_url": null,
          "description": "Because of its cylindrical shape, the Compact Muon Solenoid (CMS) detector has intrinsic rotational symmetries.  Data analysis can be greatly improved by taking advantage of these symmetries, especially in semi-supervised learning situations where labeled data is hard to come by.  Using learnable rotation matrices conditioned on class labels or contextual information, this study aims to create a novel generative model that learns and applies rotational symmetry transformations to CMS data.  Our goal is to find and utilize rotational symmetries by including this model into a GAN-like framework with a trained classifier. This will enhance data augmentation and model performance in semi-supervised CMS data processing.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2025_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/XgeDrH4B",
          "proposal_id": "HaJCkaGs",
          "short_description": "Because of its cylindrical shape, the Compact Muon Solenoid (CMS) detector has intrinsic rotational symmetries. Data analysis can be greatly improved...",
          "slug": "discovery-of-hidden-symmetries-and-conservation-laws",
          "status": "in-progress",
          "student_name": "Avishikta_Bhattacharjee",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Discovery of hidden symmetries and conservation laws"
        },
        {
          "code_url": null,
          "description": "In high-energy physics (HEP), automating the symbolic computation of squared amplitudes is essential for predicting cross-sections and validating theoretical models against experimental data. Current transformer-based approaches excel in sequence modeling but falter in capturing the relational structures and physical consistency required for HEP expressions, such as those involving gamma matrices and Mandelstam variables. To tackle this, I propose the Physics-Informed Performer (PIP), a novel framework that integrates the Performer transformer’s efficient kernel-based attention with a physics-informed tokenization scheme and a SymPy-based validation layer. This approach leverages Performer’s ability to handle long sequences, introduces tokens like <SQUARE> and <S> to embed HEP-specific operations and kinematics, and ensures symbolic accuracy through empirical post-processing. By focusing on data representation, PIP offers a computationally efficient alternative to traditional symbolic methods, tailored to the Task 1.2 dataset of amplitude-to-squared-amplitude mappings.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2025_009",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/FAUugAQ0",
          "proposal_id": "sJ5AUXx0",
          "short_description": "In high-energy physics (HEP), automating the symbolic computation of squared amplitudes is essential for predicting cross-sections and validating...",
          "slug": "physics-informed-performer-for-symbolic-squared-amplitudes-in-hep",
          "status": "in-progress",
          "student_name": "Ayush Mishra A",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Physics-Informed Performer for Symbolic Squared Amplitudes in HEP"
        },
        {
          "code_url": null,
          "description": "This project proposes ProtoDiff, a diffusion-based deep learning model designed to denoise astronomical observations of protoplanetary disks from telescopes like ALMA and VLT. Leveraging recent advances in score-based generative modeling, the model will be trained on synthetic disk simulations with realistic noise. ProtoDiff aims to outperform traditional denoising pipelines in both quality and efficiency, enabling cleaner reconstructions of planet-forming environments. The final deliverables will include open-source code, pretrained models, and documentation to support reproducible astrophysical data processing and accelerate research in planet formation studies.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2025_010",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/HEfdSjzD",
          "proposal_id": "XM31oQKL",
          "short_description": "This project proposes ProtoDiff, a diffusion-based deep learning model designed to denoise astronomical observations of protoplanetary disks from...",
          "slug": "a-diffusion-based-deep-learning-framework-for-denoising-protoplanetary-disk-observations",
          "status": "in-progress",
          "student_name": "Chukwunwogor Faithful",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "A Diffusion-Based Deep Learning Framework for Denoising Protoplanetary Disk Observations"
        },
        {
          "code_url": null,
          "description": "Continuous learning serves as a powerful approach for maintaining reliable data quality monitoring in high-energy physics experiments facing evolving detector conditions. This project centers on developing adaptive methodologies that enable machine learning models to maintain performance without frequent retraining. We aim to explore multiple strategies for implementing continuous learning, including drift detection mechanisms that trigger model updates when significant changes in detector conditions occur. The primary objective is to establish an effective framework that addresses the limitations of static models, offering a novel solution for data quality monitoring tasks. This endeavor will provide comprehensive benchmarks for evaluating performance on realistic datasets. By leveraging these adaptive methodologies, we anticipate achieving superior monitoring reliability while reducing maintenance requirements and advancing the state-of-the-art in high-energy physics data quality monitoring.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2025_011",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/LaROwUCf",
          "proposal_id": "GjzEIe4u",
          "short_description": "Continuous learning serves as a powerful approach for maintaining reliable data quality monitoring in high-energy physics experiments facing evolving...",
          "slug": "continuous-learning-for-high-energy-physics-data-quality-monitoring",
          "status": "in-progress",
          "student_name": "Daksh Mor",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Continuous learning for high-energy physics data quality monitoring"
        },
        {
          "code_url": null,
          "description": "This project aims to develop and optimize deep learning algorithms for identifying strong gravitational lenses within wide-field surveys such as the Hyper Suprime-Cam Subaru Strategic Program (HSC-SSP). The project will be executed in three phases, from convolutional neural networks, to ENNS, to vision transformers. The project will gradually increase in complexity until a satisfactory result has been achieved.",
          "difficulty": "advanced",
          "id": "proj_machine-learning-for_2025_012",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/22BgqGr7",
          "proposal_id": "TF0inRsc",
          "short_description": "This project aims to develop and optimize deep learning algorithms for identifying strong gravitational lenses within wide-field surveys such as the...",
          "slug": "deeplense-gravitational-lens-finding-project",
          "status": "in-progress",
          "student_name": "DhruvSrivastava",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "DeepLense: Gravitational Lens Finding Project"
        },
        {
          "code_url": null,
          "description": "This project intends to develop cutting-edge machine-learning tools for spectral analysis to characterize the atmospheres of exoplanets. The project will explore various state-of-the-art and recent techniques to build a robust and general model with strong regressional properties. The resultant models from our study will be benchmarked against pre-existing baselines based on the principles of statistics and atmospheric sciences. Additionally, relevant tutorials and documentation will be provided, keeping future developments in mind. We propose simulation-based inference, causal representation learning and domain-adapted transformers for atmospheric retrievals.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2025_013",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/2W9zeTPN",
          "proposal_id": "5l0JfF1W",
          "short_description": "This project intends to develop cutting-edge machine-learning tools for spectral analysis to characterize the atmospheres of exoplanets. The project...",
          "slug": "exoplanet-atmosphere-characterization",
          "status": "in-progress",
          "student_name": "Gaurav Shukla",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Exoplanet Atmosphere Characterization"
        },
        {
          "code_url": null,
          "description": "This project aims to uncover fundamental symmetries and conserved laws hidden within complex high-energy physics data (specifically CMS datasets). It proposes a novel hybrid deep learning model that uniquely combines two approaches: 1) leveraging distributional invariance (inspired by GANs) to find transformations that preserve the data's structure without needing pre-defined knowledge, and 2) enforcing mathematical consistency by ensuring these transformations adhere to Lie algebra closure rules. Key steps involve developing and validating this model, deriving the explicit conserved quantities corresponding to the discovered symmetries (potentially using symbolic regression), applying the framework to CMS data, and using the findings to build and benchmark physics-aware deep learning models (e.g., for jet tagging). The ultimate goal is to create more robust, data-efficient, and interpretable models by directly incorporating the fundamental symmetries learned from the data itself.",
          "difficulty": "advanced",
          "id": "proj_machine-learning-for_2025_014",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/7sbHDzye",
          "proposal_id": "8gKYpYtC",
          "short_description": "This project aims to uncover fundamental symmetries and conserved laws hidden within complex high-energy physics data (specifically CMS datasets). It...",
          "slug": "discovery-of-hidden-symmetries-and-conservation-laws",
          "status": "in-progress",
          "student_name": "Green Kedia",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Discovery of hidden symmetries and conservation laws"
        },
        {
          "code_url": null,
          "description": "My project focuses on developing diffusion models for gravitational lensing simulations. I will implement and evaluate various diffusion-based architectures, including Diffusion Transformers (DiT) and Latent Diffusion Models (LDM). Conditional modeling techniques such as Classifier-Free Guidance and Conditional Flow Matching will also be explored. The project involves creating a diverse dataset of simulated gravitational lensing images under various astrophysical conditions for downstream tasks. All implementations, findings, and documentation will be open-sourced through a GitHub repository.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2025_015",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/T27qiqDH",
          "proposal_id": "XFJmmm4I",
          "short_description": "My project focuses on developing diffusion models for gravitational lensing simulations. I will implement and evaluate various diffusion-based...",
          "slug": "diffusion-models-for-gravitational-lensing-simulation",
          "status": "in-progress",
          "student_name": "hamees-sayed",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "Diffusion Models for Gravitational Lensing Simulation"
        },
        {
          "code_url": null,
          "description": "This project aims to develop a vision foundation model for strong gravitational lensing by comparing various self-supervised learning techniques, including contrastive learning, masked autoencoders, and the physics-informed I-JEPA model. The objective is to evaluate and benchmark these methods on diverse gravitational lensing datasets and to integrate physical priors into the I-JEPA framework for more meaningful representation learning. The resulting foundation model will be fine-tuned for multiple downstream tasks such as lens classification, super-resolution, parameter regression, and lens detection. Deliverables include a unified lensing dataset, comparative analysis of self-supervised methods, and a robust, physics-aware foundation model for gravitaional lensing images.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2025_016",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/bDYOfWmR",
          "proposal_id": "JnTywUNC",
          "short_description": "This project aims to develop a vision foundation model for strong gravitational lensing by comparing various self-supervised learning techniques,...",
          "slug": "foundation-model-for-gravitational-lensing",
          "status": "in-progress",
          "student_name": "J Rishi",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Foundation Model for Gravitational Lensing"
        },
        {
          "code_url": null,
          "description": "This project aims to develop a cutting-edge computational pipeline—\"Latent Neural Signatures in Clinical vs. Neurotypical Dyads: A CEBRA Pipeline\"—to decode and interpret complex neural dynamics during social interactions. By leveraging the CEBRA (Contrastive Embedding for Behavioral and Neural Analysis) framework, the pipeline will process and analyze time-locked 64-channel EEG data from interacting dyads (e.g., speaker-listener pairs). The goal is to generate robust, low-dimensional latent embeddings that capture key features such as neural synchrony, connectivity, and manifold geometry, ultimately distinguishing between clinical populations (e.g., individuals with Autism Spectrum Disorder) and neurotypical participants.\r\n\r\nTo achieve this, the project will integrate rigorous EEG preprocessing (artifact removal, filtering, epoching, and synchronization) with state-of-the-art contrastive learning methods. The pipeline will be built in a modular fashion, allowing for reproducible, open-source research and facilitating cross-disciplinary collaboration between machine learning experts and neuroscientists. Key deliverables include a fully functional end-to-end pipeline, comprehensive technical documentation and user guides, and detailed analysis reports with visualizations and quantitative metrics.\r\n\r\nThis approach promises not only to enhance our understanding of the neural substrates underlying social communication but also to provide a practical tool for clinical diagnostics and personalized intervention strategies.",
          "difficulty": "advanced",
          "id": "proj_machine-learning-for_2025_017",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/n70Uehmn",
          "proposal_id": "FLhs6QH4",
          "short_description": "This project aims to develop a cutting-edge computational pipeline—\"Latent Neural Signatures in Clinical vs. Neurotypical Dyads: A CEBRA Pipeline\"—to...",
          "slug": "latent-neural-signatures-in-clinical-vs-neurotypical-dyads-a-cebra-pipeline",
          "status": "in-progress",
          "student_name": "jeffreyhuang1009",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Latent Neural Signatures in Clinical vs. Neurotypical Dyads: A CEBRA Pipeline"
        },
        {
          "code_url": null,
          "description": "The project, \"Data Processing Pipeline for the LSST,\" is designed to bridge the gap between the LSST data ecosystem and DeepLense's deep learning workflows. The proposal outlines the development of a modular, efficient pipeline that automatically retrieves relevant LSST images and catalogues via the official LSST Butler API, applies configurable preprocessing (such as cutout extraction, normalization, resizing, and channel management), and finally delivers analysis-ready data into DeepLense ML models for tasks like lens detection, classification, and super-resolution. Key deliverables include:\n1. A robust LSST Data Access Module that reliably fetches data.\n2. A flexible preprocessing module for transforming raw images into ML-compatible formats.\n3. Seamless integration with DeepLense’s deep learning workflows, enabling end-to-end processing.\n4. Comprehensive documentation and reusable, well-structured code.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2025_018",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/HoQUCDWw",
          "proposal_id": "MMa6Q3ix",
          "short_description": "The project, \"Data Processing Pipeline for the LSST,\" is designed to bridge the gap between the LSST data ecosystem and DeepLense's deep learning...",
          "slug": "data-processing-pipeline-for-the-lsst",
          "status": "in-progress",
          "student_name": "Kartik Mandar",
          "student_profile": null,
          "tags": [
            "api",
            "ml"
          ],
          "title": "Data Processing Pipeline for the LSST"
        },
        {
          "code_url": null,
          "description": "Problem: Symbolic regression is crucial for discovering underlying physical laws from data, but traditional methods are often computationally expensive or lack generalization. Current approaches struggle with efficiency and adaptability across diverse scientific datasets.\n\nSolution: This project aims to develop a foundation model for symbolic regression by integrating transformer-based architectures (e.g., SymbolicGPT) with evolutionary algorithms and learned concept libraries (LASR). The model will leverage large-scale pretraining and fine-tuning to generalize across mathematical and physical datasets, combining the strengths of language models and evolutionary search for interpretable, efficient equation discovery.\n\nDeliverables:\nA transformer-based symbolic regression model with mathematical priors and curriculum learning.\n\nIntegration of a learned concept library for reusable abstractions.\n\nBenchmarks against SOTA models.\n\nOptimized, modular code for seamless LLM integration and open-source deployment.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2025_019",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/RtrwLUB6",
          "proposal_id": "k7PTZhS3",
          "short_description": "Problem: Symbolic regression is crucial for discovering underlying physical laws from data, but traditional methods are often computationally...",
          "slug": "foundation-models-for-symbolic-regression-tasks",
          "status": "in-progress",
          "student_name": "Krish Malik",
          "student_profile": null,
          "tags": [
            "ml",
            "ai"
          ],
          "title": "Foundation models for symbolic regression tasks"
        },
        {
          "code_url": null,
          "description": "This project aims to decode the neural dynamics of social interactions by adapting the CEBRA framework to analyze dyadic EEG data. Focusing on differences between neurotypical individuals and those with autism, the work will develop robust preprocessing pipelines, contrastive learning methods for neural synchrony, and interpretable clinical biomarkers. The deliverables include an open-source toolkit for EEG analysis, enabling researchers to study brain interactions with greater precision. This approach could advance early diagnosis and deepen our understanding of social brain function.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2025_020",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/Rjgy9LB6",
          "proposal_id": "FCAs123g",
          "short_description": "This project aims to decode the neural dynamics of social interactions by adapting the CEBRA framework to analyze dyadic EEG data. Focusing on...",
          "slug": "neural-harmony-decoding-social-interactions-with-cebra-based-framework-for-analysing-eeg-data",
          "status": "in-progress",
          "student_name": "Maria Glushanina",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Neural Harmony – Decoding Social Interactions with CEBRA-based framework for analysing EEG data"
        },
        {
          "code_url": null,
          "description": "Diffusion models have experienced rapid growth in usability, availability, and research. The classical algorithm consists of two main parts: a forward diffusion process and a learned denoising step. The forward diffusion process discretely applies noise to an image until it is unrecognizable. The denoising process reverses the noise, predicting the original image. Quantum techniques, such as parametric quantum circuits, could be applied to both parts to create a fully quantum model that could run on a quantum computer, speeding up training time. This model would be trained on multiple high energy physics datasets, such as the quark and gluon dataset for generating quark and gluon jets, alongside a classical diffusion model, and the results could be evaluated taking into account resources, time, and quality. Furthermore, a mathematically-driven approach would provide the theoretical foundations of quantum diffusion models in addition to experimental results.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2025_021",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/zoK9XWAM",
          "proposal_id": "9P7GWtJS",
          "short_description": "Diffusion models have experienced rapid growth in usability, availability, and research. The classical algorithm consists of two main parts: a...",
          "slug": "quantum-diffusion-model-for-hep",
          "status": "in-progress",
          "student_name": "Masha",
          "student_profile": null,
          "tags": [
            "api",
            "ai",
            "ui"
          ],
          "title": "Quantum Diffusion Model for HEP"
        },
        {
          "code_url": null,
          "description": "This project aims to implement a Quantum Generative Adversarial Network (QGAN) using the Pennylane framework to explore the advantages of quantum machine learning in High Energy Physics. By leveraging entangling quantum circuits and variational optimization, the QGAN will be trained to model complex data distributions. The project will include a direct comparison between classical GANs and QGANs on identical tasks, evaluating performance through training speed, sample quality, and robustness to mode collapse. Deliverables include a fully functional QGAN model, benchmarking reports, noise sensitivity analysis, and an open-source code repository with documentation.",
          "difficulty": "advanced",
          "id": "proj_machine-learning-for_2025_022",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/4zV712HN",
          "proposal_id": "2zCnp4ft",
          "short_description": "This project aims to implement a Quantum Generative Adversarial Network (QGAN) using the Pennylane framework to explore the advantages of quantum...",
          "slug": "implementation-of-quantum-generative-adversarial-networks-to-perform-hep-analysis-at-the-lhc",
          "status": "in-progress",
          "student_name": "Maya Ma",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Implementation of Quantum Generative Adversarial Networks to Perform HEP Analysis at the LHC"
        },
        {
          "code_url": null,
          "description": "This project proposes the development of a foundational model for symbolic regression tailored to high energy physics (HEP). Symbolic regression can be used to rapidly provide solutions to scientific problems with high computational complexity or even intractable tasks, discovering symbolic expressions that describe underlying physical laws. While many approaches have been explored, this project focuses on building a foundation model which incorporates knowledge about the task of symbolic regression and common data representations for physical systems. The model will target accurate and interpretable prediction of squared amplitudes and cross sections—two core quantities in particle physics. Leveraging physics‑informed representations, symbolic machine learning, and simulation data, the project will explore how to integrate domain knowledge into learning algorithms to enhance scientific validity. Over 28 weeks, the project will progress through phases of theoretical investigation, foundation model design, simulation‑based data generation, model development, and integration. Deliverables will include a curated dataset, pre‑trained foundation model, symbolic models, and a final report, with broader goals of improving interpretability and reliability in physics‑informed AI.",
          "difficulty": "advanced",
          "id": "proj_machine-learning-for_2025_023",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/OEZlYZ6G",
          "proposal_id": "LQGqJfZb",
          "short_description": "This project proposes the development of a foundational model for symbolic regression tailored to high energy physics (HEP). Symbolic regression can...",
          "slug": "building-a-foundational-model-for-symbolic-regression-in-high-energy-physics",
          "status": "in-progress",
          "student_name": "Miche",
          "student_profile": null,
          "tags": [
            "api",
            "ai",
            "ui"
          ],
          "title": "Building a Foundational Model for Symbolic Regression in High Energy Physics"
        },
        {
          "code_url": null,
          "description": "One of the most important physical quantities in particle physics is the cross section, or a probability that a particular process takes place in the interaction of elementary particles. Its measure provides a testable link between theory and experiment. It is obtained theoretically mainly by calculating the squared amplitude. While the calculation of amplitudes for a particular expression is trivial, mapping it to a squared amplitude is computationally expensive. Previous works demonstrated that transformer-based (vanilla and KAN-infused) models can map amplitudes to squared amplitudes substantially faster and with high accuracy. However, transformers suffer from quadratic complexity due to self-attention, making them less efficient when handling extremely long sequences. Additionally, they may struggle with structured, hierarchical dependencies that naturally arise in amplitude computations. Inspired by Classical State Space theory, State Space Sequence Models (SSMs) emerged as a promising class of architectures for sequence modelling. These models can be interpreted as a combination of RNNs and CNNs. These models have near-linear scaling with sequence length, making them effective for long-range dependencies. This project will explore using SSMs for squared amplitude calculations.\n\nThere are 2 major aims of this project\n\n1. To develop novel hybrid models that combine state-space models (SSMs) with attention mechanisms for squared amplitude calculations.\n\n2. A systematic evaluation of already existing models and SSMs on feynman interaction datasets and their scalability with respect to dataset size, maximum sequence length etc.",
          "difficulty": "advanced",
          "id": "proj_machine-learning-for_2025_024",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/yq2sYd99",
          "proposal_id": "RazuRQdv",
          "short_description": "One of the most important physical quantities in particle physics is the cross section, or a probability that a particular process takes place in the...",
          "slug": "state-space-models-for-squared-amplitude-calculation-in-high-energy-physics",
          "status": "in-progress",
          "student_name": "Prasanth Naidu",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "State-space models for squared amplitude calculation in high-energy physics"
        },
        {
          "code_url": null,
          "description": "This project explores Quantum Kolmogorov–Arnold Networks (QKANs) as a novel and interpretable architecture for analyzing collider data from the High-Luminosity LHC. Inspired by the Kolmogorov–Arnold theorem, QKANs decompose complex multivariate functions into compositions of univariate ones—translated into quantum models using parameterized circuits and Chebyshev-based activations. QKANs leverage quantum singular value transformation (QSVT), block-encoding, and variational unitaries to efficiently model high-dimensional, nonlinear relationships in jet physics tasks like quark-gluon tagging.\n\nThe goal is to develop scalable and NISQ-compatible QKAN layers using the Pennylane framework and benchmark them against classical MLPs and spline-based KANs on realistic HEP datasets. This includes implementing quantum-friendly activation functions, evaluating noise robustness, and integrating hybrid QKAN layers selectively across high-impact features. The final deliverables will include a modular, open-source codebase, training pipelines, evaluation reports, and insights into symbolic function discovery in collider physics. This project contributes to building transparent, compact, and hardware-efficient quantum models for the next generation of scientific discovery at the LHC.",
          "difficulty": "advanced",
          "id": "proj_machine-learning-for_2025_025",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/TNdAnfnC",
          "proposal_id": "cHqKJ0BJ",
          "short_description": "This project explores Quantum Kolmogorov–Arnold Networks (QKANs) as a novel and interpretable architecture for analyzing collider data from the...",
          "slug": "quantum-kolmogorov-arnold-networks-for-high-energy-physics-analysis-at-the-lhc",
          "status": "in-progress",
          "student_name": "Ria Khatoniar",
          "student_profile": null,
          "tags": [
            "ml",
            "ai",
            "ui"
          ],
          "title": "Quantum Kolmogorov-Arnold Networks for High Energy Physics Analysis at the LHC"
        },
        {
          "code_url": null,
          "description": "In particle physics, a cross section is a measure of the likelihood that particles will interact or scatter with one another when they collide. It is a fundamental quantity and its computation can become time intensive. This project aims to apply state-of-the-art machine learning techniques, particularly transformer-based models, for the generation of symbolic representations of the squared amplitudes in HEP. The proposed sequence-to-sequence system aims to improve upon the existing time-intensive processes of calculations of the squared amplitude .  This project builds upon the previous work which includes vanilla models, and extends it further to advanced transformer models.",
          "difficulty": "advanced",
          "id": "proj_machine-learning-for_2025_026",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/niqGYrnh",
          "proposal_id": "bDzvTm9P",
          "short_description": "In particle physics, a cross section is a measure of the likelihood that particles will interact or scatter with one another when they collide. It is...",
          "slug": "next-generation-transformer-models-for-symbolic-calculations-of-squared-amplitudes-in-hep",
          "status": "in-progress",
          "student_name": "Ritesh Bhalerao",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Next-Generation Transformer Models for Symbolic Calculations of Squared Amplitudes in HEP"
        },
        {
          "code_url": null,
          "description": "High-fidelity detector simulations are critical for accurate analysis in particle physics, but traditional Monte Carlo-based methods are computationally expensive. DeepFalcon introduced a promising approach using Graph Variational Autoencoders (GVAE) that treat particle hits as graph nodes, enabling faster inference while maintaining high accuracy. This implementation used CMS Open Data of boosted top quark jets and considered only the ECAL layer of the detector, achieving a 400× speedup in reconstructing jets compared to traditional simulations. The model architecture employed GraphSAGE layers and mincut pooling, while training used Adam optimizer with a hybrid loss function combining MSE and KL divergence.\n\nHowever, the current approach is limited to single-layer detector responses and doesn't fully capture the correlations between multiple detector components.\n\nThis project aims to extend DeepFalcon’s GVAE architecture to support multi-layer detector systems, specifically incorporating Tracker, ECAL, and HCAL layers simultaneously. The proposal is structured into two phases:\n\nPhase I will focus on enhancing the graph data representation by including all three detector layers and designing optimized connectivity patterns that capture spatial and inter-layer dependencies.\n\nPhase II will explore advanced pooling techniques and alternative message-passing strategies to improve latent representation quality and model generalization, while maintaining fast inference speeds.\n\nAll components will be implemented using Python and relevant machine learning libraries such as PyTorch Geometric. Expected deliverables include a multi-layer GVAE model, benchmark comparisons against existing results, and detailed analysis of the architectural choices.\n\nThis project contributes toward advancing fast simulation techniques in high-energy physics by enabling more comprehensive and scalable detector modeling.",
          "difficulty": "advanced",
          "id": "proj_machine-learning-for_2025_027",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/pLGb5JlM",
          "proposal_id": "LGxRuMRq",
          "short_description": "High-fidelity detector simulations are critical for accurate analysis in particle physics, but traditional Monte Carlo-based methods are...",
          "slug": "graph-representation-learning-for-fast-detector-simulation",
          "status": "in-progress",
          "student_name": "Rushil Singha",
          "student_profile": null,
          "tags": [
            "python",
            "ai"
          ],
          "title": "Graph Representation Learning for Fast Detector Simulation"
        },
        {
          "code_url": null,
          "description": "This project aims at incorporating Physics informed neural network (PINN) based ODE solvers into the Diffusion probabilistic models(DPM) , to build a fast and efficient sampler for high dimensional complex probability distribution.  Diffusion models are characterized by a probability flow ODE equation which needs to solved using numerical solvers to generate samples from the target probability distribution. In this project we replace the numerical ODE solvers with PINNs which are trained to represent the solution of the probability flow ODEs over a domain of values. This enables us to amortize the large upfront cost of training PINN to fast sampling speed once the model is trained. \n\nDifferent variants of PINN like models with hard constrains on initial/boundary conditions, augmented Lagrangian based models, can-PINN and neural operator based methods will be systematically tested on different non Gaussian 3D probability distribution like [ Mixture of Gaussian, 3D helical, Torodial distribution and Concentric spherical shells ]. I will be testing both single objective optimization and  multi objective optimization techniques to handle the physical loss term and MSE loss term in PINN training. \n\nA systematic analysis of different variants of PINNs to solve the probability flow ODE will be presented with metrics to quantify the PINN representation error  and comparison between the true probability distribution and samples from PINNDE.\n\nDepending on the viability of the results on the above mentioned tests, PINNDE method will be used on the fast colorimeter simulation challenge 2022 benchmark dataset 1.",
          "difficulty": "advanced",
          "id": "proj_machine-learning-for_2025_028",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/uGmyAV1q",
          "proposal_id": "JSMaIzdZ",
          "short_description": "This project aims at incorporating Physics informed neural network (PINN) based ODE solvers into the Diffusion probabilistic models(DPM) , to build a...",
          "slug": "physics-informed-neural-network-diffusion-equation",
          "status": "in-progress",
          "student_name": "Sijil",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Physics informed neural network diffusion equation"
        },
        {
          "code_url": null,
          "description": "This project aims to develop quantum machine learning models for exoplanet atmosphere characterization by leveraging the power of quantum neural networks (QNNs) and variational quantum circuits (VQCs). We will build a hybrid quantum-classical pipeline to extract features from transmission spectra, classify atmospheric compositions, and detect anomalies that could signal unique or potentially habitable planetary conditions. Using both simulated spectra (via petitRADTRANS and Poseidon) and real observational data (from JWST/Hubble), we will benchmark QML models against classical approaches. The final deliverables include QML-based tools for spectral analysis, comprehensive performance evaluations, and detailed documentation to support future exoplanet exploration efforts.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2025_029",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/xIJEvndL",
          "proposal_id": "bbSF7Hhy",
          "short_description": "This project aims to develop quantum machine learning models for exoplanet atmosphere characterization by leveraging the power of quantum neural...",
          "slug": "quantum-machine-learning-for-exoplanet-characterization",
          "status": "in-progress",
          "student_name": "Sourish Phate",
          "student_profile": null,
          "tags": [
            "ml",
            "ai",
            "ui"
          ],
          "title": "Quantum Machine Learning For Exoplanet Characterization"
        },
        {
          "code_url": null,
          "description": "The project aims at building foundational models suitable for characterizing the vast astronomical data and emphasizing their use case for various downstream tasks. Collecting suitable datasets, training the models on simulated datasets and applying them on real observational datasets. The main purpose of the project is to develop a suitable deep learning approach for these astronomical datasets which is able to overcome the specific instrument differences for the different observations.",
          "difficulty": null,
          "id": "proj_machine-learning-for_2025_030",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/T6ZNRVxa",
          "proposal_id": "qdl5158j",
          "short_description": "The project aims at building foundational models suitable for characterizing the vast astronomical data and emphasizing their use case for various...",
          "slug": "foundation-models-for-exoplanet-characterization",
          "status": "in-progress",
          "student_name": "Tanmay Singhal",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Foundation Models for Exoplanet Characterization"
        },
        {
          "code_url": null,
          "description": "Accurately classifying particle collisions—whether distinguishing quark- from\ngluon-initiated jets or isolating Higgs events from complex backgrounds—requires\nmodels that capture both fundamental conservation laws and the inherent geo-\nmetric invariances of the detector environment. This work presents a hybrid\nself-supervised framework that leverages physics-informed deep learning to ad-\ndress these challenges. Our approach utilizes a masked transformer encoder to\nlearn conservation of momentum and energy by reconstructing masked particle\nfeatures, while a Lorentz-Equivariant Geometric Algebra Transformer (L-GATr)\nencodes the space-time symmetries present in collision events. By integrating\nthese complementary embeddings into task-specific cross-attention decoders, the\nframework effectively fuses physical and geometric information to enhance event\nclassification and mass reconstruction, thereby advancing the performance and\ninterpretability of machine learning in high-energy physics.",
          "difficulty": "advanced",
          "id": "proj_machine-learning-for_2025_031",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/MyOKgQ1j",
          "proposal_id": "NNOo5u5D",
          "short_description": "Accurately classifying particle collisions—whether distinguishing quark- from gluon-initiated jets or isolating Higgs events from complex...",
          "slug": "a-self-supervised-physics-informed-hybrid-transformer-framework-for-multi-tasks-in-hep",
          "status": "in-progress",
          "student_name": "Thanh P Nguyen",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "A Self-Supervised, Physics-Informed Hybrid Transformer Framework for Multi-Tasks in HEP"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2025/organizations/machine-learning-for-science-ml4sci"
    }
  },
  "first_time": false,
  "contact": {
    "email": "ml4-sci@cern.ch",
    "guide_url": null,
    "ideas_url": "https://ml4sci.org/",
    "irc_channel": "https://app.gitter.im/#/room/#ML4SCI_general:gitter.im",
    "mailing_list": "https://simba3.web.cern.ch/simba3/SelfSubscription.aspx?groupName=ml4sci-announce"
  },
  "social": {
    "blog": null,
    "discord": null,
    "facebook": null,
    "github": null,
    "gitlab": null,
    "instagram": null,
    "linkedin": null,
    "mastodon": null,
    "medium": null,
    "reddit": null,
    "slack": null,
    "stackoverflow": null,
    "twitch": null,
    "twitter": null,
    "youtube": null
  },
  "meta": {
    "version": 1,
    "generated_at": "2026-01-25T15:28:53.426Z"
  }
}