{
  "id": "692251dc53dd9d7326d33e25",
  "slug": "metacall",
  "name": "MetaCall",
  "category": "Programming languages",
  "description": "Simplifying the embedding of programming languages",
  "image_url": "https://summerofcode.withgoogle.com/media/org/metacall/rezoq3uue7dpdzw5-360.png",
  "img_r2_url": "https://pub-268c3a1efc8b4f8a99115507a760ca14.r2.dev/metacall.webp",
  "logo_r2_url": null,
  "url": "https://metacall.io",
  "active_years": [
    2021,
    2022,
    2023,
    2024
  ],
  "first_year": 2021,
  "last_year": 2024,
  "is_currently_active": false,
  "technologies": [
    "python",
    "javascript",
    "c",
    "c++",
    "cmake",
    "guix",
    "rust",
    "node.js",
    "docker"
  ],
  "topics": [
    "programming languages",
    "development tools",
    "cross-platform",
    "polyglot",
    "foreign function interface",
    "cloud",
    "faas",
    "languages",
    "ffi"
  ],
  "total_projects": 19,
  "stats": {
    "avg_projects_per_appeared_year": 4.75,
    "projects_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": null,
      "year_2019": null,
      "year_2020": null,
      "year_2021": 3,
      "year_2022": 5,
      "year_2023": 4,
      "year_2024": 7,
      "year_2025": null
    },
    "students_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": null,
      "year_2019": null,
      "year_2020": null,
      "year_2021": 3,
      "year_2022": 5,
      "year_2023": 4,
      "year_2024": 7,
      "year_2025": null
    },
    "total_students": 18
  },
  "years": {
    "year_2016": null,
    "year_2017": null,
    "year_2018": null,
    "year_2019": null,
    "year_2020": null,
    "year_2021": {
      "num_projects": 3,
      "projects": [
        {
          "code_url": "https://medium.com/@metacall/google-summer-of-code-2021-implementing-a-webassembly-loader-for-metacall-f7a4bc60739f",
          "description": "<p>WebAssembly is an emerging standard for a binary instruction format designed to be run on a virtual machine. It is designed to be portable, stable and fast.</p>\n<p>It is already possible to compile to WebAssembly from many different programming languages, including ones that are currently unsupported by MetaCall (e.g. Go, Zig, Kotlin and Swift). This project will add support for a wide - and expanding - range of programming languages through the implementation of a WebAssembly loader.</p>\n",
          "difficulty": null,
          "id": "proj_metacall_2021_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6740009972924416/",
          "proposal_id": null,
          "short_description": "WebAssembly is an emerging standard for a binary instruction format designed to be run on a virtual machine. It is designed to be portable, stable...",
          "slug": "webassembly-loader",
          "status": "completed",
          "student_name": "Jeppe Blomgren",
          "student_profile": null,
          "tags": [
            "web"
          ],
          "title": "WebAssembly loader"
        },
        {
          "code_url": "https://medium.com/@metacall/google-summer-of-code-2021-implementing-a-java-loader-for-metacall-13223f966960",
          "description": "<p>Metacall acts as a middleware between two languages using which we can call function present in one language from another. Java is a high-level programming language that should be a part of the metacall project. The three APIs required for the project are embedding API, extension API, and bootstrap API, which can be implemented using the Java native interface(JNI). JNI acts as a bridge between the java bytecode and a native library like C or Cpp and allows us to call  Cpp functions from java and vice versa.</p>\n",
          "difficulty": null,
          "id": "proj_metacall_2021_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5393816529403904/",
          "proposal_id": null,
          "short_description": "Metacall acts as a middleware between two languages using which we can call function present in one language from another. Java is a high-level...",
          "slug": "java-loader-using-java-native-interface",
          "status": "completed",
          "student_name": "ketangupta34",
          "student_profile": null,
          "tags": [
            "java",
            "api",
            "ui"
          ],
          "title": "Java Loader using Java Native Interface"
        },
        {
          "code_url": "https://medium.com/@metacall/google-summer-of-code-2021-development-of-jupyter-kernel-for-metacall-ddd552319ccf",
          "description": "<p>MetaCall Core is an open-source software that brings the polyglot programming experience to Developers. With MetaCall, developers can embed different programming languages through an easy-to-use high-level API. Jupyter Notebook is an interactive environment that allows scientists, researchers, developers and engineers to perform analysis, scientific computing, code prototyping and more. These notebooks provide a feature-rich interface where they can capitalize on visualizations, figures, plots and user-interface elements to prototype the code they are writing and working on.</p>\n<p>This project aims to create a kernel where the MetaCall Core can be loaded and launched through a Jupyter Notebook interface. With this Notebook, the users can try out writing and embedding code in different programming languages. It would also make it possible to use the MetaCall API and achieve the goal of bringing a unified interface for developers to try out and leverage MetaCall. The Kernel would allow developers to load the MetaCall API to execute code in different programming languages by mixing code amongst each other.</p>\n",
          "difficulty": "beginner",
          "id": "proj_metacall_2021_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5777069882998784/",
          "proposal_id": null,
          "short_description": "MetaCall Core is an open-source software that brings the polyglot programming experience to Developers. With MetaCall, developers can embed different...",
          "slug": "development-of-jupyter-kernel-for-metacall-core",
          "status": "completed",
          "student_name": "Harsh Bardhan Mishra",
          "student_profile": null,
          "tags": [
            "api",
            "ai"
          ],
          "title": "Development of Jupyter Kernel for MetaCall Core"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2021/organizations/5272300328321024/"
    },
    "year_2022": {
      "num_projects": 5,
      "projects": [
        {
          "code_url": "https://github.com/metacall/gsoc-2022/blob/main/submission/paramsiddharth.md",
          "description": "The CI/CD pipelines are currently hosted on GitLab, using their built-in GitLab CI. This project aims to migrate the existing pipelines completely to GitHub Actions and centralize the deployment of all Docker images to GitHub Packages using GitHub's Container Registry.\n\nAdditionally, it involves implementing remote caching to speed up cloud builds, and documenting the whole CI/CD process for the community to adopt it as best practice.",
          "difficulty": null,
          "id": "proj_metacall_2022_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/vkIKSHzg/",
          "proposal_id": null,
          "short_description": "The CI/CD pipelines are currently hosted on GitLab, using their built-in GitLab CI. This project aims to migrate the existing pipelines completely to...",
          "slug": "migrate-existing-cicd-pipelines-to-github-and-improve-buildtestdeployment-workflows",
          "status": "completed",
          "student_name": "Param Siddharth",
          "student_profile": null,
          "tags": [
            "ai",
            "docker",
            "cloud",
            "ui"
          ],
          "title": "Migrate existing CI/CD pipelines to GitHub and Improve Build/Test/Deployment workflows"
        },
        {
          "code_url": "https://github.com/metacall/gsoc-2022/blob/main/submission/akechishiro.md",
          "description": "Tests for the Nix Metacall package will be written, the Nix package will have more precise dependencies , documentation and a CI/CD with Docker shall be setup to tests the packaging process in order to limit the introduction of bugs.\nPackaging for MacOSX using qemu-OSX in order to virtualize a MacOSX dev environnement, (mind this won't provide support for Apple M1), Metacall will be packaged for the Homebrew package manager.\nTests shall be written for GitHub Actions with Docker for different programming language loaders (Python, Rust, C, NodeJS, etc.)\n\nAnd then in a similar manner with Windows, packaging Metacall for the Chocolatey package manager, if more time is left, a strecth goal is to make a package for apt (Debian/Ubuntu), Homebrew (MacOSX) and Chocolatey (Windows).",
          "difficulty": null,
          "id": "proj_metacall_2022_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/HlYxwIwX/",
          "proposal_id": null,
          "short_description": "Tests for the Nix Metacall package will be written, the Nix package will have more precise dependencies , documentation and a CI/CD with Docker shall...",
          "slug": "packaging-testing-metacall-for-macosx-windows-nixos-users",
          "status": "completed",
          "student_name": "Lahfa Samy",
          "student_profile": null,
          "tags": [
            "python",
            "docker"
          ],
          "title": "Packaging & Testing Metacall for MacOSX, Windows, NixOS users"
        },
        {
          "code_url": "https://github.com/rxbryan/GSOC-2022/blob/master/GSOC_report.md",
          "description": "The metacall library provides APIs for calling functions, methods, or procedures between multiple programming languages. The metacallcli's  less than modular design exposes some problems that makes it quite diffcult to either maintain or extend the cli and repl with new features and commands in an efficient manner.\n\nHence this project aims to refactor the cli to a plugin architecture. This would enable the  individual components of the cli to be developed independently, from the rest of the cli.",
          "difficulty": null,
          "id": "proj_metacall_2022_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/bn3S8wst/",
          "proposal_id": null,
          "short_description": "The metacall library provides APIs for calling functions, methods, or procedures between multiple programming languages. The metacallcli's less than...",
          "slug": "metacall-cli-refactor",
          "status": "completed",
          "student_name": "rxbryan",
          "student_profile": null,
          "tags": [
            "api",
            "ai",
            "ui"
          ],
          "title": "MetaCall Cli Refactor"
        },
        {
          "code_url": "https://github.com/metacall/gsoc-2022/blob/main/submission/tricster.md",
          "description": "Add rust loader support for Metacall, allowing user to load rust scripts dynamically and embed rust code into other languages. \nThis can be done by generating stubs before compiling rust code and dynamical loading. \nThe information needed to generate stubs can be obtained by using rustc API. \nAfter that, the user can do following things:\n1. Load rust scrips.\n2. Inspect loaded functions. \n3. Invoke loaded functions in other languages.\n4. Eval rust scripts.",
          "difficulty": null,
          "id": "proj_metacall_2022_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/F5dAfrP2/",
          "proposal_id": null,
          "short_description": "Add rust loader support for Metacall, allowing user to load rust scripts dynamically and embed rust code into other languages. This can be done by...",
          "slug": "add-rust-loader-support-for-metacall",
          "status": "completed",
          "student_name": "Tricster",
          "student_profile": null,
          "tags": [
            "api",
            "ai"
          ],
          "title": "Add Rust loader support for Metacall"
        },
        {
          "code_url": "https://github.com/metacall/gsoc-2022/blob/main/submission/creatoon.md",
          "description": "This project will implement a CLI for deploying projects into MetaCall FaaS. This CLI should be able to be integrated with the MetaCall CLI. The objective of this project is to provide an interactive and also automated way to deploy projects into MetaCall FaaS.",
          "difficulty": null,
          "id": "proj_metacall_2022_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/YqPM14us/",
          "proposal_id": null,
          "short_description": "This project will implement a CLI for deploying projects into MetaCall FaaS. This CLI should be able to be integrated with the MetaCall CLI. The...",
          "slug": "deploy-cli-metacall",
          "status": "completed",
          "student_name": "Raj Aryan",
          "student_profile": null,
          "tags": [],
          "title": "Deploy CLI (Metacall)"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2022/organizations/metacall/"
    },
    "year_2023": {
      "num_projects": 4,
      "projects": [
        {
          "code_url": "https://github.com/ahmedihabb2/gsoc-2023/blob/main/submissions/AhmedIhab.md",
          "description": "MetaCall Core has an intensive test case that is mainly focused on Linux (including Sanitizers in order to detect memory, address, undefined behavior, or threading bugs).\nThe main idea is to support multiple platforms and architectures with multiple compilers but the current baseline (Linux with GCC, Windows with MSVC, and MacOS with Clang; all on amd64 architecture)\nSo, We will implement full CI/CD for macOS with the maximum amount of language support possible for now MetaCall has one for Linux and Windows",
          "difficulty": null,
          "id": "proj_metacall_2023_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/7Jjjexmo",
          "proposal_id": "1IDMMLsd",
          "short_description": "MetaCall Core has an intensive test case that is mainly focused on Linux (including Sanitizers in order to detect memory, address, undefined...",
          "slug": "improve-cicd-for-metacall-core-macos",
          "status": "completed",
          "student_name": "Ahmed Ihab",
          "student_profile": null,
          "tags": [
            "ai",
            "ux"
          ],
          "title": "Improve CI/CD for MetaCall Core MacOS"
        },
        {
          "code_url": "https://github.com/metacall/gsoc-2023/blob/main/submissions/gpt-deploy.md",
          "description": "LambdaEase is an innovative tool designed to automate the process of writing and\ndeploying functions in any programming language. This eliminates the need for manual coding\nand debugging, making it a game-changer for developers. With LambdaEase, users can\ngenerate optimized and well-written deployable functions simply by making a request in natural\nlanguage. The tool uses chatGPT with customized features to extract essential details such as\nfunction name, parameter names, types, and expected return types. It can also provide\ndocumentation for the generated function, making it easy to understand and use. Users can run\nthe generated code in memory before deploying it, ensuring the accuracy and quality of the\noutput.\nLambdaEase is built using Typescript, React.js, and Python, making it a robust and\nreliable tool. Its compatibility with any other language makes it versatile and accessible for any\ndeveloper. The success of LambdaEase depends on the accuracy and reliability of chatGPT,\nwhich is continuously evolving and improving. With LambdaEase, developers can expect to\ndeploy complex business logic with minimal manual coding, making it a powerful tool in any\ndevelopment environment.",
          "difficulty": "beginner",
          "id": "proj_metacall_2023_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/jFcgf9UX",
          "proposal_id": "jRpTvs3A",
          "short_description": "LambdaEase is an innovative tool designed to automate the process of writing and deploying functions in any programming language. This eliminates the...",
          "slug": "lambdaease",
          "status": "completed",
          "student_name": "Durgesh Maurya",
          "student_profile": null,
          "tags": [
            "react",
            "python",
            "typescript",
            "ai",
            "ui"
          ],
          "title": "LambdaEase"
        },
        {
          "code_url": "https://github.com/metacall/gsoc-2023/blob/main/submissions/windows-ci-pkspyder007.md",
          "description": "The Windows CI/CD project aims to automate the build, testing, and deployment of software on the Windows operating system. \nThe main challenge is to ensure compatibility with multiple compilers and automate the installation of dependencies. The project's focus is on improving the MSVC support and implementing efficient testing mechanisms.\n\nI'll be working towards creating a platform-agnostic and easily deployable CI/CD system that provides end-to-end support. The MetaCall Team is available to provide assistance and address any issues that arise during the project.",
          "difficulty": null,
          "id": "proj_metacall_2023_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/GOa6ri4N",
          "proposal_id": "bfrWnMea",
          "short_description": "The Windows CI/CD project aims to automate the build, testing, and deployment of software on the Windows operating system. The main challenge is to...",
          "slug": "improve-cicd-for-metacall-core-windows",
          "status": "completed",
          "student_name": "pkspyder",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Improve CI/CD for MetaCall Core Windows"
        },
        {
          "code_url": "https://github.com/Creatoon/gsoc-2023/blob/main/submissions/creatoon.md",
          "description": "This project offers a reimplementation of MetaCall FaaS but with a simpler and less performant implementation. The objective of this FaaS reimplementation is to provide a simple and portable FaaS that can be run from the CLI in order to locally test the functions and complete projects that can be deployed into MetaCall FaaS.\n\nIt mimicks the MetaCall FaaS REST API but without need of authentication and with only the required capabilities for development. This repository will share parts with MetaCall FaaS through MetaCall Protocol so code can be reused between the repositories.\n\nIn the end, MetaCall FaaS will be integrated with MetaCall CLI, providing a self contained distributable with all the compiled code which can be launched or invoked from an external CLI via API.",
          "difficulty": null,
          "id": "proj_metacall_2023_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/8pfFYrnv",
          "proposal_id": "AlPioZnb",
          "short_description": "This project offers a reimplementation of MetaCall FaaS but with a simpler and less performant implementation. The objective of this FaaS...",
          "slug": "faas-typescript-reimplementation",
          "status": "completed",
          "student_name": "Raj Aryan",
          "student_profile": null,
          "tags": [
            "typescript",
            "api",
            "ai",
            "ui"
          ],
          "title": "FaaS TypeScript Reimplementation"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2023/organizations/metacall"
    },
    "year_2024": {
      "num_projects": 7,
      "projects": [
        {
          "code_url": "https://github.com/metacall/faashttps://heemansu.hashnode.dev/gsoc-2024-with-metacall-faas-reimplementation",
          "description": "This project aims reimplementation of Metacall Faas but in a simple way. \nGoals and Deliverables:\n1. Completing the unfinished implementation of the --addrepo (deploy form repo) and dependencies feature.\n2. Error handling in reinitialization feature.\n3. Improved logging & coloring system.\n4. Building test suite.\n5. Modifying CI pipeline for tests.\n6. Integration with Metacall installer.\n7. In Deploy CLI, Passing environment variables through a file, like --env-file=.env.\n8. Faas Docs - Documentation website for Faas.\n9. Blog Post stating overall Experience.",
          "difficulty": null,
          "id": "proj_metacall_2024_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/h1Fd2LaC/",
          "proposal_id": null,
          "short_description": "This project aims reimplementation of Metacall Faas but in a simple way. Goals and Deliverables: 1. Completing the unfinished implementation of the...",
          "slug": "faas-typescript-reimplementation-project-proposal",
          "status": "completed",
          "student_name": "Himanshu Kumar Sharma",
          "student_profile": null,
          "tags": [
            "typescript",
            "web",
            "ai",
            "ui"
          ],
          "title": "FaaS TypeScript Reimplementation Project Proposal"
        },
        {
          "code_url": "https://prakhargurunani.com/blog/bringing-metacall-to-macos-my-gsoc-2024-journey/",
          "description": "MetaCall has multiple embedded runtimes and aims for cross-platform versatility. However, managing dependencies across different runtimes poses a significant challenge. Leveraging Guix, MetaCall achieved self-contained builds for Linux. This project focuses on enhancing support for MacOS, aiming to streamline the build process and improving support for various loaders built into MetaCall. By implementing CI/CD pipelines for OS X and refining the installation scripts, the project aims to offer stable binary distributions of MetaCall for various OS X versions, ensuring seamless functionality across diverse environments.",
          "difficulty": null,
          "id": "proj_metacall_2024_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/4voBf8uO/",
          "proposal_id": null,
          "short_description": "MetaCall has multiple embedded runtimes and aims for cross-platform versatility. However, managing dependencies across different runtimes poses a...",
          "slug": "macos-distributable-for-metacall",
          "status": "completed",
          "student_name": "Prakhar Gurunani",
          "student_profile": null,
          "tags": [
            "ml",
            "ai",
            "ui",
            "ux"
          ],
          "title": "MacOS Distributable For MetaCall"
        },
        {
          "code_url": "https://gist.github.com/aakritiawasthi/ea4de17a318857c9af3a38da75333c57",
          "description": "MetaCall offers binaries and a CLI that can be downloaded and installed easily through metacall/install. This provides a CLI for executing code and a REPL for interacting with some MetaCall functionalities. Apart from this, there are two separate projects that are part of the full development lifecycle: metacall/deploy, which is a CLI for deploying into the FaaS and metacall/faas, which is a reimplementation of the FaaS for local development. These two tools are right now completely separated from the CLI, although they are necessary for the full development lifecycle.  The idea of this project is to unify them into the same project. For example, having metacall deploy ... for executing the deploy CLI or metacall faas for executing the FaaS locally. With these options, all tools will be unified into one, and end users will install all of them once the CLI is installed.",
          "difficulty": null,
          "id": "proj_metacall_2024_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/0Ih7NXN9/",
          "proposal_id": null,
          "short_description": "MetaCall offers binaries and a CLI that can be downloaded and installed easily through metacall/install. This provides a CLI for executing code and a...",
          "slug": "cli-deploy-faas-unification",
          "status": "completed",
          "student_name": "Aakriti Awasthi",
          "student_profile": null,
          "tags": [],
          "title": "CLI / Deploy / FaaS Unification"
        },
        {
          "code_url": "https://github.com/metacall/testing-center",
          "description": "There is currently no method to test all of MetaCall's examples and deployable examples. The project aims to create a single repository for each Metacall version. It should download the distributable for all supported OS systems, clone the example repositories from Metacall's GitHub account, and test each example. This would ensure that all examples for new releases operate properly on all supported systems. Similarly, for the @metacall/deploy package, deployable samples would be cloned and deployed to a FaaS website using Deploy CLI to check that they functioned as planned.",
          "difficulty": null,
          "id": "proj_metacall_2024_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/Ivmxad5S/",
          "proposal_id": null,
          "short_description": "There is currently no method to test all of MetaCall's examples and deployable examples. The project aims to create a single repository for each...",
          "slug": "metacall-examples-ci",
          "status": "completed",
          "student_name": "Mostafa Wael",
          "student_profile": null,
          "tags": [
            "web",
            "ai"
          ],
          "title": "MetaCall examples' CI"
        },
        {
          "code_url": "https://github.com/ashpect/builder/blob/Gsoc/README.md",
          "description": "The objective of this project is to develop a command-line interface and library for MetaCall, enabling selective composition of Docker images for efficient deployment in Docker and Kubernetes environments. This involves leveraging the Buildkit API for robust image construction, ensuring rootless and daemonless operation for compatibility, and prioritizing sandboxing for security. The aim is to support Function-as-a-Service development by generating compact images with reduced dependencies and attack surfaces and making light weight images, facilitating streamlined deployment workflows.",
          "difficulty": null,
          "id": "proj_metacall_2024_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/2hrok7vn/",
          "proposal_id": null,
          "short_description": "The objective of this project is to develop a command-line interface and library for MetaCall, enabling selective composition of Docker images for...",
          "slug": "builder",
          "status": "completed",
          "student_name": "Ashpect",
          "student_profile": null,
          "tags": [
            "api",
            "ml",
            "ai",
            "docker",
            "kubernetes"
          ],
          "title": "BUILDER"
        },
        {
          "code_url": "https://gist.github.com/shaggyyy2002/cbeb7bd8b3306a074ac7e3d1b552de6c",
          "description": "This project aims to develop a robust Continuous Integration (CI) system for MetaCall that automates builds and tests across platforms whenever there are updates in the core repository (new releases). By implementing this CI system, we will streamline development processes, ensure consistency across different platforms, and identify breaking changes early on.\n\nDuring the term I would be delivering the following: \n\n1. Create a comprehensive architectural diagram illustrating the CI process for building and testing across various platforms.\n\n2. Implement a central YAML workflow file within the core repository to manage version checks, job dispatching, and error reporting. This workflow will be responsible for triggering platform-specific builds and tests using matrix.os.\n\n3. Configure robust error reporting mechanisms within the workflows to ensure timely alerts and facilitate issue identification. This will help in quickly addressing any failures or issues during the CI process.\n\n4.  Provide detailed documentation covering the implemented CI system, including setup instructions, usage guidelines, and troubleshooting tips. This documentation will serve as a valuable resource for future reference and easy maintenance by the community.",
          "difficulty": "beginner",
          "id": "proj_metacall_2024_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/lA34YfMH/",
          "proposal_id": null,
          "short_description": "This project aims to develop a robust Continuous Integration (CI) system for MetaCall that automates builds and tests across platforms whenever there...",
          "slug": "connect-core-ci-with-distributables",
          "status": "completed",
          "student_name": "Nitin Gouda",
          "student_profile": null,
          "tags": [
            "ml",
            "ai",
            "ui"
          ],
          "title": "Connect Core CI with Distributables"
        },
        {
          "code_url": "https://github.com/metacall/gsoc-2024/blob/main/submissions/MetaSSR.md",
          "description": "MetaSSR is a Server-Side Rendering (SSR) framework built entirely from the ground up during the Google Summer of Code (GSoC) 2024 program. It is a real-world use case for the MetaCall polyglot runtime, demonstrating how multiple programming languages can be utilized within a single SSR framework. Built with Rust and the Axum.rs web framework, MetaSSR is designed to offer developers a high-performance, versatile tool for creating SSR web applications.",
          "difficulty": null,
          "id": "proj_metacall_2024_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/yRWw2gPh/",
          "proposal_id": null,
          "short_description": "MetaSSR is a Server-Side Rendering (SSR) framework built entirely from the ground up during the Google Summer of Code (GSoC) 2024 program. It is a...",
          "slug": "metassr-a-server-side-rendering-framework-built-on-metacall-and-rust",
          "status": "completed",
          "student_name": "Mohamed Emad",
          "student_profile": null,
          "tags": [
            "web",
            "ui"
          ],
          "title": "MetaSSR: A Server-Side Rendering Framework Built on MetaCall and Rust"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2024/organizations/metacall/"
    },
    "year_2025": null
  },
  "first_time": false,
  "contact": {
    "email": "contact@metacall.io",
    "guide_url": null,
    "ideas_url": null,
    "irc_channel": "https://matrix.to/#/#metacall:matrix.org",
    "mailing_list": null
  },
  "social": {
    "blog": null,
    "discord": null,
    "facebook": null,
    "github": null,
    "gitlab": null,
    "instagram": null,
    "linkedin": null,
    "mastodon": null,
    "medium": "https://medium.com/@metacall",
    "reddit": null,
    "slack": null,
    "stackoverflow": null,
    "twitch": null,
    "twitter": "https://twitter.com/metacallio",
    "youtube": null
  },
  "meta": {
    "version": 1,
    "generated_at": "2026-01-25T15:28:53.512Z"
  }
}