{
  "id": "692251dc53dd9d7326d33e27",
  "slug": "micro-electronics-research-lab-uitu",
  "name": "Micro Electronics Research Lab - UITU",
  "category": "Other",
  "description": "Accelerating Engineering Innovation",
  "image_url": "https://summerofcode.withgoogle.com/media/org/micro-electronics-research-lab-uitu/el9byq6f4dfc1y77-360.png",
  "img_r2_url": "https://pub-268c3a1efc8b4f8a99115507a760ca14.r2.dev/micro-electronics-research-lab-uitu.webp",
  "logo_r2_url": null,
  "url": "https://www.merledupk.org",
  "active_years": [
    2022,
    2023,
    2024,
    2025
  ],
  "first_year": 2022,
  "last_year": 2025,
  "is_currently_active": true,
  "technologies": [
    "RISCV",
    "Processor",
    "Hardware",
    "systemonchip",
    "memory"
  ],
  "topics": [
    "iot",
    "embedded",
    "Processor",
    "System on Chip",
    "RISC-V"
  ],
  "total_projects": 12,
  "stats": {
    "avg_projects_per_appeared_year": 3,
    "projects_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": null,
      "year_2019": null,
      "year_2020": null,
      "year_2021": null,
      "year_2022": 3,
      "year_2023": 1,
      "year_2024": 3,
      "year_2025": 5
    },
    "students_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": null,
      "year_2019": null,
      "year_2020": null,
      "year_2021": null,
      "year_2022": 3,
      "year_2023": 1,
      "year_2024": 3,
      "year_2025": 5
    },
    "total_students": 12
  },
  "years": {
    "year_2016": null,
    "year_2017": null,
    "year_2018": null,
    "year_2019": null,
    "year_2020": null,
    "year_2021": null,
    "year_2022": {
      "num_projects": 3,
      "projects": [
        {
          "code_url": "https://github.com/merledu/OpenTCAM",
          "description": "TCAM is used to search contents stored in memory. Although it is faster compared to SRAM it has disadvantages including increased size, higher energy consumption, and reduced efficiency. The major goal of this project is to emulate a novel approach for TCAM functionality by emulating it with SRAM blocks generated using OpenRAM that will help with optimal resource efficiency. This will allow us to use the high-speed of the TCAM architecture by using SRAM cells which are cheap and power-efficient. My goal with this project is to design a python based compiler environment that will help in achieving such capability.",
          "difficulty": null,
          "id": "proj_micro-electronics-re_2022_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/hUU6NiA5/",
          "proposal_id": null,
          "short_description": "TCAM is used to search contents stored in memory. Although it is faster compared to SRAM it has disadvantages including increased size, higher energy...",
          "slug": "development-of-a-python-compiler-for-a-resource-efficient-sram-based-tcam",
          "status": "completed",
          "student_name": "Usman Siddique",
          "student_profile": null,
          "tags": [
            "python"
          ],
          "title": "Development of a Python compiler for a resource-efficient SRAM-based TCAM"
        },
        {
          "code_url": "https://medium.com/@n.i.ansari200/gsoc22-a-summer-of-opportunity-95b9b2bb9232",
          "description": "The project aims to “Add FuseSoC support at SoC level for Azadi-SoC and Rebase ibex core with the latest commit”. As currently, The ibex core used in the Azadi SoC is not the latest committed version, Also this version was changed a bit previously to integrate it with Floating Point Unit (FPU), and Fusesoc is supported only on this ibex core which needed to support the whole SoC in this project.",
          "difficulty": null,
          "id": "proj_micro-electronics-re_2022_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/lkRwPJpN/",
          "proposal_id": null,
          "short_description": "The project aims to “Add FuseSoC support at SoC level for Azadi-SoC and Rebase ibex core with the latest commit”. As currently, The ibex core used in...",
          "slug": "add-fusesoc-support-at-soc-level-for-azadi-soc-and-rebase-ibex-core-with-the-latest-commit",
          "status": "completed",
          "student_name": "NAMEER IQBAL ANSARI.",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Add FuseSoC support at SoC level for Azadi-SoC and Rebase ibex core with the latest commit."
        },
        {
          "code_url": "https://github.com/merledu/nucleusrv/pull/42",
          "description": "The project deals with the integration of RISC-V Compressed Extension into the NucleusRV core. For most embedded processors,  the size of programmable memory is a huge limitation. \r\nMost of the frequently used instructions can be compressed i.e. compiled into 16-bits instead of 32-bits. We can perform a better utilization of memory by adding extra hardware to handle the compressed instructions.\r\nThis project aims to:\r\n* Design the compressed decoder and pre-fetch modules for NucleusRV core for Compressed Instructions support. \r\n* Verify the working of the project using RISC-V Compliance test suit\r\n* Document the complete project and guide on how to integrate the C extension support of RISC-V based cores written in SCALA.",
          "difficulty": null,
          "id": "proj_micro-electronics-re_2022_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/8tdgm8kB/",
          "proposal_id": null,
          "short_description": "The project deals with the integration of RISC-V Compressed Extension into the NucleusRV core. For most embedded processors, the size of programmable...",
          "slug": "integration-of-compressed-c-extension-in-nucleusrv-core",
          "status": "completed",
          "student_name": "Abdul Wadood",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Integration of Compressed (C) extension in NucleusRV core"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2022/organizations/micro-electronics-research-lab-uitu/"
    },
    "year_2023": {
      "num_projects": 1,
      "projects": [
        {
          "code_url": "https://medium.com/@doaa.magdy2001/cf7eb9f18030",
          "description": "In this proposal, I am going to introduce the steps needed to upgrade Tilelink\nUncached Lightweight (TL-UL) bus protocol to TL-UH (Tilelink Uncached Heavyweight).\nThe main difference between TL-UL and TL-UH is that 3 additional types of operations are added in TL-UH that cause it to be more efficient. Those operations briefly are the hint operations and atomic operations.",
          "difficulty": null,
          "id": "proj_micro-electronics-re_2023_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/3TI8MLxs",
          "proposal_id": "8n5tteHL",
          "short_description": "In this proposal, I am going to introduce the steps needed to upgrade Tilelink Uncached Lightweight (TL-UL) bus protocol to TL-UH (Tilelink Uncached...",
          "slug": "tilelink-uncached-heavyweight-tl-uh-implementation-in-azadi-soc",
          "status": "completed",
          "student_name": "Doaa Magdy",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "TileLink Uncached Heavyweight (TL-UH) implementation in Azadi-SoC"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2023/organizations/micro-electronics-research-lab-uitu"
    },
    "year_2024": {
      "num_projects": 3,
      "projects": [
        {
          "code_url": "https://github.com/merledu/vaquita/tree/dev/coprocessor",
          "description": "Summary\r\nThe project aims to enhance Nucleus RV Core by adding the RISC-V Vector Extension (RVV\r\nv1.0) as a co-processor. Key objectives include developing basic RVV functionalities,\r\ncollaborating on design with project maintainers, integrating the co-processor into Nucleus RV,\r\nand ensuring seamless operation. The project contributes to open-source hardware\r\ninnovation and improves Nucleus RV's performance for vector-intensive tasks.\r\ndeliverables\r\nThe following deliverables are considered at the time of writing which may be possible for\r\nfurther changes or improvements.\r\n1) Implemented RISC V Vector configuration instructions in Vaquita Co-Processor\r\n2) Implemented RISC V Vector configuration instructions in Vaquita Co-Processor\r\n3) Implemented RISC V Vector configuration instructions in Vaquita Co-Processor\r\n4) Implemented RISC V Vector configuration instructions in Vaquita Co-Processor\r\n5) Developer documentation and end user documentation for RISC-V Vector Vaquita\r\nCo-Processor.",
          "difficulty": null,
          "id": "proj_micro-electronics-re_2024_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/FWHAVeL5/",
          "proposal_id": null,
          "short_description": "Summary The project aims to enhance Nucleus RV Core by adding the RISC-V Vector Extension (RVV v1.0) as a co-processor. Key objectives include...",
          "slug": "vaquita-vector-coprocessor",
          "status": "completed",
          "student_name": "Mohammad Latif",
          "student_profile": null,
          "tags": [
            "ml",
            "ai",
            "ui"
          ],
          "title": "Vaquita Vector Coprocessor"
        },
        {
          "code_url": "https://github.com/merledu/baby-kyber-accelerator",
          "description": "The \"Baby Kyber Accelerator\" project aims to address the increasing demand for secure communication by developing a specialized hardware accelerator tailored for the Baby Kyber encryption system. This accelerator will be integrated into platforms like Azadi SoC and SoC-Now to enhance their cryptographic capabilities. Leveraging CHISEL HDL, the accelerator will feature optimized hardware designs and random number generation capabilities, ensuring robust cryptographic functionality while minimizing resource usage. The project will also integrate the accelerator with existing matrix multiplication accelerators for enhanced computational efficiency. Through meticulous testing and documentation, the project will deliver a working accelerator with complete Baby Kyber functionality, attachable interfaces for any SoC, and comprehensive project documentation.",
          "difficulty": null,
          "id": "proj_micro-electronics-re_2024_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/iISfNW7k/",
          "proposal_id": null,
          "short_description": "The \"Baby Kyber Accelerator\" project aims to address the increasing demand for secure communication by developing a specialized hardware accelerator...",
          "slug": "baby-kyber-accelerator",
          "status": "completed",
          "student_name": "Hamna Mohiuddin",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Baby Kyber Accelerator"
        },
        {
          "code_url": "https://docs.google.com/document/d/1RyiSrMlSLs147ZgP9A4RI5sU28C5j37xG8wvEun2aY8/edit?usp=sharing",
          "description": "This project involves generating layouts and GDSII files for IPs produced with OpenTCAM, utilising diverse memory structure configurations. TCAM IPs will be generated using an SRAM mapping. These layouts will undergo optimisation in ASIC Design, considering various parameters. The project emphasises on presenting statistical comparisons between different types of memory structures used to generate TCAMs post-optimisation.",
          "difficulty": null,
          "id": "proj_micro-electronics-re_2024_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/pO06UABK/",
          "proposal_id": null,
          "short_description": "This project involves generating layouts and GDSII files for IPs produced with OpenTCAM, utilising diverse memory structure configurations. TCAM IPs...",
          "slug": "asic-design-of-opentcam-generated-ips-using-openlane-and-gf180sky130",
          "status": "completed",
          "student_name": "V Vignesh Karthik",
          "student_profile": null,
          "tags": [],
          "title": "ASIC Design of OpenTCAM Generated IPs using  OpenLane and GF180/SKY130"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2024/organizations/micro-electronics-research-lab-uitu/"
    },
    "year_2025": {
      "num_projects": 5,
      "projects": [
        {
          "code_url": null,
          "description": "Verification in hardware design is a time-consuming and complex task as well as requires manual effort to update UVM testbench components (scoreboard, driver, sequencer) with constant changing DUT. This project proposes to solve this by using AI and NLP to extract key information from the provided DUT specs and updating the UVM components accordingly. This will reduce the manual effort of updating the components and optimize the process of verification.\n\nProject Deliverables are :\nAn NLP-based parser for extracting DUT parameters\nAutomated UVM component generation and adaptation\nReinforcement learning for better verification environment",
          "difficulty": "advanced",
          "id": "proj_micro-electronics-re_2025_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/YT9iUEa6",
          "proposal_id": "itmofYhd",
          "short_description": "Verification in hardware design is a time-consuming and complex task as well as requires manual effort to update UVM testbench components...",
          "slug": "automated-uvm-tuning-orchestrated-via-ai-reasoning",
          "status": "in-progress",
          "student_name": "Abdul_Rehman",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Automated UVM Tuning Orchestrated Via AI Reasoning"
        },
        {
          "code_url": null,
          "description": "This project focuses on integrating a Ternary Content Addressable Memory (TCAM) module into the Chipyard SoC framework to enable high-speed parallel matching operations crucial for domains like networking and pattern recognition—functionality not natively supported in Chipyard. The integration employs a dual approach: first, incorporating the Verilog-based TCAM IP (generated via OPENTCAM) as a memory-mapped I/O (MMIO) peripheral by wrapping it in a Chisel BlackBox, connecting it to the subsystem using TileLink, and exposing TCAM operations like write and search through memory-mapped registers accessible from software; and second, integrating the TCAM as a RoCC accelerator by reusing the BlackBox within a custom LazyRoCC module, mapping Rocket’s RoCC interface to TCAM operations via funct fields of custom instructions, and enabling instantiation through a dedicated WithTCAMRoCC configuration in the Rocket tile.",
          "difficulty": null,
          "id": "proj_micro-electronics-re_2025_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/Se9wHIpD",
          "proposal_id": "GneBxDbb",
          "short_description": "This project focuses on integrating a Ternary Content Addressable Memory (TCAM) module into the Chipyard SoC framework to enable high-speed parallel...",
          "slug": "integrating-tcam-ip-into-chipyard-via-mmio-and-rocc-interfaces",
          "status": "in-progress",
          "student_name": "Atharva Nerkar",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Integrating TCAM IP into Chipyard via MMIO and RoCC Interfaces"
        },
        {
          "code_url": null,
          "description": "AEGIS automates hardware verification by using AI to generate optimized test cases. \n\nParses Specifications: Extracts key features (interfaces, protocols) from documents using NLP.\n\nGenerates Tests: Creates corner-case and compliance tests via ML models.\n\nOptimizes Prioritization: Uses RL to maximize coverage efficiency.\n\nOutputs UVM Code: Auto-generates UVM testbenches for simulation.",
          "difficulty": null,
          "id": "proj_micro-electronics-re_2025_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/82d7SM6N",
          "proposal_id": "yvn9vaKo",
          "short_description": "AEGIS automates hardware verification by using AI to generate optimized test cases. Parses Specifications: Extracts key features (interfaces,...",
          "slug": "aegis-ai-enhanced-generation-of-intelligent-scenarios",
          "status": "in-progress",
          "student_name": "Mahnoor_Ismail",
          "student_profile": null,
          "tags": [
            "ios",
            "ml",
            "ai"
          ],
          "title": "AEGIS - AI-Enhanced Generation of Intelligent Scenarios"
        },
        {
          "code_url": null,
          "description": "This project aims to develop and benchmark high-performance applications that leverage the modular SoC-Now platform, which integrates RISC-V cores, a vector coprocessor (Vaquita), and a post-quantum cryptography accelerator (Baby Kyber). The project will focus on building real-world applications such as image processing, machine learning inference, and secure communication, utilizing Vaquita for vectorized computing and Baby Kyber for post-quantum encryption. These applications will be designed, implemented, and tested on the SoC-Now platform, demonstrating the practical benefits of these hardware accelerators.\n\nThe goal is to provide the open-source community with reusable application code and detailed performance benchmarks, showcasing the capabilities of SoC-Now in secure computing and efficient AI acceleration. The project will include the development of hybrid applications combining cryptography and vector processing, along with complete documentation and tutorials to make it easy for future developers to leverage the platform for their own projects.\n\nDeliverables will include working applications, performance benchmarks, and reusable code packaged for community use, with future work aiming to expand the scope with additional cryptographic primitives, AI models, and improved software stack integration.",
          "difficulty": "beginner",
          "id": "proj_micro-electronics-re_2025_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/bUMTw353",
          "proposal_id": "IITBY5yG",
          "short_description": "This project aims to develop and benchmark high-performance applications that leverage the modular SoC-Now platform, which integrates RISC-V cores, a...",
          "slug": "running-secure-and-vectorized-applications-on-soc-now",
          "status": "in-progress",
          "student_name": "Muhammad Hussain_017",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Running Secure and Vectorized Applications on SoC-Now"
        },
        {
          "code_url": null,
          "description": "As RISC-V adoption continues to grow, verifying functional correctness across various implementations becomes increasingly challenging due to the variability in core designs and protocols. Traditional verification frameworks require significant adaptation for each new RISC-V core, which complicates testing and debugging. This project, COCO-RISC-V Test Bench (COCO-RVTB), solves this problem by creating a reusable and scalable testbench that leverages the RISC-V Formal Interface (RVFI) for detailed execution trace comparison between the Ibex core and a trusted golden reference, Spike. This ensures instruction-level validation and helps identify subtle bugs that traditional methods might miss.\n\nThe testbench will include a memory preloading mechanism for ELF binaries, ensuring that both Ibex and Spike begin from identical states. Stepwise synchronization will enforce lockstep execution, enabling real-time detection of discrepancies in program counter, register, or memory updates. A scoreboard-based RVFI packet comparison unit will automatically validate each instruction, improving trace-level accuracy.\n\nBuilt with PyUVM and Cocotb, this framework will be simulator-agnostic, allowing it to run across simulators like Verilator and ModelSim without relying on proprietary features. The testbench will feature a configurable, parameterized bus interface to support protocol diversity, enabling easy integration with different RISC-V cores and future extensions.\n\nKey deliverables include:\n- A scoreboard-based RVFI trace checker.\n- A YAML-configurable, protocol-agnostic bus interface.\n- Structured error logging for debugging and traceability.\n- A simulator-agnostic framework using PyUVM and Cocotb.\n\nBy solving the challenges of core-specific verification, this project provides a scalable, standardized, and accurate approach to RISC-V core validation.",
          "difficulty": "beginner",
          "id": "proj_micro-electronics-re_2025_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/qoZg4Pu7",
          "proposal_id": "G7IKXnHS",
          "short_description": "As RISC-V adoption continues to grow, verifying functional correctness across various implementations becomes increasingly challenging due to the...",
          "slug": "pyuvm-based-general-testbench-for-risc-v-cores",
          "status": "in-progress",
          "student_name": "Nitin Grandhi",
          "student_profile": null,
          "tags": [
            "ml",
            "ai",
            "ui"
          ],
          "title": "PyUVM-Based General Testbench for RISC-V Cores"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2025/organizations/micro-electronics-research-lab-uitu"
    }
  },
  "first_time": false,
  "contact": {
    "email": null,
    "guide_url": "https://github.com/merledu/Google-Summer-of-Code/wiki/GSoC-Proposal-Template",
    "ideas_url": "https://github.com/merledu/Google-Summer-of-Code/wiki/GSoC'25-Project-Ideas-List",
    "irc_channel": "https://discord.gg/BZC54d7a",
    "mailing_list": null
  },
  "social": {
    "blog": null,
    "discord": "https://discord.gg/BZC54d7a",
    "facebook": null,
    "github": null,
    "gitlab": null,
    "instagram": null,
    "linkedin": null,
    "mastodon": null,
    "medium": null,
    "reddit": null,
    "slack": null,
    "stackoverflow": null,
    "twitch": null,
    "twitter": "https://twitter.com/merluit",
    "youtube": null
  },
  "meta": {
    "version": 1,
    "generated_at": "2026-01-25T15:28:53.550Z"
  }
}