{
  "id": "692251dd53dd9d7326d33e31",
  "slug": "mozilla",
  "name": "Mozilla",
  "category": "Web",
  "description": "Keeping the Internet open and accessible to all.",
  "image_url": "https://lh3.googleusercontent.com/v2ra_3qtUJJNbGmGrsnqw2xVpfWQLL2Xr6KUHr3ah4_aP8F37Ylm-1nuPDl33bwHKruUD5OEJ_Doa6VGmYWT_paWKA40g6k3",
  "img_r2_url": "https://pub-268c3a1efc8b4f8a99115507a760ca14.r2.dev/mozilla.webp",
  "logo_r2_url": null,
  "url": "https://mozilla.org",
  "active_years": [
    2016,
    2017,
    2018,
    2019,
    2020
  ],
  "first_year": 2016,
  "last_year": 2020,
  "is_currently_active": false,
  "technologies": [
    "python",
    "javascript",
    "c++",
    "rust",
    "html",
    "css",
    "react",
    "html5",
    "web development"
  ],
  "topics": [
    "web",
    "mozilla",
    "firefox",
    "internet",
    "education",
    "web platform and services",
    "web browser",
    "free software",
    "open web",
    "browser",
    "privacy/security",
    "internet freedom",
    "web technologies",
    "open source",
    "devtools",
    "information security"
  ],
  "total_projects": 75,
  "stats": {
    "avg_projects_per_appeared_year": 15,
    "projects_by_year": {
      "year_2016": 13,
      "year_2017": 21,
      "year_2018": 16,
      "year_2019": 14,
      "year_2020": 11,
      "year_2021": null,
      "year_2022": null,
      "year_2023": null,
      "year_2024": null,
      "year_2025": null
    },
    "students_by_year": {
      "year_2016": 13,
      "year_2017": 21,
      "year_2018": 16,
      "year_2019": 14,
      "year_2020": 11,
      "year_2021": null,
      "year_2022": null,
      "year_2023": null,
      "year_2024": null,
      "year_2025": null
    },
    "total_students": 75
  },
  "years": {
    "year_2016": {
      "num_projects": 13,
      "projects": [
        {
          "code_url": "https://wiki.mozilla.org/User:Anindyapandey",
          "description": "<p>Currently Thunderbird uses mbox as primary storage format for mails (locally). All the mails in a folder are stored in the same file with the same name as the folder and no extension. The messages are separated from each other by a \"From - \n\" line.  The maildir format is also supported, but there is no converter for it yet. The goal is to implement a component to migrate a store from the mbox format to maildir format. \nIn order to achieve the goal a new store should be created and all the messages from all the folders of the old store should be moved to respective folders of the new store in maildir format. The folder hierarchy of the old store needs to be maintained in the new store. The message copying should be carried out in a worker using OS.File to prevent other tasks from getting locked up for long.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2016_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/6359299840278528/",
          "proposal_id": null,
          "short_description": "Currently Thunderbird uses mbox as primary storage format for mails (locally). All the mails in a folder are stored in the same file with the same...",
          "slug": "thunderbird-implement-mbox-maildir-converter",
          "status": "completed",
          "student_name": "Shiva",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Thunderbird - Implement mbox -> maildir converter"
        },
        {
          "code_url": "https://docs.google.com/document/d/1RoM6JcmxU4TQKDeQsYLOkjHRIYqldUeh26a4ac6_yEo/edit?usp=sharing",
          "description": "<p>Part - 1 : It is desirable for applications or libraries that work with PKCS #11  tokens to accept a common identifier that consumers could use to identify an existing PKCS #11 storage object in a PKCS #11 token, an existing token itself, a slot, or an existing Cryptoki library.These objects can be uniquely identifiable via the PKCS #11 URI scheme</p>\n<p>Part - 2 : Any token present in the system's p11-kit configuration should be visible to NSS applications as intended.Currently, applications using NSS are unable to do so. The NSS package must also be able to load the PKCS 11 tokens by default as other packages like GnuTLS and OpenSSL(with the PKCS #11 engine) do.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2016_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/6677041252401152/",
          "proposal_id": null,
          "short_description": "Part - 1 : It is desirable for applications or libraries that work with PKCS #11  tokens to accept a common identifier that consumers could use to...",
          "slug": "implement-rfc7512-pkcs11-uri-support-and-system-integration",
          "status": "completed",
          "student_name": "varunnaganathan",
          "student_profile": null,
          "tags": [],
          "title": "Implement RFC7512 PKCS#11 URI support and system integration"
        },
        {
          "code_url": "https://wiki.mozilla.org/User:Abdelrhman/gsoc16/summary",
          "description": "<p>The aim of this project is to replace libpurple's XMPP implementation with JavaScript implementation of XMPP protocol after adding missing features to JavaScript implementation</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2016_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5394099624476672/",
          "proposal_id": null,
          "short_description": "The aim of this project is to replace libpurple's XMPP implementation with JavaScript implementation of XMPP protocol after adding missing features...",
          "slug": "improving-and-expanding-the-javascript-xmpp-implementation",
          "status": "completed",
          "student_name": "Abdelrhman Ahmed",
          "student_profile": null,
          "tags": [
            "java",
            "javascript",
            "ai"
          ],
          "title": "Improving and expanding the JavaScript XMPP Implementation"
        },
        {
          "code_url": "http://martiansideofthemoon.github.io/2016/07/19/gsoc-code-review.html",
          "description": "<p>Over the last ten years, Mozilla has been using Buildbot as its primary continuous integration tool in order to schedule builds and tests for every push that is sent to Treeherder for evaluation. As Mozilla is slowly moving towards using TaskCluster as its primary continuous integration system, an important step would be make Treeherder, the primary UI used for handling builds and tests, compatible with TaskCluster. The current Treeherder interface allows us to schedule buildbot jobs. This proposal aims to integrate Treeherder's job scheduling user interface with TaskCluster jobs. While doing this, it hopes to improve the overall integration of Treeherder with TaskCluster.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2016_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5418701734019072/",
          "proposal_id": null,
          "short_description": "Over the last ten years, Mozilla has been using Buildbot as its primary continuous integration tool in order to schedule builds and tests for every...",
          "slug": "schedule-taskcluster-jobs-in-treeherder",
          "status": "completed",
          "student_name": "martianwars",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Schedule TaskCluster Jobs in Treeherder"
        },
        {
          "code_url": "https://bugzilla.mozilla.org/show_bug.cgi?id=1272540#c2",
          "description": "<p>Currently, events and tasks are created and edited in a dialog window. This project will add the option to create and edit them in a tab instead, providing more room and flexibility for the UI design. A supplemental goal is to explore implementing this feature in HTML/CSS/JavaScript rather than XUL. By using a responsive design, an HTML-based implementation could fully replace the current XUL-based event dialog. The UI could change depending on the width of the viewport, providing either a wider (tab) view or a narrower (dialog window) view.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2016_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5489070478196736/",
          "proposal_id": null,
          "short_description": "Currently, events and tasks are created and edited in a dialog window. This project will add the option to create and edit them in a tab instead,...",
          "slug": "mozilla-calendar-event-in-a-tab",
          "status": "completed",
          "student_name": "paulmorris",
          "student_profile": null,
          "tags": [
            "java",
            "javascript",
            "ml",
            "ui"
          ],
          "title": "Mozilla Calendar – Event in a Tab"
        },
        {
          "code_url": "https://gist.github.com/baygeldin/10653d3268e7d2f63e22818b2a3f14d3",
          "description": "<p>In this project the goal is to provide a GUI for GDB in the browser so that other developers can use it to easily and intuitively debug projects running in a cloud environment</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2016_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5007236082434048/",
          "proposal_id": null,
          "short_description": "In this project the goal is to provide a GUI for GDB in the browser so that other developers can use it to easily and intuitively debug projects...",
          "slug": "web-based-gdb-frontend",
          "status": "completed",
          "student_name": "baygeldin",
          "student_profile": null,
          "tags": [
            "web",
            "cloud",
            "ui",
            "frontend"
          ],
          "title": "Web-based GDB Frontend"
        },
        {
          "code_url": "https://gist.github.com/nurav/af89f9edbb3d484d6e542a5bf1f255cf",
          "description": "<p>Balrog is the new age update server used by Mozilla to serve updates to Firefox. This project aims to address a situation in Balrog where multiple locale updates caused a race condition, leading to unnecessary retries by submitter jobs. This project proposes to resolve this situation by using an algorithm similar to a three-way merge algorithm, but for nested JSON data.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2016_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5120863737217024/",
          "proposal_id": null,
          "short_description": "Balrog is the new age update server used by Mozilla to serve updates to Firefox. This project aims to address a situation in Balrog where multiple...",
          "slug": "prevent-failures-due-to-update-races",
          "status": "completed",
          "student_name": "varunjoshi",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Prevent Failures due to Update Races"
        },
        {
          "code_url": "https://github.com/servo/servo/commits/master?author=izgzhen",
          "description": "<p>In this project, File API and related functionalities will be completely implemented in the <a href=\"https://github.com/servo/servo\" target=\"_blank\">Servo browser engine</a>. With these features landed, the end users can upload files through form submission and interact with the local file content directly in browser; the developer will be endowed the ability to read local file content programmatically in either sync or async way, create Blob URL and use them in a very flexible way. In addition, a dialog UI will be integrated to support file picking.</p>\n<p>For more information, see <a href=\"https://github.com/izgzhen/gsoc-file-support\" target=\"_blank\">the meta-tracker of this project</a>.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2016_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5298795642355712/",
          "proposal_id": null,
          "short_description": "In this project, File API and related functionalities will be completely implemented in the Servo browser engine. With these features landed, the end...",
          "slug": "file-support",
          "status": "completed",
          "student_name": "izgzhen",
          "student_profile": null,
          "tags": [
            "api",
            "ui"
          ],
          "title": "File Support"
        },
        {
          "code_url": "https://krishnakannan.github.io/GSOC/16/Report.html",
          "description": "<p>Firefox for Android is one of the most widely used browsers. The team is currently involved in reducing the size of the Android Package - APK. As a first step of this ongoing effort the fonts are excluded from being packaged along with the APK. The scope of reducing the size of the APK does not stop there. There are various opportunities and scopes for further reducing the size of APK such as excluding hyphenation dictionaries, translation and so on from being packaged. The  task is to download the excluded assets from the server. This initiative can effectively reduce the size of the APK File.I propose to implement features that enables the browser to download the assets like hyphenation dictionaries at the runtime.I also propose to implement a helper class which can be used to smartly schedule the downloads based on the conditions and smartly reschedule the failed downloads and exclude other assets like localization files.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2016_009",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5321360863657984/",
          "proposal_id": null,
          "short_description": "Firefox for Android is one of the most widely used browsers. The team is currently involved in reducing the size of the Android Package - APK. As a...",
          "slug": "download-app-assets-at-runtime",
          "status": "completed",
          "student_name": "Krish",
          "student_profile": null,
          "tags": [
            "android",
            "ai"
          ],
          "title": "Download app assets at runtime"
        },
        {
          "code_url": "https://github.com/creativcoder/gsoc16",
          "description": "<p>Servo has support for Web Workers, and the new Fetch Api whose development is in progress is another new standard, that aims to replace XMLHttpRequest (XHR), and provides a cleaner api for anything involving requests and responses.The Fetch api spec also has a subsection which details on handling fetch calls within a service worker context. <a href=\"https://slightlyoff.github.io/ServiceWorker/spec/service_worker/\" target=\"_blank\">Spec</a>\nService Workers are the new standard, for modern web apps, which aims to bring native app like experience to browser based apps, by providing a programmable api, for caching certain paths of pages, ,manipulating routing within an application,intercepting network requests according to user logic.</p>\n<p>Servo has a partial implementation of Fetch api, but the Service Worker api’s are currently missing and if implemented, Servo will be able to intercept network calls made from within the Service Worker’s context, the “handle_fetch” subsection of the Fetch Spec, is to be implemented. <a href=\"https://fetch.spec.whatwg.org/\" target=\"_blank\">Spec</a></p>\n<p>My project is to have a partial implementation of the new Service Worker Api and its helper interfaces, in Servo. The project is focused on working on parts of the Service Worker Specification which revolves around intercepting network requests.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2016_010",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5554852197302272/",
          "proposal_id": null,
          "short_description": "Servo has support for Web Workers, and the new Fetch Api whose development is in progress is another new standard, that aims to replace...",
          "slug": "implementing-service-worker-infrastructure-in-servo-browser-engine",
          "status": "completed",
          "student_name": "creativcoder",
          "student_profile": null,
          "tags": [
            "web",
            "api",
            "ml",
            "ai"
          ],
          "title": "Implementing Service Worker Infrastructure in Servo Browser Engine"
        },
        {
          "code_url": "https://docs.google.com/document/d/1J1y3m8PP19AVeJn9ShXkcWELXa-l0JIEN3OJCTdvntw/edit?usp=sharing",
          "description": "<p>In a matter of weeks, HTC and Oculus will begin shipping the first generation of VR to tens of thousands of consumers. While VR content is easy to consume, it is hard to produce. A-Frame, with its HTML-like syntax, has the potential to enable far greater participation in this new medium; but for this to happen, more documentation needs to be created, tutorials made available, functionality extended, and showcases created. I propose to help meet these needs with two projects: (1) producing a component to wrap d3.js, and (2) developing support for 3D panoramas.</p>\n",
          "difficulty": "beginner",
          "id": "proj_mozilla_2016_011",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/6257096530067456/",
          "proposal_id": null,
          "short_description": "In a matter of weeks, HTC and Oculus will begin shipping the first generation of VR to tens of thousands of consumers. While VR content is easy to...",
          "slug": "two-projects-to-make-a-frame-more-useful-accessible-and-exciting",
          "status": "completed",
          "student_name": "bryik",
          "student_profile": null,
          "tags": [
            "ml",
            "ai"
          ],
          "title": "Two Projects to Make A-Frame More Useful, Accessible, and Exciting"
        },
        {
          "code_url": "https://mikelingblog.wordpress.com/2016/08/12/summary-of-seta-rewrite/",
          "description": "<p>We have tons of testing jobs for a push but we don't want to run each of them, as they are time consuming and requiring hardware resources. The SETA (Search for Extraneous Test Automation) is a tool to help us find out which test job is necessary for detecting the failures. To make it more maintainable and more reliable, we need to re-write SETA and we may want SETA to support Taskcluster as well. Furthermore, we want Taskcluster can use SETA to schedule job and add document for SETA.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2016_012",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/6052020431618048/",
          "proposal_id": null,
          "short_description": "We have tons of testing jobs for a push but we don't want to run each of them, as they are time consuming and requiring hardware resources. The SETA...",
          "slug": "proposal-of-redesign-seta",
          "status": "completed",
          "student_name": "MikeLing",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Proposal of Redesign SETA"
        },
        {
          "code_url": "https://github.com/arunk-s/gsoc16",
          "description": "<p>Mozilla Investigator(<a href=\"http://mig.mozilla.org/\" target=\"_blank\">MIG</a>) is a platform that provides distributed and real time digital forensics at the speed of the cloud i.e. obtaining forensic information from large numbers of systems in parallel. This project aims to implement a Linux Audit module for MIG which will provide support for syscall monitoring via the Audit daemon. This will enhance the capabilities of MIG to aggregate, mark, alert on related syscall events and store them in logs.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2016_013",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5897486971437056/",
          "proposal_id": null,
          "short_description": "Mozilla Investigator(MIG) is a platform that provides distributed and real time digital forensics at the speed of the cloud i.e. obtaining forensic...",
          "slug": "mozilla-investigatormig-auditd-integration",
          "status": "completed",
          "student_name": "Arun",
          "student_profile": null,
          "tags": [
            "ai",
            "cloud",
            "ux"
          ],
          "title": "Mozilla Investigator(MIG): Auditd integration"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2016/organizations/5282259481395200/"
    },
    "year_2017": {
      "num_projects": 21,
      "projects": [
        {
          "code_url": "https://github.com/cbrewster/gsoc2017",
          "description": "<p>The custom element API allows javascript authors to create reusable web components. The author can create custom element constructors and setup callbacks for when various reactions occur on the element such as when its attributes are mutated. While this was possible in the past with non-standard elements, this API allows authors to have more functionality and ensures that these custom elements will not be broken by future changes to the web platform. While this is a new API, new web frameworks such as A-Frame and Polymer are built using custom elements. As the usage of custom elements increases, it will be important that Servo supports this API.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2017_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6610955932794880/",
          "proposal_id": null,
          "short_description": "The custom element API allows javascript authors to create reusable web components. The author can create custom element constructors and setup...",
          "slug": "servo-custom-element-proposal",
          "status": "completed",
          "student_name": "Connor Brewster",
          "student_profile": null,
          "tags": [
            "react",
            "java",
            "javascript",
            "web",
            "api"
          ],
          "title": "Servo Custom Element Proposal"
        },
        {
          "code_url": "https://shatur.github.io/gsoc_report.html",
          "description": "<p>We will be implementing browsingData and contextMenu APIs of WebExtension (a cross-browser system) for android firefox. There are some bugs related to web-extension, which will also be resolved under this project. Detailed overview can be found at <a href=\"https://wiki.mozilla.org/Community:SummerOfCode17/AndroidWebExtensions\" target=\"_blank\">https://wiki.mozilla.org/Community:SummerOfCode17/AndroidWebExtensions</a>.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2017_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6641819030913024/",
          "proposal_id": null,
          "short_description": "We will be implementing browsingData and contextMenu APIs of WebExtension (a cross-browser system) for android firefox. There are some bugs related...",
          "slug": "implementing-some-of-the-webextension-apis",
          "status": "completed",
          "student_name": "Tushar Saini",
          "student_profile": null,
          "tags": [
            "android",
            "web",
            "api",
            "ai"
          ],
          "title": "Implementing some of the WebExtension APIs"
        },
        {
          "code_url": "http://mukulmishra.me/blog/GSoC-Final-Submission/",
          "description": "<p>This project aims to implement Streams API polyfill for PDF.js, and use it for networking and rendering purpose. PDF.js current uses xhr for networking to fetch data, but it is inefficient in terms of memory as it has to buffer all the response. As xhr is an ever growing buffer, it stores all the data in its internal buffer, this uses lots of memory. Using Streams API, we can use the response incrementally and pass it for parsing and rendering as soon as it is received, hence there is no need to buffer the whole response. For rendering purpose, PDF.js makes chunks of data by parsing pdf commands in worker thread. After chunking the whole data, it is passed to the main thread for painting. Buffering the entire data in the worker thread uses a huge amount memory, and main thread also has to wait for the entire data to be parsed. This creates inefficiency in terms of memory and speed. Using Streams API, we can send the chunks from worker thread to main thread as soon as they are created, reducing the memory usage and increases speed. Since Streams API is a new technology, using it in PDF.js will test Firefox's implementation.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2017_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/4984791925522432/",
          "proposal_id": null,
          "short_description": "This project aims to implement Streams API polyfill for PDF.js, and use it for networking and rendering purpose. PDF.js current uses xhr for...",
          "slug": "streams-api-in-pdfjs",
          "status": "completed",
          "student_name": "Mukul Kumar",
          "student_profile": null,
          "tags": [
            "api",
            "ai"
          ],
          "title": "Streams API in PDF.js"
        },
        {
          "code_url": "https://gist.github.com/flyingrub/f0922b898347ba0bc59a687872a7c40b",
          "description": "<p>about:telemetry is present on all builds of Firefox as a way for users to view the data being stored and sent via Telemetry. It was built before Firefox had multi-process Telemetry and without a clear design. This has resulted in a confusing HTML UI and barely-comprehensible JS.</p>\n<p>The redesign will allow any users to understand what telemetry is and what data is sent, but it will also make it possible for developers to access the data faster, and in a more simple way.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2017_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5253441056145408/",
          "proposal_id": null,
          "short_description": "about:telemetry is present on all builds of Firefox as a way for users to view the data being stored and sent via Telemetry. It was built before...",
          "slug": "abouttelemetry-redesign",
          "status": "completed",
          "student_name": "flyingrub",
          "student_profile": null,
          "tags": [
            "ml",
            "ui"
          ],
          "title": "about:telemetry redesign"
        },
        {
          "code_url": "https://beekill95.github.io/GSOC-final-evaluation/",
          "description": "<p>Session Restore is important as a key feature of Firefox. Many people rely on it to re-open a tab from the past or recover from an unfortunate power outage. This project's goal is to make the process snappy and blazing fast.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2017_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5361967900393472/",
          "proposal_id": null,
          "short_description": "Session Restore is important as a key feature of Firefox. Many people rely on it to re-open a tab from the past or recover from an unfortunate power...",
          "slug": "boost-session-restore-performance",
          "status": "completed",
          "student_name": "Quân Nguyễn",
          "student_profile": null,
          "tags": [],
          "title": "Boost Session Restore Performance"
        },
        {
          "code_url": "https://medium.com/@razat249/google-summer-of-code-2017-report-4a86370b2b71",
          "description": "<p>The purpose of this project is to create a software tool that is capable of parsing popular online version control repositories, like GitHub, via their public APIs in order to detect open issues of projects, classify them based on several predefined configurable criteria and serve them via a public RESTFul API.</p>\n<p>A complimentary web application will also be created in order to consume this API and visualize the results of this service in an elegant and useful way.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2017_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6251557632868352/",
          "proposal_id": null,
          "short_description": "The purpose of this project is to create a software tool that is capable of parsing popular online version control repositories, like GitHub, via...",
          "slug": "github-issue-parser",
          "status": "completed",
          "student_name": "Rajat Patwa",
          "student_profile": null,
          "tags": [
            "web",
            "api"
          ],
          "title": "GitHub Issue Parser"
        },
        {
          "code_url": "https://github.com/mozilla/jx-sqlite",
          "description": "<h3>Problem:</h3>\n<p>JSON is a nice format to store data and it has become quite prevalent. If we are not overwhelmed by the diversity of JSON now, we soon will be. There will be more JSON, of more different shapes, as the number of connected devices and the information they generate continues to increase. Unfortunately, databases do not handle it well, often a human is required to declare a schema that can hold the JSON before it can be queried.</p>\n<h3>Project:</h3>\n<p>Created a Python SQLite connector to store JSON documents in SQLite so that they are accessible via SQL(using JSON Query Expressions). This will serve a basis for a general document-relational map(DRM), and leverage the database’s query optimizer. It is also responsible for making the schema and changing it dynamically as new JSON schema are encountered and to ensure that the old queries against the new schema have the same meaning.</p>\n<p>There is a test suite to confirm the expected behaviour: testing a variety of JSON forms and the queries that can be performed on them. Most tests are further split into three different output formats: list, table and cube. There is also a connector for Elastisearch and these two will be merged sometime in future.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2017_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/4562196939931648/",
          "proposal_id": null,
          "short_description": "Problem:\nJSON is a nice format to store data and it has become quite prevalent. If we are not overwhelmed by the diversity of JSON now, we soon will...",
          "slug": "json-in-sqlite",
          "status": "completed",
          "student_name": "Rohit Kumar",
          "student_profile": null,
          "tags": [
            "python",
            "ai",
            "database",
            "ui"
          ],
          "title": "JSON in Sqlite"
        },
        {
          "code_url": "https://ckousik.github.io/gsoc/2017/07/19/Final-Work-Product.html",
          "description": "<p>TaskCluster workers are hosted on services such as EC2 and currently expose ports to the internet to allow http-clients to call API endpoints. This setup may not be feasible in a data center setup. Livelog proxy aims to mitigate this problem by allowing workers to connect to the proxy over an outgoing websocket connection and exposing API endpoints to the internet. Any incoming requests will be reverse proxied to the worker over its outgoing connection. This is implemented as a distributed system to handle high amounts of traffic.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2017_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/4596748609650688/",
          "proposal_id": null,
          "short_description": "TaskCluster workers are hosted on services such as EC2 and currently expose ports to the internet to allow http-clients to call API endpoints. This...",
          "slug": "livelog-proxy",
          "status": "completed",
          "student_name": "Chinmay Kousik",
          "student_profile": null,
          "tags": [
            "web",
            "api",
            "ai"
          ],
          "title": "Livelog Proxy"
        },
        {
          "code_url": "https://cynicaldevil.github.io/blog/2017/08/24/async-html-parsing-in-servo.html",
          "description": "<p>The goal of this project is to fully implement off main thread, speculative HTML parsing. Performing HTML parsing on a separate thread gives rise to the following performance gains:</p>\n<ol>\n<li>Web pages become more responsive, because the main thread becomes available to perform other functions, such as parsing CSS or handling input events.</li>\n<li>The parser thread can perform speculative parsing on the rest of the document while the main thread evaluates scripts. This ensures that the parser is not fully blocked while evaluating Javascript.</li>\n</ol>\n",
          "difficulty": null,
          "id": "proj_mozilla_2017_009",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/4601125449760768/",
          "proposal_id": null,
          "short_description": "The goal of this project is to fully implement off main thread, speculative HTML parsing. Performing HTML parsing on a separate thread gives rise to...",
          "slug": "off-main-thread-html-parsing",
          "status": "completed",
          "student_name": "cynicaldevil",
          "student_profile": null,
          "tags": [
            "java",
            "javascript",
            "web",
            "ml",
            "ai"
          ],
          "title": "Off-main thread HTML parsing"
        },
        {
          "code_url": "https://medium.com/@harkiratsingh_17231/collaboration-in-thimble-formerly-thimble-and-remote-mentorship-7d8645763850",
          "description": "<p>The audience of Thimble largely consists of teachers, educators and students. One of the most requested feature in thimble is collaboration. \nRight now only a single user can work on a project. \nThe aim of the project is to allow multiple users to edit the same code at the same time.\nThe project would also include adding other features like chat, comments etc. that promote Collaboration.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2017_010",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/4603459227615232/",
          "proposal_id": null,
          "short_description": "The audience of Thimble largely consists of teachers, educators and students. One of the most requested feature in thimble is collaboration. \nRight...",
          "slug": "adding-collaboration-features-to-thimble",
          "status": "completed",
          "student_name": "Harkirat Singh",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Adding Collaboration Features to Thimble"
        },
        {
          "code_url": "https://medium.com/@sebastinsanty/google-summer-of-code-2017-report-8f3958b610a8",
          "description": "<p>At present, <a href=\"https://bugzilla.mozilla.org\" target=\"_blank\">bugzilla.mozilla.org</a> uses enter_bug.cgi to file bugs. This is particularly unwieldy due to a lot of reasons like two hop db access, backend template rendering and multiple views. This project aims at improving the current bug filing scenario by creating a new single page interface to file bugs, thereby increasing the overall performance and usability</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2017_011",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6530427040825344/",
          "proposal_id": null,
          "short_description": "At present, bugzilla.mozilla.org uses enter_bug.cgi to file bugs. This is particularly unwieldy due to a lot of reasons like two hop db access,...",
          "slug": "improve-bug-filing-interface-for-bugzillamozillaorg",
          "status": "completed",
          "student_name": "Sebastin Santy",
          "student_profile": null,
          "tags": [
            "ai",
            "backend"
          ],
          "title": "Improve bug filing interface for bugzilla.mozilla.org"
        },
        {
          "code_url": "https://github.com/ibabushkin/rust-semverver/blob/master/doc/gsoc.md",
          "description": "<p>The goal of this project is to develop and implement a scheme to verify a library crate's adherence to the semantic versioning specification in the Rust language. This would allow to simplify the process of stabilizing and releasing libraries on <a href=\"https://crates.io\" target=\"_blank\">crates.io</a>, as many mistakes can be automatically guarded against.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2017_012",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6563424871907328/",
          "proposal_id": null,
          "short_description": "The goal of this project is to develop and implement a scheme to verify a library crate's adherence to the semantic versioning specification in the...",
          "slug": "semver-compatibility-tool",
          "status": "completed",
          "student_name": "twk",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "SemVer compatibility tool"
        },
        {
          "code_url": "https://drive.google.com/open?id=0B44DN8uUf9JOZUJ5MEVzQ0VQU00",
          "description": "<p>Matrix is an open, decentralized protocol for instant messaging (and more!) It has bridges to many other networks and protocol, e.g. IRC, Slack, and more. Initial support for Matrix was added in bug 1199855, but there's a lot to do still :\nSupport more features from the Matrix SDK (video/audio calls, room topics, typing notifications, read receipts and a lot more.)\nSupport one-on-one conversations.\nAdd tests specific to Matrix.\nImprove the Matrix JS-SDK that Instantbird and Thunderbird depend on.\nImproving and expanding shared code and APIs used by all JavaScript protocol plugins (IRC, XMPP, Yahoo and Twitter).\nImproving documentation of the process for adding a protocol to Instantbird/Thunderbird.\nUsing the Matrix protocol on a day-to-day basis to dog-food the code.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2017_013",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6565953802338304/",
          "proposal_id": null,
          "short_description": "Matrix is an open, decentralized protocol for instant messaging (and more!) It has bridges to many other networks and protocol, e.g. IRC, Slack, and...",
          "slug": "matrix-protocol-support-for-instantbird",
          "status": "completed",
          "student_name": "Pavan Karthik",
          "student_profile": null,
          "tags": [
            "java",
            "javascript",
            "api"
          ],
          "title": "Matrix Protocol Support for Instantbird."
        },
        {
          "code_url": "http://gsoc17-convert-xul-to-html.herokuapp.com/",
          "description": "<p>Lightning has traditionally been using XUL for its user interface. To modernize, we would like to convert dialogs, tab content and other parts of the user interface to HTML. The new components should use web standards as much as possible, avoiding extensive use of third party libraries.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2017_014",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/4902015960350720/",
          "proposal_id": null,
          "short_description": "Lightning has traditionally been using XUL for its user interface. To modernize, we would like to convert dialogs, tab content and other parts of the...",
          "slug": "convert-xul-to-html",
          "status": "completed",
          "student_name": "Arshad Khan",
          "student_profile": null,
          "tags": [
            "web",
            "ml"
          ],
          "title": "Convert XUL to HTML"
        },
        {
          "code_url": "https://gist.github.com/aksareen/1546b0028a2a486650ea609849c65b95",
          "description": "<p>Balrog is the software that runs the server side component of the update system used by Firefox and other Mozilla products. It helps ship updates faster and with much more flexibility than it's predecessor AUS (Application Update Service). However, Balrog's Admin API is mostly hand-written code, with some usage of wtforms for validation. It largely works, but it has some rough spots and inconsistencies. The move to an OpenAPI Specification will have multiple benefits including less code maintenance, multiple UI and backend bug fixes, better documentation and easier for clients to visualize and interact with API’s resources. Connexion, a framework designed for flask-based applications, will be used to handle HTTP requests based on OpenAPI Specification of the API to map the endpoints to the Balrog’s existing methods for serving the requests.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2017_015",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/4914423181344768/",
          "proposal_id": null,
          "short_description": "Balrog is the software that runs the server side component of the update system used by Firefox and other Mozilla products. It helps ship updates...",
          "slug": "migrate-balrogs-admin-api-to-openapi-specification",
          "status": "completed",
          "student_name": "Ashish Sareen",
          "student_profile": null,
          "tags": [
            "api",
            "ai",
            "ui",
            "backend"
          ],
          "title": "Migrate Balrog’s Admin API to OpenAPI-Specification"
        },
        {
          "code_url": "https://github.com/mozillascience/studyGroupStats",
          "description": "<p>The current page of  Study Group Event needs enhancement as to provide information about Study Group Programs and Events. Through this page, people learns about events at individual Study Group globally.  During my internship, I would like to import the details of the event, add features to the website and provide statistics i.e, activities on the Study Group page and from all of the forks of the Study Group. The main purpose of the project is to provide visualization and automation.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2017_016",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/4929299337445376/",
          "proposal_id": null,
          "short_description": "The current page of  Study Group Event needs enhancement as to provide information about Study Group Programs and Events. Through this page, people...",
          "slug": "canvas-for-study-group-event-page",
          "status": "completed",
          "student_name": "ANAMIKA DAS",
          "student_profile": null,
          "tags": [
            "web",
            "ai"
          ],
          "title": "Canvas for Study Group Event Page"
        },
        {
          "code_url": "https://github.com/mozilla/treeherder/commits?author=SJasoria",
          "description": "<p>Perfherder is the dashboard which monitors and analyses performance tests run against Mozilla\nproducts. Currently, Perfherder provides aggregated results and graphical visualization of various\ntest suites, but not for the individual test numbers that are used to generate them. For tests where there is a large natural variation in these individual numbers, it can be difficult to determine if there is a regression when the summarized values change because there could be many different underlying reasons for that. For these cases, a detailed view of the individual test results would be extremely helpful.The project will be about creating an easy-to-use web interface for visualizing this data that integrates well with the existing Perfherder views.</p>\n",
          "difficulty": "beginner",
          "id": "proj_mozilla_2017_017",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/4930051225157632/",
          "proposal_id": null,
          "short_description": "Perfherder is the dashboard which monitors and analyses performance tests run against Mozilla\nproducts. Currently, Perfherder provides aggregated...",
          "slug": "view-details-of-performance-test-results-on-perfherder",
          "status": "completed",
          "student_name": "Shruti Jasoria",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "ui"
          ],
          "title": "View Details of Performance Test Results on Perfherder"
        },
        {
          "code_url": "https://github.com/mdn/doc-linter-webextension/wiki/Google-Summer-of-Code-2017",
          "description": "<p>Note: This is one of Mozilla proposed Subject</p>\n<p><code>Rewrite the MDN doc tester add-on as a (well-tested, modern, documented) WebExtension that runs in Firefox, Chrome, Opera, and possibly Edge. Ideally reach feature parity with the existing Add-on SDK add-on and if time allows work on new test ideas that run against the MDN documentation.</code></p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2017_018",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5889065882746880/",
          "proposal_id": null,
          "short_description": "Note: This is one of Mozilla proposed Subject\nRewrite the MDN doc tester add-on as a (well-tested, modern, documented) WebExtension that runs in...",
          "slug": "mdn-documentation-tester-webextension",
          "status": "completed",
          "student_name": "Anthony Maton",
          "student_profile": null,
          "tags": [
            "web",
            "ai"
          ],
          "title": "MDN Documentation Tester WebExtension"
        },
        {
          "code_url": "https://gist.github.com/arush0311/2cc23a584276ec5922a9036bfd1a7eec",
          "description": "<p>This project is about implementing a bunch of features from phase 2 of science.mozilla.org</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2017_019",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5957547123015680/",
          "proposal_id": null,
          "short_description": "This project is about implementing a bunch of features from phase 2 of science.mozilla.org",
          "slug": "mozilla-science-lab-sciencemozillaorg-phase-2",
          "status": "completed",
          "student_name": "arush0311",
          "student_profile": null,
          "tags": [],
          "title": "Mozilla Science Lab: science.mozilla.org phase 2"
        },
        {
          "code_url": "https://tigleym.github.io/GSoC-Work-Submission/",
          "description": "<p>I will be adding and refining existing features to Firefox Devtools' CSS Grid Inspector tool. One major feature I will be working on is the grid outline tool. This tool allows for developers and designers to interact with a CSS grid layout highlighted by the CSS Grid Inspector. It gives users the ability to visualise grid cells, areas, positioning, and line names in an intuitive way. This feature will be shipped inside the new layout panel with Firefox Developer Tools.</p>\n<p>I initially implemented this feature as part of the Undergraduate Capstone Open-Source Program for an applied studies course during the Spring 2017 semester. Although it has come a long way, it still needs polishing.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2017_020",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6321798064898048/",
          "proposal_id": null,
          "short_description": "I will be adding and refining existing features to Firefox Devtools' CSS Grid Inspector tool. One major feature I will be working on is the grid...",
          "slug": "firefox-developer-tools-css-grid-inspector",
          "status": "completed",
          "student_name": "Micah Tigley",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "Firefox Developer Tools: CSS Grid Inspector"
        },
        {
          "code_url": "https://xanewok.github.io/gsoc/2017/wrapping-up-work-for-gsoc/",
          "description": "<p>The aim of this project is to improve the Rust developer experience via the Rust Language Server by introducing few notable improvements. The scope includes supporting more workspace configurations (multiple targets and active crates) as well as popularly requested IDE features, such as implementing code action mechanism on the server side, e.g. used for refactoring or running specific tests, or improving diagnostic data required for better code navigation. Providing good out-of-box IDE experience will substantially help with widespread adoption of Rust and support writing not only quality self-contained libraries, but also incentivize writing advanced end-user oriented applications.</p>\n",
          "difficulty": "advanced",
          "id": "proj_mozilla_2017_021",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5225094271991808/",
          "proposal_id": null,
          "short_description": "The aim of this project is to improve the Rust developer experience via the Rust Language Server by introducing few notable improvements. The scope...",
          "slug": "rust-language-server-rls",
          "status": "completed",
          "student_name": "Igor Matuszewski",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Rust Language Server (RLS)"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2017/organizations/6414943960170496/"
    },
    "year_2018": {
      "num_projects": 16,
      "projects": [
        {
          "code_url": "https://medium.com/@singhi.pramit/google-summer-of-code-18-with-mozilla-pontoon-89a7cb97af39",
          "description": "<p>The project mainly focuses on <strong>improving the User Experience</strong> for people who wish to contribute to Pontoon (the localization tool developed by Mozilla) . While there are lots of good features in the Pontoon but there are few problems with the current flow for tool for the first-time users which creates a confusion for the users who wish to contribute.\nUser Experience (UX) can be improved by making some important changes in the flow majorly making a <strong>new homepage</strong> and by implementation of new functionality in the tool like <strong>implementing a tutorial</strong> and making a more smooth design of the tool to help the first-time users. UX also sometimes involve some changing in the default UI of the tool.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2018_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5671905759592448/",
          "proposal_id": null,
          "short_description": "The project mainly focuses on improving the User Experience for people who wish to contribute to Pontoon (the localization tool developed by Mozilla)...",
          "slug": "pontoon",
          "status": "completed",
          "student_name": "Pramit Singhi",
          "student_profile": null,
          "tags": [
            "ai",
            "ui",
            "ux"
          ],
          "title": "Pontoon"
        },
        {
          "code_url": "https://discourse.mozilla.org/t/pontoon-path-to-first-contribution/30024",
          "description": "<p>“Pontoon is Mozilla's localization tool, used by hundreds of contributors to translate Firefox, mozilla.org, and many other Mozilla products. It is critical to shipping Firefox to as many users as possible, all around the world.”</p>\n<p>Since active user participation and onboarding is one of the key components for the achievement of Pontoon’s goal towards localization, the idea is to improve the experience of first-time users of Pontoon by defining a \"path to first contribution\" explaining the basic flow and ins and out of contributing towards localising Mozilla applications by adding a guided interactive tour, a walkthrough for explaining basic functionality for  unauthenticated user and a better “Learn More” link replacing the current gitbook link and making all of these as smooth as possible.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2018_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5715847704215552/",
          "proposal_id": null,
          "short_description": "“Pontoon is Mozilla's localization tool, used by hundreds of contributors to translate Firefox, mozilla.org, and many other Mozilla products. It is...",
          "slug": "pontoons-path-to-first-contribution",
          "status": "completed",
          "student_name": "vishalcr7",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Pontoon's path to first contribution"
        },
        {
          "code_url": "https://ydidwania.github.io/2018/08/09/gsoc-2018-code-dump.html",
          "description": "<p>Over the years, Mozilla has shifted to using Taskcluster as its primary continuous integration system. Communication becomes essential between the various components when scaling the infrastructure. Mozilla uses Pulse to enable an exchange of information Mozilla’s systems. Pulse is actually a RabbitMQ server which uses AMQP ( and follows a Publish--Subscribe pattern). \nTaskcluster-events is a service that allows web clients to listen for pulse messages without RabbitMQ credentials and without the need for a TCP connection to the RabbitMQ server. However, currently, taskcluster-events is old and poorly designed, without protocol specification. This proposal aims to completely rebuild taskcluster-events from scratch, ensuring it is robust and free of major bugs / failures.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2018_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5438017812561920/",
          "proposal_id": null,
          "short_description": "Over the years, Mozilla has shifted to using Taskcluster as its primary continuous integration system. Communication becomes essential between the...",
          "slug": "improved-pulse-inspector-backend",
          "status": "completed",
          "student_name": "ydidwania",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "ui",
            "backend"
          ],
          "title": "Improved Pulse Inspector Backend"
        },
        {
          "code_url": "https://gist.github.com/djbarnwal/944776d8348d61bb9ed225aa093b740b",
          "description": "<p>Iodide is a browser-based notebook which works with absolute zero configuration. Iodide notebooks are designed for scientists so that they can work flexibly and share their work without any hassle. Iodide is still in its early alpha stage. This project aims to extend the functionality of the notebook; making the notebook code more robust and performant; helping to shape the user experience; and creating example notebooks.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2018_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5440170128048128/",
          "proposal_id": null,
          "short_description": "Iodide is a browser-based notebook which works with absolute zero configuration. Iodide notebooks are designed for scientists so that they can work...",
          "slug": "extending-iodides-functionality-and-improving-code-quality",
          "status": "completed",
          "student_name": "Dhiraj Barnwal",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Extending Iodide’s Functionality and Improving Code Quality"
        },
        {
          "code_url": "https://github.com/w3c/respec/wiki/Google-Summer-of-Code-2018-Summary",
          "description": "<p>This is a project to implement new features, fix some existing issues and improve maintainability of the <a href=\"https://github.com/w3c/respec\" target=\"_blank\">ReSpec</a> project.</p>\n<p>Majority of time is expected to be spent in implementing a cross references feature. It includes creating a web service that integrates with ReSpec and expands the existing reference system to allow references across specifications. This task will require some investigation first as to how we can leverage the CSSWG’s <a href=\"https://api.csswg.org/shepherd/\" target=\"_blank\">Shepherd API</a> and its database. The web service may require creating a custom datastore that allows efficient search for multiple keywords. In the end, it'll provide an easy way to deep-link specifications to each other without much hassle.</p>\n<p>Other smaller tasks that I plan to work upon include:</p>\n<ul>\n<li>auto-normalizing references</li>\n<li>implementing automatic linking of pluralized words </li>\n</ul>\n<p>I would also like to work on some of the issues that might come up during the GSoC period.</p>\n",
          "difficulty": "beginner",
          "id": "proj_mozilla_2018_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5453918721015808/",
          "proposal_id": null,
          "short_description": "This is a project to implement new features, fix some existing issues and improve maintainability of the ReSpec project.\nMajority of time is expected...",
          "slug": "implementing-cross-references-and-general-improvements-in-respec",
          "status": "completed",
          "student_name": "Sudhanshu Vishnoi",
          "student_profile": null,
          "tags": [
            "web",
            "api",
            "ai",
            "database",
            "ui"
          ],
          "title": "Implementing cross references and general improvements in ReSpec"
        },
        {
          "code_url": "https://medium.com/@ollelauribostr/google-summer-of-code-2018-final-report-49c6dd512ac9",
          "description": "<p>The goal of this project is to significantly increase test coverage and test quality in the WebAssembly Studio project. This will make it easier to detect bugs and breaking changes as the project evolves. While doing so, the idea is to simultaneously work on open issues related to the code that is tested during each iteration.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2018_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/4998480388947968/",
          "proposal_id": null,
          "short_description": "The goal of this project is to significantly increase test coverage and test quality in the WebAssembly Studio project. This will make it easier to...",
          "slug": "webassembly-studio",
          "status": "completed",
          "student_name": "Olle Lauri Boström",
          "student_profile": null,
          "tags": [
            "web"
          ],
          "title": "WebAssembly Studio"
        },
        {
          "code_url": "https://blog.servo.org/2018/08/09/gsoc-generic-servo/",
          "description": "<p>The aim of this project is to investigate and propose a plan for <em>separation of Servo script crate</em>. Script crate lays in the core of the Servo and requires a large amount of memory to build. Large memory requirements make it impossible to build on 32-bit computers and slowdown development.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2018_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5111490306637824/",
          "proposal_id": null,
          "short_description": "The aim of this project is to investigate and propose a plan for separation of Servo script crate. Script crate lays in the core of the Servo and...",
          "slug": "servo-prototype-ways-of-splitting-up-the-script-crate",
          "status": "completed",
          "student_name": "Peter Hrvola",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Servo: Prototype ways of splitting up the script crate"
        },
        {
          "code_url": "https://docs.google.com/document/d/13aZVWeGZtk0d0-TSLv1aNq90Szezys07gGdRpuPNn7E/edit?usp=sharing",
          "description": "<p>Enigmail is a seamlessly integrated security add-on for Mozilla Thunderbird. The main idea behind this project is to improve Enigmail UI so that non-experts can use encryption easily. This will be done by two main things : 1) UI Improvements 2) Adding UI Testing. Enigmail don’t have UI Test Units. I think that Testing is very important part of any development project. So I am planning to integrate it. Autocrypt setup is also an important part of this project.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2018_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/4513703537934336/",
          "proposal_id": null,
          "short_description": "Enigmail is a seamlessly integrated security add-on for Mozilla Thunderbird. The main idea behind this project is to improve Enigmail UI so that...",
          "slug": "improve-enigmail-user-experience",
          "status": "completed",
          "student_name": "Khushil Mistry",
          "student_profile": null,
          "tags": [
            "ml",
            "ai",
            "ui"
          ],
          "title": "Improve Enigmail User Experience"
        },
        {
          "code_url": "https://gfx-rs.github.io/2018/08/14/gsoc.html",
          "description": "<p>The aim of the project is to implement the D3D11 backend for the gfx hardware abstraction layer (HAL) in order to get it ready to be used by WebRender for its rendering.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2018_009",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/4760075075846144/",
          "proposal_id": null,
          "short_description": "The aim of the project is to implement the D3D11 backend for the gfx hardware abstraction layer (HAL) in order to get it ready to be used by...",
          "slug": "d3d11-backend-for-gfx-rs-hal",
          "status": "completed",
          "student_name": "Felix Kaaman",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "backend"
          ],
          "title": "D3D11 backend for gfx-rs HAL"
        },
        {
          "code_url": "https://docs.google.com/document/d/127nvmi6j-AUP4Jcjs_nF_zbYM-VPpTEM64NUnzD9AtM/edit?usp=sharing",
          "description": "<p>AOM (Accessibility Object Model) is a JavaScript API that allows for modifying an accessibility tree like DOM. In this project, AOM phase 1 &amp; 2 is implemented.</p>\n<h3>phase 1</h3>\n<p>The accessibleNode property is added to DOM Element. The properties of AccessibleNode correspond to ARIA attributes one-to-one, and web browsers can modify accessibility tree via this property. Note that if both an AccessibileNode property and its corresponding ARIA attribute are present, the AccessibleNode property overrides the ARIA attribute.</p>\n<h3>phase 2</h3>\n<p>AccessibleNode interface is derived from EventTarget so that accessibility input events and assistive actions become able to be processed via AccessibleNode. This enables web developers to check whether users are using an assistive technology or not, and this may leads to discrimination against some users. So, web browsers should ask users for permission of listening for accessiblity events before propagating those events to AccessibleNodes.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2018_010",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/6100337672847360/",
          "proposal_id": null,
          "short_description": "AOM (Accessibility Object Model) is a JavaScript API that allows for modifying an accessibility tree like DOM. In this project, AOM phase 1 & 2 is...",
          "slug": "aom-accessibility-api",
          "status": "completed",
          "student_name": "Tokio Kajitsuka",
          "student_profile": null,
          "tags": [
            "java",
            "javascript",
            "web",
            "api",
            "ai"
          ],
          "title": "AOM - accessibility API"
        },
        {
          "code_url": "https://sagarb-97.github.io/Download-Spam-Protection-Blog/gsoc-summary/",
          "description": "<p>The goal of this project is to prevent sites from bombarding the browser with multiple non user initiated downloads.\nThis would mean that a mechanism to differentiate between user initiated and automatically initiated downloads has to be established as it is undesirable to annoy the user with unnecessary warning and permission prompts even when the user himself has requested for a download.</p>\n<p>The project also involves implementing some form of data collection technique (via telemetry) to measure the effectiveness of the implemented logic.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2018_011",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/6124380295790592/",
          "proposal_id": null,
          "short_description": "The goal of this project is to prevent sites from bombarding the browser with multiple non user initiated downloads.\nThis would mean that a mechanism...",
          "slug": "download-spam-protection-for-firefox",
          "status": "completed",
          "student_name": "Sagar Bharadwaj",
          "student_profile": null,
          "tags": [],
          "title": "Download Spam Protection for Firefox"
        },
        {
          "code_url": "https://medium.com/@sagarvijaygupta/gsoc18-mozilla-autowebcompat-176d4e7ada19",
          "description": "<p>Basic functionalities which will lead to the completion of the project will be added in this proposal. <strong>Adding desktop browsers</strong> with options of <em>dimension change, zooming across the webpage</em> in both desktop and mobile browser, <strong>adding orientation mode</strong> for mobile browser. <strong>Adding a tag to website</strong> for <em>dynamic or static content</em>. <strong>Selecting advertisements</strong> in websites which will be trained on a <strong>Faster R-CNN model</strong> to mark them compatible in two screenshots. <strong>Training and testing different models on different types of queries</strong> ie, different types of web compatibilities as selected by user and <strong>maintaining a database with these results including machine information and training time along with the network architecture</strong>. Finally, create a <em>test.py</em> wich will <strong>collect screenshots in complete search fashion, chose from the database the best model</strong> for the given type of query and give result of <strong>percentage compatibility</strong>.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2018_012",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/6274816424280064/",
          "proposal_id": null,
          "short_description": "Basic functionalities which will lead to the completion of the project will be added in this proposal. Adding desktop browsers with options of...",
          "slug": "adding-and-improving-functionalities-in-autowebcompat",
          "status": "completed",
          "student_name": "Sagar Gupta",
          "student_profile": null,
          "tags": [
            "web",
            "mobile",
            "ai",
            "database"
          ],
          "title": "Adding and Improving Functionalities in Autowebcompat"
        },
        {
          "code_url": "https://github.com/nebulet/nebulet",
          "description": "<p>Design and partially implement a research operating system that uses WebAssembly to implement software-isolated processes (SIPs) that run in ring 0 in order to allow architecture-agnostic compiled binaries and possibly attain higher performance due to not needing page-table switches and interrupt-based system-calls.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2018_013",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/6310622358667264/",
          "proposal_id": null,
          "short_description": "Design and partially implement a research operating system that uses WebAssembly to implement software-isolated processes (SIPs) that run in ring 0...",
          "slug": "software-isolated-wasm-processes-in-ring-0",
          "status": "completed",
          "student_name": "Lachlan Sneff",
          "student_profile": null,
          "tags": [
            "web",
            "ai"
          ],
          "title": "Software-Isolated WASM Processes in Ring 0"
        },
        {
          "code_url": "https://gist.github.com/cnwangjie/1a9fe6293b6d900a3a1a84a09f2d9dbf",
          "description": "<p>MetricsGraphics is a great data visualization library. We hope to add natively support brushing and zooming feature (this part can also be used to create an overview plot) and provide some API to allow highlighting some data points. And we will also make some changes in the hover and click event to make it easier to create a tooltip.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2018_014",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5147144910536704/",
          "proposal_id": null,
          "short_description": "MetricsGraphics is a great data visualization library. We hope to add natively support brushing and zooming feature (this part can also be used to...",
          "slug": "metricsgraphics-zooming-and-brushing",
          "status": "completed",
          "student_name": "wangjie",
          "student_profile": null,
          "tags": [
            "api"
          ],
          "title": "metricsgraphics - zooming and brushing"
        },
        {
          "code_url": "https://bugzilla.mozilla.org/show_bug.cgi?id=1458007",
          "description": "<p>The purpose of this project is to allow the selection of several tabs in Firefox and thus perform specific actions on them at once. These actions include closing or moving tabs into a new window. The Shift and CTRL/Cmd keys could respectively be used for a range select or for individual item select.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2018_015",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5177288467415040/",
          "proposal_id": null,
          "short_description": "The purpose of this project is to allow the selection of several tabs in Firefox and thus perform specific actions on them at once. These actions...",
          "slug": "multi-tab-select-in-firefox",
          "status": "completed",
          "student_name": "Abdoulaye Oumar Ly",
          "student_profile": null,
          "tags": [],
          "title": "Multi-tab select in Firefox"
        },
        {
          "code_url": "https://mozilla-mobile.github.io/android-components/2018/08/10/fretboard.html",
          "description": "<p>This proposal is about developing Fretboard: an A/B testing framework for Android written in Kotlin, taking as foundation the Switchboard fork used in Firefox for Android.</p>\n<p>The goal is to make a reusable library decoupled from both the client and server storage mechanism which will allow to make A/B tests on Android apps: check if a user is part of an experiment, schedule frequent updates, get experiment associated metadata, as well as force specific experiments value in order to test the app, for example.</p>\n<p>It will also allow security features: certificate pinning and experiment collection signature verification.\nThe library will be deployed to jcenter and also integrated into Firefox Focus.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2018_016",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5181913610321920/",
          "proposal_id": null,
          "short_description": "This proposal is about developing Fretboard: an A/B testing framework for Android written in Kotlin, taking as foundation the Switchboard fork used...",
          "slug": "fretboard-ab-testing-framework-for-android",
          "status": "completed",
          "student_name": "Fernando García Álvarez",
          "student_profile": null,
          "tags": [
            "android"
          ],
          "title": "Fretboard: A/B Testing Framework for Android"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2018/organizations/6589662424465408/"
    },
    "year_2019": {
      "num_projects": 14,
      "projects": [
        {
          "code_url": "https://phabricator.services.mozilla.com/D33792",
          "description": "<p>The project involves the redesign of Firefox Reader as well as working on the functionality related issues the current reader is facing. The redesign of the Reader has to be done so that it complies the Photon Design System and also offers a better user experience to it's users. Thus, using the knowledge of JavaScript, CSS, and web experience, the project aims at revamping the Reader View considering all the three reader modes ie. Light Mode, Dark Mode and Sepia Mode to enhance the reader's reading experience.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2019_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/4978786922135552/",
          "proposal_id": null,
          "short_description": "The project involves the redesign of Firefox Reader as well as working on the functionality related issues the current reader is facing. The redesign...",
          "slug": "firefox-reader-redesign",
          "status": "completed",
          "student_name": "Akshitha Shetty",
          "student_profile": null,
          "tags": [
            "java",
            "javascript",
            "web",
            "ai"
          ],
          "title": "Firefox Reader Redesign"
        },
        {
          "code_url": "https://medium.com/@meghpararajkumar/gsoc19-final-submission-78ab55c37502",
          "description": "<p>Firefox Profiler is a tool which visualizes performance data recorded from various performance analysis tools, which helps us to have an insight into our app’s responsiveness, Javascript and layout performance. By using it efficiently we can optimize our app in terms of performance. Currently, it supports Gecko, chrome, and perf(Linux) profile formats. This project will provide support for visualizing profiles from Instruments which is a powerful and flexible performance-analysis and testing tool that’s part of the Xcode toolset.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2019_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5077172895612928/",
          "proposal_id": null,
          "short_description": "Firefox Profiler is a tool which visualizes performance data recorded from various performance analysis tools, which helps us to have an insight into...",
          "slug": "support-importing-instruments-profiles-in-perfhtml",
          "status": "completed",
          "student_name": "Rajkumar Meghpara",
          "student_profile": null,
          "tags": [
            "java",
            "javascript",
            "ml",
            "ux"
          ],
          "title": "Support importing Instruments profiles in perf.html"
        },
        {
          "code_url": "https://gist.github.com/farhan787/3df6916cc6bee2289cf7bcb382f362e3",
          "description": "<h4>Firefox Account Security Dashboard</h4>\n<p>The Firefox Account platform tracks security information about an account, but does not surface this information in an easily consumable format which makes this project very essential and useful for administrators as well as the users to make better decisions about security. The goal of this project is to provide Firefox Account administrators and users an easily digestible view into the important events that have occurred on an account, providing a way to audit for irregularities.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2019_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5102437638078464/",
          "proposal_id": null,
          "short_description": "Firefox Account Security Dashboard\nThe Firefox Account platform tracks security information about an account, but does not surface this information...",
          "slug": "firefox-account-security-dashboard",
          "status": "completed",
          "student_name": "MuhammadFarhan",
          "student_profile": null,
          "tags": [],
          "title": "Firefox Account Security Dashboard"
        },
        {
          "code_url": "https://github.com/mozilla/bugbug",
          "description": "<p><em>bugbug</em> was started with the aim of making the task of bug tracking simpler, by using machine learning algorithms to differentiate between bugs. However, it is currently in it's early stages. It uses basic feature extractors and a Gradient Boosting Tree classifier to make predictions. With this project, I plan on enhancing the accuracies and capabilities of <em> bugbug</em>, by making the classifiers more robust , implementing deep learning models and  additional feature extractors for these models. I hope this project is a solid move towards making the tasks related to bug tracking more convenient.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2019_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5297598183768064/",
          "proposal_id": null,
          "short_description": "bugbug was started with the aim of making the task of bug tracking simpler, by using machine learning algorithms to differentiate between bugs....",
          "slug": "enhancing-bugbug-a-platform-for-bugzilla-machine-learning-projects",
          "status": "completed",
          "student_name": "Ayush Shridhar",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Enhancing bugbug : A platform for Bugzilla machine learning projects"
        },
        {
          "code_url": "https://kounelisagis.com/blog/gsoc2019/",
          "description": "<p>Open Source software growth is rising.</p>\n<p>Millions of developers from plenty of countries with different skill-sets and ideas contribute on a daily basis to Open Source projects. It’s free and it gives you the chance to gain practical experience working on some sensational projects. You can get in touch with experts on the field and create something amazing together.</p>\n<p>But how easy is for new contributors to get involved in Open Source? It takes time to find the appropriate project and issue. The ideal project must be well-documented and match your skills. That’s what FixMe does. FixMe is a tool for surfacing meaningful contribution opportunities to new contributors.</p>\n",
          "difficulty": "beginner",
          "id": "proj_mozilla_2019_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5575700671627264/",
          "proposal_id": null,
          "short_description": "Open Source software growth is rising.\nMillions of developers from plenty of countries with different skill-sets and ideas contribute on a daily...",
          "slug": "fixme",
          "status": "completed",
          "student_name": "Agisilaos Kounelis",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "FixMe"
        },
        {
          "code_url": "https://gist.github.com/shreevari/6886eb75b02935b4a011dc3d958bad56",
          "description": "<h3>Adaptive Quantization based on an activity mask.</h3>\n<p>The human eye is more tolerant towards errors in areas of high activity and is quick to find out errors in areas of lower activity. To leverage this psychovisual characteristic, quantization can be made adaptive based on the activity mask.\nActivity masking will be implemented in two phases:</p>\n<ol>\n<li>Biasing the RDO based on the activity at a specific region.</li>\n<li>Varying the quantizer offsets across segments  based on activity.</li>\n</ol>\n<h3>Optimizing the quantization algorithm using Trellis Quantization:</h3>\n<p>Using Trellis Quantization passing the activity measurements as the weights to the trellis. The output of this Activity masked Trellis is used for quantization.\nThis helps the quantization perform better in PSNR metrics while increasing perceptual image quality significantly. This is a feature that has proved to perform better in the case of x264 and is expected to yield similar results at rav1e too.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2019_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/6231206633406464/",
          "proposal_id": null,
          "short_description": "Adaptive Quantization based on an activity mask.\nThe human eye is more tolerant towards errors in areas of high activity and is quick to find out...",
          "slug": "activity-masking-in-rav1e",
          "status": "completed",
          "student_name": "Shreevari SP",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "Activity Masking in rav1e"
        },
        {
          "code_url": "https://gist.github.com/tanhengyeow/eaa3576e3aa333db7a7d86c3fde9ccd9",
          "description": "<p>Firefox Developer Tools offers good tooling for monitoring HTTP traffic between the current page and the server. The existing Network panel allows intercepting and inspecting all data transferred over the wire including headers, GET/POST data, responses, detailed timings, etc. Unfortunately, Firefox Developer Tools doesn’t offer a way to inspect WebSocket (WS) traffic in Firefox Quantum.</p>\n<p>This project aims at providing support for WebSocket monitoring and inspection in Firefox Developer Tools. The feature should be built on top of the existing Network panel user interface (UI) and be responsible for visualizing data (i.e. WS frames) sent through a WebSocket connection. Users should be able to perform common tasks such as pausing/resuming monitoring, clearing frames, searching/filtering, looking at summary data etc. Light and Dark Themes should be supported.</p>\n<p>Furthermore, support for popular protocols such as Socket.IO, SockJS, plain JSON, and MQTT will be implemented. There is also ongoing work for supporting binary message viewer and showing WebSocket messages in HAR exports.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2019_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/6248195577872384/",
          "proposal_id": null,
          "short_description": "Firefox Developer Tools offers good tooling for monitoring HTTP traffic between the current page and the server. The existing Network panel allows...",
          "slug": "websocket-monitor",
          "status": "completed",
          "student_name": "Heng Yeow Tan",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "ui"
          ],
          "title": "WebSocket Monitor"
        },
        {
          "code_url": "http://bit.ly/GSoC19FF",
          "description": "<p>Improve the infrastructure underpinning Firefox's in-tree documentation.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2019_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/4648013773930496/",
          "proposal_id": null,
          "short_description": "Improve the infrastructure underpinning Firefox's in-tree documentation.",
          "slug": "improving-firefox-source-docs-infrastructure",
          "status": "completed",
          "student_name": "championshuttler",
          "student_profile": null,
          "tags": [],
          "title": "Improving Firefox Source Docs Infrastructure"
        },
        {
          "code_url": "https://gist.github.com/madhur-tandon/33d5b3e80e969a199494826e13486e5e",
          "description": "<p>Iodide &amp; Pyodide enables one to do data science computations entirely in the browser. These tools explore a rather unique trade-off space, allowing scientists to work flexibly and communicate effectively rather than switching mediums for different tasks. The notebook style interface allows the best in class tools of both JavaScript and Python to be used coherently.</p>\n<p>The matplotlib library that is currently shipped for Pyodide uses the Agg backend for actual rendering. Writing a new backend based on the APIs of HTML5 Canvas element would enable us to reduce size &amp; memory footprint of the final build while also resulting in significant speedups. In fact, it could also enable us to take advantage of GPU acceleration along with giving the ability to use locally installed fonts along with web fonts.</p>\n",
          "difficulty": "medium",
          "id": "proj_mozilla_2019_009",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/4683094261497856/",
          "proposal_id": null,
          "short_description": "Iodide & Pyodide enables one to do data science computations entirely in the browser. These tools explore a rather unique trade-off space, allowing...",
          "slug": "renderer-backend-for-matplotlib-based-on-html5-canvas-apis",
          "status": "completed",
          "student_name": "Madhur Tandon",
          "student_profile": null,
          "tags": [
            "python",
            "java",
            "javascript",
            "web",
            "api"
          ],
          "title": "Renderer Backend for Matplotlib based on HTML5 Canvas APIs"
        },
        {
          "code_url": "https://gist.github.com/mritunjayz/b3f5792ae6550faec1b5ff9e76a784e8",
          "description": "<p>I will work to find WebAssembly based solution for missing mediaRecorder API for browsers like Safari and Edge.\nBy using native mp3 encoder that will be used in the browser with the help of Emscripten compiled javascript output.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2019_010",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/6079910639042560/",
          "proposal_id": null,
          "short_description": "I will work to find WebAssembly based solution for missing mediaRecorder API for browsers like Safari and Edge.\nBy using native mp3 encoder that will...",
          "slug": "common-voice-webassembly-mp3-encoding",
          "status": "completed",
          "student_name": "Mritunjay Goutam",
          "student_profile": null,
          "tags": [
            "java",
            "javascript",
            "web",
            "api"
          ],
          "title": "Common Voice - WebAssembly MP3 Encoding"
        },
        {
          "code_url": "https://gist.github.com/dhyey35/6a5d81f6542429290d547f0df843a538",
          "description": "<p>In the Debugger tab of the Firefox DevTools when the debugger is paused on a breakpoint users can see the values of variables by hovering over them. This project will add inline values beside the variable name so that the user can get a quick overview of all the relevant variables easily without having to hover over each one of them.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2019_011",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/4954871151722496/",
          "proposal_id": null,
          "short_description": "In the Debugger tab of the Firefox DevTools when the debugger is paused on a breakpoint users can see the values of variables by hovering over them....",
          "slug": "debugger-inline-variable-preview",
          "status": "completed",
          "student_name": "Dhyey Thakore",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "Debugger Inline Variable Preview"
        },
        {
          "code_url": "https://github.com/mozilla/TUID/blob/47319da0b4f020175f55838c51fd41c77045eb11/docs/GSoC_Final_Report_2019.md",
          "description": "<p>Currently the TUID service has stability and speed issues. The aim of this project is to investigate, understand the problems related to it and find a permanent solution.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2019_012",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5849522285051904/",
          "proposal_id": null,
          "short_description": "Currently the TUID service has stability and speed issues. The aim of this project is to investigate, understand the problems related to it and find...",
          "slug": "tuid-service-improvments",
          "status": "completed",
          "student_name": "Ajumal P A",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "TUID service improvments"
        },
        {
          "code_url": "https://gist.github.com/arpit73/803f8d643d0e0ea2b9826d95ce95149f",
          "description": "<p>An update to the public suffix list (PSL) is shipped bundled with Firefox releases. The current system creates the DAFSA binary file at build time. The list has to be manually updated with every new release and cannot be updated for people running old versions of Firefox. I will be working to create an update system using the remote-settings API in Firefox to deliver an updated list to the client periodically, the period is yet to be determined. The list will be published on the Mozilla remote-settings servers and be shipped as a binary. This file format allows for shipping the list quickly over the network as it is orders of magnitude smaller in size an can be parsed much faster than raw text.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2019_013",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5922077838671872/",
          "proposal_id": null,
          "short_description": "An update to the public suffix list (PSL) is shipped bundled with Firefox releases. The current system creates the DAFSA binary file at build time....",
          "slug": "ship-public-suffix-list-psl-over-remote-settings",
          "status": "completed",
          "student_name": "Arpit Bharti",
          "student_profile": null,
          "tags": [
            "api",
            "ui"
          ],
          "title": "Ship Public Suffix List (PSL) over Remote Settings"
        },
        {
          "code_url": "https://georgeroman.github.io/posts/2019-08-23-gsoc-servo-final-report.html",
          "description": "<p>WebDriver is a remote control interface that enables introspection and control of user agents. Currently, Servo supports only a minimal subset of the WebDriver protocol. The goal of this project is to extend this support and pass the conformance tests to demonstrate the implementation's correctness. Additionally, the project also aims to support running WebDriver-based automated tests like the WebBluetooth test suite, which require complex browser control and automated interactions that WebDriver provides.</p>\n",
          "difficulty": "advanced",
          "id": "proj_mozilla_2019_014",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5995413734162432/",
          "proposal_id": null,
          "short_description": "WebDriver is a remote control interface that enables introspection and control of user agents. Currently, Servo supports only a minimal subset of the...",
          "slug": "improve-webdriver-support-in-servo",
          "status": "completed",
          "student_name": "George Roman",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "ui"
          ],
          "title": "Improve WebDriver support in Servo"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2019/organizations/5091266142928896/"
    },
    "year_2020": {
      "num_projects": 11,
      "projects": [
        {
          "code_url": "https://github.com/mozilla/common-voice/tree/gsoc/web/src/components/demo-pages",
          "description": "<p>The common voice project crowdsources voice clips from volunteers in multiple languages towards the creation of an open source dataset to aid in advancing voice recognition technology. \nThe current Common Voice website is not optimized for tablet view and lacks a demo-friendly workflow. In this proposal, I will highlight concrete steps towards the implementation of a Kiosk mode for the platform to enhance tablet- and demo-friendliness.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2020_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/6474750781554688/",
          "proposal_id": null,
          "short_description": "The common voice project crowdsources voice clips from volunteers in multiple languages towards the creation of an open source dataset to aid in...",
          "slug": "implementation-for-common-voice-kiosk-mode",
          "status": "completed",
          "student_name": "Nana Anikuabe",
          "student_profile": null,
          "tags": [
            "ios",
            "web",
            "ai"
          ],
          "title": "Implementation for Common Voice Kiosk Mode"
        },
        {
          "code_url": "https://shubhamkumar.live/blog/Implementing-FIDO2-For-Mozilla-GSoC-2020",
          "description": "<p>To better help protect Firefox Account (FxA) users, we want to Integrate FIDO2 (Fast Identity Online) authentication for 2FA on Firefox Account authentication as a second authentication factor.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2020_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/6638290586828800/",
          "proposal_id": null,
          "short_description": "To better help protect Firefox Account (FxA) users, we want to Integrate FIDO2 (Fast Identity Online) authentication for 2FA on Firefox Account...",
          "slug": "integrate-fido2-authentication-for-2fa-on-firefox-account",
          "status": "completed",
          "student_name": "Shubham Kumar",
          "student_profile": null,
          "tags": [],
          "title": "Integrate FIDO2 authentication for 2FA on Firefox Account"
        },
        {
          "code_url": "https://gist.github.com/hamzah70/74aa75143ddb5e575c07d07b50c6243d",
          "description": "<p>The end goal of this project is to make Mozilla's source code both py2 as well as py3 compatible. Since py2 has officially become obsolete as of January'20, so this task is considered a high priority, no new support for py2 will be published.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2020_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5665660346040320/",
          "proposal_id": null,
          "short_description": "The end goal of this project is to make Mozilla's source code both py2 as well as py3 compatible. Since py2 has officially become obsolete as of...",
          "slug": "implement-cross-version-support-for-python",
          "status": "completed",
          "student_name": "Hamzah Akhtar",
          "student_profile": null,
          "tags": [
            "python"
          ],
          "title": "Implement cross version support for python"
        },
        {
          "code_url": "https://gist.github.com/20manas/cacdcb9171c517f8d9bdf8135651655c",
          "description": "<p>It happens often that when an element overflows, its parent element ends up getting an undesirable scrollbar. To help debug such scrollbars due to overflow, DevTools already has the [scroll] inspector-badge in the Markup View, which allows a developer to detect which elements are scrollable or have a scrollbar.</p>\n<p>However, this alone is not sufficient for debugging what causes the scrollbars to appear in the first place.</p>\n<p>When debugging an unwanted scrollbar, a developer should be able to swiftly get rid of the unwanted scrollbar. One way to achieve this end-goal, is the following:</p>\n<ol>\n<li>Show the developer the innermost descendant element(s) which overflow(s) and cause the appearance of the scrollbar.</li>\n<li>Let the developer use other available tools to fix the unwanted scrollbar, as the information present to the developer when the above step completes should be sufficient to quickly fix the unwanted scrollbar.</li>\n</ol>\n<p>This proposal proposes implementing the above feature in the DevTools arsenal.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2020_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5687380196982784/",
          "proposal_id": null,
          "short_description": "It happens often that when an element overflows, its parent element ends up getting an undesirable scrollbar. To help debug such scrollbars due to...",
          "slug": "debugging-unwanted-scrollbars",
          "status": "completed",
          "student_name": "Manas Khurana",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Debugging Unwanted Scrollbars"
        },
        {
          "code_url": "https://medium.com/@ssalampuria/treeherder-gsoc20-5e067cf3ba2c",
          "description": "<ul>\n<li>Push Health is a new Dashboard being built inside Treeherder to determine if a push is good based on   calculations of Tasks and Tests success rate within the push and historically. The main aim is to add and enhance features which would make it more efficient for users like handling the bulk actions efficiently.</li>\n<li>InfraStructure Compare View is also a new Dashboard built inside Treeherder  which would provide parity. There could be different machines and large changes to OS which one needs to verify and monitor the changes well.</li>\n<li>Improve Log parsing UX and general improvements to log viewer</li>\n</ul>\n",
          "difficulty": null,
          "id": "proj_mozilla_2020_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5390369753137152/",
          "proposal_id": null,
          "short_description": "Push Health is a new Dashboard being built inside Treeherder to determine if a push is good based on   calculations of Tasks and Tests success rate...",
          "slug": "treeherder",
          "status": "completed",
          "student_name": "Suyash Salampuria",
          "student_profile": null,
          "tags": [
            "ai",
            "ui",
            "ux"
          ],
          "title": "Treeherder"
        },
        {
          "code_url": "https://gist.github.com/Kriyszig/bd10759269d0195b78b156d5bb223701",
          "description": "<p>Cascading Style Sheets is by far the most powerful tool in a web developer's toolbox. It helps you style the website exactly the way you imagined it to be. But all browser's aren't designed the same and some CSS rules might end up breaking your site on certain platforms.\nWith the introduction of Firefox 76, came a new panel in inspector - The Compatibility Panel. This panel informs one of the dangerous CSS rules in the website's stylesheet and tells them exactly on which browsers, they may end up being a nuisance on.\nThe Inline CSS Warnings helps developers detect these issues on the fly, putting addition information of the problem, just a click away.\nBuilding tools to help you instill confidence in your product - That is what the Firefox DevTools Community is working hard at.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2020_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5065255358562304/",
          "proposal_id": null,
          "short_description": "Cascading Style Sheets is by far the most powerful tool in a web developer's toolbox. It helps you style the website exactly the way you imagined it...",
          "slug": "inline-browser-compatibility-warning-for-css-properties",
          "status": "completed",
          "student_name": "Prateek Nayak",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "ui"
          ],
          "title": "Inline Browser Compatibility Warning For CSS Properties"
        },
        {
          "code_url": "https://docs.google.com/spreadsheets/d/1kLIqJxgtgAjw0wd9p4SuFPcan6GgbaKjVRRiXqySsss/edit?usp=sharing",
          "description": "<p>Writing docs for Firefox's in-tree source docs can be time consuming and difficult. Making the process of contributing to the in-tree docs an enjoyable experience is very important so that more people would contribute to the source docs. Implementing a renderer at review phase would be one of the steps toward that goal since reviewers don’t have to build the docs locally and just access s3 to review the diff and make the code-test-commit-review cycle shorter.</p>\n<p>With MDN de-prioritizing build and workflow docs, we need a suitable replacement for all of Firefox's contribution and workflow documentation. Documentation has been moved to in-tree which offers great advantages such as that it can be updated along with the source. Migrating documentation from MDN is a tedious process done manually since there are no mechanisms to make the migration easier. With the help of a web crawler and pandoc, we could make a script to use the crawler to extract all the documentation from the MDN site and convert it to Rst files that can be added to the in-tree docs.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2020_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5118040003313664/",
          "proposal_id": null,
          "short_description": "Writing docs for Firefox's in-tree source docs can be time consuming and difficult. Making the process of contributing to the in-tree docs an...",
          "slug": "mdn-to-in-tree-migration-tool",
          "status": "completed",
          "student_name": "Emil Farisan Singgih",
          "student_profile": null,
          "tags": [
            "web",
            "ui"
          ],
          "title": "MDN to in-tree migration tool"
        },
        {
          "code_url": "https://gist.github.com/atiqueahmedziad/7fd191a88c71c5b09636169bdc8b4d67",
          "description": "<p>Extensions do most of their work invisibly from users, so extension activity is a complete mystery to most users, even to advanced ones.</p>\n<p>The \"Extension Activity Monitor\" project is about developing a privileged extension for Firefox that will monitor the activities of other installed extensions and present those information to the user. It will provide more transparency which could help to increase the reliability of abuse reporting and accountability on developers, as well as providing an additional useful tool to aid investigating bugs in the extensions or in the Firefox WebExtensions internals.</p>\n",
          "difficulty": "advanced",
          "id": "proj_mozilla_2020_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/4560363867078656/",
          "proposal_id": null,
          "short_description": "Extensions do most of their work invisibly from users, so extension activity is a complete mystery to most users, even to advanced ones.\nThe...",
          "slug": "extension-activity-monitor",
          "status": "completed",
          "student_name": "Md Atique Ahmed Ziad",
          "student_profile": null,
          "tags": [
            "web",
            "ai"
          ],
          "title": "Extension Activity Monitor"
        },
        {
          "code_url": "https://github.com/fiji-flo/bikeshed-rs/",
          "description": "<p>The goal of this project is to offer a faithful rewrite of <a href=\"https://github.com/tabatkins/bikeshed\" target=\"_blank\">bikeshed</a>, a tool used for generating many standards, in <a href=\"https://www.rust-lang.org/\" target=\"_blank\">Rust</a>.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2020_009",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/4824688972267520/",
          "proposal_id": null,
          "short_description": "The goal of this project is to offer a faithful rewrite of bikeshed, a tool used for generating many standards, in Rust.",
          "slug": "bikeshedrs",
          "status": "completed",
          "student_name": "Junyu Xian",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Bikeshed.rs"
        },
        {
          "code_url": "https://github.com/xiph/rav1e/issues?q=author%3Aurhengulas+",
          "description": "<p><a href=\"https://github.com/xiph/rav1e\" target=\"_blank\">Rav1e</a> is an AV1 encoder that is fast enough to be used in videoconference scenarios on x86_64. This project will implement <a href=\"https://github.com/WebAssembly/simd\" target=\"_blank\">wasm-simd</a> support in rav1e to make viable as in-browser encoder.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2020_010",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/6041627891597312/",
          "proposal_id": null,
          "short_description": "Rav1e is an AV1 encoder that is fast enough to be used in videoconference scenarios on x86_64. This project will implement wasm-simd support in rav1e...",
          "slug": "performance-improvements-to-rav1e-wasm-target",
          "status": "completed",
          "student_name": "Johann Hemmann",
          "student_profile": null,
          "tags": [
            "ios",
            "web"
          ],
          "title": "Performance improvements to rav1e WASM target"
        },
        {
          "code_url": "https://blog.servo.org/2020/08/30/gsoc-webgpu/",
          "description": "<p>The aim of this project is to implement WeGPU API on Servo to a point where basic examples can be simulated. It would also involve covering a fair amount of conformance test suite, and profiling and benchmarking the implemented WebGPU against the existing WebGL implementation on Servo.</p>\n",
          "difficulty": null,
          "id": "proj_mozilla_2020_011",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/4869376697696256/",
          "proposal_id": null,
          "short_description": "The aim of this project is to implement WeGPU API on Servo to a point where basic examples can be simulated. It would also involve covering a fair...",
          "slug": "servo-webgpu",
          "status": "completed",
          "student_name": "Kunal Mohan",
          "student_profile": null,
          "tags": [
            "web",
            "api",
            "ai",
            "ui"
          ],
          "title": "Servo-WebGPU"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2020/organizations/5169365365817344/"
    },
    "year_2021": null,
    "year_2022": null,
    "year_2023": null,
    "year_2024": null,
    "year_2025": null
  },
  "first_time": false,
  "contact": {
    "email": "mhoye@mozilla.com",
    "guide_url": null,
    "ideas_url": null,
    "irc_channel": "https://chat.mozilla.org/#/welcome",
    "mailing_list": "https://lists.mozilla.org/listinfo"
  },
  "social": {
    "blog": "https://blog.mozilla.org/",
    "discord": null,
    "facebook": null,
    "github": null,
    "gitlab": null,
    "instagram": null,
    "linkedin": null,
    "mastodon": null,
    "medium": null,
    "reddit": null,
    "slack": null,
    "stackoverflow": null,
    "twitch": null,
    "twitter": "https://twitter.com/mozilla",
    "youtube": null
  },
  "meta": {
    "version": 1,
    "generated_at": "2026-01-25T15:28:53.626Z"
  }
}