{
  "id": "692251dd53dd9d7326d33e35",
  "slug": "national-resource-for-network-biology-nrnb",
  "name": "National Resource for Network Biology (NRNB)",
  "category": "Science and medicine",
  "description": "Developing open source tools for network biology",
  "image_url": "https://summerofcode.withgoogle.com/media/org/national-resource-for-network-biology-nrnb/5uobjboaxnzrxyoj-360.png",
  "img_r2_url": "https://pub-268c3a1efc8b4f8a99115507a760ca14.r2.dev/national-resource-for-network-biology-nrnb.webp",
  "logo_r2_url": null,
  "url": "https://nrnb.org/gsoc.html",
  "active_years": [
    2016,
    2017,
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "first_year": 2016,
  "last_year": 2025,
  "is_currently_active": true,
  "technologies": [
    "python",
    "javascript",
    "java",
    "c++",
    "php",
    "c",
    "html",
    "web",
    "r",
    "rest",
    "xml",
    "json",
    "css"
  ],
  "topics": [
    "web",
    "bioinformatics",
    "biology",
    "systems biology",
    "dataviz",
    "database",
    "graphics",
    "ui/ux",
    "network biology",
    "data visualization",
    "web applications",
    "network analysis",
    "data modeling",
    "web application",
    "data science",
    "scientific computing",
    "machine learning"
  ],
  "total_projects": 119,
  "stats": {
    "avg_projects_per_appeared_year": 11.9,
    "projects_by_year": {
      "year_2016": 15,
      "year_2017": 20,
      "year_2018": 10,
      "year_2019": 11,
      "year_2020": 15,
      "year_2021": 13,
      "year_2022": 8,
      "year_2023": 8,
      "year_2024": 11,
      "year_2025": 8
    },
    "students_by_year": {
      "year_2016": 15,
      "year_2017": 20,
      "year_2018": 10,
      "year_2019": 11,
      "year_2020": 15,
      "year_2021": 13,
      "year_2022": 8,
      "year_2023": 8,
      "year_2024": 11,
      "year_2025": 8
    },
    "total_students": 112
  },
  "years": {
    "year_2016": {
      "num_projects": 15,
      "projects": [
        {
          "code_url": "https://supunarunoda.github.io/",
          "description": "<p>Implement two algorithms which have the ability to do dimensional reduction in cluster Network. Principal Coordinate Analysis and t-Distributed Stochastic Neighbor Embedding in clusterMaker2 which runs on Cytoscape software platform.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2016_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/6408186768654336/",
          "proposal_id": null,
          "short_description": "Implement two algorithms which have the ability to do dimensional reduction in cluster Network. Principal Coordinate Analysis and t-Distributed...",
          "slug": "principal-coordinate-analysis-and-t-distributed-stochastic-neighbor-embedding-in-clustermaker2",
          "status": "completed",
          "student_name": "Supun Arunoda",
          "student_profile": null,
          "tags": [],
          "title": "Principal Coordinate Analysis and t-Distributed Stochastic Neighbor Embedding in clusterMaker2"
        },
        {
          "code_url": "https://github.com/jooolia/gsoc_Rcy3_vignettes/blob/master/blog_post_drafts/final_work_submission.md",
          "description": "<p>Many scientists use networks to visualize complex relationships among species, people, cities, genes, proteins or other subjects. Cytoscape is open-source software that is popular (6350 citations as of March 22nd 2016) for the visualization of networks. As scientists work with increasing amounts of data and the expectation of reproducible computational analyses increases, many users of network visualization programs are turning to scripted analyses instead of using a graphical user interface (GUI). \nCytoscape has an application programming interface (API) that uses the Representational State Transfer (REST) to send information between Cytoscape and different programs. The package RCy3  allows users to connect R to Cytoscape allowing them to script their visualizations. There are two ways the package would be enhanced: 1) by enabling the use of Cytoscape plugins programmatically through their API, and  2) by creating robust walkthroughs of the code necessary to use RCy3 and other packages for reproducible network visualizations. The walkthroughs would include approaches relevant to many Cytoscape users and incorporate the programmatic use of plugins with developed function.</p>\n",
          "difficulty": "advanced",
          "id": "proj_national-resource-fo_2016_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/6574250336976896/",
          "proposal_id": null,
          "short_description": "Many scientists use networks to visualize complex relationships among species, people, cities, genes, proteins or other subjects. Cytoscape is...",
          "slug": "enhance-vignettes-and-plugin-use-for-r-package-rcy3-for-network-manipulation-using-cytoscape",
          "status": "completed",
          "student_name": "jooolia",
          "student_profile": null,
          "tags": [
            "api",
            "ui"
          ],
          "title": "Enhance vignettes and plugin use for R package RCy3 for network manipulation using Cytoscape"
        },
        {
          "code_url": "https://docs.google.com/document/d/1WlhdTuwfT8mUiEiklrkjNwFQwgDy9xJgbmGDFTbUQOg/edit?usp=sharing",
          "description": "<p>The main goal of this project is to provide a new network view which is capable of visualizing curated TCGA pathways that are more attractive and more intuitive for the biologists with better analysis facilities using rich data of cBioPortal.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2016_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/6606672508223488/",
          "proposal_id": null,
          "short_description": "The main goal of this project is to provide a new network view which is capable of visualizing curated TCGA pathways that are more attractive and...",
          "slug": "visualizing-genomic-alterations-in-tcga-cancer-pathways-in-cbioportal",
          "status": "completed",
          "student_name": "Istemi Bahceci",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Visualizing genomic alterations in TCGA cancer pathways in cBioPortal"
        },
        {
          "code_url": "https://docs.google.com/document/d/1BLOgtJ7nppEJuQ5PAxrdRXnXDWXqLeL_IMTcl5L0BHA/edit?usp=sharing",
          "description": "<p>SBGNViz.js is an open source web application based on Cytoscape.js to visualize the pathway models represented by SBGN Process Description Notation . Its current version can visualize SBGN-PD maps and it is getting equipped with editor features. In this project, I propose to develop several key extensions to  the editing capabilities of SBGNViz.js. Contributions that I propose to make are mentioned in a detailed way in the problem description section of my proposal.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2016_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5746664899870720/",
          "proposal_id": null,
          "short_description": "SBGNViz.js is an open source web application based on Cytoscape.js to visualize the pathway models represented by SBGN Process Description Notation ....",
          "slug": "improving-web-based-sbgn-editor-sbgnvizjs",
          "status": "completed",
          "student_name": "Metin Can Siper",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "ui"
          ],
          "title": "Improving Web Based SBGN Editor SBGNViz.js"
        },
        {
          "code_url": "http://hgrabski.blogspot.am/2016/08/the-end.html",
          "description": "<p>Since SBML Level 3 is being developed as a modular format with optional SBML Level 3 packages are available to extend the focus of the core SBML representation. Deviser is a new code generation system developed to facilitate the development of SBML L3 packages by helping to automate  the generation of specifications, UML diagrams and library code. The code generator currently targets libSBML only. The goal is to extend Deviser's code generator to produce Java code that can be integrated into JSBML, the pure Java API library for SBML. This will allow Deviser to target both libSBML and JSBML. By contributing to Deviser and also being an active spectator, I hope to develop the skills I already have  and  also incorporate some new ones.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2016_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5499817291677696/",
          "proposal_id": null,
          "short_description": "Since SBML Level 3 is being developed as a modular format with optional SBML Level 3 packages are available to extend the focus of the core SBML...",
          "slug": "java-support-for-deviser-a-code-generation-system-for-sbml-libraries",
          "status": "completed",
          "student_name": "Hovakim Grabski",
          "student_profile": null,
          "tags": [
            "java",
            "api",
            "ml",
            "ai"
          ],
          "title": "Java support for Deviser, a code generation system for SBML libraries"
        },
        {
          "code_url": "https://gist.github.com/MridulS/8b062bc067c323fb3ca18d85c648c690",
          "description": "<p>GraphSpace is a tool for storing, sharing, and visualising graphs in order to help\ncollaborative research. Users can upload graphs and share it with other collaborators. Most\nof its users work in computational biology. One may represent biological interactions through\nthe use of nodes and edges. For example, a node may be thought of as a protein. If there\nexists an edge between two nodes in the graph, this may indicate that the two\nproteins interact.Currently GraphSpace can import JSON and .cyjs (Cytsocape JSON) files.\nIt has a REST API to allow automatic uploads of multiple files in these formats.\nThe overall goal of this project is to expand the user communities for GraphSpace by\nextending its import and export capabilities.The first part of this project will focus on adding\nimport (and export) functionality for various graph file formats like GraphML, GPML, BioPAX\nto allow a much wider set of graphs to be imported into GraphSpace. The second part of this\nproject will deal with enhancing the Cytoscape JSON parser such that it can store the\nvarious properties of the layout like x, y coordinates, color, shape, etc. The third part of this\nproject will be to add a PDF exporter.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2016_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5313526843310080/",
          "proposal_id": null,
          "short_description": "GraphSpace is a tool for storing, sharing, and visualising graphs in order to help\ncollaborative research. Users can upload graphs and share it with...",
          "slug": "import-graphs-in-multiple-formats-and-cytoscape-files-into-graphspace",
          "status": "completed",
          "student_name": "MridulS",
          "student_profile": null,
          "tags": [
            "api",
            "ml"
          ],
          "title": "Import graphs in multiple formats and Cytoscape files into GraphSpace"
        },
        {
          "code_url": "https://github.com/sbmlteam/jsbml/commits?author=anfark",
          "description": "<p>The JSBML library is a powerful Java library that gives the use a easy possibility to read, write and manipulate SBML files with Java. Because there are many different levels and versions of SBML and much more software which is using it, it is often needed to secure the quality of the interchanged data. SBML provides a well maintained specification for SBML files and even a online validator to approve your own documents. JSBML actually is using this online validator for his validation process. But that means JSBML software, which want to check their created or loaded files, need internet connection to do the test.\nThis project is about implementing a completely new validation system to JSBML, written in pure Java. The main focus here lays on a easy usability and good modularity to support future levels and versions of SBML too.</p>\n",
          "difficulty": "beginner",
          "id": "proj_national-resource-fo_2016_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5619423540936704/",
          "proposal_id": null,
          "short_description": "The JSBML library is a powerful Java library that gives the use a easy possibility to read, write and manipulate SBML files with Java. Because there...",
          "slug": "gsoc-jsbml-validation-system",
          "status": "completed",
          "student_name": "Roman Schulte",
          "student_profile": null,
          "tags": [
            "java",
            "ml",
            "ai"
          ],
          "title": "GSoC: JSBML Validation System"
        },
        {
          "code_url": "https://github.com/SBRG/EscherConverter/commits/master?author=devkhan",
          "description": "<p>Escher is quickly growing in popularity. As Escher currently uses JSON as its data and layout\nrepresentation format, and most of the community powered systems biology applications use SBML\nand SBGN-ML for representation of networks in biology, it is necessary to have seamless conversion\nbetween these two. Right now, Escher's JSON formatted data can be converted to these standards\nusing EscherConverter, but the reverse is not possible. Because of this layout has to be manually\ndefined by someone as you cannot import it from some other format. This project aims at filling that gap by providing a tool that can convert SBML (Layout Extension) and SBGN-ML to Escher compatible JSON.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2016_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/6218743277420544/",
          "proposal_id": null,
          "short_description": "Escher is quickly growing in popularity. As Escher currently uses JSON as its data and layout\nrepresentation format, and most of the community...",
          "slug": "sbgn-ml-and-sbml-to-escher-converter",
          "status": "completed",
          "student_name": "Devesh Khandelwal",
          "student_profile": null,
          "tags": [
            "ml",
            "ai",
            "ui"
          ],
          "title": "SBGN-ML and SBML to Escher Converter"
        },
        {
          "code_url": "https://docs.google.com/document/d/13cFXIG7pEFwkkVOzOlAC1unbrkXU4XA7SCbtzkDsfhA/edit?usp=sharing",
          "description": "<p>CellDesigner is a modeling/simulating software capable of visualizing, modeling, and simulating gene­regulatory and biochemical networks. The key characteristics of CellDesigner are the solidly defined and comprehensive graphical representation of network models and systems biology markup language(SBML) as a model­ describing basis. However, these two characteristics contradict each other. SBML has a standardized definition for layout of network diagram. Before this was standardized, CellDesigner has created its own which is stored in its own way. In the past GSoC project, CellDesigner plug­in that enables to export SBML Layout. To further expand from this software, I will implement a standalone software that converts CellDesigner annotation to SBML Layout and vice versa. It will allow the user to convert CellDesigner annotation into SBML format without CellDesigner. Also the same layout will be held in CellDesigner even when a model is created with another software (i.e. SBML model with Layout). From above, implementing this software will provide interconvertibility between CellDesigner and SBML Layout and remove redundancy for users.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2016_009",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/4703966562615296/",
          "proposal_id": null,
          "short_description": "CellDesigner is a modeling/simulating software capable of visualizing, modeling, and simulating gene­regulatory and biochemical networks. The key...",
          "slug": "interconvertible-layout-program-for-celldesigner",
          "status": "completed",
          "student_name": "Kaito",
          "student_profile": null,
          "tags": [
            "ml"
          ],
          "title": "Interconvertible Layout program for CellDesigner"
        },
        {
          "code_url": "http://www.async.ece.utah.edu/~tramyn/gsoc/",
          "description": "<p>In the systems biology field, there exists many different standards, with each standard serving for a different purpose. BioPax is a standard used for the representation of biological pathways. This standard has been traditionally used to describe structural and basic qualitative behavioral aspects of a biological design. While BioPax represents qualitative models, there are standards that describe quantitative models, namely the Systems Biology Markup Language (SBML). SBML is a standard for the representation of mathematical models of biological systems. SBML is built around core constructs that describe quantitative processes such as reactions. However, there are package extensions that allow for additional features. The Qualitative Models (qual) extension specifically allows SBML to describe qualitative models, which makes interconversion between both formats possible.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2016_010",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/6492203308285952/",
          "proposal_id": null,
          "short_description": "In the systems biology field, there exists many different standards, with each standard serving for a different purpose. BioPax is a standard used...",
          "slug": "interconversion-between-the-systems-biology-modeling-formats-sbml-and-biopax",
          "status": "completed",
          "student_name": "tramy",
          "student_profile": null,
          "tags": [
            "react",
            "ml",
            "ui"
          ],
          "title": "Interconversion between the systems biology modeling formats SBML and BioPAX"
        },
        {
          "code_url": "https://github.com/ibestvina/multithread-centiscape/commits/master?author=ibestvina",
          "description": "<p>CentiScaPe is a Cytoscape application used to calculate a number of different node centralities in a network. All of the centrality calculating algorithms are currently implemented in a single thread, while most of them would be suitable for parallelization, which would considerably increase their speed, thus consistently improving the performance of the CentiScaPe.<br>\nMain goal of this project is to parallelize and optimize the All-Pairs-Shortest-Path problem solver upon which most of the centralities rely. Two methods are considered: all-pairs Dijsktra's algorithm, and Floyd-Warshall algorithm, with their strengths and weaknesses compared. Apart from the parallelization, some other optimizations are described.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2016_011",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/6523918420541440/",
          "proposal_id": null,
          "short_description": "CentiScaPe is a Cytoscape application used to calculate a number of different node centralities in a network. All of the centrality calculating...",
          "slug": "multithread-centiscape-55",
          "status": "completed",
          "student_name": "ibestvina",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Multithread Centiscape (#55)"
        },
        {
          "code_url": "https://github.com/ashishtiwarigsoc/command-dialog/commits/develop",
          "description": "<p>Cytoscape is a general purpose, open source software platform for complex network data integration, analysis and visualization.  Cytoscape’s core implements generic network integration and visualization capabilities through its core apps and can be extended to suite specific use-cases by developing Cystoscape apps using its extensible plugin architecture.</p>\n<p>While Cytoscape’s graphical user interface is very useful for interactive network data integration and visualization, it may not be the best choice for workflows with hundreds if not thousands of network data files. Cytoscape includes the commandTool app to provide a command-line interface to Cytoscape using the Commands API. Cytoscape apps can register commands using annotations, and these commands will then be available in commandTool. Users can execute commands (eg importing networks from file or importing tables) using Command Line Dialog and can see the result in the Reply Log. The commandTool can also execute scripts (each line is  a set of commands) and provide help about command classes and namespaces using the Command API.</p>\n",
          "difficulty": "advanced",
          "id": "proj_national-resource-fo_2016_012",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/4870044894887936/",
          "proposal_id": null,
          "short_description": "Cytoscape is a general purpose, open source software platform for complex network data integration, analysis and visualization.  Cytoscape’s core...",
          "slug": "cytoscape-command-line-scripting-enhancements",
          "status": "completed",
          "student_name": "Ashish Tiwari",
          "student_profile": null,
          "tags": [
            "api",
            "ai",
            "ui"
          ],
          "title": "Cytoscape command line scripting enhancements"
        },
        {
          "code_url": "https://drive.google.com/open?id=1hrBy2_eCS7JGOI7vj2w_2dD9zYrFnpCgnH13bxsKuEM",
          "description": "<p>TOR-IBIN will be an online resource for gathering and storing published interface-based protein-protein interactions (PPI). TOR-IBIN aims to make these networks available in a central repository with a unified format. The web interface will have a comprehensive search functions and provide options to download the integrated data in standard formats. The interface will also have a visualization module to visualize PPI data as a network, annotated with features of the predicted PPIs using the Cytoscape.js network visualization library.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2016_013",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5870068437090304/",
          "proposal_id": null,
          "short_description": "TOR-IBIN will be an online resource for gathering and storing published interface-based protein-protein interactions (PPI). TOR-IBIN aims to make...",
          "slug": "the-online-resource-for-interface-based-interaction-networks-tor-ibin-web-interface",
          "status": "completed",
          "student_name": "MilesGSOC",
          "student_profile": null,
          "tags": [
            "web",
            "ai"
          ],
          "title": "The Online Resource for Interface Based Interaction Networks (TOR-IBIN) Web Interface"
        },
        {
          "code_url": "https://github.com/cytoscape/cytoscape.js-tutorials/commits?author=josephst",
          "description": "<p>Tutorials serve as an invaluable way to familiarize oneself with new software. Cytoscape.js currently provides demos but lacks tutorials to tie together many ideas into a fully realized implementation. This project entails writing comprehensive but easy-to-understand tutorials which demonstrate the power of Cytoscape.js, both to those new to the project and to those wishing to tackle more ambitious projects with Cytoscape.js. I envision a set of tutorials moving from a level just beyond the demos, to a tutorial that details the creation of both mobile and web apps. \nBased on the current demos, I feel that there are enough examples of possible Cytoscape.js based webapps but each needs more documentation. There is very little guidance provided to new users as to why each demo works the way it does. To use a car metaphor, it seems like the demos are oriented more for going from 60 - 100 mph than 0-60. \nAs mentioned in the provided description, each demo exhibits a single concept rather than tying them all together. Tutorials will tie together the disparate demos into more powerful (while still easy to understand) examples of Cytoscape.js</p>\n",
          "difficulty": "beginner",
          "id": "proj_national-resource-fo_2016_014",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5906695918190592/",
          "proposal_id": null,
          "short_description": "Tutorials serve as an invaluable way to familiarize oneself with new software. Cytoscape.js currently provides demos but lacks tutorials to tie...",
          "slug": "tutorials-for-cytoscapejs",
          "status": "completed",
          "student_name": "joseph.stahl",
          "student_profile": null,
          "tags": [
            "web",
            "mobile",
            "ai",
            "ui"
          ],
          "title": "Tutorials for Cytoscape.js"
        },
        {
          "code_url": "https://gist.github.com/zoexi/ec20705f6669882039b1ef8b05aaa4c1",
          "description": "<p>Cytoscape.js is a graph theory and networks library focused on providing built-in, rich and performant graph models for analysis and data visualization. This project aims at expanding Cytoscape.js’s data analysis functionalities by offering several of the most commonly used clustering algorithms, including the k-means, hierarchical, affinity propagation, Markov cluster algorithms and more, via extensions that can be easily incorporated into the default library. Such extensions, written in a user friendly and accessible manner, will help expand the usage of Cytoscape.js, as clustering algorithms are applicable in a wide variety of fields, from bioinformatics to machine learning, data science, etc.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2016_015",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5141143767482368/",
          "proposal_id": null,
          "short_description": "Cytoscape.js is a graph theory and networks library focused on providing built-in, rich and performant graph models for analysis and data...",
          "slug": "extending-cytoscapejs-addition-of-clustering-algorithms",
          "status": "completed",
          "student_name": "Zhaoyuan Zoe Xi",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Extending Cytoscape.js: Addition of Clustering Algorithms"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2016/organizations/6599328919453696/"
    },
    "year_2017": {
      "num_projects": 20,
      "projects": [
        {
          "code_url": "https://github.com/NRNB-GSoC2017-SBML2SBGNML-Converters/SBML2SBGNML/tree/GSoC_2017_final_submission",
          "description": "<p>Systems biology researchers study the network of molecular interactions within a biological system and publish the deduced models in a diagram format. Many XML variants were developed to represent diagrams, including SBML and SBGN. However, SBML can represent much more complex models than SBGN. For example, the SBML qual extension package can mechanistically describe events in its models, such as the relationship that A activates C, B activates C, but A and B cannot activate C at the same time. The SBGN Activity Flow language can describe a similar relationship, but the relationship is represented visually only, and therefore is not stored in its model. The incompatibilities between SBML and SBGN prevent direct comparison between the models.</p>\n<p>In this project, I will build tools to support bidirectional conversion between SBML and SBGN, which acts as a machinery to map between SBGN-specific and SBML-specific information. SBML Layout package will be used to represent SBML diagrams, and the SBML qual package used to store the logic model.</p>\n<p>Blog: <a href=\"http://haleyyew-gsoc.blogspot.ca/\" target=\"_blank\">http://haleyyew-gsoc.blogspot.ca/</a></p>\n<p>Repository: <a href=\"https://github.com/NRNB-GSoC2017-SBML2SBGNML-Converters/SBML2SBGNML\" target=\"_blank\">https://github.com/NRNB-GSoC2017-SBML2SBGNML-Converters/SBML2SBGNML</a></p>\n",
          "difficulty": "advanced",
          "id": "proj_national-resource-fo_2017_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6428665978028032/",
          "proposal_id": null,
          "short_description": "Systems biology researchers study the network of molecular interactions within a biological system and publish the deduced models in a diagram...",
          "slug": "interconversion-of-the-sbml-and-sbgn-modelling-languages-using-semantics-of-logic",
          "status": "completed",
          "student_name": "Haoran Yu",
          "student_profile": null,
          "tags": [
            "ml",
            "ui"
          ],
          "title": "Interconversion of the SBML and SBGN Modelling Languages using Semantics of Logic"
        },
        {
          "code_url": "https://docs.google.com/document/d/1Le_tQxiBct3Z6wIvD7azYkh5XjpCOvYEaEb-rV1ifSI/edit?usp=sharing",
          "description": "<p>Traversal-based graph algorithms are good at extracting “subgraphs of interest” when applied to large networks. However, applying known algorithms may not be enough every time to extract the useful information. Some specialized queries may be helpful in this sence to extract more useful or more specific information. Actually, these types of queries are already implemented inside the PATIKAweb software that is a result of the study done by Doğrusöz et al. in Java programming language. The aim of this project is to move these implementations into the common use of developers by making an extension to Cytoscape.js, which is a commonly used graph drawing library written in Javascript. Cytoscape.js already includes some basic graph traversal algorithms such as DFS, BFS, Dijkstra, Bellman-Ford, Kruskal etc., but I believe that these specialized queries will provide a good functionality to be used in not only in biological networks, but also in other types of networks. With the advantage of compound node support in Cytoscape.js, these specialized traversal algorithms will also be easily applied to the large networks with compound node content.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2017_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5725721968246784/",
          "proposal_id": null,
          "short_description": "Traversal-based graph algorithms are good at extracting “subgraphs of interest” when applied to large networks. However, applying known algorithms...",
          "slug": "cytoscapejs-extension-for-querying-large-networks",
          "status": "completed",
          "student_name": "Hasan Balcı",
          "student_profile": null,
          "tags": [
            "java",
            "javascript",
            "web",
            "ai"
          ],
          "title": "Cytoscape.js Extension for Querying Large Networks"
        },
        {
          "code_url": "https://github.com/BoyDun/IBW_SBML_SBOL_Export",
          "description": "<p>The Infobiotics Workbench (IBW) is a synthetic biology design tool with three major functionalities: stochastic simulations, which mimic the procession of complex biological pathways; verification of simulation rulesets; and biomatter compilation. Its simulations are driven by designs written in the domain-specific Infobiotics Language (IBL), which contains data that is then sent to the Biocompiler to be built into a Biocompiler Model internal structure.<br>\nCurrently, IBW offers limited support for two standard biological languages, the functionality-based Systems Biology Markup Language (SBML) and the design-based Synthetic Biology Open Language (SBOL), a common medium of exchange for synthetic devices. While SBML is made use of by the simulation aspect of IBW, the design-based SBOL is used by the Biocompiler as a format to write its compiled design into. This project aims to enhance the Biocompiler’s ability to export and import SBOL and SBML. If IBW’s capacity to work with these two biological modelling standards is improved, its accessibility to computational biologists around the world would increase dramatically. Hence, this project will enable this integration.</p>\n",
          "difficulty": "advanced",
          "id": "proj_national-resource-fo_2017_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/4988269775290368/",
          "proposal_id": null,
          "short_description": "The Infobiotics Workbench (IBW) is a synthetic biology design tool with three major functionalities: stochastic simulations, which mimic the...",
          "slug": "extending-the-ibw-biocompilation-interface-with-sbol-and-sbml-importexport-capabilities",
          "status": "completed",
          "student_name": "bodun",
          "student_profile": null,
          "tags": [
            "ml",
            "ai",
            "ui"
          ],
          "title": "Extending the IBW Biocompilation Interface with SBOL and SBML Import/Export Capabilities"
        },
        {
          "code_url": "https://github.com/fgoebels/PiType2.0",
          "description": "<p>PiType is an already existing protein-protein interaction classifying tool created by my mentor.  It currently exists as both a web app and a standalone software package.  PiType is designed to classify proteins within a network into different categories: Mutually Exclusive (ME) vs Simultaneously Possible (SP) and Obligate (O) vs Non-Obligate (NO).  To do this, PiType takes a series of proteins within a network, analyses them to determine which of the above categories they fit into, and outputs that information as a table.  Because of the current input and output format, it is difficult for biologists to analyze and interpret the data. Cytoscape is open source software that provides numerous modules for studying and visualizing protein networks, and as such is the perfect tool to use for PiType. My project over the summer will thus be to create a Cytoscape plugin app using PiType’s already existent algorithms, to create a visualization tool that provides an intuitive interface for biologists.  By taking the base features of PiType, and implementing them as a Cytoscape plugin, my project will widen the number of potential users, and the utility of the app.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2017_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5058485242822656/",
          "proposal_id": null,
          "short_description": "PiType is an already existing protein-protein interaction classifying tool created by my mentor.  It currently exists as both a web app and a...",
          "slug": "pitype-a-protein-interaction-prediction-cytoscape-app",
          "status": "completed",
          "student_name": "MWrana",
          "student_profile": null,
          "tags": [
            "web",
            "ui"
          ],
          "title": "PiType: A Protein Interaction Prediction Cytoscape App"
        },
        {
          "code_url": "https://docs.google.com/document/d/15o8IdyfAtjLDhsBFRGPCoykA-vDae2FxckyFachZaak/",
          "description": "<p>SBGNViz is a Cytoscape.js based library for viewing biological maps in Systems Biology Graphical Notation (SBGN) notation. ChiSE is a library based on SBGNViz to add editing  facilities  for  construction  of  SBGN  maps  or  modification  of  existing  ones. The aim of this project  is  to  design  and  implement  new  features  for  the  ChiSE editor library as well as improving existing ones.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2017_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5082708053065728/",
          "proposal_id": null,
          "short_description": "SBGNViz is a Cytoscape.js based library for viewing biological maps in Systems Biology Graphical Notation (SBGN) notation. ChiSE is a library based...",
          "slug": "improvements-in-tool-for-curating-biological-maps-in-sbgn",
          "status": "completed",
          "student_name": "Ilkin Safarli",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Improvements in Tool for Curating Biological Maps in SBGN"
        },
        {
          "code_url": "https://github.com/ZhangMenghe/PokeMeow-Renderer",
          "description": "<p>Cytoscape is an open source software platform for visualizing molecular interaction networks and biological pathways. It integrates these networks with annotations, gene expression profiles and other state data. Visualizing a complex network requires a great deal of calculations, thus takes a long time to render large networks with original software-based engine. This project aims to replace the original Cytoscape-2D engine with one taking advantage of high speed GPU calculation and delivering much better efficiency.\nThe proposed project’s goal is to build an optimized renderer that works faster with rendering a large network, has the ability to draw more nodes and can be displayed better on high-resolution screens based on previous work. Additionally, as the low level of Cytoscape System, the new renderer should be compatible with the system while easy to maintain and test.</p>\n",
          "difficulty": "beginner",
          "id": "proj_national-resource-fo_2017_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5315142019448832/",
          "proposal_id": null,
          "short_description": "Cytoscape is an open source software platform for visualizing molecular interaction networks and biological pathways. It integrates these networks...",
          "slug": "opengl-accelerated-renderer-for-cytoscape-3",
          "status": "completed",
          "student_name": "MENGHE ZHANG",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "OpenGL-accelerated Renderer for Cytoscape 3"
        },
        {
          "code_url": "http://jcbwndsr.com/gsoc-final-overview/",
          "description": "<p>WikiPathways is an open and collaborative platform for sharing biological pathway information. It features an interactive diagram that aids the user in understanding the pathway. However, the educational capabilities of these diagrams can be improved. Studies show that when information is given in steps, with dynamic visual\naids, audience attention and understanding increases dramatically. Ideas presented graphically, as a “story\", are far easier to comprehend and remember than static information. Thus, step-by-step presentations of pathway diagrams would dramatically enhance the educational capabilities of WikiPathways.</p>\n<p>In this proposal, a new \"Pathway Presenter\" is outlined that will enable biologists to create dynamic presentations of the pathways in WIkiPathways. This will allow for the creation of succinct and easily comprehensible diagrams that can be shared and embedded across multiple platforms.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2017_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5336316745089024/",
          "proposal_id": null,
          "short_description": "WikiPathways is an open and collaborative platform for sharing biological pathway information. It features an interactive diagram that aids the user...",
          "slug": "wikipathways-pathway-presenter",
          "status": "completed",
          "student_name": "jcbwndsr",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "WikiPathways Pathway Presenter"
        },
        {
          "code_url": "https://github.com/ibestvina/centiscape-net-quantity-information.git",
          "description": "<p>CentiScaPe is a Cytoscape application used to calculate a number of different node centralities of an optionally weighted network, both directed and undirected, as well as plot the results by using real and normalized values in different plots. Several centrality measures are available: degree, average shortest path, eccentricity, closeness, betweenness, centroid, stress, radiality, eigenvector, edge betweenness, bridging centrality, etc.</p>\n<p>This project aims to implement a brand new centrality measure based on Shannon entropy called Network Quantity Information. This measure aims to quantify the entropy of a given network, by firstly calculating the entropy of its nodes and edges which can then be observed as a type of centrality measure. Once all the node and edge centralities are obtained, we can derive from them the complexity of the whole network, which provides us not only with an interesting “one-value” description of the network, but also gives us the ability to compare multiple networks, or multiple parts of the same network.</p>\n",
          "difficulty": "advanced",
          "id": "proj_national-resource-fo_2017_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5576937992880128/",
          "proposal_id": null,
          "short_description": "CentiScaPe is a Cytoscape application used to calculate a number of different node centralities of an optionally weighted network, both directed and...",
          "slug": "implement-network-quantity-information-measure-in-centiscape-64",
          "status": "completed",
          "student_name": "Ivan Bestvina",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Implement Network Quantity Information measure in CentiScaPe #64"
        },
        {
          "code_url": "https://github.com/PathVisio/libGPML/blob/master/gsoc2017.md",
          "description": "<h3>libGPML</h3>\n<p>Currently it is required to include the whole <a href=\"https://github.com/PathVisio/\" target=\"_blank\">PathVisio</a> core module which is much bigger and already contains PathVisio specific visualization aspects, also with the current data model it is difficult to find out the connections between two elements in the pathway. This automatically makes any graph algorithms which could be used to analyse the pathway very inefficient.</p>\n<p>A general GPML library should only contain the data model, the functionality to read and write <a href=\"https://www.pathvisio.org/gpml/\" target=\"_blank\">GPML</a> files and relevant importers and exporters to other often used file formats so it can be easily integrated in other applications.</p>\n<p>The main goal of this project is to create a separate GPML library to read and write GPML files in Java which can be used by PathVisio, the WikiPathways app for Cytoscape and many other applications.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2017_009",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/4563894257319936/",
          "proposal_id": null,
          "short_description": "libGPML\nCurrently it is required to include the whole PathVisio core module which is much bigger and already contains PathVisio specific...",
          "slug": "libgpml-library-to-read-and-write-gpml-files",
          "status": "completed",
          "student_name": "Saurabh\tKumar",
          "student_profile": null,
          "tags": [
            "java",
            "ml",
            "ai",
            "ui"
          ],
          "title": "libGPML library to read and write GPML files"
        },
        {
          "code_url": "https://docs.google.com/document/d/1w79CfEBhsOZvShZw-yDWfA2o2ZOUkmkUO9mk0midilQ/edit?usp=sharing",
          "description": "<p>In systems biology, it is very important to formalize the model for biological phenomenon and analyze based on this model basically constructed by ordinary differential equation(ODE). The model is normally described by SBML and there are several software tools to create the model easily. Regarding the analysis, this is considered as simulation, steady state analysis and parameter estimation. These methodologies are mathematically formalized and the library to analyze already exists. However, establishing the environment of analysis is difficult for biologists. Therefore, this is the obstacle to analyze ODE model easily. This project implement the web application to execute these analysis solving this problem. Web application does not require complicated establishment of analysis environment for users. This project removes the barrier for users to analyze ODE model.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2017_010",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/4634484729184256/",
          "proposal_id": null,
          "short_description": "In systems biology, it is very important to formalize the model for biological phenomenon and analyze based on this model basically constructed by...",
          "slug": "develop-a-web-service-which-provides-simulation-steady-state-analysis-parameter-estimation-with-sbml-models",
          "status": "completed",
          "student_name": "Takahiro Yamada",
          "student_profile": null,
          "tags": [
            "web",
            "ml",
            "ui"
          ],
          "title": "Develop a web service which provides simulation / steady state analysis / parameter estimation with SBML models"
        },
        {
          "code_url": "https://gist.github.com/melvin15may/2ae50b6904844a8fa390030321394a3f",
          "description": "<p>GraphSpace is an user-friendly web-based platform that collaborating research groups can utilize for storage, interaction, and network sharing. A GraphSpace user can import graphs created in Cytoscape, upload them through a REST API, interact with them by customizing and saving layouts, share them within and between groups of collaborators, search for different graphs, and organize them using tags. The goal of this project is to build a notification system for GraphSpace which will allow a user to track important activities on GraphSpace via notifications, the purpose being to keep users on par and current with their GraphSpace activity. In doing so, there will three type of notifications: Group, Owner and Watching.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2017_011",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/4654282246717440/",
          "proposal_id": null,
          "short_description": "GraphSpace is an user-friendly web-based platform that collaborating research groups can utilize for storage, interaction, and network sharing. A...",
          "slug": "notification-system-for-graphspace",
          "status": "completed",
          "student_name": "Melvin Mathew",
          "student_profile": null,
          "tags": [
            "web",
            "api",
            "ui"
          ],
          "title": "Notification system for GraphSpace"
        },
        {
          "code_url": "https://gist.github.com/ankanch/2fd83be30010470a15a08a603ad3a19a",
          "description": "<h4>Description:</h4>\n<p>The aim of this project is is to develop a web interface for DoMo-Pred which can help to simplify the analysis of protein-protein interactions in yeast, or, if possible, in all kinds of organisms.Just upload or input pairs of protein IDs and run then the web interface will return the result and researcher can easily share the result with their colleagues and visualize the network of those interactions with significant scores.\nAlso, the result after sort with significant scores can be used for performing other analysis.</p>\n<h4>Project details.</h4>\n<ul>\n<li>Users can  upload PWMs and domain files (or use built-in data or their own trained data as well as input list of protein \nIDs) the application will call DoMo-Pred to analyze then return the result as a table.</li>\n<li>An easy to use admin tool for change built-in dataset,like uploading more PWMs and domains and add more \norganisms or to remove certain PWMs and domains.</li>\n<li>Sort the result by score after evaluation, then pick those interaction with significant scores (under user specified \ncutoff) which can be download and used to perform different analysis.</li>\n<li>Use Cytoscape.JS to visualize the network of those interactions with significant scores.</li>\n</ul>\n",
          "difficulty": "beginner",
          "id": "proj_national-resource-fo_2017_012",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/4664231135805440/",
          "proposal_id": null,
          "short_description": "Description:\nThe aim of this project is is to develop a web interface for DoMo-Pred which can help to simplify the analysis of protein-protein...",
          "slug": "developing-a-web-interface-for-domo-pred",
          "status": "completed",
          "student_name": "Long Zhang",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "ui"
          ],
          "title": "Developing a web interface for DoMo-Pred"
        },
        {
          "code_url": "https://medium.com/@s.asifullah7/a-never-ending-journey-58b33da05409",
          "description": "<p>Integrating the existing Tellurium project with Apache Spark and by which the computations or simulations can be run in parallel. Developing an API for running different scenarios like parameter scanning, parameter fitting, sensitivity analysis etc.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2017_013",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/4700839692206080/",
          "proposal_id": null,
          "short_description": "Integrating the existing Tellurium project with Apache Spark and by which the computations or simulations can be run in parallel. Developing an API...",
          "slug": "developing-a-cluster-computing-framework-for-dynamical-modeling",
          "status": "completed",
          "student_name": "Shaik Asifullah",
          "student_profile": null,
          "tags": [
            "ios",
            "api"
          ],
          "title": "Developing a Cluster Computing Framework for Dynamical Modeling"
        },
        {
          "code_url": "http://memoiry.github.io/ModMashup.jl/dev/GSoC.html",
          "description": "<p>The aim of the project is to Implement GeneMANIA in Julia to optimize netDx for high-performance computing.</p>\n<p>The current Java-based implementation of GeneMANIA scales poorly on compute clusters because of the interaction Java's memory management with the architecture of these systems. Removing this bottleneck would allow netDx to handle datasets on the order of 10K-100K patients, 100-1000X larger than the size of current datasets.</p>\n<p>Julia is a high-level programming language, with syntax similar to Matlab and Python. It provides efficient matrix representation and built-in parallel execution capabilities, making it better suited for high-performance computing (HPC). In addition to optimizing netDx for HPC, the network integration algorithm will be tuned for problems specific to netDx, such as having relatively fewer nodes and more networks.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2017_014",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6478670940078080/",
          "proposal_id": null,
          "short_description": "The aim of the project is to Implement GeneMANIA in Julia to optimize netDx for high-performance computing.\nThe current Java-based implementation of...",
          "slug": "implement-genemania-in-julia-for-high-performance-computing",
          "status": "completed",
          "student_name": "Guodong Xu",
          "student_profile": null,
          "tags": [
            "python",
            "java",
            "ai",
            "ui"
          ],
          "title": "Implement GeneMANIA in Julia for High-performance Computing"
        },
        {
          "code_url": "https://github.com/bhaveshsunny/enrichmentmap",
          "description": "<p>The Projects goal is to use opencpu and cytoscape.js in order to remove the difficulty for Biologists to tackle with the hassles    of using R code or cytoscape for enrichment analysis. This will be achieved by leveraging the opencpu RESTful services API to create an R package of our own and use opencpu to create an API and use it to generate the same plots one would  generate while using cytoscape.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2017_015",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6503415320412160/",
          "proposal_id": null,
          "short_description": "The Projects goal is to use opencpu and cytoscape.js in order to remove the difficulty for Biologists to tackle with the hassles    of using R code...",
          "slug": "roadmap-to-create-a-webapp-for-the-enrichment-map-using-cytoscape-and-restful-services",
          "status": "completed",
          "student_name": "Bhavesh Narra",
          "student_profile": null,
          "tags": [
            "web",
            "api"
          ],
          "title": "Roadmap to create a WebApp for the Enrichment Map Using Cytoscape and RESTful services"
        },
        {
          "code_url": "https://summerofcode17.wordpress.com/2017/08/25/my-journey-with-graphspace-through-gsoc-2017-final-submission/",
          "description": "<p>In this project, we would be aiming to implement a python library for the GraphSpace RESTful APIs. Implementing such a library will be boon for the GraphSpace users as they can integrate it directly in their Python based applications. A well organized documentation will also be maintained. Furthermore, we plan to document the RESTful APIs themselves using RAML and also generate a test suite for testing the RESTful APIs documented in RAML.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2017_016",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6114016405487616/",
          "proposal_id": null,
          "short_description": "In this project, we would be aiming to implement a python library for the GraphSpace RESTful APIs. Implementing such a library will be boon for the...",
          "slug": "implementation-of-a-python-library-for-graphspace-restful-apis",
          "status": "completed",
          "student_name": "Sandeep Mahapatra",
          "student_profile": null,
          "tags": [
            "python",
            "api",
            "ml",
            "ai",
            "ui"
          ],
          "title": "Implementation of a Python Library for GraphSpace RESTful APIs"
        },
        {
          "code_url": "https://medium.com/sbol-workflows/latest",
          "description": "<p>A large goal of both the SBOL and synthetic biology communities is to develop a useful and comprehensive workflow from experiment to publication. Many SBOL-compliant tools already exist which perform distinct and useful functions ranging from component design, modeling, composition, simulation, figure creation, storage, sharing, and publication. In 2016, ACS Synthetic Biology recommended that all authors submit genetic designs using SBOL. An example workflow for doing so was published in 2016 (Hillson), and each of the parts of the workflow can be fulfilled by extant tools, but the integrations between tools can be made more robust.  For example, the SynBioHub service allows for storage and sharing of SBOL parts, VisBOL allows for creation of SBOL visual images from SBOL files, and iBioSim and SBOL Designer allow for creation and composition of SBOL parts. SBOL Designer and iBioSim allow for upload of parts to an instance of SynBioHub, but there are many opportunities to improve this workflow with authentication, security, and sharing capabilities.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2017_017",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5878091972870144/",
          "proposal_id": null,
          "short_description": "A large goal of both the SBOL and synthetic biology communities is to develop a useful and comprehensive workflow from experiment to publication....",
          "slug": "develop-a-synthetic-biology-publication-workflow-that-leverages-the-synthetic-biology-open-language",
          "status": "completed",
          "student_name": "Zach Zundel",
          "student_profile": null,
          "tags": [
            "ios"
          ],
          "title": "Develop a Synthetic Biology Publication Workflow that Leverages the Synthetic Biology Open Language"
        },
        {
          "code_url": "http://jajodiaraghav.github.io/gsoc/",
          "description": "<p>The goal of the project would be to add support for PSIMI-TAB format to the admin tools of the DV-IMPACT database and allow the upload and download of PPI network data in the same format.\nCurrently, the data upload can only be performed by the database admin. The objective is to create registration and user profile system that allows users to register and upload their own data independently without the need of the database admin to be involved in the upload process.</p>\n<p>The summarized goals would be:</p>\n<ol>\n<li>Create registration and user profile system that allows users to register and upload their own data independently.</li>\n<li>Add support for PSIMI-TAB format to the admin tools of the DV-IMPACT database.</li>\n<li>Add download PPI networks in PSIMI-TAB format to the frontend of DV-IMPACT database.</li>\n</ol>\n<p>The Project fulfills all these issues by:</p>\n<ol>\n<li>Creating a User Profile system type forum.</li>\n<li>Allow users to register, upload and download domain-peptide PPI data in the specified format.</li>\n<li>Modify the DV-IMPACT database present in the server to handle the upload to the admin tools in PSIMI-TAB format.</li>\n</ol>\n<p>Link to the evaluation task: <a href=\"http://dvimpact.herokuapp.com/\" target=\"_blank\">http://dvimpact.herokuapp.com/</a></p>\n<p>Github Repo: <a href=\"https://github.com/jajodiaraghav/DV-IMPACT\" target=\"_blank\">https://github.com/jajodiaraghav/DV-IMPACT</a></p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2017_018",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6329480956084224/",
          "proposal_id": null,
          "short_description": "The goal of the project would be to add support for PSIMI-TAB format to the admin tools of the DV-IMPACT database and allow the upload and download...",
          "slug": "adding-support-for-psimi-tab-format-to-the-disease-variant-impact-dv-impact-database",
          "status": "completed",
          "student_name": "Raghav Jajodia",
          "student_profile": null,
          "tags": [
            "ai",
            "database",
            "frontend"
          ],
          "title": "Adding support for PSIMI-TAB format to the Disease Variant Impact (DV-IMPACT) Database"
        },
        {
          "code_url": "https://github.com/BIMIB-DISCo/cyTRON/blob/master/README.md",
          "description": "<p>TRONCO is an R package that implements state-of-the-art algorithms for the inference of cancer progressions with the ultimate goal of understanding the evolutionary trajectories driving tumor evolution. In such a multidisciplinary domain, where computer scientists actively cooperate with biologists, being capable of visually understanding the data is crucial to both parties. cyTRON is a Cytoscape app that was designed for this purpose, i.e., mapping the features provided by the TRONCO R package to a user-friendly and accessible interface.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2017_019",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5141157457690624/",
          "proposal_id": null,
          "short_description": "TRONCO is an R package that implements state-of-the-art algorithms for the inference of cancer progressions with the ultimate goal of understanding...",
          "slug": "cytron-a-cytoscape-app-for-the-visualization-of-evolutionary-trajectories-in-cancer-progression",
          "status": "completed",
          "student_name": "Edoardo Galimberti",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "cyTRON: a Cytoscape app for the visualization of evolutionary trajectories in cancer progression"
        },
        {
          "code_url": "https://rishabhsethi.com/blog/2017/08/26/google-summer-of-code-final-report/",
          "description": "<p>The overall goal of the project is to create a Cytoscape app (CyGraphSpace) for syncing networks from Cytoscape to GraphSpace and vice-versa. Conceptually, the app will be similar to the CyNDEx app, which syncs Cytoscape networks with NDEx.</p>\n<p>Currently, users can sync between Cytoscape and GraphSpace manually by following the given steps:\nCytoscape to GraphSpace: First, export a network and its accompanying style file in Cytoscape to JSON files. Then upload these JSON files to GraphSpace using its web interface.\nGraphSpace to Cytoscape: Download a graph’s JSON and style JSON files from GraphSpace and then import these files into Cytoscape.</p>\n<p>CyGraphSpace will allow users to upload graphs and their styles directly from Cytoscape to GraphSpace without manual intervention and saving of files thus enabling a Cytoscape user to seamlessly share their networks on the web via GraphSpace. A user can also quickly import GraphSpace graphs into Cytoscape, analyze them with other Cytoscape apps, possibly make modifications, and then re-upload them to GraphSpace. This project will also require creating a well-documented Java library that interfaces with the GraphSpace REST APIs.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2017_020",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5197057262354432/",
          "proposal_id": null,
          "short_description": "The overall goal of the project is to create a Cytoscape app (CyGraphSpace) for syncing networks from Cytoscape to GraphSpace and vice-versa....",
          "slug": "cytoscape-app-for-graphspace-cygraphspace",
          "status": "completed",
          "student_name": "Rishabh Sethi",
          "student_profile": null,
          "tags": [
            "java",
            "web",
            "api",
            "ml",
            "ui"
          ],
          "title": "Cytoscape app for GraphSpace (CyGraphSpace)"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2017/organizations/6499778154201088/"
    },
    "year_2018": {
      "num_projects": 10,
      "projects": [
        {
          "code_url": "https://github.com/BIMIB-DISCo/cyTRON-js",
          "description": "<p>This project aims at developing a tool which should provide an interactive visualization of the cancer progression models produced by the R library TRONCO. In particular, the web application will have two main functionalities: it will provide an interactive graph display and it will supply cancer progression models generation by directly calling the TRONCO functions. In addition to that it will provide the users with information about the genes involved in the model.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2018_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/6343925602189312/",
          "proposal_id": null,
          "short_description": "This project aims at developing a tool which should provide an interactive visualization of the cancer progression models produced by the R library...",
          "slug": "develop-cytronjs-a-backend-and-a-cytoscapejs-visualizer-for-cancer-progression-models",
          "status": "completed",
          "student_name": "Lucrezia Patruno",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "backend"
          ],
          "title": "Develop cyTRON/JS: a backend and a cytoscape.js visualizer for cancer progression models"
        },
        {
          "code_url": "https://gist.github.com/crvineeth97/cd5a2843dacd6012cd376e8d639d0a45",
          "description": "<p>LibRoadrunner is a high-performance SBML based simulator for Systems and Synthetic Biology that uses LLVM to generate very efficient runtime code. SBML Arrays package is under development and provides support for expressing an array of components of a computational biological model. Arrays make it easier to represent large complex regular systems in a standard way. Currently, iBioSim is the only tool that supports SBML arrays. The goal of the project is to implement “SBML Array” support in libRoadRunner and ensure compatibility between libRoadRunner and iBioSim so that models can be exchanged correctly.</p>\n",
          "difficulty": "advanced",
          "id": "proj_national-resource-fo_2018_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/6459980316147712/",
          "proposal_id": null,
          "short_description": "LibRoadrunner is a high-performance SBML based simulator for Systems and Synthetic Biology that uses LLVM to generate very efficient runtime code....",
          "slug": "implement-sbml-array-support-in-libroadrunner",
          "status": "completed",
          "student_name": "Vineeth Chelur",
          "student_profile": null,
          "tags": [
            "ios",
            "ml"
          ],
          "title": "Implement SBML Array Support in libRoadRunner"
        },
        {
          "code_url": "https://medium.com/integration-of-sboldesigner-with-boost/integration-of-cad-and-cam-tools-for-automating-synthetic-biology-workflow-2fc5808aed4b",
          "description": "<p>Integrated Build Software Optimisation Tools (BOOST) with SBOLDesigner.  SBOLDesigner is a CAD tool for creating and manipulating the sequences of genetic constructs using the Synthetic Biology Open Language (SBOL) 2.0 data model and BOOST is a repertoire of CAD/CAM tools for minimizing the cost and time for synthesizing DNA sequences with the maximal success rate of synthesis.</p>\n<p>Integration of them enabled automated synthetic biology design-build workflows by providing different functionalities like the DNA Sequence verification against constraints,  modification of complex region according to the genetic code, fragmentation of large sequences depending on max. length of synthesis and desired assembly protocol.</p>\n",
          "difficulty": "advanced",
          "id": "proj_national-resource-fo_2018_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5694143623856128/",
          "proposal_id": null,
          "short_description": "Integrated Build Software Optimisation Tools (BOOST) with SBOLDesigner.  SBOLDesigner is a CAD tool for creating and manipulating the sequences of...",
          "slug": "integrating-cad-and-cam-tools-for-automating-a-synthetic-biology-workflow",
          "status": "completed",
          "student_name": "Prem Prakash Singh",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Integrating CAD and CAM tools for automating a synthetic biology workflow"
        },
        {
          "code_url": "https://docs.google.com/document/d/1b0ifeWThTduHsaTv0E6HlqS5u2Ay-mb1GXe-p9ILf8s/edit?usp=sharing",
          "description": "<p>Newt is a free, web-based, open source viewer and editor for pathways in Systems Biological Graphical Notation (SBGN). It is written with a series of libraries and extensions based on Cytoscape.js with utmost customization in mind. The purpose of this project is to improve Newt editor so that it is much easier to use and many more people can benefit from it.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2018_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5731568492478464/",
          "proposal_id": null,
          "short_description": "Newt is a free, web-based, open source viewer and editor for pathways in Systems Biological Graphical Notation (SBGN). It is written with a series of...",
          "slug": "improvements-for-newt-a-cytoscapejs-based-sbgn-editor",
          "status": "completed",
          "student_name": "Ahmet Çandıroğlu",
          "student_profile": null,
          "tags": [
            "web"
          ],
          "title": "Improvements for Newt, a Cytoscape.js based SBGN editor"
        },
        {
          "code_url": "https://docs.google.com/document/d/1JX_TQpZujgXMBA5T4xvceIm_qu-iVNQ4hzJTZHUqQIk/edit?usp=sharing",
          "description": "<p>While the network visualization module in cBioPortal is a powerful exploration tool, most biologists are more comfortable with the kind of simplified, curated pathway diagrams that are featured in many manuscripts from The Cancer Genome Atlas (TCGA) . With the motivation of creating a platform that provides more intuitive pathway diagrams, yet supports these with rich data ‘decoration’ and analysis with access to data in cBioPortal, with attractive visualization, a tool named PathwayMapper based on Cytoscape.js was developed. PathwayMapper is a valuable tool for constructing pathways from scratch. One can also use it as a viewer to overlay cancer genomics data on existing \"template\" pathways like those that appeared in TCGA papers. Ultimately, this project has two main purposes. First one is improving PathwayMapper with new attaractive features for both local and colloborative modes. Second one is integrating PathwayMapper into cBioPortal as an alternative to the cBioPortal's current network view.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2018_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5354693567971328/",
          "proposal_id": null,
          "short_description": "While the network visualization module in cBioPortal is a powerful exploration tool, most biologists are more comfortable with the kind of...",
          "slug": "pathwaymapper-improvements-and-integration-into-cbioportal",
          "status": "completed",
          "student_name": "Kaan Sancak",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "PathwayMapper Improvements and Integration into cBioPortal"
        },
        {
          "code_url": "https://github.com/cytoscape/appstore/tree/wip",
          "description": "<p>The project is “Appstore for the CytoScape Apps” with Alex Pico, Barry Demchak and Scooter Morris as its mentor. The goals for the summer will be to improve overall user experience, security as well as accessibility of the Cytoscape App store by implementing following four major goals:</p>\n<ol>\n<li>Cytoscape App Store migration from Python 2.6, Django 1.4.5 to Python 3.X, Django version &gt;= 1.8: </li>\n<li>Implementing Reviews and comments feature for the Cytoscape apps, sending them simultaneously to the registered app authors via registered email.</li>\n<li>Web App implementation for viewing Cytoscape app store from within CyBrowser.</li>\n<li>Support for submitting, browsing, downloading R and Python scripts.</li>\n</ol>\n<p>Link to the project idea: <a href=\"https://github.com/nrnb/GoogleSummerOfCode/issues/122\" target=\"_blank\">https://github.com/nrnb/GoogleSummerOfCode/issues/122</a></p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2018_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/6227480448860160/",
          "proposal_id": null,
          "short_description": "The project is “Appstore for the CytoScape Apps” with Alex Pico, Barry Demchak and Scooter Morris as its mentor. The goals for the summer will be to...",
          "slug": "app-store-for-cytoscape-apps",
          "status": "completed",
          "student_name": "Sarthak Srivastava",
          "student_profile": null,
          "tags": [
            "python",
            "web",
            "ai"
          ],
          "title": "App Store for Cytoscape Apps"
        },
        {
          "code_url": "https://github.com/shalinshah1993/SBSCL/wiki/SBSCL-wiki-page-for-GSoC-2018",
          "description": "<p>Computational models of biological systems play an important role in advancing science as they give insights about the biology without the need for performing real experiments. A significant challenge in the systems biology field is the reproducibility and reusability of such models and making these accessible to the broader biology community. To address this issue, computer-readable formats and tools for modeling complex biological systems have been developed. Standards such as Simulation Experiment Description Markup Language (SED-ML) and tools like Systems Biology Simulation Core Library (SBSCL) can represent such complex biological models and numerically simulate them. But until now only a subset of these standards have been implemented in SBSCL. Essential features that will catalyze reproducibility, exchangeability, and reusability are lacking so far. Namely, i) implementation of full support for simulation experiments; ii) plots and visualization of simulation studies; iii) support for standard archive formats; iv) support for Open Source solvers, and v) support for hierarchical models.</p>\n",
          "difficulty": "advanced",
          "id": "proj_national-resource-fo_2018_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/4757798072090624/",
          "proposal_id": null,
          "short_description": "Computational models of biological systems play an important role in advancing science as they give insights about the biology without the need for...",
          "slug": "simulating-systems-biology-models-in-java",
          "status": "completed",
          "student_name": "Shalin",
          "student_profile": null,
          "tags": [
            "java",
            "ml"
          ],
          "title": "Simulating systems biology models in Java"
        },
        {
          "code_url": "https://gist.github.com/jahandaniyal/b7a98094b0f3988de25e7ba89f716fca",
          "description": "<p>GraphSpace is a web-based platform where collaborating research groups can use a user-friendly interface to create, interact and share networks. Users can upload richly-annotated networks using REST APIs irrespective of the algorithms or tools used in the creation of the graph. Cytoscape.js enables the users to interact with the graphs using a graphical user interface. Users can customize the layouts of the graph, search for graphs matching some criteria, organize using tags, save the graph, and share them between collaborating groups or make it available to everyone in Graphspace.</p>\n<p>The goal of this project is to implement a system of version control which will enable users to track changes made to the graphs, save different version of the graph with detailed summary of the changes with respect to previous version. The user will be able to undo changes and backtrack to a previous version of the graph using GUI and REST APIs. A layout created for a particular version of a graph may not be compatible with other versions of the same graph, therefore a feature will be added to check layout compatibility and to transfer layout between different versions of a graph.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2018_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/4912008201764864/",
          "proposal_id": null,
          "short_description": "GraphSpace is a web-based platform where collaborating research groups can use a user-friendly interface to create, interact and share networks....",
          "slug": "graphspace-git-for-graphs",
          "status": "completed",
          "student_name": "Daniyal",
          "student_profile": null,
          "tags": [
            "web",
            "api",
            "ai",
            "ui"
          ],
          "title": "GraphSpace: Git for graphs"
        },
        {
          "code_url": "https://github.com/wikipathways/wikipathways.org/wiki/GSoC-2018-Dara-Akdag",
          "description": "<p>Ontologies are an integral part of our scientific progress. The ability to share common definitions is crucial to answering questions, thus, an updated and persistent ontology is important to invest in. This project will upgrade the current ontology tagging system of WikiPathways by utilising the recommender REST-API of BioPortal. The first part deals with fixing current data fetching mismatches, where tags are stored and fetched inconsistently. The second part of this project is implementing an intuitive tagging function to the process of creating a pathway, allowing the creator to fetch suggestions from BioPortal and add them with a couple of clicks. Lastly, the final part pertains promoting the quality of the tags by crowdsourcing the votes of visiting users.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2018_009",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5897030362726400/",
          "proposal_id": null,
          "short_description": "Ontologies are an integral part of our scientific progress. The ability to share common definitions is crucial to answering questions, thus, an...",
          "slug": "upgrading-ontology-tagging-at-wikipathways",
          "status": "completed",
          "student_name": "Dara Akdag",
          "student_profile": null,
          "tags": [
            "api",
            "ai",
            "ui"
          ],
          "title": "Upgrading Ontology Tagging at WikiPathways"
        },
        {
          "code_url": "https://github.com/SynBioDex/dnaplotlib/tree/30bc94559a87cf296091e32a1dce8867a4563676",
          "description": "<p>Visualizing genetic circuits is essential in the field of synthetic biology. These genetic designs often involve complex representation of modular and hierarchical biosystems. The representations are standardized through the Synthetic Biology Open Language (SBOL) in the form of glyphs. To make the visualization of biocircuits more efficient and amenable to automation, my goal is to upgrade DNAplotlib to support highly customizable visualizations of genetic circuits from SBOL version 2 files. \nI will achieve this by integrating DNAplotlib with the pySBOL2 library to support reading and writing of SBOL2 files. The current DNAplotlib only support SBOL 1.0 documentation, and thus is only capable of manifesting DNA components consisted of DNA sequence and sequence annotation. It cannot represent complex interactions between different subcomponents, and thus has poor connectivity with other genetic platforms. Through my work this summer, DNAplotlib will (1) incorporate non-DNA components / partially complete design sequences (2) document and link to external models such as SBML and CellML (3) visualize hierarchical and modular biosystems (4) save customization into SBOL file.</p>\n",
          "difficulty": "advanced",
          "id": "proj_national-resource-fo_2018_010",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5933636436099072/",
          "proposal_id": null,
          "short_description": "Visualizing genetic circuits is essential in the field of synthetic biology. These genetic designs often involve complex representation of modular...",
          "slug": "rendering-complex-genetic-design-with-dnaplotlib-for-a-beautiful-visualization-of-genetic-circuit",
          "status": "completed",
          "student_name": "Sunwoo Kang",
          "student_profile": null,
          "tags": [
            "ios",
            "ml",
            "ui"
          ],
          "title": "Rendering Complex Genetic Design with DNAplotlib for a Beautiful Visualization of Genetic Circuit"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2018/organizations/5428149655437312/"
    },
    "year_2019": {
      "num_projects": 11,
      "projects": [
        {
          "code_url": "https://gist.github.com/lohani2280/6012afba6301db1634dab7e3b8af2fcd",
          "description": "<p>The overall goal of this project is to implement a machine-readable graph legend interface and extend the API to add, modify and remove legend data for a graph using graphspace-python package. This will enable users to interact with the legend in an easier way using GUI and graphspace_python client library.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2019_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/6475050448846848/",
          "proposal_id": null,
          "short_description": "The overall goal of this project is to implement a machine-readable graph legend interface and extend the API to add, modify and remove legend data...",
          "slug": "implement-a-machine-readable-graph-legend-interface",
          "status": "completed",
          "student_name": "Ayush Ranjan Lohani",
          "student_profile": null,
          "tags": [
            "python",
            "api",
            "ui"
          ],
          "title": "Implement a machine-readable graph legend interface"
        },
        {
          "code_url": "https://gist.github.com/debashish05/82564fc7aee5130fbca9997c55681e14",
          "description": "<p>LibRoadrunner is a high performance SBML based simulator that uses LLVM to generate very efficient runtime code. This enables LibRoadrunner to simulate models on par with compiled C/C++ code. By combining Libroadrunner with standard optimization algorithms it is possible to use Libroadrunner to fit models to data. At present this is done by writing code to link the standard Python optimizer available via scipy with Libroadrunner. Although this works, it is inefficient and for large models, it is not practical. In this project, we would like to develop a C/C++ based differential evolution plugin that can be used directly by Libroadrunner (after integrating it with RRPlugins) without having to go via Python. This would enable us to provide high performance optimization capabilities.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2019_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5654736391372800/",
          "proposal_id": null,
          "short_description": "LibRoadrunner is a high performance SBML based simulator that uses LLVM to generate very efficient runtime code. This enables LibRoadrunner to...",
          "slug": "integrating-rrplugins-with-libroadrunner-and-devloping-differential-evolution-optimizer-plugin",
          "status": "completed",
          "student_name": "Debashish Roy",
          "student_profile": null,
          "tags": [
            "python",
            "ml",
            "ai"
          ],
          "title": "Integrating RRPlugins with libRoadRunner and devloping Differential Evolution optimizer plugin"
        },
        {
          "code_url": "https://kt-gsoc19.blogspot.com/2019/08/final-report-gsoc-2019.html",
          "description": "<p>ModelPolisher is a model annotation tool for the BiGG Models Knowledgebase. Annotations enhance the reusability and interoperability of biological models. \nThis project will improve ModelPolisher by extending its annotation capabilities for models lacking BiGG Identifiers. Also, option to produce separate glossary file and embedding them in COMBINE archive will be added. Further ModelPolisher will be containerized to simplify setup of its database back-end and the project will be updated to software development standards.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2019_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5516960685621248/",
          "proposal_id": null,
          "short_description": "ModelPolisher is a model annotation tool for the BiGG Models Knowledgebase. Annotations enhance the reusability and interoperability of biological...",
          "slug": "extending-modelpolisher-to-a-universal-model-annotation-tool",
          "status": "completed",
          "student_name": "Kaustubh Trivedi",
          "student_profile": null,
          "tags": [
            "ai",
            "database"
          ],
          "title": "Extending ModelPolisher to a universal model annotation tool"
        },
        {
          "code_url": "https://docs.google.com/document/d/1NLE2xN0osMkIo87wyt4w8yuOcVRCIdEV4Ibo_R7vTVI/edit#heading=h.khe6rjdq3912",
          "description": "<p>Automated layout web service with an integrated converter, to change the format of the data, would be of great use for people who want to quickly and easily layout their data to some of the famous cytoscape.js layout extensions</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2019_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5027226301497344/",
          "proposal_id": null,
          "short_description": "Automated layout web service with an integrated converter, to change the format of the data, would be of great use for people who want to quickly and...",
          "slug": "cise-layout-as-a-cytoscapejs-extension-and-an-automated-layout-web-service-for-popular-cytoscapejs-layout-extensions",
          "status": "completed",
          "student_name": "Perman Atayev",
          "student_profile": null,
          "tags": [
            "web",
            "ui"
          ],
          "title": "CiSE layout as a Cytoscape.js extension and an automated layout web service for popular Cytoscape.js layout extensions"
        },
        {
          "code_url": "https://github.com/niikhilghodke/Insilico-BuildSystem",
          "description": "<p>InSilico is an extensible editor which can be used for manipulating and analyzing many different file types, SBML files in particular. The current implementation of InSilico has Maven Tycho and Eclipse PDE as its build system. The existing build systems will be replaced by Gradle. The goal of this project is to create a Gradle plugin that allows users to configure their OSGi application in easily understandable commands. Upon completion of this project developers will be able to complete all the above noted sub tasks by just interacting with the Gradle script. Also interacting with gradle script does NOT mean writing complex scripts but in fact will just include using of simple gradle command developed through this project. This in turn will encourage developers to create plugins and features for InSilico and making the job of developer and users easier !</p>\n",
          "difficulty": "advanced",
          "id": "proj_national-resource-fo_2019_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5319454819352576/",
          "proposal_id": null,
          "short_description": "InSilico is an extensible editor which can be used for manipulating and analyzing many different file types, SBML files in particular. The current...",
          "slug": "new-build-system-for-insilico",
          "status": "completed",
          "student_name": "Nikhil Ghodke",
          "student_profile": null,
          "tags": [
            "ml",
            "ui"
          ],
          "title": "New Build System for InSilico"
        },
        {
          "code_url": "https://drive.google.com/open?id=1_qns7B5vYtSE0yDXloT9gmndGg8w71-5mksQioLdKwc",
          "description": "<p>Develop a simulator which will support all the features of SBML core specification</p>\n<ul>\n<li>Implement a code so that the simulator can pass testcases which require simulators to correctly handle mathematical equations (concentration vs. amount, function definitions, assignment rules etc.)</li>\n<li>Implement a code so that the simulator can pass testcases which require simulators to correctly handle discrete events.</li>\n<li>Implement a code so that the simulator can pass testcases which require simulators to correctly handle delayed differential equations.</li>\n</ul>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2019_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5637831081328640/",
          "proposal_id": null,
          "short_description": "Develop a simulator which will support all the features of SBML core specification\n\nImplement a code so that the simulator can pass testcases which...",
          "slug": "simulator-for-systems-biology",
          "status": "completed",
          "student_name": "Robin Simonot",
          "student_profile": null,
          "tags": [
            "ml",
            "ui"
          ],
          "title": "Simulator for Systems Biology"
        },
        {
          "code_url": "https://cannin.github.io/ihop-reach/reports/2019-08-26-gsoc-final-report.html",
          "description": "<p><strong>An application for users to access biological data extracted from biomedical literature.</strong></p>\n<p>Project Mentor <strong>Augustin Luna</strong></p>\n<h3>Objectives</h3>\n<ul>\n<li>Easy search capabilities for biomedical entities (e.g., genes, proteins, and chemicals) for a corpus of extracted entities and interactions </li>\n<li>Users will be able to see the articles that mention entities of interest in easy to interpret manner. </li>\n<li>Users will be able to view results in a tabulated format </li>\n<li>Computational users will have access to an API to retrieve results programmatically</li>\n<li>Use modern technologies for better browser compatibility, user access, and simplified maintenance </li>\n</ul>\n<h3>Project Phases</h3>\n<ol>\n<li>Planning and deciding our approach towards the project </li>\n<li>Deciding on data structures</li>\n<li>Creating schemas and GraphQL interface </li>\n<li>Generating Wireframes </li>\n<li>Linking backend and frontend </li>\n<li>Working on functionalities like search, filter </li>\n<li>Basic prototype expected to be ready by 23rd June</li>\n<li>Taking feedback from community and mentors</li>\n<li>Implementing features advised by community and mentors</li>\n<li>Deploying the project</li>\n<li>Working on making a pipeline to automate data addition from <strong>PubMed Central</strong>.</li>\n</ol>\n",
          "difficulty": "beginner",
          "id": "proj_national-resource-fo_2019_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/6489266790596608/",
          "proposal_id": null,
          "short_description": "An application for users to access biological data extracted from biomedical literature.\nProject Mentor Augustin Luna\nObjectives\n\nEasy search...",
          "slug": "web-interface-for-nlp-extracted-interaction-network",
          "status": "completed",
          "student_name": "Rohit R. Chattopadhyay",
          "student_profile": null,
          "tags": [
            "web",
            "api",
            "ai",
            "frontend",
            "backend"
          ],
          "title": "Web Interface for NLP Extracted Interaction Network"
        },
        {
          "code_url": "https://gsoc19-spatial.blogspot.com/2019/08/project-report-gsoc-2019.html",
          "description": "<p>The <code>spatial</code> extension for SBML provides support for describing processes that involve a spatial component. This project seeks to implement validation functions for the <code>spatial</code> modelling package for SBML, thereby updating the extension to the latest specification. These functions will be used by the SBML offline validator to validate any models that contain a spatial component.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2019_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/6066046165843968/",
          "proposal_id": null,
          "short_description": "The spatial extension for SBML provides support for describing processes that involve a spatial component. This project seeks to implement validation...",
          "slug": "validation-of-spatial-systems-biology-models-in-java",
          "status": "completed",
          "student_name": "Bhavye Jain",
          "student_profile": null,
          "tags": [
            "java",
            "ml",
            "ai"
          ],
          "title": "Validation of spatial systems biology models in Java"
        },
        {
          "code_url": "https://github.com/cytoscape/appstore/tree/gsoc2019",
          "description": "<p>I am interested in the project “Appstore for the Cytoscape App” with Alex Pico, Barry Demchak and Scooter Morris as its mentor. \nMy goals for the summer will be to improve overall user experience, security as well as accessibility of the Cytoscape App store by implementing following major goals:</p>\n<ol>\n<li>Improving the user interface, particularly with respect to the search result display, redundancy in the search result, etc.</li>\n<li>Writing test script for the website, both unit test as well as integration test.</li>\n<li>Deploying the website on production server and Documentation.</li>\n<li>Removing the remaining bugs in the code.</li>\n<li>Web App implementation for viewing Cytoscape app store from within CyBrowser.</li>\n</ol>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2019_009",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/6071654369722368/",
          "proposal_id": null,
          "short_description": "I am interested in the project “Appstore for the Cytoscape App” with Alex Pico, Barry Demchak and Scooter Morris as its mentor. \nMy goals for the...",
          "slug": "app-store-for-cytoscape-apps",
          "status": "completed",
          "student_name": "Sarthak Srivastava",
          "student_profile": null,
          "tags": [
            "web",
            "ai"
          ],
          "title": "App Store for Cytoscape Apps"
        },
        {
          "code_url": "https://gist.github.com/The-Marvex/c2933be2f7cc3de026e5a1442a171263",
          "description": "<p>BridgeDb is a platform used for identifier mapping in WikiPathways and PathVisio with support for various languages like as a Cytoscape plugin, as an R package, and an API implemented in OpenRiskNet and OpenPHACTS. BridgeDB provides a platform to link other databases like Ensembl, NCBI Gene, ChEBI, PubChem, etc. The main idea of this project is to add functionality and release a major version of BridgeDb. This new version would support Java version above 8. It will also have support for ‘Secondary identifier’. As a part of the project, metadata output provided by BridgeDb will also be formatted to meet the ‘The FAIR Guiding Principles for scientific data management and stewardship’.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2019_010",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5773388839124992/",
          "proposal_id": null,
          "short_description": "BridgeDb is a platform used for identifier mapping in WikiPathways and PathVisio with support for various languages like as a Cytoscape plugin, as an...",
          "slug": "bridgedb-major-release",
          "status": "completed",
          "student_name": "Manas Awasthi",
          "student_profile": null,
          "tags": [
            "java",
            "api",
            "ai",
            "database",
            "ui"
          ],
          "title": "BridgeDb Major Release"
        },
        {
          "code_url": "https://gist.github.com/jahandaniyal/c335447a8e12889775ecf42f5562385b",
          "description": "<p>The goal of this project <strong>‘Diff for Graphs’</strong> is to implement a graph comparison functionality which will allow users to compare two or more graphs that are accessible by them. This includes graphs created by them, graphs shared with them by other users and all the public graphs. This project extends the work done in <strong>‘Git for graphs’</strong> project - which was a part of GSoC ‘18.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2019_011",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5925734734888960/",
          "proposal_id": null,
          "short_description": "The goal of this project ‘Diff for Graphs’ is to implement a graph comparison functionality which will allow users to compare two or more graphs that...",
          "slug": "graphspace-diffs-for-graphs",
          "status": "completed",
          "student_name": "Daniyal Jahan",
          "student_profile": null,
          "tags": [],
          "title": "GraphSpace: Diffs for graphs"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2019/organizations/6637709450280960/"
    },
    "year_2020": {
      "num_projects": 15,
      "projects": [
        {
          "code_url": "https://ms03831.github.io/GSoC-20/final-report-gsoc20-genetech/",
          "description": "<p>GeneTech allow users to develop genetic logic circuits only by specifying a Boolean function. The tool first performs Boolean optimisation, followed by synthesis and technology mapping. Currently, a user can define the desired behavior in the standard Boolean notation. I would like to add the support for designing a circuit via drag and drop method on a design canvas. This functionality would allow users, specially electrical/electronic engineers, to design a genetic circuit by constructing the circuit schematic on a design canvas using drag-drop-wire approach. GeneTech will then transform the circuit schematic into the corresponding genetic circuit and represent it in the standard SBOL notation. The results produced by the current version of GeneTech do not include the DNA basepair encoding of circuit components. I would like to update the tool to be able to embed the DNA sequence of generated circuits in the SBOL file.</p>\n<p>Most of the code-base of GeneTech is currently a pre-compiled version of the Java code which adds additional overhead and dependencies. We would also like to convert the Java code to Python and reduce dependencies along the way</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2020_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5704655729852416/",
          "proposal_id": null,
          "short_description": "GeneTech allow users to develop genetic logic circuits only by specifying a Boolean function. The tool first performs Boolean optimisation, followed...",
          "slug": "generating-detailed-sbol-representation-of-genetic-logic-circuits-along-with-improved-designing-capability-and-java-python-conversion",
          "status": "completed",
          "student_name": "Mudasir Shaikh",
          "student_profile": null,
          "tags": [
            "python",
            "java",
            "ai",
            "ui"
          ],
          "title": "Generating detailed SBOL representation of genetic logic circuits along with improved designing capability, and Java-Python conversion."
        },
        {
          "code_url": "https://gist.github.com/Hemant27031999/c2aef36620a7f264993621b393764688",
          "description": "<p>The Systems Biology Markup Language (SBML) is the main language for representation and exchange of computational models in biology. JSON is the main data format of the web. Currently, many issues exist with the JSON representation of SBML used by tools like cobrapy, escher, ModelPolisher or the BiGG database.</p>\n<p>The idea of this project is to update the JSON scheme to have a full coverage of features important for constraint-based methods, i.e. SBML core and the additional SBML packages fbc and groups. In addition, existing issues related to SBML-JSON will be solved. The project will be implemented as part of cobrapy with main focus on the following:</p>\n<ol>\n<li>Annotation and meta-data support will be implemented</li>\n<li>Validation of JSON-SBML files will be performed</li>\n<li>Roundtripping SBML-JSON-SBML without information loss will be implemented</li>\n<li>JSON (SBML) scheme and scheme validation will be implemented</li>\n</ol>\n<p>Hence, a full-featured JSON exchange format for SBML will improve the web-integration and exchange of SBML models on web.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2020_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5395464691646464/",
          "proposal_id": null,
          "short_description": "The Systems Biology Markup Language (SBML) is the main language for representation and exchange of computational models in biology. JSON is the main...",
          "slug": "implementation-of-sbml-json-converter-and-sbml-json-scheme",
          "status": "completed",
          "student_name": "Hemant",
          "student_profile": null,
          "tags": [
            "web",
            "ml",
            "ai",
            "database"
          ],
          "title": "Implementation of SBML-JSON converter and SBML-JSON scheme"
        },
        {
          "code_url": "https://gist.github.com/bhaveshnarra/e0eb66217553ab54dbb9309ab5180faf",
          "description": "<p>LACEview is a visualization tool for LACE (Longitudnal Analysis of Cancer Evolution) developed by a team at BIMIB. The tool is for R visualization and uses htmlwidgets and other R packages to output an informative and well optimized ourput that is user interactive.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2020_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5081852991242240/",
          "proposal_id": null,
          "short_description": "LACEview is a visualization tool for LACE (Longitudnal Analysis of Cancer Evolution) developed by a team at BIMIB. The tool is for R visualization...",
          "slug": "lace-view-a-visualizer-for-longitudinal-clonal-trees",
          "status": "completed",
          "student_name": "Bhavesh Narra",
          "student_profile": null,
          "tags": [
            "ml"
          ],
          "title": "LACE-View : A Visualizer for Longitudinal Clonal Trees"
        },
        {
          "code_url": "https://gist.github.com/PritiShaw/186d762fdab1b0b2144a0207f7d6459d#file-readme-md",
          "description": "<p><strong>Goal:</strong> The goal is to expand on the web interface and the data generation pipeline developed in 2019.</p>\n<p><strong>Overview:</strong> Continuing to the already done work, this year’s objective will be to make the platform more user friendly and information-rich, buy adding paper quality judging parameters and improving the pipeline to add as many papers as possible.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2020_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5102810552598528/",
          "proposal_id": null,
          "short_description": "Goal: The goal is to expand on the web interface and the data generation pipeline developed in 2019.\nOverview: Continuing to the already done work,...",
          "slug": "enhance-web-interface-for-natural-language-processing-extracted-interaction-network",
          "status": "completed",
          "student_name": "Priti Shaw",
          "student_profile": null,
          "tags": [
            "web",
            "ui"
          ],
          "title": "Enhance Web Interface for Natural-Language Processing Extracted Interaction Network"
        },
        {
          "code_url": "https://github.com/RBVI/clusterMaker2/pull/12",
          "description": "<p>In this project, I will develop a tool in Cytoscape app ClusterMaker2 that helps implementing new clustering algorithms in the app from inside Cytoscape. Cytoscape is a widely used software in systems biology for analyzing large and complex networks. ClusterMaker provides a tool to detect communities within the networks using different algorithms. In order to make the implementation of new clustering algorithms in ClusterMaker, Cytoscape jobs package is utilized for executing the algorithms remotely.</p>\n",
          "difficulty": "advanced",
          "id": "proj_national-resource-fo_2020_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/4644394969333760/",
          "proposal_id": null,
          "short_description": "In this project, I will develop a tool in Cytoscape app ClusterMaker2 that helps implementing new clustering algorithms in the app from inside...",
          "slug": "developing-a-tool-for-implementing-clustering-algorithms-to-cytoscape-app-clustermaker2",
          "status": "completed",
          "student_name": "Maija Utriainen",
          "student_profile": null,
          "tags": [],
          "title": "Developing a tool for implementing clustering algorithms to Cytoscape app ClusterMaker2"
        },
        {
          "code_url": "https://medium.com/@rahulagrawal799110/google-summer-of-code-2020-work-report-ea044673cd4a",
          "description": "<p>ABioTrans is a bio-statistical/informatics tool, developed in R for gene expression analysis. The tool allows the user to directly read RNA-Seq data files deposited in the Gene Expression Omnibus or GEO database. It provides easy options for performing very commonly used statistical techniques, namely, Pearson and Spearman rank correlations, Principal Component Analysis (PCA), k-means and hierarchical clustering, Shannon entropy, Noise (square of the coefficient of variation), differential expression (DE) analysis, and gene ontology classifications</p>\n<p>This project aims to develop the 2nd version of ABioTrans. ABioTrans version-2 will be web-based and will provide extensive analysis options to the gene expression analysis results such as pathway enrichment analysis, gene function, t-SNE, Protein Protein Interaction, SOM , SVM  as well as publication-ready visualization options including network visualization using Cytoscape.JS\nAs the current version of Abiotrans is not online, it gets very difficult and time consuming process for the biologist who want to perform few analysis.\nAs it's a very time consuming &amp; tedious process. So, taking it online will solve a huge problem.</p>\n",
          "difficulty": "beginner",
          "id": "proj_national-resource-fo_2020_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/6492152210653184/",
          "proposal_id": null,
          "short_description": "ABioTrans is a bio-statistical/informatics tool, developed in R for gene expression analysis. The tool allows the user to directly read RNA-Seq data...",
          "slug": "adding-bio-statistical-machine-learning-models-and-graphical-visualization-to-abiotrans-v2",
          "status": "completed",
          "student_name": "Rahul Agrawal",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "database"
          ],
          "title": "Adding Bio-Statistical Machine Learning Models and Graphical visualization to ABioTrans V2"
        },
        {
          "code_url": "https://docs.google.com/document/d/1SbEAJ45XClPG57L4TEGGds2H71Pwnhr3um2B09u1rG0/edit?usp=sharing",
          "description": "<p>This project aims at creating and implementing a system that automatically generates various spatial SBML models by comprehensively segmenting microscopic images of cells using deep learning and XitoSBML. The Systems Biology Markup Language (SBML) is a popular and widely accepted XML-based, open-source language for representing and exchanging models across analysis and simulation tools. By utilizing the capabilities of SBML via its spatial package, XitoSBML can create spatial SBML models from microscopic cellular images. However, this package has only been partially implemented and is still under development. A poignant requirement of this development process is a large number of test models, which can be provided as deliverables via this project to the SBML repository. Thus, this project will be able to contribute towards the development of the SBML Version 3 spatial package. Furthermore, the provision of several spatial SBML models will enable checking the compatibility of software tools that deal with spatial SBML models.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2020_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/4913136240427008/",
          "proposal_id": null,
          "short_description": "This project aims at creating and implementing a system that automatically generates various spatial SBML models by comprehensively segmenting...",
          "slug": "development-of-a-system-that-generates-spatial-sbml-models-using-deep-learning",
          "status": "completed",
          "student_name": "Medha Bhattacharya",
          "student_profile": null,
          "tags": [
            "ml",
            "ai",
            "ui"
          ],
          "title": "Development of a system that generates spatial SBML models using deep learning"
        },
        {
          "code_url": "https://gist.github.com/hemilpanchiwala/b52d7b285028566c35eb085d8a405aa2",
          "description": "<p>Systems biology studies the mechanisms underlying complex biological processes as integrated systems of many interacting components. Modeling biological systems has always been a difficult and often challenging task. A particular challenge is to make such models reproducible and thereby reusable by a broader community. Different languages and libraries have been developed to address the exchangeable encoding of computational models. Examples are formats such as the Systems Biology Markup Language (SBML) and Simulation Experiment Description Markup Language (SED-ML), which can represent complex biological models and libraries such as the Systems Biology Simulation Core Library (SBSCL) which can simulate them. But until now, SBSCL still lacks certain features that need to be implemented. Essential new features are</p>\n<p>i) Implementation of new features of <strong>SBML Level 3 Version 2</strong>.</p>\n<p>ii) Support for newer versions of existing SBML packages such as <strong>FBC Version 3</strong> in SBSCL.</p>\n<p>iii) Implementation of <strong>stochastic</strong> simulation in SBSCL.</p>\n<p>iv) Improvement of support for SBML models with <strong>comp</strong> extension.</p>\n",
          "difficulty": "advanced",
          "id": "proj_national-resource-fo_2020_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5760152914886656/",
          "proposal_id": null,
          "short_description": "Systems biology studies the mechanisms underlying complex biological processes as integrated systems of many interacting components. Modeling...",
          "slug": "simulation-of-systems-biology-models-in-java-support-for-new-features",
          "status": "completed",
          "student_name": "Hemil Panchiwala",
          "student_profile": null,
          "tags": [
            "java",
            "ml",
            "ai"
          ],
          "title": "Simulation of systems biology models in Java: support for new features"
        },
        {
          "code_url": "https://github.com/sraghuvanshi/GSoC-2020",
          "description": "<p>Model Bricks project is an effort focused on describing recurring patterns in biological networks. These patterns are described as small VCell models that are retrieved from the VCell database and displayed online. \nTo make Model Bricks recurring patterns more efficient and easily accessible, an entire code base shift from YAML to Vue.js is proposed. Vue.js features an incrementally adaptable architecture that focuses on declarative rendering and component composition. Vue.js component system will enable us to organize VCell APIs appropriately.</p>\n<p>The main objectives of this project are:</p>\n<ol>\n<li>Enhance Modelbricks.org user interface by using modern web design trends.</li>\n<li>Create a well-organized web architecture that will allow displaying of as many VCell elements as possible.</li>\n<li>Create VCell APIs for each element to be displayed.</li>\n<li>Enhance VCell user interface features to enable their display online.</li>\n<li>Write appropriate documentation.</li>\n</ol>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2020_009",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5843081586278400/",
          "proposal_id": null,
          "short_description": "Model Bricks project is an effort focused on describing recurring patterns in biological networks. These patterns are described as small VCell models...",
          "slug": "redevelop-model-bricks-code-base-architecture",
          "status": "completed",
          "student_name": "Saksham Raghuvanshi",
          "student_profile": null,
          "tags": [
            "vue",
            "web",
            "api",
            "ml",
            "ai"
          ],
          "title": "Redevelop Model Bricks code base architecture"
        },
        {
          "code_url": "https://gist.github.com/yash170106065/df1d27b512a320012a9a72cbe09fb073",
          "description": "<p>The aim of this project is to implement a real-time comment/discussion and reaction system that will allow users to comment on graphs and discuss ideas with each other using the GraphSpace web interface.</p>\n<ol>\n<li>Design a user interface for creating comments and discussions: When visualizing a graph, this interface should allow users to add comments as a means to discuss or share ideas with their collaborators for a given graph, analogous to the way \"Comments\" on Google Docs allow users to discuss ideas on text documents. Being applicable to graphs, the comment system on GraphSpace should apply to nodes, edges, groups of nodes, and subgraphs, or even the entire graph. Comments can be applied only to a specific layout as well. There should be a way to mark comments as resolved.</li>\n<li>Develop a web service for real-time comments and discussions: We would like to implement real-time storage, querying, and recovery of comments and discussions.</li>\n<li>Develop a reaction system for both the comment/discussion system: We would like to implement a reaction tool like GitHub for both the comment/discussion system.</li>\n<li>Integrate the web service with the user interface.</li>\n</ol>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2020_010",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5934603145052160/",
          "proposal_id": null,
          "short_description": "The aim of this project is to implement a real-time comment/discussion and reaction system that will allow users to comment on graphs and discuss...",
          "slug": "implement-a-commentdiscussion-system-in-graphspace",
          "status": "completed",
          "student_name": "Yash Agarwal_",
          "student_profile": null,
          "tags": [
            "react",
            "web",
            "ai"
          ],
          "title": "Implement a comment/discussion system in GraphSpace"
        },
        {
          "code_url": "https://docs.google.com/document/d/1AaGF7OFiccEPykvE5y-3TdjbSD7NhHsjWx2kpGGvhrk/edit?usp=sharing",
          "description": "<p>Pathways are created by selecting certain genes and studies then displayed in the PathwayMapper tab in the cBioPortal. However, not every page in cBioPortal has a direct link to PathwayMapper hence making inferences from specific pages and reflecting the outcome to PathwayMapper is not straightforward. In order to overcome the struggle to interact between the pages and pathways, a PathwayMapper tab will be incorporated into Study View, Patient View, and Comparison pages. To test the implementations, I will deploy cBioPortal to Heroku so that I can test the code and ensure that it works in a remote server. \nPathwayMapper is used to construct pathways however pathways can become very complex and hard to understand as the data mounts. Some features are expected to be implemented in PathwayMapper to decrease the complexity of pathways and make it easy for users to draw conclusions.  Features expected to be implemented are \nExpand-collapse operations, Hide-show operations, Filtering, Highlighting.\nFor PathwayMapper editor features I will use functionalities that are already implemented in the Cytoscape.js. Bugs in Collaborative Mode will be fixed.</p>\n",
          "difficulty": "beginner",
          "id": "proj_national-resource-fo_2020_011",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5975532908314624/",
          "proposal_id": null,
          "short_description": "Pathways are created by selecting certain genes and studies then displayed in the PathwayMapper tab in the cBioPortal. However, not every page in...",
          "slug": "enhancing-pathwaymapper-in-cbioportal-and-pathwaymapper-editor",
          "status": "completed",
          "student_name": "Merve Kılıçarslan",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Enhancing PathwayMapper in cBioPortal and PathwayMapper editor"
        },
        {
          "code_url": "https://github.com/sjha2048/GSoC-2020",
          "description": "<p>This project intends to make several improvements to compmodelmatch platform which will improve its performance and also add features such as ORCID and OAuth2 API Integration which will result to improve the usability of the platform.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2020_012",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/6297916743876608/",
          "proposal_id": null,
          "short_description": "This project intends to make several improvements to compmodelmatch platform which will improve its performance and also add features such as ORCID...",
          "slug": "improving-compmodelmatchorg",
          "status": "completed",
          "student_name": "Sahil Jha",
          "student_profile": null,
          "tags": [
            "api"
          ],
          "title": "Improving compmodelmatch.org"
        },
        {
          "code_url": "https://medium.com/@alice.menglh/gsoc-2020-integration-of-sequence-visualization-into-synbiohub-bca7c0ae195",
          "description": "<p>As a design repository for Synthetic Biology, SynBioHub facilitates the sharing and searching for information, combining data from a variety of sources. SynBioHub uses the Synthetic Biology Open Language (SBOL) an open source data standard that enables an information rich encoding of genetic information. To enable greater utility of the SynBioHub platform, it is necessary to extend its capability in a manner that will enhance its usability to genetic wet-lab workers, creating a better synergy between the digital and physical workflows. When creating or using genetic designs in the laboratory, experimentalists frequently want to interrogate the information for specific DNA ‘parts’ prior to using them. The annotation of a DNA sequence will define which strings of the DNA nucleotide sequence encode specific function. Being able to visualize the correlation of sequence to function is critical for experimentalists. Currently SynBioHub lacks a visualization tool that would enable this visualization. Addressing this will greatly enhance the usability of the platform by experimentalists and this will facilitate the integration of digital and physical workflows.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2020_013",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5157652016922624/",
          "proposal_id": null,
          "short_description": "As a design repository for Synthetic Biology, SynBioHub facilitates the sharing and searching for information, combining data from a variety of...",
          "slug": "integration-of-sequence-visualization-into-synbiohub",
          "status": "completed",
          "student_name": "Linhao Meng",
          "student_profile": null,
          "tags": [],
          "title": "Integration of sequence visualization into SynBioHub"
        },
        {
          "code_url": "https://gist.github.com/debashish05/e1ec288a81d77e0fe61cbf336d147109",
          "description": "<p>LibRoadrunner is a high-performance SBML based simulator that uses LLVM to generate very efficient runtime code. This enables LibRoadrunner to simulate models on par with compiled C/C++ code. By combining Libroadrunner with standard optimization algorithms it is possible to use Libroadrunner to fit models to data. At present this is done by writing code to link the standard Python optimizers available via scipy with libroadrunner. Although this works it is inefficient and for large models, it is not practical. In this project, we would like to continue the work to develop a C/C++ based optimization plugins that can be used directly by LibRoadrunner with the help of RRPlugins. RRPlugins is a software that uses Libroadrunner as a dependency to load plugins and perform optimization tasks. Now if we build roadrunner we need to build plugins again since plugins are designed in such a way that they use LibRoadRunner and RRPlugins both as a dependency. To overcome this we decided to integrate both LibRoadRunner and RRPlugins and this would enable us to provide high-performance optimization capabilities.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2020_014",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5173465314754560/",
          "proposal_id": null,
          "short_description": "LibRoadrunner is a high-performance SBML based simulator that uses LLVM to generate very efficient runtime code. This enables LibRoadrunner to...",
          "slug": "integrating-rrplugins-with-libroadrunner",
          "status": "completed",
          "student_name": "Debashish Roy",
          "student_profile": null,
          "tags": [
            "python",
            "ml",
            "ai",
            "ui"
          ],
          "title": "Integrating RRPlugins with libRoadRunner"
        },
        {
          "code_url": "https://medium.com/@IsaMarleen/final-post-64c66302ae0",
          "description": "<p>Synthetic Biology is a discipline that connects many disciplines and heterogeneous researchers. To be useful as a tool, a platform such as SynBioHub should reflect this diversity. SynBioHub is a repository of genetic components and designs and can represent a powerful way to share and curate synthetic biology projects. To do so, it should invite and fulfill the needs of bioinformaticians and mathematicians while at the same time bridging the gap to wet lab experimentalists. One of these differences is the common preference of wet lab biologists to use spreadsheets, which as of now cannot be used as input for SynBioHub. This can be changed by creating a plugin, which accepts a spreadsheet as input and converts it into SBOL which can be processed by SynBioHub. This could simplify the process of data curation for publication by bridging the gap between those that perform the experiments and those that write about them from the very beginning.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2020_015",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5194650308050944/",
          "proposal_id": null,
          "short_description": "Synthetic Biology is a discipline that connects many disciplines and heterogeneous researchers. To be useful as a tool, a platform such as SynBioHub...",
          "slug": "spreadsheet-plug-in-for-synbiohub",
          "status": "completed",
          "student_name": "Isabel Marleen",
          "student_profile": null,
          "tags": [],
          "title": "Spreadsheet Plug-in for SynBioHub"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2020/organizations/4549302816342016/"
    },
    "year_2021": {
      "num_projects": 13,
      "projects": [
        {
          "code_url": "https://danijak.github.io/GSoc-21_report/",
          "description": "<p>This project aims to add new features to ABioTrans Plus(GeneCloudOmics) that includes the direct import of gene expression data from Gene Expression Omnibus (GEO) databases, Machine learning-based analysis, creating a detailed report with the performed analysis with figures and data, and add more gene expression analysis methods e.g. Gene Set Enrichment Analysis (GSEA) and sample comparison analysis and plots. Also, provide Docker support and CI/CD pipeline.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2021_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6350036069253120/",
          "proposal_id": null,
          "short_description": "This project aims to add new features to ABioTrans Plus(GeneCloudOmics) that includes the direct import of gene expression data from Gene Expression...",
          "slug": "enhancing-abiotrans-plus-using-gene-expression-omnibus-database-and-adding-analysis-report",
          "status": "completed",
          "student_name": "Javed Ali",
          "student_profile": null,
          "tags": [
            "ai",
            "database",
            "docker",
            "cloud"
          ],
          "title": "Enhancing ABioTrans Plus  using Gene Expression Omnibus database and adding analysis report"
        },
        {
          "code_url": "https://github.com/cytoscape/enrichment-table-app",
          "description": "<p>Cytoscape is a highly popular open source bioinformatics software platform for visualizing, analyzing, and publishing graphs or networks representing molecular interactions, gene expression, and other biological data. As a desktop platform, Cytoscape is one of the most successful open source projects in biology, and it is capable of integrating observational data from numerous sources.</p>\n<p>Currently, when users are working with a network of connected genes or proteins, they have to use external web tools to perform simple enrichment analyses, e.g., using g:Profiler. However, g:Profiler provides a web service interface, so it would be relatively simple to provide access to this same service from within Cytoscape. More advanced tools for enrichment already exist as Cytoscape apps, such as BiNGO and ClueGO. The goal to produce an app that could eventually be included in the core distribution of Cytoscape.</p>\n",
          "difficulty": "advanced",
          "id": "proj_national-resource-fo_2021_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5668940155453440/",
          "proposal_id": null,
          "short_description": "Cytoscape is a highly popular open source bioinformatics software platform for visualizing, analyzing, and publishing graphs or networks representing...",
          "slug": "simple-enrichment-tool-for-analysis",
          "status": "completed",
          "student_name": "Indraneel Ghosh",
          "student_profile": null,
          "tags": [
            "web"
          ],
          "title": "Simple Enrichment Tool for Analysis"
        },
        {
          "code_url": "https://github.com/cannin/causalpath_cytoscape_app",
          "description": "<p>The project is marked as Issue #169 in GitHub. The main goal of this project is to visualize the network which is generated from the Casual Path algorithm using some of available functionalities of cytoscape and make an executable jar file which is a cytoscape application for visualization of the generated network and also store the previous used files  and save the current session for future reference. I have written detailed overview and implementation approach for the  project and create a timeline for the whole implementation.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2021_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5421107825344512/",
          "proposal_id": null,
          "short_description": "The project is marked as Issue #169 in GitHub. The main goal of this project is to visualize the network which is generated from the Casual Path...",
          "slug": "develop-a-cytoscape-app-for-the-casual-path-algorithm",
          "status": "completed",
          "student_name": "Pritam Saha",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Develop a Cytoscape App for the Casual Path Algorithm"
        },
        {
          "code_url": "https://aniket328.github.io/GSoC21_Aniket_Ranjan_NRNB_report/",
          "description": "<p>This project aims to add improvements in the admin panel of openPIP that is used to upload data and files, post announcements and change global settings of installed instances. \nThe project also requires work on the creation of an installation package and installation guide for the new users to follow. Ultimately, the project will prepare openPIP for publication.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2021_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5490035943538688/",
          "proposal_id": null,
          "short_description": "This project aims to add improvements in the admin panel of openPIP that is used to upload data and files, post announcements and change global...",
          "slug": "enhancing-the-admin-panel-of-openpip",
          "status": "completed",
          "student_name": "Aniket Ranjan",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Enhancing the admin panel of openPIP"
        },
        {
          "code_url": "https://docs.google.com/document/d/1wavf0MmCaPGopJhRyEr8HJdszmea7_0RY1kYQrVE540/edit?usp=sharing",
          "description": "<p>Newt is a web-based tool to analyze biological maps in standard formats such as PD and AF languages of SBGN, SBML, and SIF.</p>\n<p>This project aims to provide database support for Newt. SGBN maps stored on the database using Newt must be stored in an integrated manner ( i.e. fit like a puzzle with the existing database ).</p>\n<p>Furthermore, Newt must also provide the functionality to query the database for maps of interest, based on genes of interest using algorithms such as shortest path between entities, k-neighborhood, upstream/downstream of an entity, etc.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2021_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5513122768486400/",
          "proposal_id": null,
          "short_description": "Newt is a web-based tool to analyze biological maps in standard formats such as PD and AF languages of SBGN, SBML, and SIF.\nThis project aims to...",
          "slug": "local-db-support-for-sbgn-maps-in-newt",
          "status": "completed",
          "student_name": "Pankaj Yadav",
          "student_profile": null,
          "tags": [
            "web",
            "ml",
            "ai",
            "database"
          ],
          "title": "Local DB support for SBGN maps in Newt"
        },
        {
          "code_url": "https://github.com/nikitamahoviya/GSoC-21-Project_Final_Report",
          "description": "<p>We have to create a service for VCell users that allows Fiji/ImageJ scripting to directly access the VCell client. We have to expand this service into a series of user-friendly plugins for ImageJ that will automate processing and analyzing cell imaging simulation experiments.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2021_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5255777991786496/",
          "proposal_id": null,
          "short_description": "We have to create a service for VCell users that allows Fiji/ImageJ scripting to directly access the VCell client. We have to expand this service...",
          "slug": "develop-gui-for-imagej-groovy-script-calling-vcell-api",
          "status": "completed",
          "student_name": "NIKITA MAHOVIYA",
          "student_profile": null,
          "tags": [
            "api",
            "ui"
          ],
          "title": "Develop GUI for ImageJ groovy script calling VCell API"
        },
        {
          "code_url": "https://github.com/noahlb123/vcell#readme",
          "description": "<p>ModelBricks is a tool for bioinformatics researchers that allows users to browse, view, and download detailed models of biological processes. I propose that various needed visualizations, and model retrieval functions are added using the existing code framework and the VCell API. Furthermore, I propose that the VCell API be expanded to include useful functionality such as more versatile searching and permissions changes.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2021_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/4682812174630912/",
          "proposal_id": null,
          "short_description": "ModelBricks is a tool for bioinformatics researchers that allows users to browse, view, and download detailed models of biological processes. I...",
          "slug": "expand-modelbricksorg-and-vcell-api",
          "status": "completed",
          "student_name": "Noah Liguori-Bills",
          "student_profile": null,
          "tags": [
            "api",
            "ai"
          ],
          "title": "Expand ModelBricks.org and VCell API"
        },
        {
          "code_url": "https://docs.google.com/document/d/1f2xqqWRrk_Dzi5WFWem20CN49SxDtxttoQcZzBCzHck/edit?usp=sharing",
          "description": "<p>Over the last few years, the programming language Rust has seen a surge in popularity. This has primarily been the case due to its more robust memory management and faster execution when compared to C/C++. Rust’s features are advantageous while building scientific software since there’s often a large amount of data to analyse, and performance is one of the most critical concerns. Hence, Rust is now being applied to the development of bioinformatics tools as well. In the future, these tools will be increasingly used online, and implementation in the Rust language is expected to ensure the safety of these tools. This project aims to demonstrate the suitability of Rust to the development of a simulator for SBML models.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2021_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/4702026784571392/",
          "proposal_id": null,
          "short_description": "Over the last few years, the programming language Rust has seen a surge in popularity. This has primarily been the case due to its more robust memory...",
          "slug": "sbml-simulator-in-rust",
          "status": "completed",
          "student_name": "Pranav Ballaney",
          "student_profile": null,
          "tags": [
            "ml",
            "ai",
            "ui"
          ],
          "title": "SBML Simulator in Rust"
        },
        {
          "code_url": "https://medium.com/@mohmedsoudy77/google-summer-of-code-2021-work-report-43e9d73b03bb",
          "description": "<p>ABioTrans Plus is a web server for transcriptome data analysis and visualization. It supports the analysis of microarray and RNASeq data and performs ten different bio-statistical analyses that cover the common analytics for gene expression data. Furthermore, it gives the users access to several bioinformatics tools to perform 12 different bioinformatics analyses on gene/protein datasets. This project aims to develop ABioTrans Plus v3.0 which will support a wider range of high throughput omics data, namely MS-based proteomics and metabolomics data. Furthermore, developing a detailed report with the performed analysis with figures and data ready to be included in the publications. Machine learning is a method of data analysis that automates analytical model building. It is a branch of artificial intelligence based on the idea that systems can learn from data, identify patterns and make decisions with minimal human intervention. Machine learning has been used broadly in biological studies for prediction and discovery.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2021_009",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/4792324613210112/",
          "proposal_id": null,
          "short_description": "ABioTrans Plus is a web server for transcriptome data analysis and visualization. It supports the analysis of microarray and RNASeq data and performs...",
          "slug": "adding-multi-omics-data-support-to-abiotrans-plus",
          "status": "completed",
          "student_name": "Mohamed Soudy-1",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "ui"
          ],
          "title": "Adding Multi-omics data support to ABioTrans Plus"
        },
        {
          "code_url": "https://gist.github.com/acanalpay/7331af0109078602729da24a1f41b584",
          "description": "<p>Newt supports the Process Description (PD) and the Activity Flow (AF) graphs of SBGN. However,  there is no conversion between these two graphs in the Newt.  PD is a detailed version of AF. Thus, from PD, AF can be obtained but not vice versa. There is already a library for converting PD to AF. The goal of this project is to host a service for this converter and then integrate it into Newt.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2021_010",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/4818667191140352/",
          "proposal_id": null,
          "short_description": "Newt supports the Process Description (PD) and the Activity Flow (AF) graphs of SBGN. However,  there is no conversion between these two graphs in...",
          "slug": "pd-to-af-conversion-facility-in-newt",
          "status": "completed",
          "student_name": "Can Alpay",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "PD to AF conversion facility in Newt"
        },
        {
          "code_url": "https://sbml4humans-gsoc-2021.blogspot.com/2021/08/gsoc-2021-sbml4humans-interactive-sbml.html",
          "description": "<p>Systems Biology Markup Language (SBML) is a standard format for the representation and exchange of biological models between computers. The information in an SBML model file is organized as a list of components encapsulated within the model (e.g. compartments, species, parameters, reactions, etc.). However, SBML is difficult to read, comprehend and interpret by humans directly, and tools are required to provide an abstraction layer to interact with SBML objects and the relationships between them. The objective of the project SBML4Humans is to address this issue by providing  an interactive and reactive report for SBML models which will allow humans (experts as well as beginners) to easily comprehend the content of a model. The key features introduced in the interactive report are:</p>\n<p>i) interactive SBML report with navigation between SBML objects</p>\n<p>ii) search and filter functionality</p>\n<p>iii) web application with REST API</p>\n<p>iv) downloadable standalone reports</p>\n<p>v) support for hierarchical models</p>\n<p>vi) support for distributions and uncertainties</p>\n<p>vii) support for COMBINE archives</p>\n<p>Such an interactive report will thus significantly enhance the process of reading and exchanging SBML models.</p>\n",
          "difficulty": "beginner",
          "id": "proj_national-resource-fo_2021_011",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/4821475160227840/",
          "proposal_id": null,
          "short_description": "Systems Biology Markup Language (SBML) is a standard format for the representation and exchange of biological models between computers. The...",
          "slug": "sbml4humans-interactive-sbml-report-for-humans",
          "status": "completed",
          "student_name": "Sankha Das",
          "student_profile": null,
          "tags": [
            "react",
            "web",
            "api",
            "ml",
            "ai"
          ],
          "title": "SBML4Humans - Interactive SBML Report for Humans"
        },
        {
          "code_url": "https://github.com/RBVI/clusterMaker2/pull/26",
          "description": "<p>Implementing following dimensionality reduction techniques and clustering algorithms to clusterMaker2: UMAP, t-SNE, PCA, PCoA, Louvain, Walktrap, Edge Betweenness, Surprise, DBSCAN, Spectral clustering and Self Organizing Map. This project is a continuation from last summer's clusterMaker2 project, when I implemented a feature that allows running the algorithms on a remote server. These algorithms that will be added will also use the remote feature.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2021_012",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6069235133972480/",
          "proposal_id": null,
          "short_description": "Implementing following dimensionality reduction techniques and clustering algorithms to clusterMaker2: UMAP, t-SNE, PCA, PCoA, Louvain, Walktrap,...",
          "slug": "implementing-multiple-clustering-algorithms-and-dimensionality-reduction-techniques-on-clustermaker2",
          "status": "completed",
          "student_name": "Maija Utriainen",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Implementing multiple clustering algorithms and dimensionality reduction techniques on clusterMaker2"
        },
        {
          "code_url": "https://sanderlab.github.io/tumorcomparer/",
          "description": "<h3>TumorComparer, updated version</h3>\n<p>The TumorComparer is a computational method for the comparison of different cancer types with cancer cell lines by their cellular profile. This comparison allows finding the closest cell lines for a selected cancer type by molecular profile as well as to detect outliers.</p>\n<p>The main objectives of the project are:</p>\n<ul>\n<li>Expand the package to include new data types</li>\n<li>Create patient to patient similarity examples on R shiny based platform</li>\n<li>Provide a network visualization for correlated samples and cell lines</li>\n</ul>\n<p>Further updates for the package are:</p>\n<ul>\n<li>Implement a function to perform comparison for separate gene sets and make the graphical interface of the function for shiny application</li>\n<li>Update R shiny application to have better error handling, improved event observers for optimal app performance, and interactive documentation</li>\n</ul>\n<p>Finally, an updated version of the package will be capable to analyze new omics data types as well as perform comparisons for separate gene sets. R shiny application will be more optimized and user-friendly.</p>\n",
          "difficulty": null,
          "id": "proj_national-resource-fo_2021_013",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5809458332041216/",
          "proposal_id": null,
          "short_description": "TumorComparer, updated version\nThe TumorComparer is a computational method for the comparison of different cancer types with cancer cell lines by...",
          "slug": "tumorcomparer-updated-version",
          "status": "completed",
          "student_name": "Siras Hakobyan",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "TumorComparer, updated version"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2021/organizations/4898028657311744/"
    },
    "year_2022": {
      "num_projects": 8,
      "projects": [
        {
          "code_url": "https://docs.google.com/document/d/17Yp1YPOVLc3PJYNRKO9FeCiH_bzyK8rVv08jGs3ilyQ/edit?usp=sharing",
          "description": "Currently, the Newt editor supports Systems Biological Graphical Notation (SBGN) and Simple Interactive Format (SIF) formats while also allowing importing/exporting data in Systems Biology Markup Language (SBML) format. Conversion to SBML format from SBGN or SIF is lossy since the data models are not fully compatible. Information may be lost during conversion to SBML format. This is why supporting the SBML format in Newt is crucial. The main feature proposed to be implemented is for users to create SBML models from scratch in Newt without the need to convert them to other data formats. An additional palette will be added with the corresponding notation to the existing palette for the user to create new SBML models or edit an existing one by dragging elements from the palette.",
          "difficulty": null,
          "id": "proj_national-resource-fo_2022_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/7cXTK3p5/",
          "proposal_id": null,
          "short_description": "Currently, the Newt editor supports Systems Biological Graphical Notation (SBGN) and Simple Interactive Format (SIF) formats while also allowing...",
          "slug": "sbml-minerva-support-in-newt",
          "status": "completed",
          "student_name": "Selbi Ereshova",
          "student_profile": null,
          "tags": [
            "ml",
            "ai"
          ],
          "title": "SBML-MINERVA support in Newt"
        },
        {
          "code_url": "https://github.com/cannin/graph_neural_network_drug_response/blob/main/docs/_reports/GSoC_final_report.md",
          "description": "The use of machine learning models in medicine is expanding, but there are still undergoing due to the interpretability. One useful example which has understandability is DrugCell, which reflects biological structures in machine learning models. Based on this model, this project aims to build a machine learning pipeline using DrugCell from the data in the CellMinerCDB database developed by NRNB.\n\nThe current data structure of CellMinerCDB makes it challenging to pass inputs directly to DrugCell. Therefore, in this project, we will make PRs for 1) processing the data, 2) passing the data, and 3) calling DrugCell to make predictions.\n\nThe deliverable of this project is to merge the above PRs into rcellminer, so that data acquisition, processing, and prediction can be completed by rcellminer.",
          "difficulty": null,
          "id": "proj_national-resource-fo_2022_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/ylOolPrk/",
          "proposal_id": null,
          "short_description": "The use of machine learning models in medicine is expanding, but there are still undergoing due to the interpretability. One useful example which has...",
          "slug": "create-a-pipeline-from-data-extraction-to-execution-of-gnn-based-drug-response-prediction",
          "status": "completed",
          "student_name": "Yoshitaka Inoue",
          "student_profile": null,
          "tags": [
            "ai",
            "database",
            "ui"
          ],
          "title": "Create a Pipeline from data extraction to execution of GNN based Drug Response Prediction"
        },
        {
          "code_url": "https://medium.com/@fizza.rubab/google-summer-of-code-2022-cloud-copasi-nrnb-6308ef05edb2",
          "description": "Customized SSH Authentication Free Implementation of the Cloud-COPASI for UConn users:\nThe  project proposal aims to create a customized version of Cloud-COPASI that already has a predefined HPC pool connection which will be used by all registered users of this version of Cloud-COPASI. It will also implement a quota system to prevent abuse of computing resources.\nThis will be accomplished by using a predefined SSH connection to the facility. Instead of user holding the private key and moving the public key to the remote submit node, the server holds a database of all remote nodes and for each node it creates a separate public and private key pair.  The public key will be copied to the remote node. The private key would be saved on the server. Whenever an authenticated user tries to connect to a particular submit node in the HPC facility, the private key for that node will be fetched by the server and will be used to authenticate the user against that remote node and there will be no need for the user to configure and enter any private key at all. Thus there will be just one private key for all users of a particular submit node. Server will also keep a tally of all the users that are currently using the server's private key at the moment. This will help implement a quota system to ensure that the resources are not maxed out.\nOver the span of 12 weeks, a customized version of cloud COPASI will be produced that will provide an easy to use interface for UConn users to submit their jobs and get results in quick time.",
          "difficulty": "beginner",
          "id": "proj_national-resource-fo_2022_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/edb5T3iZ/",
          "proposal_id": null,
          "short_description": "Customized SSH Authentication Free Implementation of the Cloud-COPASI for UConn users: The project proposal aims to create a customized version of...",
          "slug": "high-throughput-simulation-for-computational-cell-biology-with-cloud-copasi",
          "status": "completed",
          "student_name": "Fizza Rubab",
          "student_profile": null,
          "tags": [
            "ai",
            "database",
            "cloud",
            "ui"
          ],
          "title": "High-throughput simulation for computational cell biology with Cloud-COPASI"
        },
        {
          "code_url": "https://gist.github.com/AkMo3/260b155ffc095ed52e1beccaa318cbe0",
          "description": "This proposal aims to implement new features to the Enrichment Table App.\nThe major changes were adding Ring Charts, prediction of gene id column and organism using past network history, implementing various filters and redundancy removal mechanisms, and reciprocal node selection.  Some other minor new features were adding the ability to generate enrichment map from current table data and adding a new logging mechanism to the app to provide clear error messages. Entire new documentation was written for new users to the app to guide them through project usage. The app was further improved by providing multiple bug fixes and GitHub action to generate a new jar on code push.",
          "difficulty": null,
          "id": "proj_national-resource-fo_2022_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/8f4qeUPF/",
          "proposal_id": null,
          "short_description": "This proposal aims to implement new features to the Enrichment Table App. The major changes were adding Ring Charts, prediction of gene id column and...",
          "slug": "updates-to-the-enrichment-table-app",
          "status": "completed",
          "student_name": "Akash Mondal",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Updates to the Enrichment Table App"
        },
        {
          "code_url": "https://github.com/BaderLab/openPIP/pull/80",
          "description": "OpenPIP (Open Source Protein Interaction Platform) is an open-source software package for hosting protein-protein interaction (PPI) data based on the PSI-MI-TAB format. openPIP provides a PPI database and a customisable web interface that enables searching and visualising the interactions as well as downloading the search results in different formats. The whole system is a ready-to-use virtual machine that can be imported to VMware.\n\n\nThis project aims to add enhancements and several new features in various sections of openPIP that are used to upload and download data and files, and visualize the complex interaction on various levels with filters and applications.",
          "difficulty": "advanced",
          "id": "proj_national-resource-fo_2022_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/fjUDLOrk/",
          "proposal_id": null,
          "short_description": "OpenPIP (Open Source Protein Interaction Platform) is an open-source software package for hosting protein-protein interaction (PPI) data based on the...",
          "slug": "adding-visualization-of-protein-complex-interaction-to-openpip",
          "status": "completed",
          "student_name": "Aniket Ranjan",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "database"
          ],
          "title": "Adding visualization of protein-complex interaction to OpenPIP"
        },
        {
          "code_url": "https://github.com/SynBioDex/SBOL-utilities/pull/186",
          "description": "The SBOL-Utilities repository is a python library that provides many useful\nmethods and utilities on top of the main PySBOL3 implementation of SBOL3. All\nthe utilities created in the SBOL-Utilities repository follows the design choices and\nimplementations as described in the various SEPs (SBOL Enhancement\nProtocols). Now, GenBank is another popular file format for storing sequences,\nDNA components, etc, just like SBOL. Currently, SBOL-Utilities supports\nconversion to GenBank from SBOL3, but only by having an intermediate SBOL2\nconversion. What I seek to implement in this project is a way to directly convert\nSBOL3 to GenBank, without any intermediate file formats.\nThe final goal is to have a set of test GenBank files generated from conversion and implement unit tests for the same.",
          "difficulty": "medium",
          "id": "proj_national-resource-fo_2022_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/IvKQhkk9/",
          "proposal_id": null,
          "short_description": "The SBOL-Utilities repository is a python library that provides many useful methods and utilities on top of the main PySBOL3 implementation of SBOL3....",
          "slug": "conversion-between-genbank-and-sbol3",
          "status": "completed",
          "student_name": "Mohit Makwana",
          "student_profile": null,
          "tags": [
            "python",
            "ai"
          ],
          "title": "Conversion between GenBank and SBOL3"
        },
        {
          "code_url": "https://sajo25.github.io/netboxr/",
          "description": "netboxr is an R package for the automated discovery of biological process modules by network analysis. The project involves updating netboxr functionality. The proposed updates include the addition of new analysis features (more specifically, the ability to support weighted nodes in community detection and to parameterize the sizes of returned modules), and making netboxr more widely available to researchers via the Galaxy platform. Additionally, time-permitting, a pipeline for processing datasets from the cBioPortal using netboxr will also be created.",
          "difficulty": null,
          "id": "proj_national-resource-fo_2022_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/nZRMy1Oa/",
          "proposal_id": null,
          "short_description": "netboxr is an R package for the automated discovery of biological process modules by network analysis. The project involves updating netboxr...",
          "slug": "netboxr-updates",
          "status": "completed",
          "student_name": "Sara J",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "NetBoxR Updates"
        },
        {
          "code_url": "https://github.com/combine-org/combine-notebooks",
          "description": "The Computational Modeling in Biology Network (COMBINE) is an initiative to coordinate the development of various community standards and formats in systems biology and related fields. While multiple resources exist explaining these standards as well as libraries to work with these standards, it is currently challenging for newcomers to start using them. Existing resources are difficult to find, read, comprehend, implement, and interpret. The overall goal of the project is to address these issues by developing Jupyter notebooks showcasing COMBINE standards and libraries.\n\nThe notebooks will be developed around one common theme; the famous repressilator model. The project will demonstrate how to construct, encode, visualize, simulate, annotate and distribute computational models using COMBINE standards and libraries. This project will contribute open resources which will \n\n● introduce and educate newcomers to standards for computational models. \n● aid in navigating the vast online resources available in this area by providing a common entry point. \n● provide an interactive introduction to the libraries with code examples for important examples. \n● provide testing of COMBINE libraries via Continuous Integration (CI).\n\nThereby this project will add an important contribution to the field of systems biology and network biology.",
          "difficulty": null,
          "id": "proj_national-resource-fo_2022_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/pimyoHRY/",
          "proposal_id": null,
          "short_description": "The Computational Modeling in Biology Network (COMBINE) is an initiative to coordinate the development of various community standards and formats in...",
          "slug": "create-jupyter-notebooks-showcasing-combine-standards",
          "status": "completed",
          "student_name": "Aditya Singhal",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Create Jupyter Notebooks showcasing COMBINE Standards"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2022/organizations/national-resource-for-network-biology-nrnb/"
    },
    "year_2023": {
      "num_projects": 8,
      "projects": [
        {
          "code_url": "https://gist.github.com/AkMo3/7288756239c2aad897c23162daa8195d",
          "description": "Cytoscape.js is an open-source JavaScript-based graph theory library\nthat can be used for graph analysis and visualisation. It contains many useful\nfunctions in graph theory and can be used headlessly on Node.js to do graph\nanalysis in the terminal or on a web server. Cytoscape.js supports several types\nof graphs, including traditional graphs, directed graphs, undirected graphs,\nmultigraphs and hypergraphs (with compound nodes, but not yet with\nhyperedges). It was designed to make it as easy as possible for programmers\nand scientists to use graph theory in their apps. The application receives\nconstant updates from open-source contributors, which are bundled in a patch\nfor release. The current system of this release is primarily manual. This proposal\naims toward developing GitHub action that automates the task of release\nresulting in lower costs of making the release.",
          "difficulty": "beginner",
          "id": "proj_national-resource-fo_2023_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/b74gpyOU",
          "proposal_id": "1K2XemMm",
          "short_description": "Cytoscape.js is an open-source JavaScript-based graph theory library that can be used for graph analysis and visualisation. It contains many useful...",
          "slug": "automate-cytoscapejs-release-process-using-github-actions",
          "status": "completed",
          "student_name": "Akash Mondal",
          "student_profile": null,
          "tags": [
            "java",
            "javascript",
            "web",
            "ai"
          ],
          "title": "Automate Cytoscape.js release process using GitHub Actions"
        },
        {
          "code_url": "https://ermismd.github.io/MGG/",
          "description": "Microbial associations play a fundamental part in deciphering underlying mechanisms of microbial communities. A series of algorithms have been developed to retrieve such associations from taxa abundance data, however the outcome is usually tool-dependent and a large number of the retrieved associations may be spurious. microbetag is a co-occurrence network annotator aiming at increasing/decreasing the confidence level of the associations of such a network. However, being a command line tool, microbetag’s output is hard to interpret; its true potential can be revealed only by visualizing its findings so researchers can combine the retrieved annotations with their expertise to make further conclusions. Cytoscape Apps support additional features, e.g. new layouts, connection with databases etc, on Cytoscape, a well-established open source software platform for visualizing such interaction networks.\nGoal of this project is to develop a Cytoscape App providing a graphical interface for the microbetag tool.",
          "difficulty": null,
          "id": "proj_national-resource-fo_2023_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/7IKSInMx",
          "proposal_id": "OpSoVjNa",
          "short_description": "Microbial associations play a fundamental part in deciphering underlying mechanisms of microbial communities. A series of algorithms have been...",
          "slug": "development-of-a-cytoscape-app-for-microbe-microbe-association-networks",
          "status": "completed",
          "student_name": "Ermis Delopoulos",
          "student_profile": null,
          "tags": [
            "ai",
            "database"
          ],
          "title": "Development of a Cytoscape App for microbe-microbe association networks"
        },
        {
          "code_url": "https://github.com/cannin/gsoc_2023_pytorch_pathway_commons/blob/main/docs/_reports/Final%20Report%20of%20GSoC%202023.pdf",
          "description": "The main goal of this project is to create a PyTorch Geometric(PyG) dataset by integrating the cBioPortal and Pathway Commons datasets and provide a clear example code for this integration. The project will require working with different datasets from the cBioPortal and Pathway Commons. \n\nThe proposed solution involves a three-stage process: retrieving and preprocessing data from the datasets, integrating the data, and developing and training Graph Neural Network(GNN) models on the integrated dataset. \n\nThe main deliverables for this project will be:\n\n1. Preprocessed and integrated example dataset for PyTorch Geometric using cBioPortal and Pathway Commons datasets.\n\n2. Example code for combining cBioPortal and Pathway Commons datasets in PyTorch Geometric.\n\n3. Developed and optimized GNN models for downstream tasks using the integrated dataset.\n\nAdditionally, the project will produce a well-documented and well-structured codebase for data retrieval, preprocessing, integration, and GNN model development. The final deliverable will be the contributed PyTorch Geometric dataset to the library for potential use by other researchers.",
          "difficulty": null,
          "id": "proj_national-resource-fo_2023_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/NBZn0Zm3",
          "proposal_id": "i2DFEZ1D",
          "short_description": "The main goal of this project is to create a PyTorch Geometric(PyG) dataset by integrating the cBioPortal and Pathway Commons datasets and provide a...",
          "slug": "generate-example-dataset-for-pytorch-geometric-based-on-pathway-commons-and-prototype",
          "status": "completed",
          "student_name": "Favour James",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Generate Example Dataset for PyTorch Geometric Based on Pathway Commons and Prototype"
        },
        {
          "code_url": "https://gist.github.com/Jigyasa-G/543d3a96463308479bb86aa866323391",
          "description": "clusterProfiler is an efficient package that provides a universal interface for gene functional annotation from a variety of resources and is extremely helpful in data manipulation and its visualization. The idea of integrating Pathway Commons, which is an aggregated database of molecular interactions of approximately 20 databases, brings in scope to analyze data and obtain better results. However, the data lies in GMT format due to which it requires additional functions to bind pathways with their name and gene. It is then saved in RDS format to feed the enricher() function to obtain an enrichResult object. We perform ORA and GSEA using some functions defined in R script on Pathway Commons data to support it in clusterProfiler.\n\nWith the advent of a new technique ssGSEA (single sample Gene Set Enrichment Analysis) used to quantify the activity of a specific pathway or gene set in individual sample,for example, analyzing heterogeneous samples (tumor samples), integration of ssGSEA with clusterProfiler will help in better medical analyses. Thus, using packages like GSVA(Gene set variation analysis) and GenePattern we can calculate enrichment scores in permutations and support ssGSEA  in clusterProfiler.",
          "difficulty": null,
          "id": "proj_national-resource-fo_2023_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/GYJ9YvJD",
          "proposal_id": "S5gKxube",
          "short_description": "clusterProfiler is an efficient package that provides a universal interface for gene functional annotation from a variety of resources and is...",
          "slug": "supporting-pathway-commons-and-ssgsea-in-clusterprofiler",
          "status": "completed",
          "student_name": "JIGYASA GUPTA",
          "student_profile": null,
          "tags": [
            "ai",
            "database",
            "ui"
          ],
          "title": "Supporting Pathway Commons and ssGSEA in clusterProfiler"
        },
        {
          "code_url": "https://github.com/RBVI/CyPlot/tree/Develop-Kartik",
          "description": "This project involves updating cyPlot(a Cytoscape app written in JAVA) which provides the ability to plot data through GUI or CyCommands/REST. CyPlot uses plotly.js to achieve plot related functions. CyPlot also customizes plotly.js and PlotlyEditor to suit the needs of CyPlot. It currently supports plots including heatmaps, violin plots, volcano plots, dot plots, line graphs, and scatter plots. The main goals of this project include:\n 1. Add Histogram as an additional plot type.\n 2. Implement log scales for scatter plot, line plot and histogram plot.\n 3. Support linear regression.\n 4. Updated user interface (UI)",
          "difficulty": null,
          "id": "proj_national-resource-fo_2023_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/8MUpOz28",
          "proposal_id": "EFJM8XN9",
          "short_description": "This project involves updating cyPlot(a Cytoscape app written in JAVA) which provides the ability to plot data through GUI or CyCommands/REST. CyPlot...",
          "slug": "develop-new-features-for-cytoscape-app-cyplot",
          "status": "completed",
          "student_name": "Kartik Kumar Pawar",
          "student_profile": null,
          "tags": [
            "java",
            "ai",
            "ui"
          ],
          "title": "Develop new features for Cytoscape App-cyPlot"
        },
        {
          "code_url": "https://gist.github.com/maheshkasabe/0218efdc41da263331a99588573adec7",
          "description": "Currently the Graphspace code repository has a lot of mismatched dependency issues & consist no automating techniques in their repository to release or test graphspace image while deploying to production. The Project aims to stabilise & setup the CI/CD pipeline for Graphspace project. The project involves creating a Production ready Dokcerfile setup to install graphspace locally. The project also focuses on automating the release workflow of Docker image to Docker-registry services like AWS ECR or Dockerhub, automating the releasing, testing PR , labelling (PR's & Issues), performing necessary security checks & image vulnerability scans by creating multiple workflows with Github Actions",
          "difficulty": null,
          "id": "proj_national-resource-fo_2023_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/tSIGvxsf",
          "proposal_id": "j4mbNmdl",
          "short_description": "Currently the Graphspace code repository has a lot of mismatched dependency issues & consist no automating techniques in their repository to release...",
          "slug": "setting-up-the-cicd-pipeline-using-github-actions-on-graphspace",
          "status": "completed",
          "student_name": "Mahesh Kasbe",
          "student_profile": null,
          "tags": [
            "ai",
            "docker"
          ],
          "title": "Setting up the CI/CD Pipeline using Github Actions on GraphSpace"
        },
        {
          "code_url": "https://mustardburger.github.io/projects/gsoc/",
          "description": "CellBox is a model for predicting cell states under drug perturbations, whose code base was originally written in Tensorflow 1. Since Tensorflow 1 has been replaced by Tensorflow 2 and Pytorch, the aim of the project is to recreate CellBox in Pytorch. There are three main components of the model: the data processing pipeline, the model architecture, and the training process, all of which will be sequentially converted into Pytorch. After the conversion is complete, the new Pytorch model is trained using the same training configurations as the Tensorflow model. The following deliverables define the proposal’s success: the trained Pytorch model should reproduce the same results as the current Tensorflow model; the new Pytorch code base should be configured to be able to run on multiple platforms (Linux, Mac, …); and the github should have clear documentations for installing and running the model.",
          "difficulty": null,
          "id": "proj_national-resource-fo_2023_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/HKW6ydaI",
          "proposal_id": "ZkmgOuj8",
          "short_description": "CellBox is a model for predicting cell states under drug perturbations, whose code base was originally written in Tensorflow 1. Since Tensorflow 1...",
          "slug": "convert-cellbox-tensorflow-code-to-pytorch",
          "status": "completed",
          "student_name": "Phuc Nguyen",
          "student_profile": null,
          "tags": [
            "ai",
            "ux"
          ],
          "title": "Convert CellBox Tensorflow code to Pytorch"
        },
        {
          "code_url": "https://github.com/sidd-2203/cellminercdb/tree/GSoC-Staging",
          "description": "CellMinerCDB provides a web-based resource for integrating multiple forms of pharmacological and genomic analyses, and unifying the richest cancer cell line datasets (the NCI-60, Sanger/MGH GDSC, and Broad CCLE/CTRP).CellMinerCDB enables data queries for genomics analyses and exploration of pharmacogenomic determinants of response. It leverages overlaps of cell lines and drugs across databases to examine several biological questions. CellMinerCDB is built using R Shiny which provides a modular framework.\nThis proposal is aiming towards adding an additional module in CellMinerCDB for Network Analysis that will provide an easier visualization of averaged genetic profiling data on top of a curated set of pathways.",
          "difficulty": null,
          "id": "proj_national-resource-fo_2023_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/9bSOdy71",
          "proposal_id": "dJq0fx4S",
          "short_description": "CellMinerCDB provides a web-based resource for integrating multiple forms of pharmacological and genomic analyses, and unifying the richest cancer...",
          "slug": "implement-a-r-shiny-module-for-network-analysis-in-cellminercdb",
          "status": "completed",
          "student_name": "Siddharth Chaudhary",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "database",
            "ui"
          ],
          "title": "Implement a R Shiny module for Network Analysis in CellMinerCDB"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2023/organizations/national-resource-for-network-biology-nrnb"
    },
    "year_2024": {
      "num_projects": 11,
      "projects": [
        {
          "code_url": "https://gist.github.com/SainiAditya1/90e96e09bad684fdc5734a186c233165",
          "description": "The goal of this project is to add new functionalities to Newt to be able to create biological maps in GPML format from scratch or edit existing ones. This will provide users to have a web-based alternative to PathVisio where they can easily create/edit GPML maps from any computer with Internet access. The functionalities to be added will also include access to WikiPathways, easy identifier mapping and data visualization etc., as in PathVisio.",
          "difficulty": "beginner",
          "id": "proj_national-resource-fo_2024_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/g2B7bPLO/",
          "proposal_id": null,
          "short_description": "The goal of this project is to add new functionalities to Newt to be able to create biological maps in GPML format from scratch or edit existing...",
          "slug": "gpml-support-in-newt",
          "status": "completed",
          "student_name": "Aditya Saini",
          "student_profile": null,
          "tags": [
            "web",
            "ml"
          ],
          "title": "GPML support in Newt"
        },
        {
          "code_url": "https://umut-er.github.io/posts/my-contributions-to-the-newt-project/",
          "description": "In this proposal, I explain the machine learning support I aim to implement to generate SBGN maps. I am planning to make an API connection to a machine learning service, let it generate an SBGN map based on an explanatory text provided by the user and integrate the result to the current map. I also plan to give the user the option to reject the new map in the event that it does not match their expectations. The proposal also includes a section about some maintenance work on the backend of the project.",
          "difficulty": null,
          "id": "proj_national-resource-fo_2024_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/gk4SrGuW/",
          "proposal_id": null,
          "short_description": "In this proposal, I explain the machine learning support I aim to implement to generate SBGN maps. I am planning to make an API connection to a...",
          "slug": "machine-learning-support-for-constructing-newt-sbgn-maps",
          "status": "completed",
          "student_name": "Umut Utku ERŞAHİNCE",
          "student_profile": null,
          "tags": [
            "api",
            "ai",
            "backend"
          ],
          "title": "Machine Learning Support for Constructing Newt SBGN Maps"
        },
        {
          "code_url": "https://jguillen15.github.io/",
          "description": "The goal is developing an updated workflow that uses the existing iGEM distribution structure to integrate a synthesizability assessment of genetic designs and build plans for DNA assembly, with the purpose of facilitating DNA synthesis orders. For this, I am going to integrate the SBOL-utilities script of calculate_complexity_scores.py (https://github.com/SynBioDex/SBOL-utilities/blob/develop/sbol_utilities/calculate_complexity_scores.py) into the iGEM-Actions workflow(https://github.com/iGEM-Engineering/iGEM-actions), storing metadata in the Synthetic Biology Open Language(SBOL)",
          "difficulty": "advanced",
          "id": "proj_national-resource-fo_2024_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/E1zR3jcF/",
          "proposal_id": null,
          "short_description": "The goal is developing an updated workflow that uses the existing iGEM distribution structure to integrate a synthesizability assessment of genetic...",
          "slug": "integration-of-complexity-score-functions-into-the-igem-dna-kit-distribution-workflow",
          "status": "completed",
          "student_name": "Johan Guillen",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "Integration of complexity score functions into the iGEM DNA kit distribution workflow"
        },
        {
          "code_url": "https://drive.google.com/file/d/1osF48I1BQfKO7Bw2rn9qq8-LByAiw3_1/view?usp=drive_link",
          "description": "This project aims to enhance the accessibility and usability of the ASCETIC framework, which interprets tumor evolutionary signatures crucial for patient stratification and treatment decisions. The proposal involves developing a Shiny app in R, providing an intuitive dashboard facilitating user interaction with ASCETIC. The dashboard will feature sections for uploading and analyzing data, performing inference, and visualizing survival curves. By simplifying the analysis of oncological data and translating complex molecular information into actionable insights, the project aims to empower users to make informed clinical decisions. The deliverables include a fully functional dashboard with intuitive navigation, data visualization tools, inference capabilities, and project management features such as saving and reloading projects.",
          "difficulty": "advanced",
          "id": "proj_national-resource-fo_2024_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/uRwvXHO6/",
          "proposal_id": null,
          "short_description": "This project aims to enhance the accessibility and usability of the ASCETIC framework, which interprets tumor evolutionary signatures crucial for...",
          "slug": "ascetic-vision",
          "status": "completed",
          "student_name": "Nada Mohamed",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "ASCETIC Vision"
        },
        {
          "code_url": "https://gist.github.com/code-bele/59a3df1a6bb39cc697a4e3fe3a8d9169",
          "description": "BEELINE is a bench marking tool that evaluates different methods and models that infer Gene Regulatory Networks (GRN) from Single cell gene expression data. The BLRun package currently incorporates 12 inference algorithms. The primary goal of this project is to expand this to 15 by adding the latest algorithms and test it on new datasets as well. The new algorithms would first be implemented and added to BEELINE as docker containers. These will then be evaluated for performance using the BLEval package and its metrics.",
          "difficulty": null,
          "id": "proj_national-resource-fo_2024_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/vlvwQRJY/",
          "proposal_id": null,
          "short_description": "BEELINE is a bench marking tool that evaluates different methods and models that infer Gene Regulatory Networks (GRN) from Single cell gene...",
          "slug": "integration-of-grn-inference-algorithms-using-single-cell-multi-omics-data-to-beeline",
          "status": "completed",
          "student_name": "BB Vishnu Madhav",
          "student_profile": null,
          "tags": [
            "ai",
            "docker"
          ],
          "title": "Integration of GRN inference algorithms using single cell multi-omics data to BEELINE"
        },
        {
          "code_url": "https://toolshed.g2.bx.psu.edu/repos/bimib/marea_2/file/default/marea_2",
          "description": "MaREA4Galaxy is a user-friendly tool designed to facilitate the characterization and graphical comparison of sample groups exhibiting distinct transcriptional regulation of metabolism, as inferred from cross-sectional RNA-seq data. The overarching goal of this project is to enhance the MaREA4Galaxy environment by integrating various omics data types, such as gene expression, proteomics, and metabolomics, enabling researchers worldwide to conduct constraint-based enrichment analyses of metabolic pathways.\n\nThe key enhancements include two primary features:\n\n1. Flux Sampling Interface: This feature provides users with the capability to sample fluxes through cobra models utilizing methods like CHRR (Coordinate Hit and Run with Rounding) and CBS (Corner Based Sampling).\n\n2. Feature Loading Interface: Users can load diverse features for a given set of samples, including RNA-seq data, RAS data, sampled fluxes, metabolomics, and proteomics, initiating a clustering analysis. Subsequently, leveraging the MaREA tool, enriched metabolic maps are generated. Additionally, users gain the ability to compare different clusters derived from the input datasets.",
          "difficulty": null,
          "id": "proj_national-resource-fo_2024_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/LSrCKfq7/",
          "proposal_id": null,
          "short_description": "MaREA4Galaxy is a user-friendly tool designed to facilitate the characterization and graphical comparison of sample groups exhibiting distinct...",
          "slug": "cobraxy-cobra-and-marea4galaxy",
          "status": "completed",
          "student_name": "Luca Milazzo",
          "student_profile": null,
          "tags": [
            "ai",
            "ux"
          ],
          "title": "COBRAxy: COBRA and MaREA4Galaxy"
        },
        {
          "code_url": "https://gist.github.com/deep-poharkar/67d22ed4c32dd7713097b4ec283e707e",
          "description": "Project mainly focuses on automating image deployment to an EC2 instance via an AWS DevOps pipeline. Key tasks involve setting up an AWS account with appropriate permissions, creating a pipeline script to fetch images from a repository, and automating the deployment process to the EC2 instance. This includes configuring IAM roles, defining pipeline stages for image retrieval, setting up the EC2 instance with necessary software and security measures, and scripting deployment automation. By leveraging CI/CD services and AWS tools, the project aims to streamline the deployment process for improved efficiency and reliability.",
          "difficulty": null,
          "id": "proj_national-resource-fo_2024_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/977EsxSv/",
          "proposal_id": null,
          "short_description": "Project mainly focuses on automating image deployment to an EC2 instance via an AWS DevOps pipeline. Key tasks involve setting up an AWS account with...",
          "slug": "implement-aws-devops-pipeline-for-image-deployment-for-graphspace",
          "status": "completed",
          "student_name": "Deep Poharkar",
          "student_profile": null,
          "tags": [
            "ml",
            "ai"
          ],
          "title": "Implement AWS DevOps Pipeline for Image Deployment for Graphspace"
        },
        {
          "code_url": "https://github.com/ndexbio/gsoc_llm",
          "description": "This project proposes the development of a Python web application that utilizes Large Language Models (LLMs) for extracting, transforming, and visualizing molecular interaction networks from scientific literature. Leveraging LLMs' advanced natural language processing capabilities, the application will interpret complex academic texts to construct interaction graphs. These results would be uploaded to the Network Data Exchange (NDEx) platform, enabling researchers to manage and visualize biological data more effectively.\n\nKey deliverables include:\nAn interactive Python web app for document processing and network generation.\nSeamless integration with the NDEx API for data management and graph visualization using Cytoscape.\nA robust pipeline for document analysis and data transformation with CX2 format output.",
          "difficulty": "advanced",
          "id": "proj_national-resource-fo_2024_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/biCyAipp/",
          "proposal_id": null,
          "short_description": "This project proposes the development of a Python web application that utilizes Large Language Models (LLMs) for extracting, transforming, and...",
          "slug": "large-language-model-based-creation-of-knowledge-graph-from-a-publication",
          "status": "completed",
          "student_name": "Favour James",
          "student_profile": null,
          "tags": [
            "python",
            "web",
            "api",
            "ml"
          ],
          "title": "Large Language Model-based creation of knowledge graph from a publication"
        },
        {
          "code_url": "https://faizaljnu.github.io/GSoC24-FinalReport/",
          "description": "The project aims to develop a robust pipeline for assessing the performance of foundation models, specifically focusing on scGPT, in generating embeddings suitable for inferring gene regulatory networks (GRNs) from single-cell RNA-sequencing (scRNA-seq) data.\n\nLeveraging the BEELINE benchmark and algorithms like GENIE3, GRNBoost2 and PIDC the pipeline will systematically evaluate scGPT's ability to capture gene regulatory relationships. Key steps include data preprocessing, embedding generation with scGPT, and GRN inference using GENIE3. Evaluation metrics such as precision, recall, F1-score, and area under the precision-recall curve (AUPR) will be employed, comparing inferred networks against simulated ground truth or expert-curated GRNs from BEELINE.\n\nThe modular design of the pipeline allows for future integration of additional foundation models, enhancing its versatility and extendibility. This research will deepen our understanding of foundation models, particularly scGPT, in GRN inference, guiding the development of improved algorithms and methodologies for deciphering gene regulatory mechanisms from scRNA-seq data. \n\nUltimately, this work will advance biological knowledge by shedding light on gene regulatory processes and their implications across various biological contexts.",
          "difficulty": null,
          "id": "proj_national-resource-fo_2024_009",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/TZ3sbM7P/",
          "proposal_id": null,
          "short_description": "The project aims to develop a robust pipeline for assessing the performance of foundation models, specifically focusing on scGPT, in generating...",
          "slug": "using-foundation-model-scgpt-for-gene-regulatory-network-inference",
          "status": "completed",
          "student_name": "Faizal Rahman",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Using Foundation Model: scGPT for Gene Regulatory Network Inference"
        },
        {
          "code_url": "https://github.com/tushar-c23/CytoJSLayout/wiki",
          "description": "Cytoscape Desktop Application serves as a powerful tool for network analysis and visualization. However, its layout options are limited compared to Cytoscape.js library. By developing a layout plugin, we aim to enrich the desktop application with additional layout algorithms available in Cytoscape.js, thereby providing users with a more comprehensive suite of tools for network visualization and analysis.\nOur plugin will integrate with the SyBLaRS web service. This integration will process the user data through SyBLaRS, a powerful layout and analysis tool, and seamlessly incorporate the results back into the Cytoscape Desktop Application. By leveraging SyBLaRS, we can access all Cytoscape.js layout algorithms without the need to implement their Java versions.",
          "difficulty": null,
          "id": "proj_national-resource-fo_2024_010",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/42jYK8ra/",
          "proposal_id": null,
          "short_description": "Cytoscape Desktop Application serves as a powerful tool for network analysis and visualization. However, its layout options are limited compared to...",
          "slug": "cytoscape-layout-plugin-to-support-cytoscapejs-layouts",
          "status": "completed",
          "student_name": "Tushar Choudhary",
          "student_profile": null,
          "tags": [
            "java",
            "web",
            "ml",
            "ai",
            "ui"
          ],
          "title": "Cytoscape layout plugin to support Cytoscape.js layouts"
        },
        {
          "code_url": "https://medium.com/@mohmedsoudy77/google-summer-of-code-2024-openpip-work-report-b30d02d6f786",
          "description": "OpenPIP platform is typically necessary alongside a research paper detailing experimental data, alongside depositing the data into a standard repository. Setting up and tailoring the database and web portal doesn't demand any coding expertise. OpenPIP has been utilized in constructing the databases and web portals for two significant protein interactome maps: the Human and Yeast Reference Protein Interactome maps (HuRI and YeRI). o\tThe current data import/upload module uses the standard Proteomics Standards Initiative Molecular Interactions (PSI-MI) format and connects to several public databases to collect further information for all proteins in the dataset. Possible improvements as data upload and visualization are the main goals of this milestone.",
          "difficulty": null,
          "id": "proj_national-resource-fo_2024_011",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/CtEpYa1C/",
          "proposal_id": null,
          "short_description": "OpenPIP platform is typically necessary alongside a research paper detailing experimental data, alongside depositing the data into a standard...",
          "slug": "improvement-of-openpip-data-upload-visualization",
          "status": "completed",
          "student_name": "Mohamed Soudy",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "database"
          ],
          "title": "Improvement Of openPIP (Data upload & Visualization)"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2024/organizations/national-resource-for-network-biology-nrnb/"
    },
    "year_2025": {
      "num_projects": 8,
      "projects": [
        {
          "code_url": null,
          "description": "The Synthetic Biology Open Language (SBOL) serves as a vital community standard for representing biological designs, with version 3.1 offering mature capabilities for the entire Design-Build-Test-Learn cycle. Despite this advancement, a significant hurdle persists: the widespread use of the older SBOL2 format by crucial tools and large repositories like SynBioHub, coupled with the absence of a complete converter to bridge the gap with SBOL3. This incompatibility fragments the ecosystem, hinders the adoption of the latest standard, and limits seamless data exchange. \nThis project tackles this challenge by directly contributing to the development of the essential bidirectional Python converter between SBOL2 and SBOL3 within the sbol-utilities library. By implementing and testing conversion functionalities, this work aims to create the necessary infrastructure to unify the SBOL software landscape, enable smooth migration to SBOL3, facilitate interoperability, and unlock the full potential of the standard for the synthetic biology community.",
          "difficulty": null,
          "id": "proj_national-resource-fo_2025_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/1PJYrp9q",
          "proposal_id": "RFrpAGaq",
          "short_description": "The Synthetic Biology Open Language (SBOL) serves as a vital community standard for representing biological designs, with version 3.1 offering mature...",
          "slug": "sbol2-sbol3-convertor-utility",
          "status": "in-progress",
          "student_name": "__Harsh_Sharma__",
          "student_profile": null,
          "tags": [
            "python",
            "ml",
            "ai",
            "ui"
          ],
          "title": "SBOL2 SBOL3 Convertor Utility"
        },
        {
          "code_url": null,
          "description": "The field of computational biology depends significantly on mathematical modeling to simulate complex biological simulations, often involving solution of large systems of ordinary differential equations, which describe dynamic biological processes. Accurate and efficient numerical solvers are essential for these simulations to predict correct behaviour. LSODA (Livermore Solver for Ordinary Differential equations Automatic) is a well-established ODE solver known for its ability to dynamically switch between stiff and nonstiff methods, making it particularly suitable for biological models where stiffness can vary over time. However, LSODA’s widely used implementations are primarily in C/C++ and Fortran, creating a barrier for researchers working in Java-based environments. This project aims to bridge that gap by implementing a robust, optimized, thoroughly tested, and fully functional Java-based version of the LSODA algorithm within SBSCL (Systems Biology Simulation Core Library).",
          "difficulty": "advanced",
          "id": "proj_national-resource-fo_2025_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/gtQryewh",
          "proposal_id": "ROGM9hw7",
          "short_description": "The field of computational biology depends significantly on mathematical modeling to simulate complex biological simulations, often involving...",
          "slug": "developing-a-highly-efficient-numerical-ode-solver-in-systems-biology-simulation-core-library",
          "status": "in-progress",
          "student_name": "Ayush Baranwal",
          "student_profile": null,
          "tags": [
            "java",
            "ai",
            "ui"
          ],
          "title": "Developing a highly efficient numerical ODE solver in Systems Biology Simulation Core Library"
        },
        {
          "code_url": null,
          "description": "In the realm of synthetic biology, there is a significant source of data in the form of models, genetic sequences, regulatory networks, and experimental results. Databases such as SynBioHub store this data represented by the Synthetic Biology Open Language (SBOL); using machine learning models, this data can be used by researchers to predict promoter activity, analyze protein-DNA interactions, and more. However, researchers must preprocess SBOL data before training their models, which can be time-consuming. Thus, this project aims to develop a Python package to automate the creation of datasets from data in SynBioHub. In doing so, we will first upload data from previous research to SynBioHub, create the package that returns data from SynBioHub in a format suitable for machine learning models, test the package on the data that was uploaded, explore the performance of a Graph Neural Network (GNN) on the data, and thoroughly document the package.",
          "difficulty": null,
          "id": "proj_national-resource-fo_2025_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/Z3Hk9SnE",
          "proposal_id": "jwNfsQPH",
          "short_description": "In the realm of synthetic biology, there is a significant source of data in the form of models, genetic sequences, regulatory networks, and...",
          "slug": "seqtrainer-creating-datasets-from-synbiohub-to-aid-researchers-in-creating-machine-learning-models",
          "status": "in-progress",
          "student_name": "cywong",
          "student_profile": null,
          "tags": [
            "python",
            "ai",
            "database",
            "ui"
          ],
          "title": "SeqTrainer - creating datasets from SynBioHub to aid researchers in creating machine learning models"
        },
        {
          "code_url": null,
          "description": "CySBML Reloaded: Smarter, Simpler, Automated focuses on upgrading CySBML — a Cytoscape app for visualizing computational models encoded in SBML. The project will enhance usability, improve stability, and introduce automation features, making it easier for researchers to explore, validate, and interact with complex biomedical models through an intuitive and streamlined interface based on network visualization.\n\nThe main project outcomes of CySBML Reloaded: Smarter, Simpler, Automated will be a major release of CySBML, with an updated backend supporting automation features, an up-to-date frontend addressing usability issues, updated REST APIs, improved reading of SBML, and improved visualization capabilities such as network and cofactor collapse. This will allow us to integrate CySBML in modeling workflows based on Python/R.",
          "difficulty": "advanced",
          "id": "proj_national-resource-fo_2025_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/YaV539XE",
          "proposal_id": "5yLIsVdr",
          "short_description": "CySBML Reloaded: Smarter, Simpler, Automated focuses on upgrading CySBML — a Cytoscape app for visualizing computational models encoded in SBML. The...",
          "slug": "cysbml-reloaded-smarter-simpler-automated",
          "status": "in-progress",
          "student_name": "Hikmet Emre Kaya",
          "student_profile": null,
          "tags": [
            "python",
            "api",
            "ml",
            "ai",
            "ui"
          ],
          "title": "CySBML Reloaded: Smarter, Simpler, Automated"
        },
        {
          "code_url": null,
          "description": "This proposal aims to transform SBOannotator from a static, hard-coded tool into a dynamic, intelligent system for annotating SBML models with Systems Biology Ontology terms.After initial discussions with mentor Nantia Leonidou, who provided valuable feedback on my approach, I've developed a comprehensive plan and initial implementation (PR #2 https://github.com/draeger-lab/SBOannotator/pull/2). \n\nBy implementing real-time SBO term retrieval, integrating multiple enzymatic data sources, and incorporating LLM-based annotation assistance, this project will significantly enhance both the accuracy and usability of SBOannotator while maintaining its core classification strengths. The addition of a standalone desktop GUI with interactive visualizations will make these powerful annotation capabilities accessible to a broader range of systems biology researchers.",
          "difficulty": null,
          "id": "proj_national-resource-fo_2025_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/UvnOXGwN",
          "proposal_id": "ygDDJOYD",
          "short_description": "This proposal aims to transform SBOannotator from a static, hard-coded tool into a dynamic, intelligent system for annotating SBML models with...",
          "slug": "enhancing-sboannotator-with-llm-integration-dynamic-term-retrieval",
          "status": "in-progress",
          "student_name": "Jiahui Hu",
          "student_profile": null,
          "tags": [
            "ml",
            "ai",
            "ui"
          ],
          "title": "Enhancing SBOannotator with LLM Integration & Dynamic Term Retrieval"
        },
        {
          "code_url": null,
          "description": "This project aims to build an intelligent chatbot and web interface that allows researchers to query and explore models from the VCell BioModel Database using natural language. Users will be able to search by geometry, solver, or biological context, access both public and private models, generate visual diagrams, and receive contextual explanations. The system will use LLMs, a Retrieval-Augmented Generation (RAG) pipeline, and VCell APIs to support model interpretation and simulation. Deliverables include a modular backend of specialized agents (querying, knowledge, visualization), a responsive frontend (Streamlit or React), and full documentation for deployment and reuse.",
          "difficulty": null,
          "id": "proj_national-resource-fo_2025_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/vFE5LPKW",
          "proposal_id": "b0qQgPOZ",
          "short_description": "This project aims to build an intelligent chatbot and web interface that allows researchers to query and explore models from the VCell BioModel...",
          "slug": "project-263-chatbot-to-query-vcell-modeling-resources",
          "status": "in-progress",
          "student_name": "Kacem Mathlouthi",
          "student_profile": null,
          "tags": [
            "react",
            "web",
            "api",
            "ml",
            "ai"
          ],
          "title": "Project #263: Chatbot to query VCell modeling resources"
        },
        {
          "code_url": null,
          "description": "This project addresses the current incompatibility of the Systems Biology Simulation Core Library (SBSCL) with modern computing architectures, specifically ARM-based processors. It restores its functionality on these newer hardware platforms. By creating a flexible, solver-agnostic abstraction layer, SBSCL will integrate a variety of linear optimization solvers, including both open-source (GLPK, CBC, SCIP) and commercial (CPLEX, Gurobi) options. The project also explores extending functionality with advanced constraint-based analysis methods, such as Flux Variability Analysis (FVA), further enhancing SBSCL’s analytical capabilities. Comprehensive validation, clear documentation, and example workflows will ensure easy use and broad adoption. Ultimately, these improvements will substantially enhance SBSCL’s usability, reproducibility, and overall user experience. As a result, researchers will spend less time on technical workarounds and more time focusing on biological questions.",
          "difficulty": "beginner",
          "id": "proj_national-resource-fo_2025_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/Yibmo4UH",
          "proposal_id": "OzdzflQ8",
          "short_description": "This project addresses the current incompatibility of the Systems Biology Simulation Core Library (SBSCL) with modern computing architectures,...",
          "slug": "enhancing-the-systems-biology-simulation-core-library-sbscl-with-a-solver-agnostic-framework",
          "status": "in-progress",
          "student_name": "Michael-Gaas",
          "student_profile": null,
          "tags": [
            "ai",
            "ux"
          ],
          "title": "Enhancing the Systems Biology Simulation Core Library (SBSCL) with a Solver-Agnostic Framework..."
        },
        {
          "code_url": null,
          "description": "This project will develop an intelligent chat interface for CellMinerCDB, a cancer genomics database, using GraphRAG (Graph Retrieval-Augmented Generation) to enhance accessibility for researchers. The system will convert natural language queries into executable R code and leverage knowledge graphs to provide context-aware responses about complex relationships between drugs, genes, and cancer cell lines.\n\nKey deliverables include: (1) A data bridge connecting R's CellMinerCDB with Python; (2) A GraphRAG component that builds and queries knowledge graphs from cancer genomics data; (3) NDEx integration for network visualization and sharing; and (4) A natural language interface powered by PandasAI. This project extends previous work by adding knowledge graph capabilities, improving entity recognition for cancer genomics terminology, and enabling standardized network sharing through NDEx.\n\nThe completed system will democratize access to complex cancer genomics data, promote reproducibility in research, and establish a foundation for natural language interfaces to biomedical databases.",
          "difficulty": "advanced",
          "id": "proj_national-resource-fo_2025_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/G0jh7cDV",
          "proposal_id": "FmdcdWuP",
          "short_description": "This project will develop an intelligent chat interface for CellMinerCDB, a cancer genomics database, using GraphRAG (Graph Retrieval-Augmented...",
          "slug": "llm-powered-interactive-chat-interface-for-cellminercdb-with-graphrag-integration",
          "status": "in-progress",
          "student_name": "Milit S Patel",
          "student_profile": null,
          "tags": [
            "python",
            "ai",
            "database",
            "ui"
          ],
          "title": "LLM-Powered Interactive Chat Interface for CellMinerCDB with GraphRAG Integration"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2025/organizations/national-resource-for-network-biology-nrnb"
    }
  },
  "first_time": false,
  "contact": {
    "email": "kristina.hanspers@gladstone.ucsf.edu",
    "guide_url": "https://docs.google.com/document/d/1Zi6L38CHEeq2aL6xzv0Ozhd_Y6D71W3yCBGHplmxr6k/edit?usp=sharing",
    "ideas_url": "https://github.com/nrnb/GoogleSummerOfCode/issues",
    "irc_channel": "https://github.com/nrnb/GoogleSummerOfCode/issues",
    "mailing_list": "https://groups.google.com/g/cytoscape-helpdesk"
  },
  "social": {
    "blog": "https://nrnb.org/testimonials.html#profile-tab",
    "discord": null,
    "facebook": null,
    "github": null,
    "gitlab": null,
    "instagram": null,
    "linkedin": null,
    "mastodon": null,
    "medium": null,
    "reddit": null,
    "slack": null,
    "stackoverflow": null,
    "twitch": null,
    "twitter": "https://twitter.com/cytoscape",
    "youtube": null
  },
  "meta": {
    "version": 1,
    "generated_at": "2026-01-25T15:28:53.716Z"
  }
}