{
  "id": "692251e053dd9d7326d33e54",
  "slug": "open-transit-software-foundation",
  "name": "Open Transit Software Foundation",
  "category": "End user applications",
  "description": "Help make public transit better",
  "image_url": "https://summerofcode.withgoogle.com/media/org/open-transit-software-foundation/uz3p7k5vsxduhrhk-360.png",
  "img_r2_url": "https://pub-268c3a1efc8b4f8a99115507a760ca14.r2.dev/open-transit-software-foundation.webp",
  "logo_r2_url": null,
  "url": "https://opentransitsoftwarefoundation.org",
  "active_years": [
    2024,
    2025
  ],
  "first_year": 2024,
  "last_year": 2025,
  "is_currently_active": true,
  "technologies": [
    "android",
    "java",
    "golang",
    "docker",
    "ios"
  ],
  "topics": [
    "ai",
    "apps",
    "Transit",
    "travel",
    "bus"
  ],
  "total_projects": 10,
  "stats": {
    "avg_projects_per_appeared_year": 5,
    "projects_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": null,
      "year_2019": null,
      "year_2020": null,
      "year_2021": null,
      "year_2022": null,
      "year_2023": null,
      "year_2024": 5,
      "year_2025": 5
    },
    "students_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": null,
      "year_2019": null,
      "year_2020": null,
      "year_2021": null,
      "year_2022": null,
      "year_2023": null,
      "year_2024": 5,
      "year_2025": 5
    },
    "total_students": 10
  },
  "years": {
    "year_2016": null,
    "year_2017": null,
    "year_2018": null,
    "year_2019": null,
    "year_2020": null,
    "year_2021": null,
    "year_2022": null,
    "year_2023": null,
    "year_2024": {
      "num_projects": 5,
      "projects": [
        {
          "code_url": "https://github.com/OneBusAway/otpkit",
          "description": "Trip Planner feature is a highly anticipated addition to the OneBusAway application. Recognizing the vital need for efficient route planning in public transit, proposing the integration of the OpenTripPlanner library, which later will be referred to as OTPKit.\n\nOTPKit is a Swift library designed to encapsulate the functionalities of OpenTripPlanner, facilitating seamless integration with existing maps and features within the OneBusAway app. In its initial version, OTPKit will focus primarily on core logic and compatibility with current app functionalities, aiming to significantly enhance user experience by offering optimized route suggestions.",
          "difficulty": null,
          "id": "proj_open-transit-softwar_2024_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/RHtM4Lyc/",
          "proposal_id": null,
          "short_description": "Trip Planner feature is a highly anticipated addition to the OneBusAway application. Recognizing the vital need for efficient route planning in...",
          "slug": "otpkit-opentripplanner-client-library-written-in-swift",
          "status": "completed",
          "student_name": "Hilmy Veradin",
          "student_profile": null,
          "tags": [
            "ml",
            "ai"
          ],
          "title": "OTPKit: OpenTripPlanner Client Library Written in Swift"
        },
        {
          "code_url": "https://github.com/TheTransitClock/DetourDetective",
          "description": "DetourDetective is a proposed plugin for TheTransitClock that aims to automatically detect detours on transit routes. It is expected, this will further enhance the reliability and accuracy of arrival predictions produced by TheTransitClock during disruptions. TheTransitClock is an open-source transit information system. Its core function is to provide and analyse arrival predictions for transit systems. It takes a GTFS-realtime vehicle-position feed as input and produces arrival predictions in a GTFS-realtime trip-updates feed.",
          "difficulty": null,
          "id": "proj_open-transit-softwar_2024_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/F6ZyKmsA/",
          "proposal_id": null,
          "short_description": "DetourDetective is a proposed plugin for TheTransitClock that aims to automatically detect detours on transit routes. It is expected, this will...",
          "slug": "thetransitclock-detourdetective",
          "status": "completed",
          "student_name": "Andrew Cunningham",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "TheTransitClock:-DetourDetective"
        },
        {
          "code_url": "https://github.com/OneBusAway/onebusaway-deployment",
          "description": "The OneBusAway server provides real-time vehicle information to users, yet it currently lacks a streamlined deployment process. This project aims to bridge that gap by exploring and evaluating different Infrastructure as Code (IaC) tools, to identify the most efficient means to deploy OBA across various platforms. The project will undertake a thorough analysis of leading IaC technologies, subjecting each to practical tests to ascertain the most suitable tool for OBA's deployment needs. The chosen tool will then be used to develop deployment scripts for multiple platforms, complemented by comprehensive documentation. This initiative promises to enhance the deployment flexibility and efficiency of OBA, significantly easing the adoption of open-source transit tools globally.",
          "difficulty": null,
          "id": "proj_open-transit-softwar_2024_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/PnGdLXTu/",
          "proposal_id": null,
          "short_description": "The OneBusAway server provides real-time vehicle information to users, yet it currently lacks a streamlined deployment process. This project aims to...",
          "slug": "create-cloud-deployment-strategy-for-onebusaway",
          "status": "completed",
          "student_name": "Alton He",
          "student_profile": null,
          "tags": [
            "ml",
            "ai",
            "cloud",
            "ui"
          ],
          "title": "Create cloud deployment strategy for OneBusAway"
        },
        {
          "code_url": "https://gist.github.com/Ahmedhossamdev/bf867112b98e1284cca7d917f4307740",
          "description": "Summary: \n\nThe OBA project aims to develop official OneBusAway REST API client libraries in TypeScript and Python, enhancing accessibility and user experience for developers interacting with OneBusAway servers. These libraries will support all REST API methods, handle diverse data types, include comprehensive tests, and provide helpful examples for new users.\n\nAbout Me: \n\nI am Ahmed Hossam, a senior information technology student with a passion for technology and problem-solving. With experience in backend engineering and competitive programming, I am excited to contribute to the OBA project and make a positive impact. Investigations: I have familiarized myself with OneBusAway endpoints, built a beta version of the TypeScript package, and experimented with different structures for scalability and maintainability. \n\nDetailed Design: \n\nThe API client follows a modular structure, with each endpoint encapsulated within its own module. It employs a combination of factory and dependency injection patterns and includes a base class for foundational HTTP request functionality.\n\nImplementation Plan:\n\nI will collaborate closely with mentors to understand API client requirements and plan implementation details. Error handling and unit testing will be prioritized, followed by thorough testing and the publishing of final packages. \n\nProposal Timeline: \n\nThe timeline spans 14 weeks, beginning with communication and research in the first three weeks, followed by official coding in TypeScript. Python implementation will commence in week 9, with completion and finalization in week 14. \n\nWhy Me:\n\nI find joy in making OBA APIs accessible to everyone and am dedicated to contributing positively to the project. My experience in API development, along with continuous learning, makes me well-suited for this role.",
          "difficulty": null,
          "id": "proj_open-transit-softwar_2024_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/YZoanrXh/",
          "proposal_id": null,
          "short_description": "Summary: The OBA project aims to develop official OneBusAway REST API client libraries in TypeScript and Python, enhancing accessibility and user...",
          "slug": "building-an-api-client-for-oba-servers",
          "status": "completed",
          "student_name": "Ahmed Hossam",
          "student_profile": null,
          "tags": [
            "python",
            "typescript",
            "api",
            "ai",
            "ui"
          ],
          "title": "Building an API Client for OBA Servers"
        },
        {
          "code_url": "https://github.com/OneBusAway/onebusaway-android/pull/1222",
          "description": "Transit agencies often struggle to obtain direct feedback from riders, which impedes their ability to improve service quality and accessibility. This challenge is particularly acute for women, who encounter unique issues such as safety concerns and complex care-related travel patterns that are not always adequately addressed.\n\nTo bridge this gap, my project introduced a travel survey feature within the OBA app. This feature allows riders to provide direct feedback on their transit experiences, with a special focus on understanding and enhancing the transit experiences of women.",
          "difficulty": "advanced",
          "id": "proj_open-transit-softwar_2024_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/s5qkVzt1/",
          "proposal_id": null,
          "short_description": "Transit agencies often struggle to obtain direct feedback from riders, which impedes their ability to improve service quality and accessibility. This...",
          "slug": "oba-android-app-build-surveys-into-onebusaway",
          "status": "completed",
          "student_name": "Amr Hossam Abo Ghanima",
          "student_profile": null,
          "tags": [
            "android",
            "ai",
            "ui"
          ],
          "title": "OBA Android App - Build Surveys into OneBusAway"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2024/organizations/open-transit-software-foundation/"
    },
    "year_2025": {
      "num_projects": 5,
      "projects": [
        {
          "code_url": null,
          "description": "This project aims to build a self-operating transit information display that works reliably in real-world transit environments. The system will show live departure times, service alerts for delays or disruptions, and support multiple languages to serve diverse riders. Designed for public displays, it will automatically adapt to different screen sizes while maintaining clear, easy-to-read information - all without requiring constant manual oversight. Key features include dynamic stop routing, real-time updates, and a clean interface that scales from standard monitors to large 4K screens.",
          "difficulty": "beginner",
          "id": "proj_open-transit-softwar_2025_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/PmZ9fdSN",
          "proposal_id": "uDUI5ktf",
          "short_description": "This project aims to build a self-operating transit information display that works reliably in real-world transit environments. The system will show...",
          "slug": "waystation-next-generation-sign-mode",
          "status": "in-progress",
          "student_name": "Amr Abdelfattah",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "WayStation - Next Generation Sign Mode"
        },
        {
          "code_url": null,
          "description": "The goal of this project is to build OTPKit, a Swift library that brings OpenTripPlanner to iOS. It will work as a standalone package that can be added to any iOS app. The first use will be in the OneBusAway app, giving users a modern trip planning experience with real-time updates, smart routing, and easy-to-follow directions.\n\nOTPKit will support key features like trip requests, walking directions, and smooth map interaction. Built with SwiftUI and a clean architecture, it will be easy to maintain and integrate with other iOS apps.\n\nBy the end of the project, OTPKit will be the first Swift-based, Apache 2.0-licensed OpenTripPlanner library—making trip planning better for OneBusAway and available to other iOS transit apps too.",
          "difficulty": "beginner",
          "id": "proj_open-transit-softwar_2025_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/7hA4Gs1k",
          "proposal_id": "FeO1LuPr",
          "short_description": "The goal of this project is to build OTPKit, a Swift library that brings OpenTripPlanner to iOS. It will work as a standalone package that can be...",
          "slug": "trip-planner-building-otpkit-a-swift-library-for-opentripplanner-on-ios",
          "status": "in-progress",
          "student_name": "Manu R",
          "student_profile": null,
          "tags": [
            "ios",
            "ai",
            "ui"
          ],
          "title": "Trip Planner: Building OTPKit, a Swift Library for OpenTripPlanner on iOS"
        },
        {
          "code_url": null,
          "description": "This project aims to enhance the monitoring capabilities of OneBusAway (OBA), an open-source platform that provides real-time transit information to riders across multiple cities. The focus is on improving Watchdog, a Go-based backend service that tracks the health and data integrity of OBA servers by reporting detailed metrics to Prometheus.\n\nIn the past, a Python script was used to monitor the system by checking real-time API data and identifying issues such as expired transit bundles or data mismatches. However, this legacy solution lacked flexibility and scalability. The current Watchdog framework, built in Go, addresses these shortcomings but still requires the addition of several key metrics.\n\nThe proposed solution builds on the existing Go codebase, expanding and refining the metrics to ensure accurate, real-time tracking of issues such as unmatched trips, stale data, and anomalies in transit information. The project also prioritizes maintainability by refactoring code, implementing robust error reporting through Sentry, and ensuring comprehensive test coverage to maintain reliability.\n\nKey deliverables include:\n\nImplementation of multiple high-priority metrics\n\nComplete test coverage and improved modularity of the codebase\n\nClear, user-friendly documentation\n\nA production-ready, extensible monitoring service for OBA\n\nThis work will provide transit agencies with better insights into data health and system performance, ultimately enhancing the experience for thousands of daily riders.",
          "difficulty": null,
          "id": "proj_open-transit-softwar_2025_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/ZzUiW13a",
          "proposal_id": "Ps9vXt8j",
          "short_description": "This project aims to enhance the monitoring capabilities of OneBusAway (OBA), an open-source platform that provides real-time transit information to...",
          "slug": "enhancing-watchdog-metrics-expansion-for-oba-monitoring",
          "status": "in-progress",
          "student_name": "Mohamed Aboomar",
          "student_profile": null,
          "tags": [
            "python",
            "api",
            "ai",
            "ui",
            "backend"
          ],
          "title": "Enhancing Watchdog: Metrics Expansion for OBA Monitoring"
        },
        {
          "code_url": null,
          "description": "Summary : The OBA project aims to develop an integration testing system to ensure the accuracy and stability of the OneBusAway API server. This system will use Docker to create a controlled test environment to simulate various test scenarios and a Golang-based tool to validate API responses against expected outputs using GTFS and GTFS-RT data. It will include time simulation, structured test cases, and CI/CD integration to detect regressions and prevent inconsistencies. By automating the validation process, this project will enhance API reliability, making it easier for developers to trust and build upon OBA transit data services.",
          "difficulty": null,
          "id": "proj_open-transit-softwar_2025_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/gxPo5O7k",
          "proposal_id": "NqgOqRQM",
          "short_description": "Summary : The OBA project aims to develop an integration testing system to ensure the accuracy and stability of the OneBusAway API server. This...",
          "slug": "integration-test-system-for-oba",
          "status": "in-progress",
          "student_name": "Satyam Kumar Chauhan",
          "student_profile": null,
          "tags": [
            "ios",
            "api",
            "ai",
            "docker",
            "ui"
          ],
          "title": "Integration Test System For OBA"
        },
        {
          "code_url": null,
          "description": "OneBusAway iOS Survey Feature - Proposal Summary\n\nThis project proposes implementing a comprehensive survey feature for the OneBusAway iOS app that matches the functionality recently developed for Android. The feature will enable transit agencies to collect valuable rider feedback through in-app surveys that appear based on contextual factors such as location, stops visited, and routes taken.\n\nUsing Swift and the Eureka form library, I will create an intuitive survey system that displays both simple \"hero question\" cards and multi-question forms, along with external survey integration via WebView. The implementation will follow iOS design patterns while ensuring feature parity with Android.\n\nKey components include:\n- Contextual survey cards that appear at relevant moments\n- Multi-question survey forms using Eureka\n- External survey support with context data passing\n- Core Data integration for survey state management\n- Network services for fetching surveys and submitting responses\n- User preferences for survey participation\n\nMy previous contributions to OneBusAway iOS and experience with Swift development have prepared me for this project. The proposed implementation follows MVVM architecture and emphasizes accessibility, with full VoiceOver support and Dynamic Type integration.\n\nBy bringing this feature to iOS, we'll help transit agencies collect essential feedback to improve service quality, with particular focus on understanding women's unique transit experiences, mobility of care trips, and complex travel patterns.",
          "difficulty": "advanced",
          "id": "proj_open-transit-softwar_2025_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/b4x8dfSt",
          "proposal_id": "VE44IjXy",
          "short_description": "OneBusAway iOS Survey Feature - Proposal Summary This project proposes implementing a comprehensive survey feature for the OneBusAway iOS app that...",
          "slug": "survey-features-ios",
          "status": "in-progress",
          "student_name": "Shreyas Sahoo",
          "student_profile": null,
          "tags": [
            "android",
            "ios",
            "web",
            "ui"
          ],
          "title": "Survey Features (iOS)"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2025/organizations/open-transit-software-foundation"
    }
  },
  "first_time": false,
  "contact": {
    "email": null,
    "guide_url": "https://opentransitsoftwarefoundation.org/2024/02/how-to-craft-a-successful-gsoc-proposal/",
    "ideas_url": "https://opentransitsoftwarefoundation.org/2025/01/google-summer-of-code-2025-project-ideas/",
    "irc_channel": "https://join.slack.com/t/onebusaway/shared_invite/zt-2jve26vs6-~qXjgxv_HkTliUKhAnuSDA",
    "mailing_list": null
  },
  "social": {
    "blog": "https://opentransitsoftwarefoundation.org/blog/",
    "discord": null,
    "facebook": null,
    "github": null,
    "gitlab": null,
    "instagram": null,
    "linkedin": null,
    "mastodon": null,
    "medium": null,
    "reddit": null,
    "slack": "https://join.slack.com/t/onebusaway/shared_invite/zt-2jve26vs6-~qXjgxv_HkTliUKhAnuSDA",
    "stackoverflow": null,
    "twitch": null,
    "twitter": null,
    "youtube": null
  },
  "meta": {
    "version": 1,
    "generated_at": "2026-01-25T15:28:53.855Z"
  }
}