{
  "id": "692251df53dd9d7326d33e44",
  "slug": "open-bioinformatics-foundation-obf",
  "name": "Open Bioinformatics Foundation (OBF)",
  "category": "Science and medicine",
  "description": "Open Source & Open Science in biological research",
  "image_url": "https://summerofcode.withgoogle.com/media/org/open-bioinformatics-foundation-obf/gcg4ymt4qhsd0fyj-360.png",
  "img_r2_url": "https://pub-268c3a1efc8b4f8a99115507a760ca14.r2.dev/open-bioinformatics-foundation-obf.webp",
  "logo_r2_url": null,
  "url": "https://www.open-bio.org",
  "active_years": [
    2016,
    2017,
    2018,
    2019,
    2020,
    2021,
    2022
  ],
  "first_year": 2016,
  "last_year": 2022,
  "is_currently_active": false,
  "technologies": [
    "python",
    "java",
    "haskell",
    "ruby",
    "perl",
    "c",
    "c++",
    "javascript",
    "php",
    "d",
    "biojs",
    "react",
    "html",
    "css",
    "Git/GitHub"
  ],
  "topics": [
    "bioinformatics",
    "web",
    "computational biology",
    "genomics",
    "workflows",
    "open science",
    "Open Source Bioinformatics"
  ],
  "total_projects": 45,
  "stats": {
    "avg_projects_per_appeared_year": 6.43,
    "projects_by_year": {
      "year_2016": 7,
      "year_2017": 7,
      "year_2018": 5,
      "year_2019": 5,
      "year_2020": 8,
      "year_2021": 8,
      "year_2022": 5,
      "year_2023": null,
      "year_2024": null,
      "year_2025": null
    },
    "students_by_year": {
      "year_2016": 7,
      "year_2017": 7,
      "year_2018": 5,
      "year_2019": 5,
      "year_2020": 8,
      "year_2021": 8,
      "year_2022": 5,
      "year_2023": null,
      "year_2024": null,
      "year_2025": null
    },
    "total_students": 45
  },
  "years": {
    "year_2016": {
      "num_projects": 7,
      "projects": [
        {
          "code_url": "https://vivekiitkgp.github.io/programming/gsoc-16-wrap-up.html",
          "description": "<p>A crucial component of the openSNP infrastructure is to make the available data\nmore accessible to the general users and scientists alike. Currently, the portal\nhas independent listing of user <em>Phenotypes</em> and parsed <em>SNP</em>s. Each <em>SNP</em>s\nentry have an additional information section where data from other credible\nsources (PLoS, Mendeley, Genome.gov) is made available. There is, however, no\ndirect or inferred relationship available between the <em>SNP</em>s and the\ncorresponding <em>Phenotypes</em> (as reported). <strong>This project proposes to bridge the\nconnectivity between existing <em>Phenotypes</em> and genetic variants with the help of\nalready mined data and implementing additional services as necessary.</strong></p>\n",
          "difficulty": null,
          "id": "proj_open-bioinformatics-_2016_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/6590368275496960/",
          "proposal_id": null,
          "short_description": "A crucial component of the openSNP infrastructure is to make the available data\nmore accessible to the general users and scientists alike. Currently,...",
          "slug": "opensnp-linking-phenotypes-to-snps-in-opensnp",
          "status": "completed",
          "student_name": "Vivek Rai",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "openSNP: Linking Phenotypes to SNPs in openSNP"
        },
        {
          "code_url": "https://github.com/bionode/gsoc16",
          "description": "<p>The streams based workflow engine will organize tasks into streams, allow parallelization of this streams, and work locally as well as integrated into common external HPC services. As well dat can be integrated to store intermediate and final data. This provides a framework for efficient, reproducible, and understandable bioinformatics pipelines.</p>\n",
          "difficulty": "medium",
          "id": "proj_open-bioinformatics-_2016_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5735739308376064/",
          "proposal_id": null,
          "short_description": "The streams based workflow engine will organize tasks into streams, allow parallelization of this streams, and work locally as well as integrated...",
          "slug": "bionode-workflow-engine-for-streamed-data-analysis",
          "status": "completed",
          "student_name": "thejmazz",
          "student_profile": null,
          "tags": [],
          "title": "Bionode workflow engine for streamed data analysis"
        },
        {
          "code_url": "https://SXibolet.2pitau.org/gsoc.html",
          "description": "<p>Over 100,000 people have already been genotype through DTC genetic testing however, these data live in siloes, often inaccessible to the public. {Bastian Greshake, Philipp E. Bayer, Helge Rausch, Julia Reda, openSNP: A Crowdsourced Web Resource for Personal Genomics, 2014}. openSNP seeks to solve this problem by allowing users to upload their results, where they'll be freely-available for all.</p>\n<p>In addition to these genetic data, openSNP's broader goal relates to all types of quantified-self (QS) information as this is of interest to genetic researchers.</p>\n<p>So far, openSNP allows people to link their Fitbit accounts, thereby donating their activity, sleep, and weight data to the public domain. By now, there are many more tracking devices (HTDs) around, and many of them offer their APIs. By exploiting these services, openSNP can dramatically increase the amount of QS data available in the public domain, providing a means for academic researchers and scientists to find new associations. These associations are easier to find in openSNP than similar services since a user's genetic test results, their tagged phenotypes, and HTD data are all linked to a single person.</p>\n",
          "difficulty": null,
          "id": "proj_open-bioinformatics-_2016_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5303768677613568/",
          "proposal_id": null,
          "short_description": "Over 100,000 people have already been genotype through DTC genetic testing however, these data live in siloes, often inaccessible to the public....",
          "slug": "opensnp-extending-quantified-self-support-in-opensnp",
          "status": "completed",
          "student_name": "gdyer",
          "student_profile": null,
          "tags": [
            "web",
            "api",
            "ai"
          ],
          "title": "openSNP: Extending Quantified-Self Support in openSNP"
        },
        {
          "code_url": "https://anton-khodak.github.io/argparse2cwl-blog/2016/08/11/gsoc-summary.html",
          "description": "<p>The project is aimed to generate CWL tool descriptions from Python tools which use argparse.</p>\n",
          "difficulty": null,
          "id": "proj_open-bioinformatics-_2016_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5549054796759040/",
          "proposal_id": null,
          "short_description": "The project is aimed to generate CWL tool descriptions from Python tools which use argparse.",
          "slug": "automated-tool-wrapperconverter-for-cwl",
          "status": "completed",
          "student_name": "Anton Khodak",
          "student_profile": null,
          "tags": [
            "python",
            "ai"
          ],
          "title": "Automated tool wrapper/converter for CWL"
        },
        {
          "code_url": "http://mateusjabour.github.io/gsoc-code-submission",
          "description": "<p>We all know that nowadays a website needs a responsive layout, by the fact that there are a lot of different devices sizes, like smartphones, tablets and desktops. In addition to this, the project organization is another important thing: letting the code more readable and easier to maintain helps the developer to modify the code when something goes wrong. Another important thing that we can't ignore is the website performance, this one depends of the website weight, but, why performance is important? Because nowadays people wants instant information, since they have a hurry life. This project has as main goal to give these three important things to the OpenSNP website.</p>\n",
          "difficulty": null,
          "id": "proj_open-bioinformatics-_2016_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/4851164755525632/",
          "proposal_id": null,
          "short_description": "We all know that nowadays a website needs a responsive layout, by the fact that there are a lot of different devices sizes, like smartphones, tablets...",
          "slug": "opensnp",
          "status": "completed",
          "student_name": "mateusjabour",
          "student_profile": null,
          "tags": [
            "web",
            "ai"
          ],
          "title": "OpenSNP"
        },
        {
          "code_url": "https://bitbucket.org/antismash/antismash/pull-requests/23/gsoc-2016-specific-modules-lassopeptides/commits",
          "description": "<p>Ribosomally synthesised and post-translationally modified peptides (RiPPs) are a class of secondary metabolites that share a common biosynthetic origin - a precursor gene, encoded on the genome of a microorganism. It is translated to a peptide by the ribosome, and then further modified to give the active final product. RiPPs can be divided in more than 20 sub-classes and have a wide range of biological functions:  among others, they can work as antibiotics, nutritional additives or food preservatives. Thus, the use of RiPPs as drugs is increasing and several RiPP derivatives are already in advanced phases of clinical trials.\nIn this project, prediction modules for a number of RiPP clusters will be developed. Working together with the mentors, who can provide technical and scientific advice, antiSMASH plug-ins will be created to allow researchers to identify the RiPP precursor gene, identify the cleavage sites of the core peptide and predict further modifications to its sctructure. With these plug-ins, we hope to accelerate all the research involving RiPPs and consequently, shorten the time “between the bench and the bed” for possible new drugs.</p>\n",
          "difficulty": "advanced",
          "id": "proj_open-bioinformatics-_2016_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/6289112021598208/",
          "proposal_id": null,
          "short_description": "Ribosomally synthesised and post-translationally modified peptides (RiPPs) are a class of secondary metabolites that share a common biosynthetic...",
          "slug": "improve-the-prediction-for-ripp-clusters",
          "status": "completed",
          "student_name": "MNave",
          "student_profile": null,
          "tags": [
            "ios"
          ],
          "title": "Improve the prediction for RiPP clusters"
        },
        {
          "code_url": "https://chfi.se/posts/2016-08-22-gsoc-final.html",
          "description": "<p>Modify GeneNetwork to embed the BioDalliance genome browser in it. BioDalliance (henceforth\nBD) would be integrated into GeneNetwork (henceforth GN); not only should it be possible to\nview data from GN using BD, but the BD interface should be extended to allow on­the­fly\nfetching of data from the server as the user works with the browser, as well as add functionality\nfor visualizing various types of data, such as quantitative trait loci and underlying genotypes.</p>\n<p>The goal would be to have the browser embedded in GeneNetwork, and sufficiently and\nseamlessly integrated with the backend, so that the browser would be a valuable and useful tool\nin the GeneNetwork environment.</p>\n",
          "difficulty": null,
          "id": "proj_open-bioinformatics-_2016_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5187735035838464/",
          "proposal_id": null,
          "short_description": "Modify GeneNetwork to embed the BioDalliance genome browser in it. BioDalliance (henceforth\nBD) would be integrated into GeneNetwork (henceforth GN);...",
          "slug": "genenetwork-genome-browser",
          "status": "completed",
          "student_name": "christian_f",
          "student_profile": null,
          "tags": [
            "ml",
            "ai",
            "backend"
          ],
          "title": "GeneNetwork Genome Browser"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2016/organizations/5480198954811392/"
    },
    "year_2017": {
      "num_projects": 7,
      "projects": [
        {
          "code_url": "https://gist.github.com/manu-chroma/8e10ea9fd728356a4363b5af1f0d8aaa",
          "description": "<p>The goal of this proposal is to enhance support and usability of <code>cwltool</code> by:</p>\n<ul>\n<li>Adding Python 3 compatibility to CWL Tool, Schema Salad and CWL Test projects.</li>\n<li>Improving mypy annotations and upgrading mypy dependency for CWL Tool and Schema Salad.</li>\n<li>Reducing <a href=\"https://github.com/orgs/common-workflow-language/projects/3?fullscreen=true\" target=\"_blank\">issue backlog</a> and misc enhancements</li>\n</ul>\n",
          "difficulty": null,
          "id": "proj_open-bioinformatics-_2017_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6701160580775936/",
          "proposal_id": null,
          "short_description": "The goal of this proposal is to enhance support and usability of cwltool by:\n\nAdding Python 3 compatibility to CWL Tool, Schema Salad and CWL Test...",
          "slug": "adding-python-3-compatibility-and-improving-mypy-support-for-cwltool",
          "status": "completed",
          "student_name": "Manvendra Singh",
          "student_profile": null,
          "tags": [
            "python"
          ],
          "title": "Adding Python 3 compatibility and improving mypy support for cwltool"
        },
        {
          "code_url": "https://pati-ni.github.io/2017/08/26/final-submission-post.html",
          "description": "<p>In mass spectrometry the isotope pattern of an unknown molecule consists a powerful analytical tool to identify its molecular formula. Modern technological advancements led to a resolution increase in mass spectrometers. This enables mass spectrometers to distinguish parts of a molecule's isotopic fine structure.</p>\n<p>To determine whether a presumed molecular formula is observed within a mass spectrum the theoretical isotope pattern of the formula needs to be calculated.</p>\n<h3>OpenMS implements only one theoretical isotope pattern generator that calculates a low resolution version of the isotopic structure. The additional information that a mass spectrometer provides may be absent in a low resolution theoretical isotope pattern and potentially restricts scientists of excluding possible identities of a certain molecule.</h3>\n<h3>This proposal aims to enrich the OpenMS isotope distribution class with the implementation of three new algorithms for calculating high-resolution isotope patterns.</h3>\n<p>Ιt proposes an algorithm that belongs in the class of polynomial multiplication methods and two algorithms that consist variations of the Fourier transform methods.</p>\n",
          "difficulty": null,
          "id": "proj_open-bioinformatics-_2017_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6722516903002112/",
          "proposal_id": null,
          "short_description": "In mass spectrometry the isotope pattern of an unknown molecule consists a powerful analytical tool to identify its molecular formula. Modern...",
          "slug": "implement-algorithms-for-the-generation-of-high-resolution-isotope-patterns",
          "status": "completed",
          "student_name": "Nikos Patikas",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Implement algorithms for the generation of high-resolution isotope patterns"
        },
        {
          "code_url": "https://bitbucket.org/antismash/antismash/pull-requests/116/gsoc-2017-move-antismash-to-jinja2-a/diff",
          "description": "<p>antiSMASH, a python-based tool to mine micro-organisms genomes, currently uses pyQuery to generate static HTML pages. Consequently, several difficulties are found when improvements/changes need to be performed. This library is commonly described as too verbose, implying most of the times, string concatenations and mixed code for both presentation and logic. Subsequently, it is not much intuitive. In addition, recent patch update from 1.2.9 to 1.2.10 resulted in a backward compatibility break, and as a minor patch should not raise compatibility issues, the trust in this library is somehow compromised.\nTemplate Engines overcome the majority of the issues related to output generation. They are powerful tools that allow the developers to speed up their work in an easier and much cleaner way.</p>\n<p>This project proposes moving antiSMASH to jinja2, a well known, widely used and developer-friendly templating language for Python. With this migration, we intend to facilitate the future development of antiSMASH as well as the onboarding of new developers to the team. Moreover, considering jinja2 enormous user-base and applications, a backwards compatibility break in a minor version is unlikely.</p>\n",
          "difficulty": null,
          "id": "proj_open-bioinformatics-_2017_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5688096846774272/",
          "proposal_id": null,
          "short_description": "antiSMASH, a python-based tool to mine micro-organisms genomes, currently uses pyQuery to generate static HTML pages. Consequently, several...",
          "slug": "antismash-migration-to-template-system",
          "status": "completed",
          "student_name": "Mariana Nave",
          "student_profile": null,
          "tags": [
            "python",
            "ml",
            "ai",
            "ui"
          ],
          "title": "antiSMASH Migration to Template System"
        },
        {
          "code_url": "https://dpliakos.github.io/gsoc2017_overview/",
          "description": "<p>TreeMatcher is a subproject of ETE3. Target of TreeMatcher is to perform search on phylogenetic trees using tree patterns that allows relax connection between tree nodes in newick format mimicking regular expressions' functionality.</p>\n",
          "difficulty": null,
          "id": "proj_open-bioinformatics-_2017_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5709813409382400/",
          "proposal_id": null,
          "short_description": "TreeMatcher is a subproject of ETE3. Target of TreeMatcher is to perform search on phylogenetic trees using tree patterns that allows relax...",
          "slug": "etetree-matcher",
          "status": "completed",
          "student_name": "Dimitris Pliakos",
          "student_profile": null,
          "tags": [],
          "title": "ETE/Tree matcher"
        },
        {
          "code_url": "https://chfi.se/posts/2017-08-25-gsoc2017-summary.html",
          "description": "<p>Modify GeneNetwork to embed the BioDalliance genome browser in it. BioDalliance (henceforth BD) would be integrated into GeneNetwork (henceforth GN); not only should it be possible to view data from GN using BD, but the BD interface should be extended to allow on-the-fly fetching of data from the server as the user works with the browser, as well as add functionality for visualizing various types of data, such as QTLs and underlying genotypes.</p>\n<p>The goal would be to have the browser embedded in GN, and sufficiently and seamlessly integrated with the backend, so that the browser would be a valuable and useful tool in the GN environment.</p>\n",
          "difficulty": null,
          "id": "proj_open-bioinformatics-_2017_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5014950649004032/",
          "proposal_id": null,
          "short_description": "Modify GeneNetwork to embed the BioDalliance genome browser in it. BioDalliance (henceforth BD) would be integrated into GeneNetwork (henceforth GN);...",
          "slug": "genenetwork-genome-browser",
          "status": "completed",
          "student_name": "Christian Fischer",
          "student_profile": null,
          "tags": [
            "ml",
            "backend"
          ],
          "title": "GeneNetwork Genome Browser"
        },
        {
          "code_url": "https://gist.github.com/kapilkd13/309f9893ebf5657f33c823b154555212",
          "description": "<p>Cwltool is a reference implementation of the Common Workflow Language. It provides comprehensive validation of CWL files and include tools related to working with CWL.<br>\nCWL is a specification which is used to describe command line tools and workflows, providing benefits like flexibility, scalability and portability.<br>\nCurrently cwltool is developed for Linux and OS X and not for Windows Operating System.<br>\nAlso, cwltool and schema-salad targets python 2.7.</p>\n<p>The aim of this proposal is to enhance cross platform compatibility and usability of cwltool and schema-salad by:</p>\n<ul>\n<li><strong>Migrating to complete Python2+3 support for cwltool and schema-salad.</strong></li>\n<li><strong>Extending cwltool support to Microsoft Windows Operating System.</strong></li>\n</ul>\n",
          "difficulty": null,
          "id": "proj_open-bioinformatics-_2017_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/4952969170649088/",
          "proposal_id": null,
          "short_description": "Cwltool is a reference implementation of the Common Workflow Language. It provides comprehensive validation of CWL files and include tools related to...",
          "slug": "common-workflow-language-reference-implementation-modernization-making-cwltool-and-schema-salad-microsoft-windows-compatible-and-providing-complete-python-3-support-for-cwltool-and-schema-salad",
          "status": "completed",
          "student_name": "Kapil kumar",
          "student_profile": null,
          "tags": [
            "python",
            "ai",
            "ux"
          ],
          "title": "Common Workflow Language reference implementation modernization- Making cwltool and schema-salad, Microsoft Windows compatible and providing complete Python 3 support for cwltool and schema-salad"
        },
        {
          "code_url": "https://github.com/bionode/GSoC17",
          "description": "<p>This project started in last GSoC but is still missing core functionality</p>\n",
          "difficulty": null,
          "id": "proj_open-bioinformatics-_2017_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5883245933625344/",
          "proposal_id": null,
          "short_description": "This project started in last GSoC but is still missing core functionality",
          "slug": "bionode-watermill-a-streaming-workflow-engine-for-bioinformatics",
          "status": "completed",
          "student_name": "Tiago Jesus",
          "student_profile": null,
          "tags": [],
          "title": "Bionode-Watermill - A Streaming Workflow Engine for Bioinformatics"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2017/organizations/6098536001175552/"
    },
    "year_2018": {
      "num_projects": 5,
      "projects": [
        {
          "code_url": "https://medium.com/@synchon_mandal/gsoc-2018-with-open-bioinformatics-foundation-dc201bf945b9",
          "description": "<p>Constraint-Based Reconstruction and Analysis (COBRA) methods for Genome-wide Metabolic Networks (GEMs) have proven to be essential for the varied applications of metabolic modelling, from predicting growth rate of an organism to production of antibiotics and lethality analysis to name a few.  FBA or, Flux Balance Analysis is the earliest COBRA method and the most widely used. But, currently, we have sub-divisions of metabolic modelling strategies which are uncovering the flaws of FBA. To fix these flaws, we have been developing multiple methods which are also being backed by experimental data. So, now we are integrating data from experiments in the models and developing methods for a much better understanding of the metabolic pathways and functionalities of the organisms. The data-driven approaches provide more information about the models and hence provide us with a deeper understanding of the networks.</p>\n",
          "difficulty": null,
          "id": "proj_open-bioinformatics-_2018_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5430800522674176/",
          "proposal_id": null,
          "short_description": "Constraint-Based Reconstruction and Analysis (COBRA) methods for Genome-wide Metabolic Networks (GEMs) have proven to be essential for the varied...",
          "slug": "adding-methods-to-cobrapy-for-improved-constraint-based-metabolic-modelling",
          "status": "completed",
          "student_name": "synchon",
          "student_profile": null,
          "tags": [
            "ai",
            "ux"
          ],
          "title": "Adding methods to cobrapy for improved constraint-based metabolic modelling."
        },
        {
          "code_url": "https://sarthaksehgal18.wordpress.com/2018/08/12/gsoc-2018-final-report/",
          "description": "<p>BioJS is a library of over two hundred JavaScript components which enables users to visualise and process data. BioJS currently has two websites:</p>\n<ol>\n<li>Biojs.io: it lists all the components (npm packages) of BioJS with detailed information and visualisation(s).</li>\n<li>Biojs.net: it is an informational website for the BioJS organisation.</li>\n</ol>\n<p>BioJS.io gets the data of all the components through a middleware called workman. The development of a new workman has already been initiated which needs to be completed for integration with the frontend. I propose to create a new frontend website for BioJS and to integrate it with the backend/middleware to get the data in the most optimized way. The website will be developed using VueJS which makes it easy to maintain and the website will merge the currently existing websites and produce a consistent and modern UI and a better UX.</p>\n",
          "difficulty": "beginner",
          "id": "proj_open-bioinformatics-_2018_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/6129302596747264/",
          "proposal_id": null,
          "short_description": "BioJS is a library of over two hundred JavaScript components which enables users to visualise and process data. BioJS currently has two websites:\n...",
          "slug": "frontend-website-student-project-for-biojs",
          "status": "completed",
          "student_name": "Sarthak Sehgal",
          "student_profile": null,
          "tags": [
            "vue",
            "java",
            "javascript",
            "web",
            "ai"
          ],
          "title": "Frontend Website Student Project for BioJS"
        },
        {
          "code_url": "https://github.com/edgano/nextflow/tree/663a933db47a246cae35703892bebd4b03e97b5b/subprojects/nxf-prov",
          "description": "<p>The goal of this project is to implement the support for Research Object specification into Nextflow workflow framework, with the aim to improve the reproducibility and transparency of the resulting data-analysis and computational workflows based on such tool.</p>\n",
          "difficulty": null,
          "id": "proj_open-bioinformatics-_2018_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/4805810840403968/",
          "proposal_id": null,
          "short_description": "The goal of this project is to implement the support for Research Object specification into Nextflow workflow framework, with the aim to improve the...",
          "slug": "implement-the-support-for-research-object-specification-into-nextflow-framework",
          "status": "completed",
          "student_name": "Edgar Garriga Nogales",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Implement the support for Research Object specification into Nextflow framework"
        },
        {
          "code_url": "https://sophiamersmann.github.io///2018/08/08/final-report/",
          "description": "<p>OpenMS is an open-source software C++ library for mass spectrometry (MS) data management and analyses. A common task in proteomics is to identify and quantify proteins in complex biological mixtures. In a standard tandem mass spectrometry (MS/MS) protocol, a crucial part is to control the uncertainty in peptide identifications generated by search engines that match MS spectra to peptides. Based on an idea suggested by the OpenMS team, I propose a project to improve the posterior error probability estimation for peptide search engine results in OpenMS.</p>\n",
          "difficulty": "advanced",
          "id": "proj_open-bioinformatics-_2018_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5921078421487616/",
          "proposal_id": null,
          "short_description": "OpenMS is an open-source software C++ library for mass spectrometry (MS) data management and analyses. A common task in proteomics is to identify and...",
          "slug": "improve-posterior-error-probability-estimation-for-peptide-search-engine-results",
          "status": "completed",
          "student_name": "Sophia Mersmann",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Improve Posterior Error Probability Estimation For Peptide Search Engine Results"
        },
        {
          "code_url": "https://megh-thakkar.github.io/2018-08-12-GSoC-Final-Report/",
          "description": "<p>BioJS is a library of over two hundred JavaScript components enabling developers to visualize and process data using current web technologies. The primary aim of the project is to merge and redesign the backend of the two separate BioJS websites, namely biojs.io and biojs.net and work on the overall optimization of the new website.</p>\n",
          "difficulty": null,
          "id": "proj_open-bioinformatics-_2018_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/6278298501906432/",
          "proposal_id": null,
          "short_description": "BioJS is a library of over two hundred JavaScript components enabling developers to visualize and process data using current web technologies. The...",
          "slug": "backend-website-student-project",
          "status": "completed",
          "student_name": "MEGH THAKKAR",
          "student_profile": null,
          "tags": [
            "java",
            "javascript",
            "web",
            "ai",
            "backend"
          ],
          "title": "Backend Website Student Project"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2018/organizations/5813329234755584/"
    },
    "year_2019": {
      "num_projects": 5,
      "projects": [
        {
          "code_url": "https://github.com/antismash/2019-gsoc-webui",
          "description": "<p>antiSmash run multiple instances of the submission page, depending on whether people want to analyse bacterial or fungal sequences, or run the production or development version. Those sites are very similar, but differ slightly in what features are offered. Currently this causes a lot of code duplication.</p>\n<p>This summer I will develop a library that will contain common components from bacterial-ui and fungal-ui repositories. The library will act as common repository not only for these two projects but to other future projects related to antiSmash and beyond.</p>\n",
          "difficulty": null,
          "id": "proj_open-bioinformatics-_2019_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5125077937422336/",
          "proposal_id": null,
          "short_description": "antiSmash run multiple instances of the submission page, depending on whether people want to analyse bacterial or fungal sequences, or run the...",
          "slug": "antismash-submission-redesign",
          "status": "completed",
          "student_name": "Jeevan",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "antiSmash submission redesign"
        },
        {
          "code_url": "https://blog.urbanslug.com/posts/2019-08-20-Google-Summer-of-Code-2019-Final-Submission.html",
          "description": "<p>The current representation of reference genomes is as a sequence of nucleotides akin to a long string. Intuitively, this doesn’t represent a genome but rather a consensus. A workaround used today  is holding variation data in VCF files that don’t update the reference meaning the reference will always represent the genome as it <strong>was</strong> not as it <strong>is</strong> or as it’s <strong>evolving</strong>. It’s clear that the current method of representing genomes is not ideal.\nThere is a need for a representing the reference in a data structure that contains its inherent variation. Different methods have been tried and the variant graph is a promising one. The way the graph works is by representing the variation within the genome as alternative paths one can traverse the graph through and conserved regions as nodes without alternative paths to the get to the next node; we then index the nodes for querying and alignment.\nMoreover, variation graphs hold an advantage with rapidly evolving genomes and short read data that could get thrown out when it doesn’t have a place to align to in the reference; with the variant graph short reads should reads could align to alternative nodes.</p>\n",
          "difficulty": null,
          "id": "proj_open-bioinformatics-_2019_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5246044214919168/",
          "proposal_id": null,
          "short_description": "The current representation of reference genomes is as a sequence of nucleotides akin to a long string. Intuitively, this doesn’t represent a genome...",
          "slug": "add-variant-graph-vg-support-to-biod",
          "status": "completed",
          "student_name": "Njagi Mwaniki",
          "student_profile": null,
          "tags": [
            "api",
            "ai",
            "ui"
          ],
          "title": "Add Variant Graph (VG) support to BioD"
        },
        {
          "code_url": "https://gist.github.com/NickRoz1/a4ce8fff0b6904bb97f701c2d852a63e",
          "description": "<p>This project is aimed to build an efficient BAM format to ADAM format converter utilizing Sambamba library base.</p>\n",
          "difficulty": null,
          "id": "proj_open-bioinformatics-_2019_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/4644761342836736/",
          "proposal_id": null,
          "short_description": "This project is aimed to build an efficient BAM format to ADAM format converter utilizing Sambamba library base.",
          "slug": "bam-to-adam-converter-on-sambambas-base",
          "status": "completed",
          "student_name": "Nick Rozinsky",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "BAM to ADAM converter on Sambamba’s base"
        },
        {
          "code_url": "https://blog.biojs.net/2019-08-20-gsoc-wrap-up/",
          "description": "<p>BioJS is a library of over one hundred JavaScript components enabling users to visualise and process data using current web technologies. BioJS makes it easy for users to integrate their visualisations into their own website or web application.</p>\n<p>The process of updating the BioJS standard to version 3.0 is going on. The Yeoman generator to upgrade BioJS components by wrapping them in a Web Component has already been created which enables users to embed and use visualisation of various BioJS components.</p>\n<p>This project involves improving the Yeoman generator by adding new features and tests to make it easier for developers to implement old BioJS components as Web Components and to make new BioJS Web Components. It also involves clearly documenting the whole process of using the generator so as to make the task of working with the generator, making new components easy for developers as well as easily creating visualisations so that even non-technical persons can embed and use the visualisations in their work.</p>\n",
          "difficulty": "beginner",
          "id": "proj_open-bioinformatics-_2019_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/4928963908993024/",
          "proposal_id": null,
          "short_description": "BioJS is a library of over one hundred JavaScript components enabling users to visualise and process data using current web technologies. BioJS makes...",
          "slug": "interactive-yeoman-generator-for-biojs-components",
          "status": "completed",
          "student_name": "Nikhil Vats",
          "student_profile": null,
          "tags": [
            "java",
            "javascript",
            "web"
          ],
          "title": "Interactive Yeoman generator for BioJS components"
        },
        {
          "code_url": "https://bangpradyumna.github.io/GSoC-Final-Report/",
          "description": "<p>Open science is a movement that promotes open access to research data, publications, and scientific collaboration. It promises to increase transparency, provide reproducibility by reusing scientific datasets and increases trust in the scientific collaboration. Blockchain fits the mindset of open science because of its transparency and decentralized nature.</p>\n<p>This project aims to create a Hyperledger Composer/Fabric based \"Scientific Journal\" which could be used to share all the research objects that were produced during the research. These objects (Docs, Videos, Images, Code, Data sets) will be stored in a decentralized manner using IPFS (Inter-Planetory File System).</p>\n",
          "difficulty": null,
          "id": "proj_open-bioinformatics-_2019_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5147590344048640/",
          "proposal_id": null,
          "short_description": "Open science is a movement that promotes open access to research data, publications, and scientific collaboration. It promises to increase...",
          "slug": "add-blockchain-and-hyperledger-support-for-the-journal-of-open-data-publications",
          "status": "completed",
          "student_name": "Pradyumna Bang",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Add blockchain and hyperledger support for the ‘Journal of Open Data Publications’"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2019/organizations/5294944380518400/"
    },
    "year_2020": {
      "num_projects": 8,
      "projects": [
        {
          "code_url": "https://medium.com/@himanshi18037/final-work-product-gsoc-2020-5fba8744cbcf",
          "description": "<p>This project will be aimed to create an API-compatible open-source implementation of Intel's proprietary SVML which would be portable to other architectures and compilers. The implementation will be vectorised when possible to provide good performance.</p>\n",
          "difficulty": null,
          "id": "proj_open-bioinformatics-_2020_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/6576740249370624/",
          "proposal_id": null,
          "short_description": "This project will be aimed to create an API-compatible open-source implementation of Intel's proprietary SVML which would be portable to other...",
          "slug": "implementation-of-svml-in-simde",
          "status": "completed",
          "student_name": "Himanshi Mathur",
          "student_profile": null,
          "tags": [
            "api",
            "ml",
            "ai"
          ],
          "title": "Implementation of SVML in SIMDe"
        },
        {
          "code_url": "https://gist.github.com/24sharkS/7cb791091a8301f7c8460f15c04b97a0",
          "description": "<p>OpenMS, an open-source C++ library for the analysis of mass spectrometric data exposes a large part of its functionality to the Python community via the automatically generated pyOpenMS package. \nIn order to make the OpenMS algorithms available to the python community, we can use the reticulate package which is an R interface to python, to call the pyopenms methods.\nThis project involves expanding this initial prototype to create a fully capable R package that internally calls pyopenms methods using reticulate to analyze mass spectrometric data. The package would come along with tests, additional documentation, example visualizations, and a tutorial to guide beginners.</p>\n",
          "difficulty": "beginner",
          "id": "proj_open-bioinformatics-_2020_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5403269754519552/",
          "proposal_id": null,
          "short_description": "OpenMS, an open-source C++ library for the analysis of mass spectrometric data exposes a large part of its functionality to the Python community via...",
          "slug": "openms-r-package",
          "status": "completed",
          "student_name": "Shekhar Shukla",
          "student_profile": null,
          "tags": [
            "python",
            "ai",
            "ui"
          ],
          "title": "OpenMS R-Package"
        },
        {
          "code_url": "https://gsocgraph.blogspot.com/2020/08/final-week-recap-of-my-gsoc-experience.html",
          "description": "<p>Traditionally, Bioinformatics has focused its eﬀorts on the study of single genomes, each representing an individual of a certain species. In more recent times, the focus has shifted on pangenomes, that encode genomic variation across multiple individuals of a certain species.\nPangenome graphs (also called Variation Graphs) are used to store and represent pangenomes. Multiple open-source tools have been developed for building and analyzing Variation Graphs and VG (<a href=\"https://github.com/vgteam/vg\" target=\"_blank\">https://github.com/vgteam/vg</a>) is the most popular one. VG provides a framework to work with Variation Graphs, and it is currently capable of handling moderately-sized graphs. However, it has issues scaling up for large datasets.\nI want to improve its performances by building a highly parallel graph explorer that makes use of GPU architecture in Rust. GPUs are well known for their ability to do millions of operations at the same time, however achieving this requires code to be written in a speciﬁc, parallel-oriented way. I think that, with help from the mentors, this can surely happen, and VG will be able to explore Variation Graphs much faster.</p>\n",
          "difficulty": null,
          "id": "proj_open-bioinformatics-_2020_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5109120027328512/",
          "proposal_id": null,
          "short_description": "Traditionally, Bioinformatics has focused its eﬀorts on the study of single genomes, each representing an individual of a certain species. In more...",
          "slug": "parallel-graph-traversal-for-variation-graphs",
          "status": "completed",
          "student_name": "Francesco Porto",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Parallel Graph Traversal for Variation Graphs"
        },
        {
          "code_url": "https://bscrow.github.io/gsoc2020.html",
          "description": "<p>Pysradb provides a convenient method to retrieve information from NCBI’s SRA database. Currently, pysradb is transitioning to phase out its dependency on an SRAmetadb.Sqlite file from the SRAdb project. While this file provides a fast, offline method of retrieving metadata found in SRA, it is very large; downloading the file represents a significant hurdle for users.</p>\n<p>This project seeks to implement a search module for pysradb. This search module should be able to take in the user’s search query, parse it accordingly, query the SRA database and then retrieve and display the search results to the user. As the main consideration of this search module is user-friendliness, I propose several additional features to make pysradb more effective in achieving user's needs. These features include:</p>\n<ul>\n<li>Accepting additional input parameters to finetune search results.</li>\n<li>Processing and organisation of search results into more user-friendly formats.</li>\n<li>Automatic generation of statistics and graphs, which serves to provide summary information about a search query for the user.</li>\n</ul>\n",
          "difficulty": null,
          "id": "proj_open-bioinformatics-_2020_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/6238152676605952/",
          "proposal_id": null,
          "short_description": "Pysradb provides a convenient method to retrieve information from NCBI’s SRA database. Currently, pysradb is transitioning to phase out its...",
          "slug": "implementing-user-friendly-search-features",
          "status": "completed",
          "student_name": "Boshen Yan",
          "student_profile": null,
          "tags": [
            "ai",
            "database"
          ],
          "title": "Implementing user-friendly search features"
        },
        {
          "code_url": "https://github.com/vermasrijan/srijan-gsoc-2020",
          "description": "<p>Nowadays, sharing and use of human biomedical data is heavily restricted and regulated by multiple laws. Such data-sharing restrictions allow keeping privacy of the patients but at the same time it impedes the pace of biomedical research, slows down the development of treatments of various diseases and often costs human lives. \nCOVID-19 pandemic is unfortunately a good illustration of how inaccessibility of clinical training data leads to casualties that can be otherwise avoided. Even the World Health Organization which is supposed to become a data hub for COVID-19 data, refuses to share most of the clinical data even in anonymous form due to the complexity of regulations. \nSuch problems are also common for bioinformatics as training classifiers and regressors on patient *-omics data often involves dealing with medical records of the patients.</p>\n<p>To address these problems, we propose to develop a package, HRC, which will be built on top of Federated Learning (FL) framework, to bridge the gap between healthcare provides and researchers.<br>\nThis package will allow biomedical researchers to quickly modify and deploy FL for typical bioinformatic use-cases.</p>\n",
          "difficulty": "advanced",
          "id": "proj_open-bioinformatics-_2020_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/4898360579850240/",
          "proposal_id": null,
          "short_description": "Nowadays, sharing and use of human biomedical data is heavily restricted and regulated by multiple laws. Such data-sharing restrictions allow keeping...",
          "slug": "healthcare-researcher-connector-hrc-a-federated-learning-package-for-bridging-the-gap-between-healthcare-providers-and-researchers",
          "status": "completed",
          "student_name": "Srijan Verma",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Healthcare-Researcher-Connector (HRC): A Federated Learning package for bridging the gap between Healthcare providers and researchers"
        },
        {
          "code_url": "https://masterchef2209.wordpress.com/2020/08/26/final-work-product-submission-report-google-summer-of-code-2020/",
          "description": "<p>The project deals with writing portable implementations for SIMD ISA extensions SSE4.2 and AVX-512 functions and NEON implementations for SSE4.1,SSE4.2,SSE3 and SSSE3 ISA extensions.</p>\n",
          "difficulty": null,
          "id": "proj_open-bioinformatics-_2020_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/4905563541995520/",
          "proposal_id": null,
          "short_description": "The project deals with writing portable implementations for SIMD ISA extensions SSE4.2 and AVX-512 functions and NEON implementations for...",
          "slug": "simde-add-implementations-of-isa-extensions-sse42-and-avx512-and-neon-implementations-of-sse41sse42sse3ssse3-isa-extension",
          "status": "completed",
          "student_name": "Hidayat Ullah Khan",
          "student_profile": null,
          "tags": [],
          "title": "SIMDe : Add implementations of ISA extensions (SSE4.2 and AVX512) and NEON implementations of SSE4.1,SSE4.2,SSE3,SSSE3 ISA extension"
        },
        {
          "code_url": "https://github.com/eliza-m/CrossSpeciesWorkflow/blob/GSOC2020/GSOC2020_final_report.md",
          "description": "<p>While there are a multitude of open source ML methods for prediction of various structural or biological related attributes, there are no open source pipelines or APIs which allow to performing a one command task for running multiple/equivalent methods and join the results in a way that facilitates comparisons and further dissemination. This limits any type of structural/comparative biology analyses, as one would need to install and run &gt;50 software and put together all the results using in-house scripts.</p>\n<p>This project aims at developing a scalable workflow that receives the protein FASTA file and runs a series of structural and phenotype related predictors, generating a knowledge dataset that will facilitate further exploration and comparisons according to the following categories of features:  secondary structure, solvent accessibility, disordered regions, PTS modifications or binding sites.</p>\n<p>Deliverables of this project consists of 8 modules for each analysis type organised as Docker images, a Python library for processing inputs &amp; outputs of the included methods and a CWL pipeline that will facilitate a one-line command run of all the predictors (default or custom configuration).</p>\n",
          "difficulty": null,
          "id": "proj_open-bioinformatics-_2020_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/6302555174338560/",
          "proposal_id": null,
          "short_description": "While there are a multitude of open source ML methods for prediction of various structural or biological related attributes, there are no open source...",
          "slug": "protein-sequence-and-structural-analysis-cwl-pipeline-for-comparative-biology",
          "status": "completed",
          "student_name": "Eliza Martin",
          "student_profile": null,
          "tags": [
            "python",
            "api",
            "ml",
            "ai",
            "docker"
          ],
          "title": "Protein sequence and structural analysis CWL pipeline for comparative biology"
        },
        {
          "code_url": "https://openmsgsoc2020.blogspot.com/2020/08/gsoc-final-report.html",
          "description": "<p>When using mass spectrometry to analyze protein samples it is key to use the appropriate protein database. Most of the time a sample from only one organism, of which the genome (and therefore the proteasome) is known, is analyzed. In this case choosing a suitable database does not pose a problem.<br>\nHowever if the sample contains one or multiple unknown organisms, it can be difficult to choose an adequate database. Nevertheless there are multiple approaches to solve this, but those methods frequently depend on assumptions and are therefore not guaranteed to generate a suitable database.<br>\nBecause of that it would be valuable to be able to score those databases. Thus ensuring the most suitable one is used.<br>\nTo achieve this, <em>de novo</em> sequences are derived for mass spectra and appended to the given protein database. Subsequent a standard protein search engine is run. The number of <em>de novo</em> and database sequences are counted after some false discovery rate determinations. The quality of the database can now be calculated as follows:</p>\n<p>database quality = # database sequences / (# database sequences + # <em>de novo</em> sequences)</p>\n<p>This project aims to implement this metric in OpenMS.</p>\n",
          "difficulty": null,
          "id": "proj_open-bioinformatics-_2020_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5225514815455232/",
          "proposal_id": null,
          "short_description": "When using mass spectrometry to analyze protein samples it is key to use the appropriate protein database. Most of the time a sample from only one...",
          "slug": "using-denovo-sequencing-to-predict-protein-database-suitability",
          "status": "completed",
          "student_name": "T. Waschischeck",
          "student_profile": null,
          "tags": [
            "ai",
            "database",
            "ui"
          ],
          "title": "Using DeNovo Sequencing to Predict Protein Database Suitability"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2020/organizations/4595548239167488/"
    },
    "year_2021": {
      "num_projects": 8,
      "projects": [
        {
          "code_url": "https://simba611.wordpress.com/",
          "description": "<p>This project aims to add portable implementations for SIMD ISA extension AVX-512 functions which are not yet supported by SIMDe. This will make development with highly optimized code more universal and allow developers to write and test vectorized code for many applications even without access to specific hardware.</p>\n",
          "difficulty": null,
          "id": "proj_open-bioinformatics-_2021_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6431754096738304/",
          "proposal_id": null,
          "short_description": "This project aims to add portable implementations for SIMD ISA extension AVX-512 functions which are not yet supported by SIMDe. This will make...",
          "slug": "implementations-of-avx-512-functions",
          "status": "completed",
          "student_name": "Kunwar Maheep Singh",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Implementations of AVX-512 functions"
        },
        {
          "code_url": "https://gist.github.com/federikovi/0ff5f376105e3111d624d935758cded3",
          "description": "<h3>Synopsis</h3>\n<p>WellcomeML is a python package containing a set of utility functions that use machine learning for reading, processing, embedding and classifying academic text data like publications, grants, and other documents. \nThe need for developing a new feature for expanding WellcomeML with further visualisation modules has emerged; in this specific case the objective is to create a standard interactive visualisation tool for the results of the clustering algorithm present in the library.</p>\n",
          "difficulty": null,
          "id": "proj_open-bioinformatics-_2021_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5736009995649024/",
          "proposal_id": null,
          "short_description": "Synopsis\nWellcomeML is a python package containing a set of utility functions that use machine learning for reading, processing, embedding and...",
          "slug": "developing-wellcomeml-further-for-the-visualisation-of-academic-research-data",
          "status": "completed",
          "student_name": "Federica Trevisan",
          "student_profile": null,
          "tags": [
            "python",
            "ml",
            "ai"
          ],
          "title": "Developing WellcomeML further for the visualisation of academic research data"
        },
        {
          "code_url": "https://github.com/OpenMS/OpenMS/pull/5489",
          "description": "<p>This project aims to enable JavaScript visualizations in TOPPView using Qt WebEngine and its different modules.</p>\n",
          "difficulty": null,
          "id": "proj_open-bioinformatics-_2021_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5109826782232576/",
          "proposal_id": null,
          "short_description": "This project aims to enable JavaScript visualizations in TOPPView using Qt WebEngine and its different modules.",
          "slug": "enabling-and-prototyping-javascript-visualizations-in-the-qt-based-viewer-toppview-openms",
          "status": "completed",
          "student_name": "Dhanmoni Nath",
          "student_profile": null,
          "tags": [
            "java",
            "javascript",
            "web",
            "ai"
          ],
          "title": "Enabling and prototyping JavaScript visualizations in the Qt-based viewer TOPPView (OpenMS)."
        },
        {
          "code_url": "https://docs.google.com/document/d/1vDrG2qiU7NSABXG1BUoDeztsWhvzlv6rJOkq6h6MLVc/edit?usp=sharing",
          "description": "<p>The aim on this project is to implement NEON functions into SIMD which are not yet supported. Adding these implementations will allow the NEON SIMD intrinsics to be run on any architecture. Along with their portable implementations, implementations using other ISA extensions will also be included. For example, SSE/AVX, AltiVec, WebAssembly (WASM) etc.</p>\n",
          "difficulty": null,
          "id": "proj_open-bioinformatics-_2021_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6257652765556736/",
          "proposal_id": null,
          "short_description": "The aim on this project is to implement NEON functions into SIMD which are not yet supported. Adding these implementations will allow the NEON SIMD...",
          "slug": "implementation-of-neon-functions-simde",
          "status": "completed",
          "student_name": "Atharva Nimbalkar",
          "student_profile": null,
          "tags": [
            "web",
            "ai"
          ],
          "title": "Implementation of NEON functions (SIMDe)"
        },
        {
          "code_url": "https://ikayz.github.io/code-is-science-frontend/",
          "description": "<p>The Code is science website is currently built using vanilla HTML, CSS and JavaScript with Ruby as part of its backend. The current frontend needs to be redesigned and updated.</p>\n",
          "difficulty": null,
          "id": "proj_open-bioinformatics-_2021_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/4885658513965056/",
          "proposal_id": null,
          "short_description": "The Code is science website is currently built using vanilla HTML, CSS and JavaScript with Ruby as part of its backend. The current frontend needs to...",
          "slug": "design-and-implementation-of-code-is-science-front-end-using-reactjs",
          "status": "completed",
          "student_name": "Isaac Miti",
          "student_profile": null,
          "tags": [
            "react",
            "java",
            "javascript",
            "web",
            "ml"
          ],
          "title": "Design and implementation of Code is Science front-end using ReactJS"
        },
        {
          "code_url": "https://gist.github.com/mhpopescu/da10ef62158f03141e7898d2bb156c05",
          "description": "<p>Toil is an open-source Python workflow engine that lets people write data analysis pipelines in Python, CWL, and WDL. Toil has support for common workflow language (CWL), an open standard for describing analysis workflows. The power of Toil was demonstrated in “Toil enables reproducible, open source, big biomedical data analyses” paper published in Nature Biotechnology volume where it is described how well it scaled for a dataset of 108 terabytes on 32,000 cores on a public cloud.</p>\n<p>This project aims to implement data streaming to speed up the analysis by avoiding slow disk/storage IO and speeding up the start of tool execution when it isn't required to wait for data to download. The main focus is to implement this first in AWS S3.</p>\n",
          "difficulty": null,
          "id": "proj_open-bioinformatics-_2021_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5793792606601216/",
          "proposal_id": null,
          "short_description": "Toil is an open-source Python workflow engine that lets people write data analysis pipelines in Python, CWL, and WDL. Toil has support for common...",
          "slug": "data-streaming-in-scientific-workflows-implementation-for-toil",
          "status": "completed",
          "student_name": "Mihai Popescu",
          "student_profile": null,
          "tags": [
            "python",
            "ai",
            "cloud",
            "ui"
          ],
          "title": "Data streaming in scientific workflows, implementation for Toil"
        },
        {
          "code_url": "https://medium.com/@tanishqgupta_91919/final-evaluation-gsoc-2021-8f109d4fa458",
          "description": "<p>While GTF files are by themselves comprehensive, a lot of analysis is focused on individual features. For example, any analysis focused on transcriptional regulation would focus more on exons and possibly introns and non-coding RNA than UTRs while translational regulation analysis would focus on only the CDS and possibly the UTRs. Though the GTF is supposed to be a standard format, there are differences in the annotation features for different species.</p>\n<p>These analyses often require a BED file to work with. However, currently we don't have any existing database of BED files nor a modular script which can convert GTF files to Bed.  Though it is trivial to obtain a BED from GTF but it does require some time.</p>\n<p>This project provides a modularized library with an easy to use command line interface to convert GTF files to BED files. It also provides a modular pipeline to create a repository of Bed files for all species on Ensembl. \nThis will save time of great scientists and engineers doing work in this field and maybe they can utilize this time in a more productive way.</p>\n",
          "difficulty": "beginner",
          "id": "proj_open-bioinformatics-_2021_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5883191075799040/",
          "proposal_id": null,
          "short_description": "While GTF files are by themselves comprehensive, a lot of analysis is focused on individual features. For example, any analysis focused on...",
          "slug": "gtfbase-a-curated-resource-of-multispecies-genomic-regions",
          "status": "completed",
          "student_name": "Tanishq Gupta",
          "student_profile": null,
          "tags": [
            "ai",
            "database",
            "ui"
          ],
          "title": "gtfBase- A curated resource of multispecies genomic regions"
        },
        {
          "code_url": "https://medium.com/@shreysachdeva.2000/obf-development-of-a-user-interface-for-the-vep-nextprot-plugin-cebafa386d64",
          "description": "<p>The goal of this project would be to develop a web based user interface to visualise the variant prediction data from VEP plugin using the neXtProt tools to make it easily accessible to the users. The interface would be designed in such a way that it is performant, scalable and can easily handle large amounts of data that is computed by the VEP plugin API.</p>\n",
          "difficulty": null,
          "id": "proj_open-bioinformatics-_2021_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5894767623274496/",
          "proposal_id": null,
          "short_description": "The goal of this project would be to develop a web based user interface to visualise the variant prediction data from VEP plugin using the neXtProt...",
          "slug": "development-of-a-user-interface-to-visualise-vep-data-using-nextprot-tools",
          "status": "completed",
          "student_name": "Shrey Sachdeva",
          "student_profile": null,
          "tags": [
            "web",
            "api"
          ],
          "title": "Development of a user interface to visualise VEP data using neXtProt tools"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2021/organizations/6326136019091456/"
    },
    "year_2022": {
      "num_projects": 5,
      "projects": [
        {
          "code_url": "https://gist.github.com/chaliya96/1d5b52f0c40a34a52d8b7925d761fdf8",
          "description": "Analyzing positional features/annotations in sequences is important in bioinformatics. Visualizing such data is quite a challenging task, considering the large amount of data to be displayed. The feature viewer is an open source javascript library developed to visualize biological data (referred to as features) mapped to a linear sequence (Paladin et al., 2020). For instance, it can be configured to visualize the location of protein domains or amino acid variations in a protein sequence. The feature viewer is being used in several popular bioinformatics resources such as neXtProt and COSMIC 3D.\n\nCurrently, the feature viewer supports limited configurability options in the features displayed, such as the color, shape and on-click behavior. This is too restrictive for some of the possible use cases of the feature viewer, where more flexibility is required in the display of features. One such instance is when different types of amino acid variants should be displayed in a color-specific manner in the same feature track.\n\nThe overall goal of this project is to improve the configurability of the feature viewer, such that it allows greater flexibility in the visualization of detailed biological data.",
          "difficulty": null,
          "id": "proj_open-bioinformatics-_2022_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/rxjfYo3p/",
          "proposal_id": null,
          "short_description": "Analyzing positional features/annotations in sequences is important in bioinformatics. Visualizing such data is quite a challenging task, considering...",
          "slug": "feature-viewer-enhanced-user-experience-and-performance",
          "status": "completed",
          "student_name": "Chalith Tharuka",
          "student_profile": null,
          "tags": [
            "java",
            "javascript",
            "ai",
            "ui"
          ],
          "title": "Feature Viewer - Enhanced User Experience and Performance"
        },
        {
          "code_url": "https://gist.github.com/d-e-v-esh/d0c7cde2bdfecde2e265b7d63dd1c89a",
          "description": "Currently, the backend of the journal policy tracker is on Flask and SQLite3. The goal for this project is to create a full-fledged functioning backend with\nExpress, GraphQL, and MongoDB write extensive tests for that backend\nand then deploy it online. Switching to a no-SQL database for this use case will remove unneeded complexity from the database and make it more friendly to new contributors. Using GraphQL will eliminate a good amount of server load as the frontend will be able to precisely pick and choose the data that it wants to request.\n\nThe main objectives of this project are:\n\n1. Building a user Authentication API that will let people register and log in on\nthe website as well as implementing the function of forgot-password.\n\n2. Building Journal CRUD API which will allow our users to Create, Read, Update\nand Delete journal requests.\n\n3. Writing proper documentation for all the implemented APIs.\n\n4. Deploying this server online and making it fully functional.",
          "difficulty": "advanced",
          "id": "proj_open-bioinformatics-_2022_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/vTyb8f1v/",
          "proposal_id": null,
          "short_description": "Currently, the backend of the journal policy tracker is on Flask and SQLite3. The goal for this project is to create a full-fledged functioning...",
          "slug": "migration-of-the-backend-to-express-graphql-and-mongodb",
          "status": "completed",
          "student_name": "Devesh Kumar",
          "student_profile": null,
          "tags": [
            "web",
            "api",
            "ai",
            "database",
            "ui"
          ],
          "title": "Migration of the backend to Express, GraphQL, and MongoDB"
        },
        {
          "code_url": "https://codeisscience-community.netlify.app/blog/GSoC-22-Building-the-Journal-Policy-Tracker",
          "description": "The project aims at helping researchers find journals that require open source code easily. I aim to create a user interface that could seamlessly help users submit, edit and delete journals and a user-management system that could help with admin and user roles. React forms can replace the outdated google forms to sign manifestos by individuals or organizations, which comes with proper authentication and spam prevention. Apart from working on having maximum functionalities integrated, I shall be removing the frontend dependencies like React-Bootstrap to make the project more user-friendly. With that, CI pipelines shall be integrated through Github actions along with E2E tests written with Cypress.",
          "difficulty": null,
          "id": "proj_open-bioinformatics-_2022_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/Jmh3T7CH/",
          "proposal_id": null,
          "short_description": "The project aims at helping researchers find journals that require open source code easily. I aim to create a user interface that could seamlessly...",
          "slug": "journal-tracker-finalise-and-deploy-react-front-end",
          "status": "completed",
          "student_name": "Padmaja Bhol",
          "student_profile": null,
          "tags": [
            "react",
            "ml",
            "ai",
            "ui",
            "frontend"
          ],
          "title": "Journal tracker – finalise and deploy React front-end"
        },
        {
          "code_url": "https://pranavich18.github.io/datalayout-mass-spectrometry/",
          "description": "In this project, we need to implement a zero-cost abstraction using Modern C++, which can help us to switch between Structure of Arrays (SoA) and Array of Structures (AoS).\nThis abstraction needs to be introduced at MSSpectrum and MSChromatogram levels. These are the 2 classes used in OpenMS, which currently uses vector<Peak1D> i.e. an Array of Structures.",
          "difficulty": null,
          "id": "proj_open-bioinformatics-_2022_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/k2WCuWM8/",
          "proposal_id": null,
          "short_description": "In this project, we need to implement a zero-cost abstraction using Modern C++, which can help us to switch between Structure of Arrays (SoA) and...",
          "slug": "efficient-data-layout-for-mass-spectrometry-data-openms",
          "status": "completed",
          "student_name": "Pranav Joshi",
          "student_profile": null,
          "tags": [],
          "title": "Efficient data layout for mass spectrometry data (OpenMS)"
        },
        {
          "code_url": "https://gist.github.com/anamika-yadav99/371a486a489b6e327906eefad69f71ba",
          "description": "Genstorian data refinement tool is pipeline to identify allele names  in genotype of a model organism and strain information related to the allele from a table.  The inventories of strain collections are typically kept as plain text in spreadsheets or similar tables. This is prone to errors and inconsistency because genotypes are input manually as plain text. The major challenge of the project is to migrate data from spreadsheets to the database. There is no standard set of rules followed to store allele information in a spreadsheet. Hence, the goal of the project is extract the information in spreadsheet then standardize it before storing it in a database.",
          "difficulty": null,
          "id": "proj_open-bioinformatics-_2022_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/2UDvDlA2/",
          "proposal_id": null,
          "short_description": "Genstorian data refinement tool is pipeline to identify allele names in genotype of a model organism and strain information related to the allele...",
          "slug": "genestorian-data-refinement",
          "status": "completed",
          "student_name": "Anamika Yadav",
          "student_profile": null,
          "tags": [
            "ai",
            "database"
          ],
          "title": "Genestorian data refinement"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2022/organizations/open-bioinformatics-foundation-obf/"
    },
    "year_2023": null,
    "year_2024": null,
    "year_2025": null
  },
  "first_time": false,
  "contact": {
    "email": "gsoc@mailman.open-bio.org",
    "guide_url": null,
    "ideas_url": null,
    "irc_channel": "https://obf.github.io/GSoC/contact/",
    "mailing_list": "https://groups.google.com/g/obf-gsoc-general"
  },
  "social": {
    "blog": "https://www.open-bio.org/blog/",
    "discord": null,
    "facebook": null,
    "github": null,
    "gitlab": null,
    "instagram": null,
    "linkedin": null,
    "mastodon": null,
    "medium": null,
    "reddit": null,
    "slack": null,
    "stackoverflow": null,
    "twitch": null,
    "twitter": "https://twitter.com/obf_news",
    "youtube": null
  },
  "meta": {
    "version": 1,
    "generated_at": "2026-01-25T15:28:53.810Z"
  }
}