{
  "id": "692251df53dd9d7326d33e4c",
  "slug": "open-genome-informatics",
  "name": "Open Genome Informatics",
  "category": "Science and medicine",
  "description": "Open access genomics and bioinformatics projects",
  "image_url": "https://summerofcode.withgoogle.com/media/org/open-genome-informatics/p6nhalhjwargwd5s-360.png",
  "img_r2_url": "https://pub-268c3a1efc8b4f8a99115507a760ca14.r2.dev/open-genome-informatics.webp",
  "logo_r2_url": null,
  "url": "http://gmod.org/wiki/GSoC",
  "active_years": [
    2016,
    2017,
    2020,
    2021,
    2022,
    2023
  ],
  "first_year": 2016,
  "last_year": 2023,
  "is_currently_active": false,
  "technologies": [
    "python",
    "java",
    "node.js",
    "gwt",
    "html",
    "javascript",
    "neo4j",
    "react",
    "r-project",
    "mysql",
    "graph",
    "angular"
  ],
  "topics": [
    "databases",
    "bioinformatics",
    "genome",
    "computational biology",
    "data visualisation",
    "data mining",
    "genomics",
    "biology",
    "data and databases",
    "cloud",
    "data discovery"
  ],
  "total_projects": 28,
  "stats": {
    "avg_projects_per_appeared_year": 4.67,
    "projects_by_year": {
      "year_2016": 6,
      "year_2017": 8,
      "year_2018": null,
      "year_2019": null,
      "year_2020": 5,
      "year_2021": 6,
      "year_2022": 2,
      "year_2023": 1,
      "year_2024": null,
      "year_2025": null
    },
    "students_by_year": {
      "year_2016": 6,
      "year_2017": 8,
      "year_2018": null,
      "year_2019": null,
      "year_2020": 5,
      "year_2021": 6,
      "year_2022": 2,
      "year_2023": 1,
      "year_2024": null,
      "year_2025": null
    },
    "total_students": 27
  },
  "years": {
    "year_2016": {
      "num_projects": 6,
      "projects": [
        {
          "code_url": "https://gist.github.com/krassowski/2dd02c4d7473251089521d810fe9d9ec",
          "description": "<p>I have wrote a set of thoughts expanding the original proposal \"Interactive visualisation framework for genome mutations in gene and protein networks\" to express my current understanding of the topic, my views and propositions.</p>\n<p>The ideas expressed in the proposal are related to the general planning of the project as well to implementation of visualization engine specifically. Among others I propose use of \"user defined layouts\", clusterization, refer to pathway visualization in KEGG and mention alternative to graph-based visualization tools.</p>\n<p>I hope to get feedback on this draft to know whether my current idea of this project is on track or whether I am thinking of something other than the author had in mind. I will appreciate any feedback.</p>\n",
          "difficulty": null,
          "id": "proj_open-genome-informat_2016_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/6640774816989184/",
          "proposal_id": null,
          "short_description": "I have wrote a set of thoughts expanding the original proposal \"Interactive visualisation framework for genome mutations in gene and protein...",
          "slug": "interactive-visualisation-framework-for-genome-mutations-in-gene-and-protein-networks",
          "status": "completed",
          "student_name": "krassowski",
          "student_profile": null,
          "tags": [],
          "title": "Interactive visualisation framework for genome mutations in gene and protein networks"
        },
        {
          "code_url": "https://github.com/varunshankar/galaxy-godocker",
          "description": "<p>Go-Docker is a cluster management tool using Docker as execution/isolation system. It can be seen like Sun Grid Engine/Torque/… Using Bioinformatics dedicated Docker hub as BioShaDock, It allows life scientists to use powerful tools in a easy and secure way while finely managing infrastructures resources. It integrates with container management tools (Docker Swarm, Mesos, ...) to dispatch of the commands on the remote nodes. Galaxy is a user-friendly web platform originally dedicated to life sciences data analysis. If Galaxy provides amazing functionalities to enhance transparency, accessibility and reproducibility of data analysis related processes, there is still opportunities to provide more reproducibility and flexibility in the manner of using this web platform.This project idea is to integrate the Go-Docker system with Galaxy. Integration is to be done in two ways. First, to develop a “Go-Docker Galaxy tool” which will allow the possibility to create / use new on demand “tools” in a Galaxy instance without being an admin and without going to the system black matter. Second, to develop a “Go-Docker executor/runner” which can be used as any other scheduler (i.e. SGE, Torque …).</p>\n",
          "difficulty": "beginner",
          "id": "proj_open-genome-informat_2016_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5045382371344384/",
          "proposal_id": null,
          "short_description": "Go-Docker is a cluster management tool using Docker as execution/isolation system. It can be seen like Sun Grid Engine/Torque/… Using Bioinformatics...",
          "slug": "using-go-docker-to-enhance-galaxy-functionalities",
          "status": "completed",
          "student_name": "Varun Shankar S",
          "student_profile": null,
          "tags": [
            "ios",
            "web",
            "ai",
            "docker"
          ],
          "title": "Using Go-Docker to enhance Galaxy functionalities"
        },
        {
          "code_url": "https://docs.google.com/document/d/1suJVO5VGXn3sFI3Rk88uU4vbLJHH5ZpTxUSzZDcfO8M/edit?usp=sharing",
          "description": "<p>With the development of software container technology, developers can manage and deploy their software effectively. The software can start up and run on the container more and more quickly. The Dockstore is a platform for users to share tools encapsulated in Docker. Furthermore, in order to share tools as seamlessly as possible, GA4GH create a set of APIs for the biology scientists. In this project, I would like to make the Dockstore support these APIs. In this way, people can create their tools based on the APIs so that their tools can be work with others’ tools seamlessly. It will absolutely help the cooperation between scientists due to they can create their tools based on or cooperate with others’ more easily. Our project has three main goals. The first is to communicate with GA4GH community so as to decide the APIs standard and their implementations. Then, I need to implement and test these APIs with java so that the Dockstore can support the APIs. The last goal is realize cross indexing of tools across all sites that support the standard. When finish cross indexing, Dockstore can search all the tools from all websites which support the standard.</p>\n",
          "difficulty": null,
          "id": "proj_open-genome-informat_2016_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5543076202283008/",
          "proposal_id": null,
          "short_description": "With the development of software container technology, developers can manage and deploy their software effectively. The software can start up and run...",
          "slug": "work-with-the-dockstore-team-and-the-ga4gh-to-enable-cross-docker-repository-sharing",
          "status": "completed",
          "student_name": "ulim",
          "student_profile": null,
          "tags": [
            "java",
            "web",
            "api",
            "ml",
            "ai"
          ],
          "title": "Work with the Dockstore Team and the GA4GH to Enable Cross Docker Repository Sharing"
        },
        {
          "code_url": "http://pubudusoc16.blogspot.com/2016/08/project-wrapup.html",
          "description": "<p>This project will deliver a lightweight socializing plugin for JBrowse using OAuth2 and the Faye pub/sub framework. Users will be able to chat, share their session and comment on each other with the identity they build using OAuth2. Users will be able to control the visibility of their avatar as well as their activities. This document also contains personal details about me, why I chose this project and why I think I deserve to be selected to do this project.</p>\n",
          "difficulty": null,
          "id": "proj_open-genome-informat_2016_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/6486825203924992/",
          "proposal_id": null,
          "short_description": "This project will deliver a lightweight socializing plugin for JBrowse using OAuth2 and the Faye pub/sub framework. Users will be able to chat, share...",
          "slug": "lightweight-chat-plugin-for-the-jbrowse-genome-browser",
          "status": "completed",
          "student_name": "Pubudu Dodangoda",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Lightweight chat plugin for the JBrowse genome browser"
        },
        {
          "code_url": "http://samyadeep.weebly.com/",
          "description": "<p>The proposed project deals with the development of two Drupal modules,  for storage and visualizations of Complex Biological Graph. Both the proposed modules will be able to integrate along with Tripal and can be used by the Scientific community for the construction of genetic website, publish genomic data. The primary aim of the project is to optimize querying by using a Graph Database and also generate a good User Interface.</p>\n",
          "difficulty": "advanced",
          "id": "proj_open-genome-informat_2016_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5902985066446848/",
          "proposal_id": null,
          "short_description": "The proposed project deals with the development of two Drupal modules,  for storage and visualizations of Complex Biological Graph. Both the proposed...",
          "slug": "biological-graph-visualizations",
          "status": "completed",
          "student_name": "Samyadeep Basu",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "database"
          ],
          "title": "Biological Graph Visualizations"
        },
        {
          "code_url": "http://www.hiten.io/blog/articles/gsoc-16/",
          "description": "<p>Build a Standalone library / tool to visualise the <code>BLAST</code> results. This tool will be build on Ruby as command line tool.</p>\n<h4>Types of visualisation</h4>\n<ul>\n<li><strong>Relationship Visualisation</strong> will display relationship between query sequence and hits sequences. The circos visualisation will plot alignment which are identical in query and hit sequence. This will help user to understand alignments in query and hit sequence.</li>\n<li><strong>Length Analysis Visualisation</strong> will display the lengths of various hits sequences alongside display the relative length of hits with respective to the query sequence. This will provide a gist of lengths of hits and also an idea about query sequence length.</li>\n<li><strong>Dotplot visualisation</strong> plots a two-dimensional matrix and filling it with shaded blacks if residues of both sequence are identical. This will provide an in-depth idea about similarity of both the sequence.\n## Integration with SequenceServer\nSequenceServer integration of tool enables it to display the result in HTML and readily available to all existing users. It will enable tool in filtering the results on basis of taxonomy and E-value. Select relevant results to download data in GFF3 format and visualisation.</li>\n</ul>\n",
          "difficulty": null,
          "id": "proj_open-genome-informat_2016_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5151519871598592/",
          "proposal_id": null,
          "short_description": "Build a Standalone library / tool to visualise the BLAST results. This tool will be build on Ruby as command line tool.\nTypes of visualisation\n...",
          "slug": "visualisation-for-blast-results",
          "status": "completed",
          "student_name": "aniarya",
          "student_profile": null,
          "tags": [
            "ml",
            "ai",
            "ui"
          ],
          "title": "Visualisation for BLAST results"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2016/organizations/5362834141609984/"
    },
    "year_2017": {
      "num_projects": 8,
      "projects": [
        {
          "code_url": "https://github.com/intermine/intermine-registry",
          "description": "<p>The InterMine Registry will allow users to obtain and search, by consuming a RESTful API, basic information about existing InterMine instances. This information includes instances names, URLs, versions, sizes, descriptions and principal data-types with their fields brief descriptions. Furthermore, the API is going to give the possibility to create and administer the registry entries.</p>\n",
          "difficulty": null,
          "id": "proj_open-genome-informat_2017_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6434386606030848/",
          "proposal_id": null,
          "short_description": "The InterMine Registry will allow users to obtain and search, by consuming a RESTful API, basic information about existing InterMine instances. This...",
          "slug": "intermine-registry",
          "status": "completed",
          "student_name": "Leonardo Kuffo",
          "student_profile": null,
          "tags": [
            "api",
            "ai"
          ],
          "title": "InterMine Registry"
        },
        {
          "code_url": "https://samyadeepblog.wordpress.com/summary/",
          "description": "<p>InterMine is a large graph containing entities(Genes, Transcription Factors etc. ) with important relationships between them. The main aim of the project is to leverage the huge amount of data lying in InterMine and create an ensemble of algorithms specific to Biological Networks using Graph Theory and Unsupervised Machine Learning Algorithms to identify similar entities in InterMine. The results obtained by the framework will be used to build an efficient Recommendation System for the user based on their selection criteria.</p>\n",
          "difficulty": null,
          "id": "proj_open-genome-informat_2017_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6703800509267968/",
          "proposal_id": null,
          "short_description": "InterMine is a large graph containing entities(Genes, Transcription Factors etc. ) with important relationships between them. The main aim of the...",
          "slug": "development-of-a-statistical-framework-to-identify-similar-nodes-in-intermine",
          "status": "completed",
          "student_name": "Samyadeep Basu",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Development of a Statistical Framework to Identify Similar Nodes in InterMine"
        },
        {
          "code_url": "https://gist.github.com/yasharmaster/cfa18e7bac00d7ed0a93d74f4946efc7",
          "description": "<h3>Description</h3>\n<p>InterMine is an open source data warehouse which is used to store complex biological data. It is currently using PostgreSQL as the database. This project aims to develop a prototype of InterMine which is based on Neo4j, a graph database.</p>\n<h3>Goals</h3>\n<ul>\n<li>Adapt the existing XML model to represent the nodes, relationships and their properties in Neo4j.</li>\n<li>Develop a module for generating a schema as per the existing data in Neo4j and store it in the database itself. Also, expose an API to query the schema/metadata.</li>\n<li>Develop a module which can take Path Query XML as input and can generate equivalent Cypher which can be queried against the InterMine Neo4j graph.</li>\n<li>Develop a RESTful API based on JAX RS to expose the query service. Document the API using Swagger.</li>\n</ul>\n",
          "difficulty": "advanced",
          "id": "proj_open-genome-informat_2017_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5484312191303680/",
          "proposal_id": null,
          "short_description": "Description\nInterMine is an open source data warehouse which is used to store complex biological data. It is currently using PostgreSQL as the...",
          "slug": "prototype-a-new-restful-api-querying-neo4j-database",
          "status": "completed",
          "student_name": "yasharmaster",
          "student_profile": null,
          "tags": [
            "api",
            "ml",
            "ai",
            "database",
            "ui"
          ],
          "title": "Prototype a new RESTful API querying Neo4j database"
        },
        {
          "code_url": "https://ayushyachitransh.wordpress.com/gsoc-2017-reactome-container/",
          "description": "<p>The goal of this project is to produce a Docker image that contains everything that an end-user needs to run Reactome on his/her own workstation. Provisions will be made to update the database in the image with the latest centralized database of Reactome.</p>\n",
          "difficulty": null,
          "id": "proj_open-genome-informat_2017_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5551066452066304/",
          "proposal_id": null,
          "short_description": "The goal of this project is to produce a Docker image that contains everything that an end-user needs to run Reactome on his/her own workstation....",
          "slug": "stand-alone-reactome-server-in-a-docker-image",
          "status": "completed",
          "student_name": "Ayushya Chitransh",
          "student_profile": null,
          "tags": [
            "react",
            "ai",
            "database",
            "docker"
          ],
          "title": "Stand-alone Reactome server in a Docker image"
        },
        {
          "code_url": "https://intermineorg.wordpress.com/2017/08/18/interminer-package/",
          "description": "<p>InterMine constitutes a data warehouse framework, which provides the ability to access, retrieve and analyze rapidly a variety of biological data (<a href=\"http://intermine.org/\" target=\"_blank\">http://intermine.org/</a>). With intuitive tools, like targeted searches, customized queries, and predefined templates which incorporate popular queries for specific type of biological data, InterMine attempts to facilitate access, retrieval and analysis heterogeneous biological information. Aiming to expand the functionality of InterMine framework, an R package, InterMineR, has been developed that provides access to InterMine instances through the R programming environment (<a href=\"https://github.com/intermine/interminer\" target=\"_blank\">https://github.com/intermine/interminer</a>). However, for InterMine resources to be fully exploited with R language, it is necessary to develop detailed, easy-to-access tutorials, that demonstrate the integration of InterMineR in routine R bioinformatics analyses. In the context of Google Summer of Code program, this proposal describes in detail the steps that can be followed in order to 1) create detailed, bioinformatics R demos for InterMineR, 2) expand the functionality of InterMineR by integrating enrichment analysis, and 3) publish InterMineR to CRAN and Bioconductor.</p>\n",
          "difficulty": "beginner",
          "id": "proj_open-genome-informat_2017_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5554092793397248/",
          "proposal_id": null,
          "short_description": "InterMine constitutes a data warehouse framework, which provides the ability to access, retrieve and analyze rapidly a variety of biological data...",
          "slug": "expansion-of-functionality-and-creation-of-detailed-and-exciting-bioinformatics-r-demos-for-interminer-package",
          "status": "completed",
          "student_name": "Konstantinos Kyritsis",
          "student_profile": null,
          "tags": [
            "api",
            "ai",
            "ui"
          ],
          "title": "Expansion of functionality and creation of detailed and exciting bioinformatics R demos for InterMineR package"
        },
        {
          "code_url": "https://joystate.github.io/intermine-ios/",
          "description": "<p>InterMine has an Android application and is looking to make it available on iOS as well. Native iOS application will allow researchers to have access to InterMine data using fast, reliable and intuitive interface.</p>\n",
          "difficulty": null,
          "id": "proj_open-genome-informat_2017_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5801530422722560/",
          "proposal_id": null,
          "short_description": "InterMine has an Android application and is looking to make it available on iOS as well. Native iOS application will allow researchers to have access...",
          "slug": "ios-intermine-app",
          "status": "completed",
          "student_name": "Nadezda Yudina",
          "student_profile": null,
          "tags": [
            "android",
            "ios",
            "ai",
            "ui"
          ],
          "title": "iOS InterMine app"
        },
        {
          "code_url": "http://www.hiten.io/blog/articles/gsoc-17/",
          "description": "<p>The primary goal of the project is to upgrade Afra's annotation editing code, to provide it performance upgrade. Afra's annotation editor is built using JBrowse and WebApollo, is completely browser based. Afra is unique in the way it addresses the challenges of biocuration. The community needs this kind of tool to grow. This goal will be achieved in following steps</p>\n<ul>\n<li>Extensive automated test for the annotation editing facility</li>\n<li>Determine change we made to the codebase of JBrowse/Apollo in Afra. Based on which we will implement new features for the performance upgrade.</li>\n</ul>\n",
          "difficulty": null,
          "id": "proj_open-genome-informat_2017_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5965290546397184/",
          "proposal_id": null,
          "short_description": "The primary goal of the project is to upgrade Afra's annotation editing code, to provide it performance upgrade. Afra's annotation editor is built...",
          "slug": "performance-and-user-centric-upgrade-to-afra",
          "status": "completed",
          "student_name": "aniarya82",
          "student_profile": null,
          "tags": [
            "web",
            "ui"
          ],
          "title": "Performance and user-centric upgrade to Afra"
        },
        {
          "code_url": "https://docs.google.com/document/d/13lIITV_ND3Dj9pjvx5Q59045iSMOfF2BPZIKJQvy4RA/edit?usp=sharing",
          "description": "<p>With the number of sequenced and annotated genomes continuously increasing, there is a need for new algorithms and tools for comparative analyses both at the nucleotide and genic levels. The Genome Context Viewer (GCV) is an OSS tool that enables comparative genomics by using gene families as a unit of search and comparison. It currently uses Chado as a reference implementation for its data services and can be integrated with other GMOD components via a service layer/API. This work will create an extension module that will integrate new and existing pan-genomics algorithms into GCV while leveraging the existing UI for visualization purposes. This will help to serve communities facing the challenges of having multiple reference genomes within a single species, as well as improving GCV’s utility for clade-oriented resources.</p>\n",
          "difficulty": null,
          "id": "proj_open-genome-informat_2017_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6280625434656768/",
          "proposal_id": null,
          "short_description": "With the number of sequenced and annotated genomes continuously increasing, there is a need for new algorithms and tools for comparative analyses...",
          "slug": "pan-genome-module-for-the-genome-context-viewer",
          "status": "completed",
          "student_name": "Alan Cleary",
          "student_profile": null,
          "tags": [
            "api",
            "ui"
          ],
          "title": "Pan-Genome Module for the Genome Context Viewer"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2017/organizations/4997812655751168/"
    },
    "year_2018": null,
    "year_2019": null,
    "year_2020": {
      "num_projects": 5,
      "projects": [
        {
          "code_url": "https://github.com/AndraVasilache/jbrowse-plugin-ensembl-vep",
          "description": "<p>This project aims to integrate Ensembl VEP into the developing JBrowse 2. For this to happen, every component feature of this project must be implemented: data adapters, visualization features, api calls etc.</p>\n",
          "difficulty": null,
          "id": "proj_open-genome-informat_2020_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5639826990170112/",
          "proposal_id": null,
          "short_description": "This project aims to integrate Ensembl VEP into the developing JBrowse 2. For this to happen, every component feature of this project must be...",
          "slug": "jbrowse-2-ensembl-vep-integration",
          "status": "completed",
          "student_name": "Andra Vasilache",
          "student_profile": null,
          "tags": [
            "api",
            "ai"
          ],
          "title": "JBrowse 2 - Ensembl VEP integration"
        },
        {
          "code_url": "https://gist.github.com/chilampoon/3e517aa94c8c07fa42db2ea5dea0dc5b",
          "description": "<p>R has been extensively used in bioinformatics research. However, there is still no direct way to obtain Reactome’s information in R. This project aims to create the R interface for querying data from the Neo4j Graph Database and the Content Service in Reactome. Pre-built functions in the package allow users to retrieve data such as proteins, complexes, pathways, etc. related to a specific gene or entity in Reactome. Returned data would be manipulated into usable data structures for further analyses. Also, pathway diagrams and graph visualizations are provided, helping R users to explain their experimental results.</p>\n",
          "difficulty": "advanced",
          "id": "proj_open-genome-informat_2020_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/6246717881581568/",
          "proposal_id": null,
          "short_description": "R has been extensively used in bioinformatics research. However, there is still no direct way to obtain Reactome’s information in R. This project...",
          "slug": "query-reactome-data-in-r",
          "status": "completed",
          "student_name": "Chi Lam Poon",
          "student_profile": null,
          "tags": [
            "react",
            "ai",
            "database",
            "ui"
          ],
          "title": "Query Reactome Data in R"
        },
        {
          "code_url": "https://github.com/n3m3sis00/phylo-react/blob/master/README.md",
          "description": "<p>It is a Phylogenetic tree viewer for the JBrowse 2 in the most dynamic way possible. With the help of Reactjs, it will be much more efficient than the basic HTML/CSS. Furthermore, the phylogenetic tree or a dendrogram will also be connected to the synteny view for the detailed comparative study of genomic data.  Phylogenetic tree Viewer toolbar will consist of some indispensable features/components in it which are required in the manipulation of the visualization of the phylogenetic trees.</p>\n",
          "difficulty": null,
          "id": "proj_open-genome-informat_2020_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/4772437842984960/",
          "proposal_id": null,
          "short_description": "It is a Phylogenetic tree viewer for the JBrowse 2 in the most dynamic way possible. With the help of Reactjs, it will be much more efficient than...",
          "slug": "phylogenetic-tree-viewer-for-jbrowse-2",
          "status": "completed",
          "student_name": "Shreya Srivastava",
          "student_profile": null,
          "tags": [
            "react",
            "ml",
            "ai",
            "ui"
          ],
          "title": "Phylogenetic tree viewer for JBrowse 2"
        },
        {
          "code_url": "https://github.com/pratiklodha/graphql",
          "description": "<p>Reactome currently uses a REST-based API that allows end-users to obtain specific data from a set of predefined end-points. To provide better flexibility and allow users to query whatever data they need, this project provides a GraphQL interface to Reactome data fetched from a Neo4j database.</p>\n<p>There are several advantages of using GraphQL over RESTful API implementation:</p>\n<ol>\n<li>Request and retrieve exact data in a predictable manner.</li>\n<li>Through a single request, the ability to retrieve data from multiple sources.</li>\n<li>Since GraphQL is strongly-typed, it allows the user to know the availability and the state of data at any given point of time (through subscriptions).</li>\n</ol>\n",
          "difficulty": null,
          "id": "proj_open-genome-informat_2020_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/6523044064919552/",
          "proposal_id": null,
          "short_description": "Reactome currently uses a REST-based API that allows end-users to obtain specific data from a set of predefined end-points. To provide better...",
          "slug": "graphql-interface-for-querying-reactome-data",
          "status": "completed",
          "student_name": "Pratik Lodha",
          "student_profile": null,
          "tags": [
            "react",
            "api",
            "ai",
            "database"
          ],
          "title": "GraphQL Interface For Querying Reactome Data"
        },
        {
          "code_url": "https://docs.google.com/document/d/1KL4s2cAmee7AXvOjumW4QSjA1eVLyQah5cKnR3nleCw/edit?usp=sharing",
          "description": "<p>WormBase is a comprehensive research knowledge base on the genetics, genomics\nand biology of C. elegans and related nematodes. Biologists access these vast\ninformation through a web port which often provides information in many tables.\nHowever, these tables where developed years ago based on HTML and jQuery, with certain features\ndepending on Flash. Their limitations and usability issues are more pronounced now.</p>\n<p>In this project, I will rebuild more functional and performant table using React.\nNew implementation of table will be a generic and customizable React component,\nand it will serve WormBase data with the ability to search, filter, sort, paginate,\nand export all or parts of the table. Furthermore, the new implementation provides not only\nbetter data visibility, but also a better user experience by significantly reducing the existing load times.</p>\n",
          "difficulty": null,
          "id": "proj_open-genome-informat_2020_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5789267055345664/",
          "proposal_id": null,
          "short_description": "WormBase is a comprehensive research knowledge base on the genetics, genomics\nand biology of C. elegans and related nematodes. Biologists access...",
          "slug": "building-functional-and-performant-datatable-for-wormbase",
          "status": "completed",
          "student_name": "Hitonari Sato",
          "student_profile": null,
          "tags": [
            "react",
            "web",
            "ml",
            "ai",
            "ui"
          ],
          "title": "Building functional and performant DataTable for WormBase"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2020/organizations/5089985813807104/"
    },
    "year_2021": {
      "num_projects": 6,
      "projects": [
        {
          "code_url": "https://github.com/reactome/reactome_gnn",
          "description": "<p>In the last several years, deep learning became widely used in various different fields, ranging from object detection and face recognition to speech recognition and machine translation. The common thing between all these areas is that they are working on structured data - data that can be represented in a table, such as images with a well defined number of rows and columns. An example of unstructured data are graphs - a collections of nodes connected with edges. Although graphs can also be represented through adjacency matrix, this representation implies ordinality of the nodes. Furthermore, once trained on a graph represented this way, a neural network could be used only on the graphs of the same sizes. This was fixed with the introduction of graph neural networks.</p>\n<p>In this project, I will construct models based on graph neural networks and apply them to graphs found in the Reactome database. Reactome is a graph database of pathways of several organisms. The goal is to create a Python client able to compute the vector representations of the pathways, which may be used in downstream analysis such as predicting whether a pathway is involved within a certain disease.</p>\n",
          "difficulty": null,
          "id": "proj_open-genome-informat_2021_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5753303614357504/",
          "proposal_id": null,
          "short_description": "In the last several years, deep learning became widely used in various different fields, ranging from object detection and face recognition to speech...",
          "slug": "reactome-pathway-embeddings",
          "status": "completed",
          "student_name": "Lovro Vrcek",
          "student_profile": null,
          "tags": [
            "react",
            "python",
            "ai",
            "database"
          ],
          "title": "Reactome Pathway Embeddings"
        },
        {
          "code_url": "https://gist.github.com/lokeshrana/f6f31df634e0ed2b28ea971e1c7f2efe",
          "description": "<p>This GSoC project proposes to create the UI side of a network-based hierarchical viewer to visualize gene annotation at various levels of systems organization, including: gene-gene interactions, cell type, disease, and known drug targets.</p>\n",
          "difficulty": null,
          "id": "proj_open-genome-informat_2021_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5403262068457472/",
          "proposal_id": null,
          "short_description": "This GSoC project proposes to create the UI side of a network-based hierarchical viewer to visualize gene annotation at various levels of systems...",
          "slug": "visualization-of-systems-level-gene-annotation-ui-side",
          "status": "completed",
          "student_name": "Lokesh Rana",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "Visualization Of Systems-Level Gene Annotation  (UI-Side)"
        },
        {
          "code_url": "https://gist.github.com/r-kohale9/d9e98ba75d8b09cc042c1c8ddfaa7a24",
          "description": "<p>Genomic assays generate lists of genes or proteins statistically associated with a condition, such as being altered in disease. Genes need to be systematically linked to other layers of system organization to develop a hypothesis about the mechanism of action, and to drive downstream experiments. These layers include information about intracellular interacting molecules, the types of cells genes are expressed in, and what diseases are known to arise from altered function in genes. Finally, rational drug design is furthered by understanding drug-gene interactions. Gene lists are currently turned into exhaustive tables containing cross-references to various databases of annotation, without a systems-level framework to visualize the data. This GSoC project proposes to create a network-based hierarchical viewer to visualize gene annotation at various levels of systems organization, including gene-gene interactions, cell type, disease, and known drug targets.</p>\n",
          "difficulty": null,
          "id": "proj_open-genome-informat_2021_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/4975840344932352/",
          "proposal_id": null,
          "short_description": "Genomic assays generate lists of genes or proteins statistically associated with a condition, such as being altered in disease. Genes need to be...",
          "slug": "interactive-viewer-for-systems-biology-variant-interpretation-server-side",
          "status": "completed",
          "student_name": "Rishabh kohale",
          "student_profile": null,
          "tags": [
            "ai",
            "database"
          ],
          "title": "Interactive viewer for systems-biology variant interpretation (Server-side)"
        },
        {
          "code_url": "https://gist.github.com/ph09/487959b0a0fa2db412d4d076ce536060",
          "description": "<p>For an open-source tool for bioinformatics like WormBase, it is essential to have thorough documentation of features and use cases. As part of this project, we will document the programmatic access and use of different data available on WormBase and create pipelines for data analysis and visualisation using various publicly available tools. We will\nhelp users with easy programmatic access to data with options to filter and refine results per their wish.</p>\n<p>There are multiple bioinformatics data analysis tools, both on and outside the WormBase websites. It would be helpful to integrate these tools into several pipelines for regularly used types of analyses. This would remove the need to manually plug in the output from one tool into another as the input.</p>\n<p>This project will be highly advantageous to users who are not familiar with the different data that WormBase provides and those looking for an easy way to quickly extract the data they need. Since we also integrate many widely used tools, it will be beneficial to the Worm community, especially pure biologists who want to analyse their data.</p>\n",
          "difficulty": "beginner",
          "id": "proj_open-genome-informat_2021_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5074537250553856/",
          "proposal_id": null,
          "short_description": "For an open-source tool for bioinformatics like WormBase, it is essential to have thorough documentation of features and use cases. As part of this...",
          "slug": "bioinformatics-with-jupyter-notebooks",
          "status": "completed",
          "student_name": "Prajna",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "ui"
          ],
          "title": "Bioinformatics with Jupyter Notebooks"
        },
        {
          "code_url": "https://docs.google.com/document/d/18jYDOYAayytGEFLx4qT8CnvDaM4NcEPLB2MLVV0uD50/edit?usp=sharing",
          "description": "<p>The Alliance of Genome Resources is a consortium of 6 model organism databases (MODs) and the Gene Ontology (GO) Consortium whose goal is to provide an integrated view of their data to all biologists, clinicians and other interested parties. Alliance of Genomic Resources now has several services which require authentication and authorization. The aim of this project is to implement a single service to maintain authentication and authorization across the project as the number of services increase.</p>\n<p>This authentication and authorization service will allow users to sign in using Oauth2 (Google, Microsoft, etc...). For the Alliance members, JWT access tokens and refresh tokens with specific user information will be generated, which could be used for authentication of Literature service at this time and other services in the future (File Management System(FMS), Public Website, Annotation Database, Curation Interface).</p>\n<p>The implementation of this project consists three parts: Authentication and authorization backend service for Alliance members, User Login for non-Alliance members and A Frontend interface for user login and shows user statistics.</p>\n",
          "difficulty": null,
          "id": "proj_open-genome-informat_2021_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/4717036051103744/",
          "proposal_id": null,
          "short_description": "The Alliance of Genome Resources is a consortium of 6 model organism databases (MODs) and the Gene Ontology (GO) Consortium whose goal is to provide...",
          "slug": "authentication-and-authorization-service-for-the-alliance-of-genome-resources",
          "status": "completed",
          "student_name": "Aoji Xie",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "database",
            "ui",
            "frontend"
          ],
          "title": "Authentication and Authorization Service for the Alliance of Genome Resources"
        },
        {
          "code_url": "https://github.com/reactome/descartes_rpa",
          "description": "<p>Single-Cell sequencing is a new methodology that provides high-resolution data to understand individual cells. Applied to RNA sequencing, it can reveal a multitude of relevant information, such as identifying different cell types within a sample and RNA velocity to understand cell fate. The possibility to query individual cells permits a fine-grained analysis compared to conventional NGS (Next Generation Sequencing) methods.</p>\n<p>Reactome is a “free, online, and open-source database” that stores pathway data from various organisms, such as genes that make up the pathways and hierarchy mappings. Leveraging on this curated data and using single-cell resources from descartes database, we can enhance this data by annotating which pathways each identified cluster represents.</p>\n<p>This project aims to create a dockerized python pipeline to extract pathway activity from single-cell clusters in a systematic manner, annotating each cluster with which pathway it represents.</p>\n",
          "difficulty": null,
          "id": "proj_open-genome-informat_2021_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6004582722830336/",
          "proposal_id": null,
          "short_description": "Single-Cell sequencing is a new methodology that provides high-resolution data to understand individual cells. Applied to RNA sequencing, it can...",
          "slug": "single-cell-pathway-annotation-pipeline",
          "status": "completed",
          "student_name": "Joao Luiz",
          "student_profile": null,
          "tags": [
            "react",
            "python",
            "ai",
            "database",
            "docker"
          ],
          "title": "Single-Cell pathway annotation pipeline"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2021/organizations/5660767872876544/"
    },
    "year_2022": {
      "num_projects": 2,
      "projects": [
        {
          "code_url": "https://github.com/Asanka25/GSOC2022",
          "description": "In Reactome, once the new data is released, preceding data will be archived in an AWS S3 bucket. Now they don't have a web interface for users to request and download previous versions of archived data. I hope to solve this problem.\n\nDeliverables: UI design, Web interface, Fetch data from AWS resources, Define AWS architecture/AWS service interactions",
          "difficulty": null,
          "id": "proj_open-genome-informat_2022_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/0VT60ELS/",
          "proposal_id": null,
          "short_description": "In Reactome, once the new data is released, preceding data will be archived in an AWS S3 bucket. Now they don't have a web interface for users to...",
          "slug": "community-access-portal-to-reactome-archive",
          "status": "completed",
          "student_name": "Asanka",
          "student_profile": null,
          "tags": [
            "react",
            "web",
            "ui"
          ],
          "title": "Community Access Portal to Reactome Archive"
        },
        {
          "code_url": "https://github.com/ModeEric/MPBiopathDiagram",
          "description": "This project entails the creation of the MP-BioPath tool into the FI Viz Cytoscape Plugin. Biological pathways model the set of actions that molecules in a biological cell can perform. What the MP-BioPath does is model the activity of certain biological pathways, helping to predict the response of the pathways to external perturbances. The MP-Biopath tool already exists, but has not been made accessible through the FI Viz Cytoscape Plugin, which is an app designed to analyze the pathways involved with diseases such as cancer. My job would be to incorporate the MP-BioPath tool into the FI Viz Cytoscape Plugin and develop customized visualizations for showing the result of MP-BioPath. If I have time remaining, I intend to deliver a baseline Tensorflow model which utilizes the MP-BioPath tool to create predictions for pathway activity.",
          "difficulty": null,
          "id": "proj_open-genome-informat_2022_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/je40nNhz/",
          "proposal_id": null,
          "short_description": "This project entails the creation of the MP-BioPath tool into the FI Viz Cytoscape Plugin. Biological pathways model the set of actions that...",
          "slug": "implementing-and-visualizing-mp-biopath-tool-in-the-fi-viz-cytoscape-plugin",
          "status": "completed",
          "student_name": "ModeEric",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Implementing and Visualizing MP-BioPath tool in the FI Viz Cytoscape Plugin"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2022/organizations/open-genome-informatics/"
    },
    "year_2023": {
      "num_projects": 1,
      "projects": [
        {
          "code_url": "https://docs.google.com/document/d/1-XuX4gTXukKFAE-t_H5ZYC2auqsg7EO3Tq9jQIEACZs/edit",
          "description": "Currently, at the Ontario Institute of Cancer Research, Jenkins is being used to run the release pipelines and this project proposes moving the system into a more automated format – to use Docker containers with a CI/CD-based system. In the standard release process, as project code will be built and pushed to the main branch for each GitHub repository, as a result, multiple dependencies would also be triggered to be built as well. In this way, we will know if a change in a dependency has correctly integrated into the broader code base. A lot of this testing is done manually, so automating this system can make the time frame for making a release much smaller. With a continuous integration system, we will integrate these artifacts with the release ETL (Extract Transform Load) pipelines.",
          "difficulty": null,
          "id": "proj_open-genome-informat_2023_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/FNZtunYS",
          "proposal_id": "Dl7u0BLN",
          "short_description": "Currently, at the Ontario Institute of Cancer Research, Jenkins is being used to run the release pipelines and this project proposes moving the...",
          "slug": "improved-continuous-integration-for-reactome",
          "status": "completed",
          "student_name": "sskrishn",
          "student_profile": null,
          "tags": [
            "react",
            "ai",
            "docker",
            "ui"
          ],
          "title": "Improved Continuous Integration for Reactome"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2023/organizations/open-genome-informatics"
    },
    "year_2024": null,
    "year_2025": null
  },
  "first_time": false,
  "contact": {
    "email": "help@gmod.org",
    "guide_url": null,
    "ideas_url": null,
    "irc_channel": "http://irc.lc/freenode/genomeinformatics/",
    "mailing_list": "http://groups.google.com/group/genome-informatics"
  },
  "social": {
    "blog": "http://gmod.org/wiki/GMOD_News",
    "discord": null,
    "facebook": null,
    "github": null,
    "gitlab": null,
    "instagram": null,
    "linkedin": null,
    "mastodon": null,
    "medium": null,
    "reddit": null,
    "slack": null,
    "stackoverflow": null,
    "twitch": null,
    "twitter": "https://twitter.com/gmodproject",
    "youtube": null
  },
  "meta": {
    "version": 1,
    "generated_at": "2026-01-25T15:28:53.831Z"
  }
}