{
  "id": "692251df53dd9d7326d33e4b",
  "slug": "open-food-facts",
  "name": "Open Food Facts",
  "category": "Science and medicine",
  "description": "Better food choices for your health & the planet",
  "image_url": "https://summerofcode.withgoogle.com/media/org/open-food-facts/ypo4wfmbo5ueujuf-360.png",
  "img_r2_url": "https://pub-268c3a1efc8b4f8a99115507a760ca14.r2.dev/open-food-facts.webp",
  "logo_r2_url": null,
  "url": "https://world.openfoodfacts.org/discover",
  "active_years": [
    2018,
    2022,
    2025
  ],
  "first_year": 2018,
  "last_year": 2025,
  "is_currently_active": true,
  "technologies": [
    "android",
    "machine learning",
    "mongodb",
    "perl",
    "ios",
    "python",
    "tensorflow",
    "flutter",
    "javascript"
  ],
  "topics": [
    "open data",
    "health",
    "computer vision",
    "crowdsourcing",
    "food",
    "environment",
    "mobile"
  ],
  "total_projects": 10,
  "stats": {
    "avg_projects_per_appeared_year": 3.33,
    "projects_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": 2,
      "year_2019": null,
      "year_2020": null,
      "year_2021": null,
      "year_2022": 4,
      "year_2023": null,
      "year_2024": null,
      "year_2025": 4
    },
    "students_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": 2,
      "year_2019": null,
      "year_2020": null,
      "year_2021": null,
      "year_2022": 4,
      "year_2023": null,
      "year_2024": null,
      "year_2025": 4
    },
    "total_students": 10
  },
  "years": {
    "year_2016": null,
    "year_2017": null,
    "year_2018": {
      "num_projects": 2,
      "projects": [
        {
          "code_url": "https://github.com/openfoodfacts/off-nutrition-table-extractor",
          "description": "<p>Open Food Facts currently have a huge dataset that is not being utilized for anything except for showing the raw data to the users. Despite the dataset mine that Open Food Facts is sitting on, most of the work is done manually.\nThis project aims to help the user by reducing the hassle of manually updating the fields of nutritional facts of a particular product. With the latest advancements in Deep Learning, we can easily automate this process by applying various fundamental neural network approaches to the OFF dataset.</p>\n",
          "difficulty": null,
          "id": "proj_open-food-facts_2018_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/4816708648828928/",
          "proposal_id": null,
          "short_description": "Open Food Facts currently have a huge dataset that is not being utilized for anything except for showing the raw data to the users. Despite the...",
          "slug": "ocr-on-nutritional-facts-table",
          "status": "completed",
          "student_name": "Sagar Panchal",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "OCR on Nutritional Facts Table"
        },
        {
          "code_url": "https://github.com/openfoodfacts/openfoodfacts-androidapp/tree/master/PROJECTS/GSOC-2018-huzaifa",
          "description": "<p>This project aims to introduce a continuous scan feature in the Open Food Facts native android application. This will make the process of scanning barcodes much more powerful and will be very much efficient in terms of time, even more than the current “Power Mode Scan”. Just hover over a barcode and the key information will be displayed, move onto other barcode and find it’s key information on the screen. No need to touch the screen when scanning different barcodes just hover over them one by one and see the results. This project also aims to add the complete information about the product during its addition including its nutritional facts, ingredients etc. Adding the ingredients will be made convenient using Optical Character Recognition (OCR) thus saving time. The overall UI of the scanning part will be revamped to give an immersive design.</p>\n",
          "difficulty": null,
          "id": "proj_open-food-facts_2018_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5150591688900608/",
          "proposal_id": null,
          "short_description": "This project aims to introduce a continuous scan feature in the Open Food Facts native android application. This will make the process of scanning...",
          "slug": "add-continuous-scan-and-thorough-product-addition-using-ocr-in-native-android-application",
          "status": "completed",
          "student_name": "Huzaifa Iftikhar",
          "student_profile": null,
          "tags": [
            "android",
            "ai",
            "ui"
          ],
          "title": "Add Continuous Scan and Thorough Product Addition using OCR in Native Android Application"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2018/organizations/5395828684357632/"
    },
    "year_2019": null,
    "year_2020": null,
    "year_2021": null,
    "year_2022": {
      "num_projects": 4,
      "projects": [
        {
          "code_url": "https://github.com/AshAman999/GSoC-Report2022-openfoodfacts",
          "description": "1. \nUnderstanding the Flow and Discussion:\n\nMake a clear understanding of the flow of data between the mobile and the server,\nIncluding how the app loads the data. In the process of doing so, it will be much \nmore clear and more precise to figure out ways for implementing a fast offline experience.\n\n2.\nImplementing the offline save mechanism:\n\nWith proper knowledge about the exact workflow how the data flow is, the first step \nI think of storing the data for the already scanned and opened products. This in turn will facilitate the users to look up the already scanned products without the need for an Internet connection.\n\n3. \nOffline Edit Mode:\n\nAfter being done with the above two works, the 3rd and most important phase will be \nCarried out. A clean and working mechanism to store the changes locally will be\nDiscussed with the mentors and start the work on the same to store the changes and \nsync those changes when online and delete the offline changes so as to keep the app as lightweight as possible.\n\n4.\n Preloading Data:\n\nIf time persists and the above work is done(which I am sure will be done), add a \nmechanism to preload the data as cache (as step 2) so as to let the users use the app\nfor popular food items in their country out of the box\n\n5.\n Testing:\n\nAfter the whole work is done, a clean throughout the testing of the implemented features is to be carried out so as to ensure a steady smooth experience.",
          "difficulty": null,
          "id": "proj_open-food-facts_2022_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/0B0YhUb3/",
          "proposal_id": null,
          "short_description": "1. Understanding the Flow and Discussion: Make a clear understanding of the flow of data between the mobile and the server, Including how the app...",
          "slug": "implement-an-offline-mode-for-the-new-open-food-facts-flutter-application",
          "status": "completed",
          "student_name": "Aman Raj",
          "student_profile": null,
          "tags": [
            "mobile"
          ],
          "title": "Implement an offline mode for the new Open Food Facts Flutter application"
        },
        {
          "code_url": "https://gist.github.com/LandonPattison/21839d41101923fe1564f653d90ffa6f",
          "description": "This project sets up an authentication micro-service for the open source organization OpenFoodFacts. The project entails migrating all users to the authentication micro-service giving OpenFoodFacts authentication new features and a new UI.",
          "difficulty": null,
          "id": "proj_open-food-facts_2022_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/RIwJKyYg/",
          "proposal_id": null,
          "short_description": "This project sets up an authentication micro-service for the open source organization OpenFoodFacts. The project entails migrating all users to the...",
          "slug": "setup-an-external-authentication-service",
          "status": "completed",
          "student_name": "LandonPattison",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Setup an External Authentication Service"
        },
        {
          "code_url": "https://gist.github.com/sumit-158/dd9fd3b6337fda5b95e882160bf4ea16",
          "description": "This project aims at building an Api based on knowledge panel of Open Food Facts that return client a specific knowledge panel with use of one or two facets its Provides applications with a set of informative or actionable items which are contextual to a specific facet ,the primary goal is to allow high level contributions by users that maybe interested in a particular subset of the database, like a particular food category or a brand, a location, etc...,its reuse the knowledge panel format, which remove the need for the application to change as the server side code change, or to implement specific business logic.",
          "difficulty": null,
          "id": "proj_open-food-facts_2022_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/Orz9SFRa/",
          "proposal_id": null,
          "short_description": "This project aims at building an Api based on knowledge panel of Open Food Facts that return client a specific knowledge panel with use of one or two...",
          "slug": "facets-knowledge-panels",
          "status": "completed",
          "student_name": "Sumit Kashyap",
          "student_profile": null,
          "tags": [
            "api",
            "ai",
            "database",
            "ui"
          ],
          "title": "Facets knowledge panels"
        },
        {
          "code_url": "https://github.com/aadarsh-ram/GSoC2022-OpenFoodFacts/blob/main/README.md",
          "description": "The Open Food Facts database contains a lot of information on food products, such as ingredients, labels, additives etc. To link this information to useful properties such as Nutri-Score, Agribalyse and many more, taxonomies are used within the database.\n\nA taxonomy in Open Food Facts is a raw text file containing a Directed Acyclic Graph (DAG) where each leaf node has one or more parent nodes. It is mainly used for classification and translation of various food products within the database. Hence, taxonomies are at the heart of data structures in the Open Food Facts database and must be maintained properly.\n\nThis project provides an User-Friendly interface developed for editing taxonomies with ease. This tool is helpful for contributors to visualize a node's translations, properties, parents and children in a single page. The editor allows users to perform CRUD operations on the taxonomy and on the nodes present. A fast search mechanism for finding nodes within the taxonomy has also been implemented successfully.\n\nThe introduction of Taxonomy Editor will be very beneficial, as it will help to visualize how products are classified and would encourage more contributions from the wonderful community of contributors of Open Food Facts.",
          "difficulty": null,
          "id": "proj_open-food-facts_2022_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/WvIpqgrR/",
          "proposal_id": null,
          "short_description": "The Open Food Facts database contains a lot of information on food products, such as ingredients, labels, additives etc. To link this information to...",
          "slug": "build-a-taxonomy-editor",
          "status": "completed",
          "student_name": "Aadarsh Anantha Ramakrishnan",
          "student_profile": null,
          "tags": [
            "ai",
            "database",
            "ui"
          ],
          "title": "Build a Taxonomy Editor"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2022/organizations/open-food-facts/"
    },
    "year_2023": null,
    "year_2024": null,
    "year_2025": {
      "num_projects": 4,
      "projects": [
        {
          "code_url": null,
          "description": "This project is in 3 sections.\n\nSection 1 : Continuation of the FDC import project. \nThe Open Food Facts database is missing some data on a lot of American and Canadian products, which prevents the calculation of some of their scores (Nutri Score, Eco-Score and/or NOVA group). A project in which I participated was started to address this by importing the USDA's FDC branded database but was not completed (https://github.com/Mieux-choisir/OpenFoodFactsCanada). This section aims to finish this process by completing the comparison tool between OFF and FDC products to complete the OFF products, automating the script so it can be run easily and create a report file, and adding documentation to this project to make it more accessible and understandable.\n\nSection 2 : Documentation.\nThis section aims to make the Open Food Facts database more comprehensible by adding documentation where needed (what type of data each field contains, if the fields are to be manually completed or if they are automatically completed, what the export files contain, etc.).\n\nSection 3 : Continuation of AI projects.\nFinally, several AI projects have been developed using Open Food Facts in Canada in Laval University (for more information: https://off.mieuxchoisir.org/ift6005). Some use LLMs to enable user who have little or no knowledge on databases to make queries and to retrieve information. This process requires to translate natural language to SQL queries, but it was hypothesized that using a type of export or data that is currently unavailable such as knowledge graphs and products sheets could improve the results. This section also aims to create the needed export formats for these AI projects that will be carried on as well as future ones.\n\nI am also open to do only one or two sections of this project.",
          "difficulty": null,
          "id": "proj_open-food-facts_2025_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/mzpDaWXd",
          "proposal_id": "jDuNeTzW",
          "short_description": "This project is in 3 sections. Section 1 : Continuation of the FDC import project. The Open Food Facts database is missing some data on a lot of...",
          "slug": "completion-of-products-data-with-usdas-fdc-database-new-exports-and-database-documentation",
          "status": "in-progress",
          "student_name": "Estrella Paoli",
          "student_profile": null,
          "tags": [
            "ai",
            "database",
            "ui",
            "ux"
          ],
          "title": "Completion of products data with USDA's FDC database, new exports and database documentation"
        },
        {
          "code_url": null,
          "description": "Open Food Facts (OFF) relies on contributions from a global community of developers and volunteers. However, setting up development environments, navigating complex CI/CD pipelines, and contributing to multiple repositories like off-server, robotoff, and smooth-app can be time-consuming and frustrating—especially for newcomers. This project aims to streamline the entire contributor journey by creating a unified, cloud-powered Developer Experience (DevX) platform for OFF.\\n \\n\n\nWe will implement pre-configured Google IDX, Gitpod and Codespaces environments, enabling contributors to start coding within minutes. The CI/CD pipelines will be optimized to run only affected modules, significantly cutting build and test times. We'll also create a live, versioned documentation pipeline, integrate AI-powered tools for issue triage and PR review, and develop a metrics dashboard for maintainers to track workflow efficiency.\\n \\n\n\nDeliverables include: \\n\n- Deployment staging environment with Docker swarm or Ansible.\\n\n- Auto-launch Gitpod/ Codespace environments. \\n\n- Optimized CI/CD workflows with modular test execution. \\n\n- Automated documentation site using OpenAPI Spec + MDX + Fumadocs. \\n\n- AI bot integration for issue triage. \\n\n- A real-time DevX dashboard. \\n\n\\n\nThis project will empower contributors to go from zero to green PRs faster, making OFF development more accessible, efficient, and scalable.",
          "difficulty": "advanced",
          "id": "proj_open-food-facts_2025_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/bCxnCqZt",
          "proposal_id": "cOxGxJ8K",
          "short_description": "Open Food Facts (OFF) relies on contributions from a global community of developers and volunteers. However, setting up development environments,...",
          "slug": "enhancing-developer-experience-through-automation-and-workflow-optimization",
          "status": "in-progress",
          "student_name": "Jagjeevan Kashid",
          "student_profile": null,
          "tags": [
            "api",
            "ml",
            "ai",
            "docker",
            "cloud"
          ],
          "title": "Enhancing Developer Experience Through Automation and Workflow Optimization"
        },
        {
          "code_url": null,
          "description": "The Folksonomy Engine does not support intuitive property suggestions and reusable web components. In order to enhance usability and scalability, the system requires improved property suggestion mechanisms, more effective handling of nested values, and an easier-to-use interface for data contribution and analysis.\n\nTo address the challenges in data contribution, consistency, and exploration, the project will develop new API features and create a reusable web interface. The proposed solution includes developing new API features and a reusable web interface. The main goal is to get as many contributors as possible to use this, making it easy and accessible for everyone to contribute.\n\n- New API Features:\n  - Suggestions based on popularity and categories.\n  - Improved handling of nested property values.\n  - Tools for exploring and merging values.\n\n- Improved Reusable JavaScript-based Web Interface:\n  - For display and editing of data.\n  - Potential formalization of property definitions.",
          "difficulty": "beginner",
          "id": "proj_open-food-facts_2025_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/AoicMwVR",
          "proposal_id": "n93venhh",
          "short_description": "The Folksonomy Engine does not support intuitive property suggestions and reusable web components. In order to enhance usability and scalability, the...",
          "slug": "folksonomy-engine-a-one-size-fit-all-for-any-product-data",
          "status": "in-progress",
          "student_name": "Kirtan Chandak",
          "student_profile": null,
          "tags": [
            "java",
            "javascript",
            "web",
            "api",
            "ai"
          ],
          "title": "Folksonomy Engine: a one size fit all for any product data"
        },
        {
          "code_url": null,
          "description": "This Google Summer of Code (GSoC) project aims to enhance the Open Food Facts Explorer by implementing new features, ensuring design consistency, improving backend API support, and elevating the overall user experience. The Explorer acts as a user-friendly portal where contributors can explore food data, contribute new information, and visualize relationships among food products.\n\nThroughout the summer, I will work on bringing feature parity with the main website by adding login flow, advanced search capability, image editing features, and more. Additionally, I will extend functionalities through the Open Prices integration, contribute to reusable web components, and enhance automation using GitHub Actions and Storybook. The project is divided into focused milestones to ensure consistent progress, including buffer periods for testing and documentation.",
          "difficulty": "advanced",
          "id": "proj_open-food-facts_2025_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/3AaDmj04",
          "proposal_id": "CeAklX09",
          "short_description": "This Google Summer of Code (GSoC) project aims to enhance the Open Food Facts Explorer by implementing new features, ensuring design consistency,...",
          "slug": "open-food-facts-explorer-a-new-generation-frontend",
          "status": "in-progress",
          "student_name": "Mitali Singh",
          "student_profile": null,
          "tags": [
            "web",
            "api",
            "ai",
            "frontend",
            "backend"
          ],
          "title": "Open Food Facts Explorer - A New Generation Frontend"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2025/organizations/open-food-facts"
    }
  },
  "first_time": false,
  "contact": {
    "email": "contact@openfoodfacts.org",
    "guide_url": "https://world.openfoodfacts.org/google-summer-of-code",
    "ideas_url": "https://wiki.openfoodfacts.org/GSOC/2025_ideas_list",
    "irc_channel": "https://slack.openfoodfacts.org",
    "mailing_list": null
  },
  "social": {
    "blog": "https://blog.openfoodfacts.org/en/news/tis-the-season",
    "discord": null,
    "facebook": null,
    "github": null,
    "gitlab": null,
    "instagram": null,
    "linkedin": null,
    "mastodon": null,
    "medium": null,
    "reddit": null,
    "slack": null,
    "stackoverflow": null,
    "twitch": null,
    "twitter": "https://twitter.com/OpenFoodFacts",
    "youtube": null
  },
  "meta": {
    "version": 1,
    "generated_at": "2026-01-25T15:28:53.829Z"
  }
}