{
  "id": "692251e053dd9d7326d33e57",
  "slug": "openastronomy",
  "name": "OpenAstronomy",
  "category": "Science and medicine",
  "description": "Look at the Universe with the power of Open Source",
  "image_url": "https://summerofcode.withgoogle.com/media/org/openastronomy/3wvadxwxjc2arepg-360.png",
  "img_r2_url": "https://pub-268c3a1efc8b4f8a99115507a760ca14.r2.dev/openastronomy.webp",
  "logo_r2_url": null,
  "url": "https://openastronomy.org/",
  "active_years": [
    2016,
    2017,
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "first_year": 2016,
  "last_year": 2025,
  "is_currently_active": true,
  "technologies": [
    "c",
    "python",
    "julia",
    "numpy",
    "qt",
    "c++",
    "numba",
    "javascript",
    "spark",
    "css"
  ],
  "topics": [
    "visualization",
    "science",
    "astronomy",
    "solar physics",
    "atomic physics",
    "data science",
    "visualisation",
    "astrophysics",
    "orbital mechanics",
    "high-energy astrophysics",
    "high energy astrophysics",
    "cloud infrastructure",
    "image processing",
    "data analysis"
  ],
  "total_projects": 77,
  "stats": {
    "avg_projects_per_appeared_year": 7.7,
    "projects_by_year": {
      "year_2016": 7,
      "year_2017": 8,
      "year_2018": 8,
      "year_2019": 9,
      "year_2020": 10,
      "year_2021": 8,
      "year_2022": 8,
      "year_2023": 6,
      "year_2024": 8,
      "year_2025": 5
    },
    "students_by_year": {
      "year_2016": 7,
      "year_2017": 8,
      "year_2018": 8,
      "year_2019": 9,
      "year_2020": 10,
      "year_2021": 8,
      "year_2022": 8,
      "year_2023": 6,
      "year_2024": 8,
      "year_2025": 5
    },
    "total_students": 74
  },
  "years": {
    "year_2016": {
      "num_projects": 7,
      "projects": [
        {
          "code_url": "https://github.com/sudk1896/sunpy/pull/1",
          "description": "<p>Developing viz tools for SunPy.</p>\n",
          "difficulty": null,
          "id": "proj_openastronomy_2016_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/6658051994025984/",
          "proposal_id": null,
          "short_description": "Developing viz tools for SunPy.",
          "slug": "real-time-data-access-and-visualisation-tools",
          "status": "completed",
          "student_name": "Sudarshan Konge",
          "student_profile": null,
          "tags": [],
          "title": "Real Time Data Access and Visualisation tools."
        },
        {
          "code_url": "http://myopensauceadventure.blogspot.co.uk/2016/08/dessert.html",
          "description": "<p>Both astropy and Sherpa (<a href=\"https://github.com/sherpa/sherpa/\" target=\"_blank\">https://github.com/sherpa/sherpa/</a>) provide modeling and fitting capabilities; however, Sherpa’s features are way more advanced providing far more build-in models, a larger choice of optimizers and a real variety of fit statistics. Whereas Astropy's functional state-based interface is much more user friendly. Astropy is also more widely used. The main goal is the bring Sherpa’s optimizers and fit statistic functions to astropy. A more hopeful goal is to develop a bridge between both packages such that a user can use a astropy models completely interchangeably with Sherpa models and fitters. This will give astropy users access to fitting capabilities that required many years of developer time and that are unfeasible redevelop from scratch.</p>\n<p>Goals:</p>\n<ul>\n<li>Sherpa optimization routines embedded within astropy fitters and have them use astropy models.</li>\n<li>The ability to use of all sherpa's fit statistic functions while fitting.</li>\n<li>Have sherpa models imported through astropy act like astropy models.</li>\n</ul>\n",
          "difficulty": "advanced",
          "id": "proj_openastronomy_2016_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/6728735747211264/",
          "proposal_id": null,
          "short_description": "Both astropy and Sherpa (https://github.com/sherpa/sherpa/) provide modeling and fitting capabilities; however, Sherpa’s features are way more...",
          "slug": "astropy-bridge-sherpa-and-astropy-fitting",
          "status": "completed",
          "student_name": "nocturnalastro",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Astropy: Bridge sherpa and astropy fitting"
        },
        {
          "code_url": "https://github.com/Punyaslok/sunpy/pull/1",
          "description": "<p>The SunPy database module enables users to manage files on a disk, or a network hosted database. Users can find files by using physical parameters such as wavelength, time etc. or by using attributes such as instrument name. Queries can also be combined to form complex queries.</p>\n<p>The first part of the project would involve making several modifications to the database module used by SunPy to integrate the Fido interface with the database which will enable users to use only the Fido to make queries, instead of making separate queries for separate clients like VSO, LightCurve etc.</p>\n<p>The second part involves improving the caching mechanism to enable query result based caching instead of the current query based  caching.</p>\n",
          "difficulty": "advanced",
          "id": "proj_openastronomy_2016_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5092662445080576/",
          "proposal_id": null,
          "short_description": "The SunPy database module enables users to manage files on a disk, or a network hosted database. Users can find files by using physical parameters...",
          "slug": "improvements-to-the-sunpy-database",
          "status": "completed",
          "student_name": "Punyaslok Pattnaik",
          "student_profile": null,
          "tags": [
            "database"
          ],
          "title": "Improvements to the SunPy Database"
        },
        {
          "code_url": "https://github.com/sunpy/sunpy/pull/1837",
          "description": "<p>Solar physics uses the CHIANTI atomic physics database to obtain properties about various elements and ionisation states. By using observed elemental abundances and these ionization states, one can use CHIANTI to obtain synthetic spectra of solar plasma from various features, which inform a response function used by the observational instruments themselves. This response function is vital to understanding observations. The Atmospheric Imaging Assembly (AIA) is a multi-wavelength imager on the Solar Dynamics Observatory that specifically looks at the solar corona to understand magnetic processes.  This project aims to use SunPy to infer plasma properties like temperature and density by developing the routines necessary to calculate two response functions for the AIA using Python and ChiantiPy. They are wavelength response functions that calculate the amount of flux per wavelength as measured by AIA, and temperature response functions that calculate the sensitivity of light from the plasma per temperature as measured by AIA.</p>\n",
          "difficulty": null,
          "id": "proj_openastronomy_2016_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5602520831361024/",
          "proposal_id": null,
          "short_description": "Solar physics uses the CHIANTI atomic physics database to obtain properties about various elements and ionisation states. By using observed elemental...",
          "slug": "implementing-aia-response-function-in-sunpy",
          "status": "completed",
          "student_name": "TDWilkinson",
          "student_profile": null,
          "tags": [
            "python",
            "ai",
            "database",
            "ux"
          ],
          "title": "Implementing AIA response function in Sunpy"
        },
        {
          "code_url": "http://mirca.github.io/gsoc-astropy-final/",
          "description": "<p>Aperture photometry assumes that the background varies in a linear fashion in the aperture’s vicinity. However, in a dense star cluster the background is usually nonlinear. Therefore, one may use point spread function (PSF) photometry in order to meaningfully measure the brightnesses of the sources. In the latter approach, a single model is fitted to each object allowing one to determine, with subpixel precision, their position, amplitude, and width.</p>\n<p>However, this becomes a non straightforward task when considering fitting multiple overlapping objects. To do so, one can not “just fit a model with hundreds parameters”. In fact, there exist several problems with this “brute force” approach, and the most critical one might be that the parameter space will have many dimensions (as many as the number of parameters, precisely), which almost certainly will make optimization algorithms to diverge or to get stuck in a local minima.</p>\n<p>Hence, my primary task is to work on developing an algorithm to localize, fit, and perform photometry of several overlapping objects (e.g. a dense star cluster, globular clusters, etc) simultaneously.</p>\n",
          "difficulty": null,
          "id": "proj_openastronomy_2016_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/6262816889634816/",
          "proposal_id": null,
          "short_description": "Aperture photometry assumes that the background varies in a linear fashion in the aperture’s vicinity. However, in a dense star cluster the...",
          "slug": "implement-psf-photometry-for-fitting-several-overlapping-objects-at-once",
          "status": "completed",
          "student_name": "Zé Vinícius",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Implement PSF photometry for fitting several overlapping objects at once"
        },
        {
          "code_url": "http://kvyhastroplan.blogspot.com/2016/08/cleaning-up-and-documenting.html",
          "description": "<p>The project aims to build upon the Astropy-affiliated package Astroplan to provide scheduling functionality for individual observations and higher-demand observatories. The individual observation scheduling will make use of the observability functions already implemented in Astroplan to take targets and constraints as inputs and return a nearly optimised observing schedule. Scheduling for a high-demand observatory will take multiple proposals, each containing targets and constraints, with varying priority and find a schedule that best satisfies the proposals.</p>\n",
          "difficulty": null,
          "id": "proj_openastronomy_2016_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/4806240471351296/",
          "proposal_id": null,
          "short_description": "The project aims to build upon the Astropy-affiliated package Astroplan to provide scheduling functionality for individual observations and...",
          "slug": "scheduling-capabilities-for-astroplan",
          "status": "completed",
          "student_name": "Kvyh",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Scheduling capabilities for Astroplan"
        },
        {
          "code_url": "https://github.com/search?p=1&q=author%3AOlgaVorokh+created%3A%222016-02-10+..+2016-08-23%22&ref=searchresults&type=Issues&utf8=%E2%9C%93",
          "description": "<p>Gammapy is a Python package for professional gamma-ray astronomers to analyse data from space-based gamma-ray telescopes (like Fermi-LAT) as well as ground-based gamma-ray telescopes (such as HESS or CTA). It is a very young project, so there’s a lot to do. The project I will be working on consists of gammapy.image, gammapy.detect (using gammapy.image as a building block) and making small modules and improvements such as source extraction or cluster detection tools. Working on the tests and documentation will be a significant part of my project, making both new and existing code documented and increasing coverage.</p>\n",
          "difficulty": null,
          "id": "proj_openastronomy_2016_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/6097787066253312/",
          "proposal_id": null,
          "short_description": "Gammapy is a Python package for professional gamma-ray astronomers to analyse data from space-based gamma-ray telescopes (like Fermi-LAT) as well as...",
          "slug": "image-processing-and-source-detection-in-gammapy",
          "status": "completed",
          "student_name": "Olga Vorokh",
          "student_profile": null,
          "tags": [
            "python",
            "ui"
          ],
          "title": "Image processing and source detection in Gammapy"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2016/organizations/5193799529660416/"
    },
    "year_2017": {
      "num_projects": 8,
      "projects": [
        {
          "code_url": "http://www.techievirus.com/Gsoc-Final-report",
          "description": "<p>This project aims to improve python-casacore infrastructure, making the codebase cleaner, modern, maintainable and adding more unit tests.</p>\n",
          "difficulty": null,
          "id": "proj_openastronomy_2017_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6393703333625856/",
          "proposal_id": null,
          "short_description": "This project aims to improve python-casacore infrastructure, making the codebase cleaner, modern, maintainable and adding more unit tests.",
          "slug": "casacore-testing",
          "status": "completed",
          "student_name": "Shibasis Patel",
          "student_profile": null,
          "tags": [
            "python",
            "ai"
          ],
          "title": "Casacore Testing"
        },
        {
          "code_url": "https://medium.com/@nitinkgp23/gsoc-coming-to-an-end-d20afa843940",
          "description": "<p>The SunPy JSOC Client is a very rudimentary client to JSOC's export data CGI. The drms module provides a more complete implementation of the DRMS protocol. The drms module needs testing, and some other packaging improvements to automatically run the tests. This might involve adoption of some of the Astropy packaging code such as astropy_helpers, if necessary.\nOnce the drms package has been well tested, CI added and a conda package created, the SunPy JSOC client could be improved and extended to enable use of the majority of the drms functionality through the unified search API of SunPy. While the SunPy implementation would not need to provide all the features of the drms library, it would strive to provide a simple API for most queries supported by drms.</p>\n",
          "difficulty": null,
          "id": "proj_openastronomy_2017_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5644701705175040/",
          "proposal_id": null,
          "short_description": "The SunPy JSOC Client is a very rudimentary client to JSOC's export data CGI. The drms module provides a more complete implementation of the DRMS...",
          "slug": "drms-module-for-jsoc-downloads",
          "status": "completed",
          "student_name": "nitinkgp23",
          "student_profile": null,
          "tags": [
            "api"
          ],
          "title": "Drms module for JSOC Downloads"
        },
        {
          "code_url": "https://adl1995.github.io/gsoc-final-evaluation-report.html",
          "description": "<p>Design and create a Python client for Hierarchical Progressive Surveys (HiPS). The package will enable users to view astronomical figures in an interactive environment. Currently, similar clients exist, such as Aladin and Aladin Lite, but they are written in Java and JavaScript, respectively. The goal of this project is to provide similar functionality using Python. The current decision is to work only with HiPS images, but if this gets done before the deadline, support for HiPS catalogues will be added as well.</p>\n",
          "difficulty": null,
          "id": "proj_openastronomy_2017_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5440053895495680/",
          "proposal_id": null,
          "short_description": "Design and create a Python client for Hierarchical Progressive Surveys (HiPS). The package will enable users to view astronomical figures in an...",
          "slug": "hips-client-for-python",
          "status": "completed",
          "student_name": "Adeel Ahmad",
          "student_profile": null,
          "tags": [
            "python",
            "java",
            "javascript"
          ],
          "title": "HiPS client for Python"
        },
        {
          "code_url": "https://duygukeskek.github.io/SunPy_Website_Improvements/",
          "description": "<p>SunPy website is a platform that introduces the SunPy open-source software package for solar physics based on Python. Its main elements are an about section for introduction of both the software and the team, a blog for the latest updates, astronomy events, and news, a documentation for the developers use, and a gallery for tutorials. However, there are some problems with the website such as the inconsistency between home page and documentation, and also the out of date look of its design. My proposal will include redesigning each components of the website from stratch by following material design guidelines to enhance the general view, and using the latest web technologies and frameworks to make it more scalable, fast, secure, and responsive. Moreover, I will explain my approach to the implementation of extensions in this project and propose some new features that will undertake the project to a high standard.</p>\n",
          "difficulty": null,
          "id": "proj_openastronomy_2017_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6126231292477440/",
          "proposal_id": null,
          "short_description": "SunPy website is a platform that introduces the SunPy open-source software package for solar physics based on Python. Its main elements are an about...",
          "slug": "sunpy-website-improvements",
          "status": "completed",
          "student_name": "Duygu Keşkek",
          "student_profile": null,
          "tags": [
            "python",
            "web",
            "ai",
            "ui"
          ],
          "title": "SunPy Website Improvements"
        },
        {
          "code_url": "https://github.com/Punyaslok/sunrightnow/pull/2",
          "description": "<p>The Sun releases large amounts of magnetic energy in the form of X-rays, EUV (Extreme ultraviolet), radio waves and high energy particles regularly. This kind of radiation bursts can threaten space and ground based technological infrastructure. Hence it is important to monitor solar activity to be prepared for potential threats.</p>\n<p>The main purpose of this project is to provide near real-time information on solar activity and active regions. It will be completely powered by SunPy, and will be accessible to a wide variety of users. It will serve, among other things, active region information, full solar disk images etc.</p>\n",
          "difficulty": null,
          "id": "proj_openastronomy_2017_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/4506490677231616/",
          "proposal_id": null,
          "short_description": "The Sun releases large amounts of magnetic energy in the form of X-rays, EUV (Extreme ultraviolet), radio waves and high energy particles regularly....",
          "slug": "sun-right-now",
          "status": "completed",
          "student_name": "Punyaslok Pattnaik",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Sun, Right now!"
        },
        {
          "code_url": "https://aaryapatil.wordpress.com/2017/08/28/a-mixin-protocol-for-seamless-interoperability/",
          "description": "<p>Astropy has emerged as an integration of several independent packages (PyFits, asciitable), each responsible for an individual task in the storage, reduction and analysis pipeline of the astronomical data sets. It has mostly unified the interface in order to make these entities coalesce. However, the need for Astropy to shine as a single package and not just a collection of functionally independent modules, calls for seamless interoperability between the three special and powerful constituents of Astropy: coordinates, time and units and the underlying Astropy table writers. We seek to develop a protocol that allows their storage, the mixin columns, in FITS and ASCII ECSV, while still ensuring \"round-tripping\". Abiding by the rules set by the FITS standard, requires mapping of the special Astropy objects, with extensive associated metadata, to the standard keywords. We thus want to achieve the ideal goal of preserving complete information, while still going hand in hand with the defined standard.</p>\n",
          "difficulty": null,
          "id": "proj_openastronomy_2017_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/4778482366152704/",
          "proposal_id": null,
          "short_description": "Astropy has emerged as an integration of several independent packages (PyFits, asciitable), each responsible for an individual task in the storage,...",
          "slug": "astropy-a-mixin-protocol-for-seamless-interoperability",
          "status": "completed",
          "student_name": "Aarya Patil",
          "student_profile": null,
          "tags": [
            "ml",
            "ui"
          ],
          "title": "Astropy : A mixin protocol for seamless interoperability"
        },
        {
          "code_url": "https://medium.com/@prasunk2/and-so-the-curtain-falls-on-this-gsoc-journey-69f1e4d0e4ca",
          "description": "<p>Hello. As a part of Google Summer Code of 2017, the main task that I intend to take up is to increase the number of the functions present in the <a href=\"https://github.com/JuliaAstro/AstroLib.jl\" target=\"_blank\">AstroLib.jl</a> package, chiefly by porting an extensive portion of the IDL <a href=\"https://idlastro.gsfc.nasa.gov/homepage.html\" target=\"_blank\">Astronomy User’s Library</a> procedures not present in the package.</p>\n<p>The project involves translating the code from IDL - <a href=\"https://idlastro.gsfc.nasa.gov/homepage.html\" target=\"_blank\">Interactive Data Language</a> - to <a href=\"https://github.com/JuliaLang/julia\" target=\"_blank\">Julia</a>, a relatively new high-level dynamic programming language designed to address the needs of high-performance numerical analysis and computational science. This will greatly increase the range of utilities present in the AstroLib.jl package, making it much more useful for users.</p>\n<p>A sample of what this project will entail can be seen through the following pull requests on Github -  <a href=\"https://github.com/JuliaAstro/AstroLib.jl/pull/10\" target=\"_blank\">#10</a> and <a href=\"https://github.com/JuliaAstro/AstroLib.jl/pull/13\" target=\"_blank\">#13</a></p>\n",
          "difficulty": null,
          "id": "proj_openastronomy_2017_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/4935757223428096/",
          "proposal_id": null,
          "short_description": "Hello. As a part of Google Summer Code of 2017, the main task that I intend to take up is to increase the number of the functions present in the...",
          "slug": "porting-the-idl-astronomy-users-library-to-julia",
          "status": "completed",
          "student_name": "Kumar Prasun (KP)",
          "student_profile": null,
          "tags": [
            "ml",
            "ai"
          ],
          "title": "Porting the IDL Astronomy User's Library to Julia"
        },
        {
          "code_url": "https://medium.com/@ankit_b/gsoc-2017-fce66e75341",
          "description": "<p>The project will enable users to use IRIS class objects IRISRaster and IRISSji and its tools to calibrate, visualise and analyse different IRIS data. The class also has a IRISObservation class which will contain IRISRaster and IRISSji object and this class will be able to open level 3 files. This observation class will help users to associate IRISRaster and IRISSji data. This project helps to increase the user-base of the IRIS data, since the younger generation of scientists are trained in Python and the current software is written in IDL, where everyone cannot afford a licence.</p>\n",
          "difficulty": null,
          "id": "proj_openastronomy_2017_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6313559243882496/",
          "proposal_id": null,
          "short_description": "The project will enable users to use IRIS class objects IRISRaster and IRISSji and its tools to calibrate, visualise and analyse different IRIS data....",
          "slug": "iris-data-class",
          "status": "completed",
          "student_name": "Ankit Baruah",
          "student_profile": null,
          "tags": [
            "python",
            "ai"
          ],
          "title": "IRIS Data Class"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2017/organizations/6563063020912640/"
    },
    "year_2018": {
      "num_projects": 8,
      "projects": [
        {
          "code_url": "https://medium.com/@yatharthrai16/heliopy-final-blog-post-cd4e9cf3ebe1",
          "description": "<p>HelioPy is a Python package which lets the user import space physics data from various sources and converts them into an easy-to-read and manipulates format.</p>\n<p>All of the data currently returned is in Pandas DataFrame, which does not support physical units. My project is to add an additional functionality so that HelioPy can use physical units and attach them to the data.</p>\n",
          "difficulty": "beginner",
          "id": "proj_openastronomy_2018_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/6448924936110080/",
          "proposal_id": null,
          "short_description": "HelioPy is a Python package which lets the user import space physics data from various sources and converts them into an easy-to-read and manipulates...",
          "slug": "integrating-physical-units-into-heliopy",
          "status": "completed",
          "student_name": "Yatharth Rai",
          "student_profile": null,
          "tags": [
            "python"
          ],
          "title": "Integrating Physical Units into HelioPy"
        },
        {
          "code_url": "https://medium.com/@sushobhanapatra/gsoc-final-report-dd9a3dc0d1d7",
          "description": "<p>Astropy's <code>regions</code> package is being developed to handle description and manipulation of astronomical regions on sky and pixel coordinates.The current regions package has support for the most commonly used region specification, DS9,  but does not yet support the <code>CRTF</code> and <code>FITS REGION</code>.</p>\n<p>CASA is the main package for radio interferometry data reduction and processing. CASA regions are mostly compatible with and translatable to DS9 other formats, but the only parser that presently exists, lives within CASA. <code>CRTF</code> stands for Casa Region Text Format.</p>\n<p>FITS , <code>Flexible Image Transport System</code> is an image format standard used in astronomy. A <code>FITS Region</code> binary table defines a spatial region of a 2-dimensional image. The region file is often used to define an area that is to be included or excluded from certain data processing operations on the image.</p>\n<p>The primary goal of the project is to implement I/O so the <code>regions.Region</code> objects can serialize/deserialize across these file formats , handle the meta data and spectral dimensions , improve the regions package, document and test alongside.</p>\n",
          "difficulty": null,
          "id": "proj_openastronomy_2018_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5108140769017856/",
          "proposal_id": null,
          "short_description": "Astropy's regions package is being developed to handle description and manipulation of astronomical regions on sky and pixel coordinates.The current...",
          "slug": "incorporating-fits-region-crtf-io-and-improving-regions",
          "status": "completed",
          "student_name": "Sushobhana Patra",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Incorporating FITS Region, CRTF I/O and improving Regions."
        },
        {
          "code_url": "http://prsr.me/GSoC-Wrap-Up/",
          "description": "<p>The JuliaAstro organization equips astronomers with tools developed in Julia language that they can include in their daily workflow and do impactful research. The AstronomicalTime.Jl package provides a new data type “Epoch” which is capable of handling conversions between different timescales using efficient routines. \nCurrently, the AstronomicalTime package relies on ERFA.jl for handling conversions between different time scales. ERFA.jl further ccalls liberfa, a library written in C programming language. This proposal aims to write all the liberfa function used in AstronomicalTIme.jl in pure Julia, increasing the ease of development and making the package extensible by using Julia's flexible user-defined types.</p>\n",
          "difficulty": null,
          "id": "proj_openastronomy_2018_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5373821473259520/",
          "proposal_id": null,
          "short_description": "The JuliaAstro organization equips astronomers with tools developed in Julia language that they can include in their daily workflow and do impactful...",
          "slug": "porting-essential-erfa-functions-to-julia",
          "status": "completed",
          "student_name": "Prakhar Srivastava",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Porting Essential ERFA Functions to Julia"
        },
        {
          "code_url": "https://docs.google.com/document/d/1iR8DjAmaSPK9cuwuAYePXLuir_aDJjhNBrqYGF8qwdg/edit?usp=sharing",
          "description": "<p>Quasi-periodic oscillations are the “heart-beat” of black holes and neutron stars: oscillations with changing phase and frequency, probably due to the complicated motion of matter around these objects. Besides characterizing how these frequencies evolve in time (accelerate, decelerate, for example, when the luminosity increases), it is important to understand their exact physical meaning. A few examples in the literature use different approaches to the problem, and calculate the different spectrum of the light emitted at different phases of these oscillations. This is highly non-trivial: one cannot follow easily the single “heartbeat”, but needs to apply a strong de-noising to the signal first, and then calculate the average spectrum during the oscillation.</p>\n",
          "difficulty": null,
          "id": "proj_openastronomy_2018_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/4580171982045184/",
          "proposal_id": null,
          "short_description": "Quasi-periodic oscillations are the “heart-beat” of black holes and neutron stars: oscillations with changing phase and frequency, probably due to...",
          "slug": "phase-resolved-oscillations",
          "status": "completed",
          "student_name": "Swapnil Sharma",
          "student_profile": null,
          "tags": [],
          "title": "Phase-resolved oscillations"
        },
        {
          "code_url": "https://medium.com/@appukuttancr/the-end-of-gsoc-261e9afa66ac",
          "description": "<p>SunPy uses python <code>datetime</code> module for handling almost all time related things. <code>datetime</code> is not the best choice for astronomy related projects due to a lot of reasons (for instance, it does not handle leap seconds). The answer is to use <code>time</code> module from <code>astropy</code>.</p>\n<p><code>astropy.time.Time</code> can do a lot things including:</p>\n<ul>\n<li>Handle leap seconds</li>\n<li>Easy conversion between format like <code>iso</code>, <code>isot</code> etc.</li>\n<li>Easy conversion between scales like <code>utc</code>, <code>tai</code> etc.</li>\n<li>Can be initialized from and converted to a lot of popular time formats and even supports python <code>datetime</code>.</li>\n<li>Ability to create custom classes to support extra formats of time.</li>\n</ul>\n<p>This makes <code>astropy.time</code> the best candidate to replace python <code>datetime</code> in SunPy.</p>\n<p>This project will transition the whole of SunPy to use <code>astropy.time</code> instead of python <code>datetime</code>.</p>\n",
          "difficulty": "beginner",
          "id": "proj_openastronomy_2018_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/6500738213609472/",
          "proposal_id": null,
          "short_description": "SunPy uses python datetime module for handling almost all time related things. datetime is not the best choice for astronomy related projects due to...",
          "slug": "transition-to-astropy-time",
          "status": "completed",
          "student_name": "Vishnunarayan K I",
          "student_profile": null,
          "tags": [
            "python",
            "ai"
          ],
          "title": "Transition to astropy time"
        },
        {
          "code_url": "https://blog.poliastro.space/2018/08/05/2018-08-05-google-summer-of-code-2018/",
          "description": "<p>The project is aimed at improvement of currently implemented Poliastro propagators (cure long-time propagation problems, measure performance, use better ODE solvers)  and also implementation of various perturbation effects such as J2-coefficients, 3rd body effects. The secondary goals include implementing higher-order corrections to orbit, moving already existing code to the project (low-thrust trajectories, Solar drag, e t.c.) and creation of Jupyter notebooks demonstrating all the new advances.</p>\n",
          "difficulty": null,
          "id": "proj_openastronomy_2018_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/6040133975408640/",
          "proposal_id": null,
          "short_description": "The project is aimed at improvement of currently implemented Poliastro propagators (cure long-time propagation problems, measure performance, use...",
          "slug": "improving-propagators-and-perturbations-account-in-poliastro",
          "status": "completed",
          "student_name": "Nikita Astrakhantsev",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Improving propagators and perturbations account in Poliastro"
        },
        {
          "code_url": "https://gist.github.com/ritiek/505b696436182a4b3da027787c831edc",
          "description": "<p>PlasmaPy is an open-source Python package and aims to provide a set of common functionality used in plasma physics. Currently it implements a Plasma class which does all the fundamental work of calculating plasma parameters like alfven speed, density, electric field, magnetic field, pressure, etc. The current Plasma class does a good job at the moment but it will be very messy to work with different kinds of plasmas in the future by relying solely on current implementation using classes. Since dealing with different kinds of plasmas is an important part of plasma physics, having a more compact way of working with these kinds of plasmas will be a milestone of substantial importance and priority for PlasmaPy.</p>\n",
          "difficulty": null,
          "id": "proj_openastronomy_2018_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5159989614215168/",
          "proposal_id": null,
          "short_description": "PlasmaPy is an open-source Python package and aims to provide a set of common functionality used in plasma physics. Currently it implements a Plasma...",
          "slug": "implement-a-new-plasma-metaclass-in-plasmapy",
          "status": "completed",
          "student_name": "Ritiek Malhotra",
          "student_profile": null,
          "tags": [
            "python",
            "ai"
          ],
          "title": "Implement a new Plasma metaclass in PlasmaPy"
        },
        {
          "code_url": "https://medium.com/@manan_agarwal/gsoc-diaries-4-02-wrapping-up-66346255bc6c",
          "description": "<p>Learn Astropy is a website for the Astropy Learn ecosystem which consolidates Astropy documentation and associated examples, Astropy tutorials, and guides. The goal is to make the Astropy Learn ecosystem more organised, accessible and efficient by adding features like dynamic search that works across all of the Learn resources. Astropy aims to provide users packages that improve reuse, interoperability, and interface standards for python astronomy and astrophysics packages. Learn Astropy will help both amateurs as well as professional astronomers and astrophysicists in exploring and implementing the various utilities and functionalities provided by Astropy. It will also simplify the process for anyone who is learning to work with python astronomy/astrophysics packages or anyone developing astronomy software.</p>\n<p>The project involved optimising the dynamic search, making custom Sphinx directives, indexing and tagging of Astropy Learn material. Work was also done on user interface design and user experience. I worked primarily with javascript and python, and used Sphinx for generating the HTML build files from Jupyter notebooks.</p>\n",
          "difficulty": null,
          "id": "proj_openastronomy_2018_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5184722451824640/",
          "proposal_id": null,
          "short_description": "Learn Astropy is a website for the Astropy Learn ecosystem which consolidates Astropy documentation and associated examples, Astropy tutorials, and...",
          "slug": "learn-astropy",
          "status": "completed",
          "student_name": "Manan Agarwal",
          "student_profile": null,
          "tags": [
            "python",
            "java",
            "javascript",
            "web",
            "ml"
          ],
          "title": "Learn Astropy"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2018/organizations/6600717804503040/"
    },
    "year_2019": {
      "num_projects": 9,
      "projects": [
        {
          "code_url": "https://gist.github.com/vatch123/d81e04dbf1f613eaf425965f3bbf6364",
          "description": "<p>This project aims at developing various image processing algorithms and manipulation routines to sunkit-image, an affiliated python package of Sunpy. The analysis of solar images is of paramount to the heliophysics community. Such analysis reveals various factors which affect the Sun and which in turn affect everything here, on Earth. Moreover, the surge in the popularity of python for various data analysis and scientific computing tasks during the past few years makes the need for such a library in python hard to overlook. This project aims at bringing the various solar image processing algorithms under the umbrella of one library.</p>\n",
          "difficulty": null,
          "id": "proj_openastronomy_2019_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/6683198925307904/",
          "proposal_id": null,
          "short_description": "This project aims at developing various image processing algorithms and manipulation routines to sunkit-image, an affiliated python package of Sunpy....",
          "slug": "sunkit-image",
          "status": "completed",
          "student_name": "Vatsalya Chaubey",
          "student_profile": null,
          "tags": [
            "python",
            "ai"
          ],
          "title": "Sunkit-Image"
        },
        {
          "code_url": "https://github.com/ctlearn-project/ctlearn_optimizer/pull/3",
          "description": "<p>CTLearn is a Python package for using deep learning to perform analysis tasks on data from imaging atmospheric Cherenkov telescopes (IACTs). These tasks may be either classification or regression problems. \nThe sensitivity of IACTs is mostly driven by our capability of distinguishing gamma-ray induced events from cosmic-ray induced events. The better our deep learning models are in telling these two populations apart, the better our reach in the gamma-ray Universe will be. Therefore, optimizing our deep learning models has the potential to make a difference in our view of the Universe at these energies.\nThis project aims to implement an automated model optimization framework in CTLearn, including random and grid search, Bayesian and genetic algorithms based optimization.</p>\n",
          "difficulty": null,
          "id": "proj_openastronomy_2019_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5672735995330560/",
          "proposal_id": null,
          "short_description": "CTLearn is a Python package for using deep learning to perform analysis tasks on data from imaging atmospheric Cherenkov telescopes (IACTs). These...",
          "slug": "implement-an-automated-model-optimization-framework-in-ctlearn",
          "status": "completed",
          "student_name": "Juan Redondo Pizarro",
          "student_profile": null,
          "tags": [
            "python",
            "ai",
            "ui"
          ],
          "title": "Implement an automated model optimization framework in CTLearn"
        },
        {
          "code_url": "https://medium.com/@appukuttancr/gsoc-the-end-1e6153c49a7d",
          "description": "<p>Some functionality in SunPy or in affiliated packages is going to need access to data files on remote (HTTP) servers. Examples of this include data provided by instrument teams relating to the calibrations or performance of the instruments, these kind of data are highly likely to change with time.</p>\n<p>This project needs to be designed and implemented under the assumptions that SunPy has no control over the data on these servers, and that files on the servers may be replaced with different files with the same name.</p>\n",
          "difficulty": null,
          "id": "proj_openastronomy_2019_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5709992840134656/",
          "proposal_id": null,
          "short_description": "Some functionality in SunPy or in affiliated packages is going to need access to data files on remote (HTTP) servers. Examples of this include data...",
          "slug": "remote-data-for-sunpy",
          "status": "completed",
          "student_name": "Vishnunarayan K I",
          "student_profile": null,
          "tags": [],
          "title": "Remote Data for SunPy"
        },
        {
          "code_url": "https://astrotiff.home.blog/2019/08/25/final-gsoc-post/",
          "description": "<p>To make a convincing proposal in observational astronomy, you must demonstrate to a telescope’s proposal committee that your target can indeed be sufficiently observed with their instrument. How long could you observe a particular A-star with Hubble before it saturates the pixels? Will an M-dwarf at a distance of 327 parsecs have a high enough photon flux to be detectable with a certain filter and aperture? How many more photon counts can you expect when observing your object in the V band versus the U band? These questions are among those which telescopy will make easy to answer, thus aiding the thorough astronomer in their observational endeavors.</p>\n",
          "difficulty": "beginner",
          "id": "proj_openastronomy_2019_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5742737184260096/",
          "proposal_id": null,
          "short_description": "To make a convincing proposal in observational astronomy, you must demonstrate to a telescope’s proposal committee that your target can indeed be...",
          "slug": "developing-telescopy-a-simple-api-for-retrieving-signal-to-noise-estimates-of-an-arbitrary-astronomical-observation",
          "status": "completed",
          "student_name": "Tiffany Jansen",
          "student_profile": null,
          "tags": [
            "api",
            "ai",
            "ux"
          ],
          "title": "Developing “telescopy”: A Simple API for Retrieving Signal-to-Noise Estimates of an Arbitrary Astronomical Observation"
        },
        {
          "code_url": "https://github.com/sunpy/irispy/pull/119",
          "description": "<p>This project is about adding a very practical functionality to the IRISpy package which is built on top of Sunpy’s ndcube package. IRISpy provides functionalities for the analysis of observations from NASA's Interface Region Imaging Spectrograph (IRIS) satellite which looks at UV emission from the solar chromosphere in particular. The proposed new features will give scientists far greater power and ability to perform IRIS data analysis in Python, as well as to make new discoveries regarding the energetics and dynamics of the solar chromosphere and transition region than previously could.</p>\n",
          "difficulty": null,
          "id": "proj_openastronomy_2019_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/6094580905148416/",
          "proposal_id": null,
          "short_description": "This project is about adding a very practical functionality to the IRISpy package which is built on top of Sunpy’s ndcube package. IRISpy provides...",
          "slug": "add-time-dependent-instrument-response-function-to-irispy",
          "status": "completed",
          "student_name": "Kris Stern",
          "student_profile": null,
          "tags": [
            "python",
            "ui"
          ],
          "title": "Add Time-dependent Instrument Response Function to IRISpy"
        },
        {
          "code_url": "https://blog.poliastro.space/2019/08/20/2019-08-20-new-features-after-gsoc19/",
          "description": "<h4>Author and organisation</h4>\n<ul>\n<li><strong>Name:</strong> Jorge Martínez Garrido</li>\n<li><strong>Organisation:</strong> poliastro - Open Astronomy</li>\n</ul>\n<h4>Application</h4>\n<h6><em>Improving poliastro Earth capabilities</em></h6>\n<h5>Summary</h5>\n<p>Nowadays poliastro includes different interplanetary capabilities, such us retrieving the user any body available in JPL database, Cowell's propagation under different perturbations or even plotting porkchops. However more features could be developed for Earth such us:</p>\n<ul>\n<li>Defining Earth-Moon and Solar System barycenter.</li>\n<li>New integrators such us Verner78 can improve computation times    </li>\n<li>Atmospheric and gravitational models such us: Jacchia-Roberts, Russian GOST... </li>\n<li>Orbit determination, making use of external packages like the Aerospace Research Orbit determinator. </li>\n<li>Orbital and ground station keeping, rendezvous maneuvers, low-thrust guidance laws and others.</li>\n<li>Two-Line Element (TLE) retrieval from Celestrak.</li>\n</ul>\n",
          "difficulty": null,
          "id": "proj_openastronomy_2019_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/4887352839766016/",
          "proposal_id": null,
          "short_description": "Author and organisation\n\nName: Jorge Martínez Garrido\nOrganisation: poliastro - Open Astronomy\n\nApplication\nImproving poliastro Earth capabilities...",
          "slug": "improving-poliastro-earth-capabilities",
          "status": "completed",
          "student_name": "Jorge Martínez Garrido",
          "student_profile": null,
          "tags": [
            "ai",
            "database",
            "ui"
          ],
          "title": "Improving poliastro Earth capabilities"
        },
        {
          "code_url": "https://blog.poliastro.space/2019/08/19/2019-08-19-czml-extractor-an-overview.md",
          "description": "<p>Poliastro aims to be an open source library for aiding Astrodynamics and Orbital Mechanics. However, a lack of interactive visualization tools is apparent. My proposal aims to build a module to extract orbital data from poliastro and visualize them using the open source 3d mapping application, Cesium.</p>\n",
          "difficulty": null,
          "id": "proj_openastronomy_2019_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/4930418745278464/",
          "proposal_id": null,
          "short_description": "Poliastro aims to be an open source library for aiding Astrodynamics and Orbital Mechanics. However, a lack of interactive visualization tools is...",
          "slug": "czml-extractor-for-poliastro",
          "status": "completed",
          "student_name": "Eleftheria",
          "student_profile": null,
          "tags": [
            "ml",
            "ai",
            "ui"
          ],
          "title": "CZML Extractor for poliastro"
        },
        {
          "code_url": "https://medium.com/@yashrsharma44/google-summer-of-code-2019-final-report-openastronomy-ndcube-65068b8571d8",
          "description": "<p>This project proposes to add the support for APE14 in NDCube, which is a SunPy-affiliated project. In order to support both FITS-WCS and gWCS and hence support more future WCSs libraries, this project aims to convert the ndcube package to use a  common WCS API. The new API has already been outlined by astropy’s APE14. Implementing support for APE14 will enable ndcube to use FITS-WCS and gWCS independently and hence increase the power and scope of the ndcube package. With this new feature, NDCube will become better placed to serve a wider array of n-dimensional data analysis needs from multiple astronomical communities.</p>\n",
          "difficulty": null,
          "id": "proj_openastronomy_2019_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5877302938828800/",
          "proposal_id": null,
          "short_description": "This project proposes to add the support for APE14 in NDCube, which is a SunPy-affiliated project. In order to support both FITS-WCS and gWCS and...",
          "slug": "supporting-ape14-in-ndcube",
          "status": "completed",
          "student_name": "yashrsharma44",
          "student_profile": null,
          "tags": [
            "api",
            "ai"
          ],
          "title": "Supporting APE14 in NDCube"
        },
        {
          "code_url": "https://aquatiko.github.io/blog/2019-08/final-report-gsoc19-the-curtain-falls/",
          "description": "<p>JuliaAstro organization provides astronomers with the tools to work with the Julia language.\nOne of the latest packages is AstroImages.jl, which aims to allow researchers to visualize astronomical images coming from FITS files. It is meant as an interface to popular Julia packages like Images.jl and Plots.jl This package is now in its infancy stage. The goal of this project will be to introduce new features and make it useful.</p>\n<p>GOALS</p>\n<ol>\n<li>Allow users to Reproject and co-align different ImageHDU into one using their WCS header info</li>\n<li>Support 3 channel/band astronomical images (i.e different extensions like RGB, HSV, XYZ, Lab etc.) and handle interconversions while minimizing losses</li>\n<li>Integrate different plotting feature like zooming, grids, overlays, markers, labels etc. with AstroImage type.</li>\n<li>Allow interactive GUI based or script based  plotting of astronomical images</li>\n<li>Designing interface and integration with Images.jl for operations like contour plotting, filtering, histograms, segmentation etc</li>\n<li>(optional) Some miscellaneous features like blending of images from different fits files, custom colourmap visualization</li>\n<li>Design distributable format (metadata specific) of these custom visualization</li>\n</ol>\n",
          "difficulty": null,
          "id": "proj_openastronomy_2019_009",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5135227968552960/",
          "proposal_id": null,
          "short_description": "JuliaAstro organization provides astronomers with the tools to work with the Julia language.\nOne of the latest packages is AstroImages.jl, which aims...",
          "slug": "visualization-of-astronomical-images-in-julia-a-fresh-approach",
          "status": "completed",
          "student_name": "Rohit-Kumar",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Visualization of astronomical images in Julia: A fresh Approach"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2019/organizations/5152196847468544/"
    },
    "year_2020": {
      "num_projects": 10,
      "projects": [
        {
          "code_url": "https://github.com/abhijeetmanhas/abhijeetmanhas/blob/master/GSoC2020-Fido-WorkProduct.md",
          "description": "<p><strong>Federated internet data obtainer</strong> (Fido) is a very powerful query and fetch interface when it comes to its flexibility and versatility with different types of clients and query attributes. The data archives available at various FTP and HTTP sites mostly offer file-based records accessible easily through time ranges, and Fido evolved to efficiently handle such queries.</p>\n<p>This project will be an attempt to refactor the net module by standardizing all client classes and their responses. It will enable Fido to parse metadata queries and allow users to inspect them as well; particularly for meta-specific clients like <code>HEK</code> and <code>HEC</code> Clients. The project will also attempt to solve download failures with <code>JSOC</code> and <code>VSO</code> as in <a href=\"https://github.com/sunpy/sunpy/issues/3336\" target=\"_blank\">Issue #3336</a>  and <a href=\"https://github.com/sunpy/sunpy/issues/3733\" target=\"_blank\">Issue #3773</a> respectively. Finally, this project will enable post-search filtering features for all clients of <code>sunpy/net</code> and use <code>scraper</code> objects to scrap all attributes for a response table from the data archives. This would be followed by writing pytests for various untested functions in the module.</p>\n<p>The project will end with easy interpretable documentation of code and gallery examples wherever possible.</p>\n",
          "difficulty": "beginner",
          "id": "proj_openastronomy_2020_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/6373058639560704/",
          "proposal_id": null,
          "short_description": "Federated internet data obtainer (Fido) is a very powerful query and fetch interface when it comes to its flexibility and versatility with different...",
          "slug": "metadata-searches-using-fido",
          "status": "completed",
          "student_name": "Abhijeet Manhas",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Metadata searches using Fido"
        },
        {
          "code_url": "https://github.com/radis/radis/pull/117",
          "description": "<p>The presence and concentration of molecules in a gas can be measured by comparing absorption and emission experimental spectra to synthetic spectra. However, under high-temperature conditions, the synthetic spectra contain dozens of millions of lines. In any line-by-line code the bottleneck is the calculation of the lineshapes, which can require long computational times (up to several minutes).</p>\n<p>The goal of this project is to parallelize this bottleneck operation of synthetic spectra calculations done in RADIS. The lineshape broadening step currently has multiple variants and pathways that depend on the input parameters, and thus a major task of this project will be to make the GPU-implementation compliant with all the variants.</p>\n",
          "difficulty": null,
          "id": "proj_openastronomy_2020_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5717508822138880/",
          "proposal_id": null,
          "short_description": "The presence and concentration of molecules in a gas can be measured by comparing absorption and emission experimental spectra to synthetic spectra....",
          "slug": "accelerate-synthetic-spectra-calculations-using-cuda",
          "status": "completed",
          "student_name": "Pankaj Mishra",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Accelerate Synthetic Spectra Calculations using CUDA"
        },
        {
          "code_url": "https://github.com/einsteinpy/GSoC-2020/wiki",
          "description": "<p>Null geodesics refer to the path, that massless particles, such as photons, follow in 4-dimensional spacetime. Accurate numerical computation of these geodesics near Black Holes is paramount to advance our knowledge of the relativistic physics, surrounding these extreme gravitational objects, as the nearest stellar mass black hole is ~3000 ly away, making astronomical observations nearly impractical. Without proper astronomical reference to compare against, it is impossible to obtain data on the line profile of these celestial bodies, due to the appreciable general relativistic corrections required. In this project, we will consider two spacetime geometries, the Schwarzschild and Kerr Metrics, and implement python modules, that (1) help in solving geodesic equations, given initial conditions; (2) raytracing photons (null geodesics); and (3) help in performing some advanced simulations and visualizations, like simulating accretion flow, gravitational lensing and calculations, related to redshifted photons due to the spacetime curvature, near these bodies. We will survey the existing state-of-the-art literature and pick a performant implementation for the two geometries.</p>\n",
          "difficulty": "advanced",
          "id": "proj_openastronomy_2020_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5743602493292544/",
          "proposal_id": null,
          "short_description": "Null geodesics refer to the path, that massless particles, such as photons, follow in 4-dimensional spacetime. Accurate numerical computation of...",
          "slug": "einsteinpy-null-geodesics-for-schwarzschild-and-kerr-geometries",
          "status": "completed",
          "student_name": "Jyotirmaya Shivottam",
          "student_profile": null,
          "tags": [
            "python",
            "ai",
            "ui"
          ],
          "title": "EinsteinPy: Null geodesics for Schwarzschild and Kerr Geometries"
        },
        {
          "code_url": "https://medium.com/@sahilyadav27",
          "description": "<p>Most of the data from IACTs currently in operation comes in ROOT format. Enabling ROOT input in CTLearn will open its doors to existing IACT facilities. Hence, this project aims to use CTLearn to train classification models that tell gamma-ray images from cosmic-ray images apart and why this is important in the context of IACTs, then, enable the input of data in ROOT format and train some of the already existing deep learning models in CTLearn with data from current-generation IACTs.</p>\n",
          "difficulty": null,
          "id": "proj_openastronomy_2020_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5281162190127104/",
          "proposal_id": null,
          "short_description": "Most of the data from IACTs currently in operation comes in ROOT format. Enabling ROOT input in CTLearn will open its doors to existing IACT...",
          "slug": "enable-root-input",
          "status": "completed",
          "student_name": "SahilYadav",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Enable ROOT input"
        },
        {
          "code_url": "https://github.com/theand9/stingray/blob/gsoc2020_final_report/GSoC%20-%202020%20Final%20Project%20Report%20stingray%20Amogh%20Desai_%20A%20lightning%20fast%20stingray.pdf",
          "description": "<p><strong>stingray</strong> is a python framework that assists astronomers in spectral-timing(time-series) analysis of X-ray observations from Black Holes, Pulsars etc. stingray provides methods to generate lightcurves, periodograms and cross-spectra diagrams</p>\n<p>Stingray deals with fairly large-sized objects and datasets. This creates bottlenecks in the library, leading to a compromise between accuracy/precision and acceptable computing times.</p>\n<p>This project performs the necessary optimizations i.e. parallelizing computations, efficient memory management to speed-up stingray and support analysis of larger-than-memory datasets; ultimately eliminating bottlenecks from stingray.</p>\n<p><strong>Links:</strong> <a href=\"https://github.com/theand9\" target=\"_blank\">GitHub</a> | <a href=\"https://drive.google.com/file/d/1uNMbn-KWmJL6P5FtxPcwTwop3nMuYCHV/view?usp=sharing\" target=\"_blank\">CV</a> | <a href=\"https://www.linkedin.com/in/theand9/\" target=\"_blank\">LinkedIn</a></p>\n",
          "difficulty": null,
          "id": "proj_openastronomy_2020_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5558602951032832/",
          "proposal_id": null,
          "short_description": "stingray is a python framework that assists astronomers in spectral-timing(time-series) analysis of X-ray observations from Black Holes, Pulsars etc....",
          "slug": "a-lightning-fast-stingray-parallelizing-stingray-operations-to-analyze-larger-than-memory-datasets",
          "status": "completed",
          "student_name": "Amogh Desai",
          "student_profile": null,
          "tags": [
            "python",
            "ai"
          ],
          "title": "A lightning-fast stingray: Parallelizing stingray operations to analyze larger-than-memory datasets"
        },
        {
          "code_url": "https://github.com/astronomy-commons/sparkmanager",
          "description": "<p>Apache Spark which is used by people at Astronomy Commons enables large scale distributed computing via creating local and remote clusters. \nBut the problem is that for creating and configuring a cluster one needs to write multiple lines of cumbersome codes. Additionally, if we are scheduling a job on Kubernetes, then we need to write more options and configs.  In the long run , maintaining the clusters programmatically becomes inefficient, complicated  and unmaintainable. \nOur idea is to develop a well-designed interface that could replace the programmatic creation of (or connection to) a Spark cluster with simple UI elements.</p>\n",
          "difficulty": null,
          "id": "proj_openastronomy_2020_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/6228999061110784/",
          "proposal_id": null,
          "short_description": "Apache Spark which is used by people at Astronomy Commons enables large scale distributed computing via creating local and remote clusters. \nBut the...",
          "slug": "spark-cluster-management-dashboard",
          "status": "completed",
          "student_name": "Biswarup Banerjee",
          "student_profile": null,
          "tags": [
            "ai",
            "kubernetes",
            "ui"
          ],
          "title": "Spark Cluster Management Dashboard"
        },
        {
          "code_url": "https://medium.com/@krisastern/gsoc-2020-glue-solar-project-3-2-eb6b2bccce85",
          "description": "<p>The objective of this project is to provide a foundation for interactively exploring and quickly analyzing large datasets (100Gb or larger) in solar physics to be built in Python. This software will enable multi-instrument interactive visualisation as a plugin of Glue,  which is “a python project to link visualizations of scientific datasets across many files.” While a fully featured GUI toolkit for solar data is not expected to be built in one summer due to time constraint, the goal is to provide the technical building blocks, but more importantly to demonstrate, and document, how this framework can be used by various instrument teams to build custom solutions for their solar data.</p>\n",
          "difficulty": null,
          "id": "proj_openastronomy_2020_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/6025721211781120/",
          "proposal_id": null,
          "short_description": "The objective of this project is to provide a foundation for interactively exploring and quickly analyzing large datasets (100Gb or larger) in solar...",
          "slug": "glue-solar",
          "status": "completed",
          "student_name": "Kris Stern",
          "student_profile": null,
          "tags": [
            "python",
            "ai",
            "ui"
          ],
          "title": "glue-solar"
        },
        {
          "code_url": "https://gist.github.com/Raahul-Singh/907e5af7c568a94cbb313200f034916f",
          "description": "<p>The goal of this project is to develop a model for forecasting the likelihood that an Active Region on the sun would produce a solar flare in the near future.\nThe dataset used in this project is the Sunspotter dataset, which includes a complexity score for each AR. It is to be explored if the complexity of the AR corresponds to a higher probability of flare production.\nIn the course of this project, a Search Events object capable of querying HEK and HELIO databases also needs to be created.</p>\n",
          "difficulty": "advanced",
          "id": "proj_openastronomy_2020_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/4893913812303872/",
          "proposal_id": null,
          "short_description": "The goal of this project is to develop a model for forecasting the likelihood that an Active Region on the sun would produce a solar flare in the...",
          "slug": "solar-weather-forecasting-using-linear-algebra",
          "status": "completed",
          "student_name": "Raahul Singh",
          "student_profile": null,
          "tags": [
            "database"
          ],
          "title": "Solar Weather Forecasting using Linear Algebra"
        },
        {
          "code_url": "https://github.com/JuliaAstro/CCDReduction.jl/commits?author=siddharthlal25",
          "description": "<p>Over the years Julia has become a successful language for science and numerical computing. However, there are no current packages for performing CCD image reduction, which is essential for any observational astronomer. As a part of this project, my goal is to solve this problem by developing a new package for CCD data reduction, which will be easy to use, clairvoyant in its effects, and provide comparable utility to other reduction packages.</p>\n",
          "difficulty": "beginner",
          "id": "proj_openastronomy_2020_009",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5771063339778048/",
          "proposal_id": null,
          "short_description": "Over the years Julia has become a successful language for science and numerical computing. However, there are no current packages for performing CCD...",
          "slug": "ccd-reduction-package",
          "status": "completed",
          "student_name": "Siddharth Lal",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "CCD Reduction Package"
        },
        {
          "code_url": "https://blog.poliastro.space/2020/08/31/2020-08-31-This-is-an-end-of-an-era/",
          "description": "<p>The main objective of the proposal is to add the features to develop a <em>Specialized Orbit</em> and to incorporate a library of <em>Surveillance and Recognition Capabilities</em> to extend the capacity of <strong>Poliastro</strong>. In order to help its users achieve higher efficiency, faster analysis, and cost reduction in space missions.</p>\n",
          "difficulty": null,
          "id": "proj_openastronomy_2020_010",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5795527741931520/",
          "proposal_id": null,
          "short_description": "The main objective of the proposal is to add the features to develop a Specialized Orbit and to incorporate a library of Surveillance and Recognition...",
          "slug": "designing-a-specialized-orbit-and-implementing-geometries-for-surveillance-and-reconnaissance-capabilities",
          "status": "completed",
          "student_name": "Meuge",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Designing a Specialized Orbit ​and Implementing Geometries for Surveillance and Reconnaissance Capabilities"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2020/organizations/4577601315667968/"
    },
    "year_2021": {
      "num_projects": 8,
      "projects": [
        {
          "code_url": "https://suyog20.blogspot.com/2021/08/astropygsoc-blog-post-65-week-10-final.html",
          "description": "<p>Astropy is a massive Python library providing methods and general purpose tools for processing and analysis of data generated in astronomy and related fields. It is widely used by researchers and the scientific community at large. One important feature of Astropy is reading and writing tabular data in a wide variety of useful formats. One such astronomical data storage format is the CDS-ASCII format employed by Centre de Données astronomiques de Strasbourg (CDS) for maintaining its VizieR catalog. Currently Astropy only supports reading data from a CDS-ASCII table and not writing to it. The present project is meant to address this issue by adding a CDS-ASCII writer to Astropy. CDS already has an available package to generate standardized ASCII tables for submission of data to its catalog. The proposed Astropy CDS-ASCII writer can be based on the methods used by that package.</p>\n",
          "difficulty": null,
          "id": "proj_openastronomy_2021_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5365547692195840/",
          "proposal_id": null,
          "short_description": "Astropy is a massive Python library providing methods and general purpose tools for processing and analysis of data generated in astronomy and...",
          "slug": "add-a-cds-ascii-writer-to-astropy",
          "status": "completed",
          "student_name": "Suyog Garg",
          "student_profile": null,
          "tags": [
            "python",
            "ai"
          ],
          "title": "Add a CDS-ASCII writer to astropy"
        },
        {
          "code_url": "https://adwaitbhope.medium.com/google-summer-of-code-work-product-submission-b35a6c6cba33",
          "description": "<p><code>ndcube</code> is a package that lets users combine multi-dimensional astronomical data with their corresponding real-world physical coordinates. WCS transformations are used to make this conversion. <code>ndcube</code> provides a powerful technique to couple them together so that researchers can tinker with their data while being assured that the underlying transformations remain consistent with any operations they perform.</p>\n<p>This project aims to add support for resampling n-dimensional data. Essentially, it means that users will be able to upsample or downsample the resolution of their data based on their specific needs. They will be able to map it on a different grid that better suits their research requirements. Just like with existing operations such as slicing, this project will ensure that resampling an <code>NDCube</code> will modify the underlying WCS transformations and other attached parameters, to make it always remain consistent with the data.</p>\n",
          "difficulty": null,
          "id": "proj_openastronomy_2021_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/4594065231839232/",
          "proposal_id": null,
          "short_description": "ndcube is a package that lets users combine multi-dimensional astronomical data with their corresponding real-world physical coordinates. WCS...",
          "slug": "adding-support-for-resampling-data-with-ndcube",
          "status": "completed",
          "student_name": "Adwait Bhope",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Adding Support for Resampling Data with NDCube"
        },
        {
          "code_url": "https://github.com/radis/radis/projects/5",
          "description": "<p>Radis is a fast line-by-line code used to synthesize high-resolution infrared molecular spectra and a post-processing library to analyze spectral lines. It can synthesize absorption and emission spectrum for multiple molecular species at both equilibrium and non-equilibrium conditions. Radis uses two methods for computing Spectrum that are Legacy and DLM.</p>\n<p>The goal of this project is to derive an equation (R) comprising of all the parameters that can affect the performance for calculating Voigt broadening by running a number of benchmarks for different parameters involved in the calculation of lineshapes to check their significance in computation time. Then we need to find the critical value for the derived equation (<code>Rc</code>) which will tell us which optimization technique to select based on the computed <code>R</code> value in calc_spectrum().</p>\n",
          "difficulty": null,
          "id": "proj_openastronomy_2021_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6093171255148544/",
          "proposal_id": null,
          "short_description": "Radis is a fast line-by-line code used to synthesize high-resolution infrared molecular spectra and a post-processing library to analyze spectral...",
          "slug": "automatic-lineshape-engine",
          "status": "completed",
          "student_name": "Anand Kumar",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "Automatic Lineshape Engine"
        },
        {
          "code_url": "https://dhruv9vats.github.io/gsoc-2021/",
          "description": "<p>Time series analysis has become a fundamental ingredient in modern-day astronomical studies. A common approach for characterizing the properties of time-series data is to estimate the power spectrum of the data using the periodogram. But the periodogram as an estimate suffers from being:</p>\n<ul>\n<li>Statistically inconsistent (does not converge to zero with infinite data)</li>\n<li>Biased for finite samples</li>\n<li>Suffers from spectral leakage</li>\n</ul>\n<p>This project aims to implement and integrate a superior spectral estimation technique, known as the Multitaper Periodogram, into Stingray. It, as an estimate, is attractive because it directly trades off bias and variance for frequency resolution; it is consistent; and is fast to compute.</p>\n<p>This integration would follow the library’s existing design principles so its current users can use this technique to better interpret their time-series data.</p>\n<p>The tapers, or data windows, applied to the data in the time domain before Fourier transforming are characterized as being the most nearly band-limited functions possible among functions defined on a finite time domain. These are the discrete prolate spheroidal sequences (DPSS), or the Selpians, and help reduce spectral leakage.</p>\n",
          "difficulty": null,
          "id": "proj_openastronomy_2021_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/4864586733322240/",
          "proposal_id": null,
          "short_description": "Time series analysis has become a fundamental ingredient in modern-day astronomical studies. A common approach for characterizing the properties of...",
          "slug": "integrating-multitaper-periodogram-into-stingray",
          "status": "completed",
          "student_name": "Dhruv Vats",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Integrating Multitaper Periodogram into Stingray"
        },
        {
          "code_url": "https://jeffrey-paul2000.medium.com/gsoc-2021-final-report-87f74dd364df",
          "description": "<p><strong>SunPy</strong> allows visualization of spatially-aware data by means of Map objects. These objects have extensive 2D visualization capabilities for plotting various coordinate objects. \nThis project primarily focuses on extending these various plotting and visualization capabilities of <strong>SunPy's</strong> Map objects into 3D by the use of <strong>PyVista</strong>, a 3D plotting interface for the Visualization Tool Kit (VTK). \nThe project also focuses on writing extensive documentation and testing the functionality of the code along with the integration of plotting magnetic field lines from <strong>PfssPy</strong> as well.</p>\n",
          "difficulty": null,
          "id": "proj_openastronomy_2021_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/4879804070887424/",
          "proposal_id": null,
          "short_description": "SunPy allows visualization of spatially-aware data by means of Map objects. These objects have extensive 2D visualization capabilities for plotting...",
          "slug": "3d-plotting",
          "status": "completed",
          "student_name": "Jeffrey Paul",
          "student_profile": null,
          "tags": [],
          "title": "3D Plotting"
        },
        {
          "code_url": "https://raj-rashmi741.medium.com/google-summer-of-code-final-evaluation-578c0088bcbd",
          "description": "<p>The statistical inference of properties of astronomical objects can be done using parametric modelling of Fourier products and light curves including common algorithms for time series. Introduction of current state-of-the-art methods for stochastic systems using automatic differentiation, variational inference can make the analysis of periodograms efficient and robust.\nIn regard to (<a href=\"https://github.com/StingraySoftware/stingray/issues\" target=\"_blank\">https://github.com/StingraySoftware/stingray/issues</a>), the first goal of this project is to add automatic differentiation and modern optimization algorithms to increase the robustness of the existing infrastructure. The second goal is to extend the existing infrastructure to facilitate building fully probabilistic models using PyMC3/Tensorflow packages.</p>\n",
          "difficulty": null,
          "id": "proj_openastronomy_2021_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5944567097982976/",
          "proposal_id": null,
          "short_description": "The statistical inference of properties of astronomical objects can be done using parametric modelling of Fourier products and light curves including...",
          "slug": "modern-statistical-modeling-in-stingray",
          "status": "completed",
          "student_name": "Rashmi Raj",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "Modern Statistical Modeling in Stingray"
        },
        {
          "code_url": "https://github.com/radis/radis/projects/4",
          "description": "<p>RADIS is a fast line-by-line code for synthesizing and fitting infrared absorption and emission spectra such as encountered in laboratory plasmas or exoplanet atmospheres. It uses a line-by-line approach, where each absorption or emission line of a molecule is computed by accounting for the influence of environmental parameters. Even though the current implementation can compute high-temperature spectra of millions of lines in just a few seconds it is quite memory hungry. In order to be able to run computations on high-temperature infrared spectra from databases of tens of millions of lines, it is essential to optimize memory consumption in a way that it is possible for us to run reasonably large data on a regular machine (one that has 8 - 16 GB of RAM). RADIS uses Pandas dataframe for handling all the databases currently. Pandas rule of thumb: have 5 to 10 times as much RAM as the size of the dataset. Which makes it impossible to read say a database of size 5GB on a machine with a RAM of 16GB. The goal of this project would be to reduce the memory usage of the current calculations, which would make it possible to compute spectral databases of up to billions of lines.</p>\n",
          "difficulty": null,
          "id": "proj_openastronomy_2021_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6007392973619200/",
          "proposal_id": null,
          "short_description": "RADIS is a fast line-by-line code for synthesizing and fitting infrared absorption and emission spectra such as encountered in laboratory plasmas or...",
          "slug": "reduce-memory-usage-radis",
          "status": "completed",
          "student_name": "Gagan Aryan",
          "student_profile": null,
          "tags": [
            "database",
            "ui"
          ],
          "title": "Reduce Memory Usage - Radis"
        },
        {
          "code_url": "https://ndanzanello.wordpress.com/2021/08/21/gsoc/",
          "description": "<p>Astrometry is of fundamental importance in processing astronomical data. It involves the precise measurement of the coordinates of celestial bodies. The applications range from extrasolar planet detection to tracking near-Earth objects.</p>\n<p>The goal of the project is to get an astronomical image and convert its pixel coordinates to sky coordinates without any prior information about the input image’s location. It’s a very important feature because it allows astronomers to analyze images coming directly from telescopes as these images don’t have any information about the sky coordinates. Hence, it is the basis for almost all subsequent astrophysical analysis of the image, creating an important feature which can be used in a variety of programs</p>\n",
          "difficulty": null,
          "id": "proj_openastronomy_2021_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6311790828322816/",
          "proposal_id": null,
          "short_description": "Astrometry is of fundamental importance in processing astronomical data. It involves the precise measurement of the coordinates of celestial bodies....",
          "slug": "astrometry-gnuastro",
          "status": "completed",
          "student_name": "Natáli Anzanello",
          "student_profile": null,
          "tags": [],
          "title": "Astrometry - Gnuastro"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2021/organizations/6276607395758080/"
    },
    "year_2022": {
      "num_projects": 8,
      "projects": [
        {
          "code_url": "https://medium.com/@akash5100/google-summer-of-code-2022-building-testing-and-wrapping-helioviewer-api-in-a-python-package-f51ba6566f71",
          "description": "The Helioviewer Project is developing a suite of technologies that allow users around the world to visualize, browse and access these heterogeneous datasets in a highly customizable fashion. They do so by providing public APIs to the developers. In sunpy, we can query to Helioviewer API to get those data, with the help of a HelioviewerClient instance that can be used to make HTTP requests and manipulate the results as required.\nThe current HelioviewerClient in sunpy does not offer full access to the Helioviewer API and is limited to a few endpoints. \nBut the Helioviewer API has a huge number of endpoints that provide different functionality, the current implementation doesn’t integrate with Fido (sunpy’s search and download interface) and the HelioviewerClient doesn’t belong to sunpy’s core and needs to be moved out of the codebase.\nThis project will we wrapping every aspect of Helioviewer API in a Python package and extend its support to Fido with the help of a new client.",
          "difficulty": null,
          "id": "proj_openastronomy_2022_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/HXCZO14B/",
          "proposal_id": null,
          "short_description": "The Helioviewer Project is developing a suite of technologies that allow users around the world to visualize, browse and access these heterogeneous...",
          "slug": "sunpy-helioviewer-python-api-wrapper",
          "status": "completed",
          "student_name": "Akash Verma",
          "student_profile": null,
          "tags": [
            "python",
            "api",
            "ui"
          ],
          "title": "[SunPy] HelioViewer Python API Wrapper"
        },
        {
          "code_url": "https://mihirtripathi97.github.io/GSoC-22/",
          "description": "Stingray is a python package that provides a common platform for time series analysis of X-ray data to the astronomy community. One important aspect of time series analysis of astronomical sources is to identify and characterize their variability from their light curves. The light curves of these sources are affected by spurious variability from variable backgrounds and gaps due to occultation or inaccessibility of the source. This causes data to be affected by Poissonian uncertainties. In the case of sources that are near to detection limit of telescope, these uncertainties are dominant.\n\nBayesian Excess Variance (Bexvar) is a statistical method to measure variability in Poisson-distributed data. The method has been developed to analyze X-Ray light curves of faint sources observed by eROSITA telescope. Bexvar is a Bayesian formulation of the excess variance method.\n\nThe aim of this project is to implement this method in Stingray, create test cases for the method based on real observational data and write appropriate documentation.",
          "difficulty": null,
          "id": "proj_openastronomy_2022_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/rG1XqJqK/",
          "proposal_id": null,
          "short_description": "Stingray is a python package that provides a common platform for time series analysis of X-ray data to the astronomy community. One important aspect...",
          "slug": "bayesian-excess-variance-bexvar-in-stingray",
          "status": "completed",
          "student_name": "Mihir Tripathi",
          "student_profile": null,
          "tags": [
            "python",
            "ai"
          ],
          "title": "Bayesian Excess Variance (Bexvar) in Stingray"
        },
        {
          "code_url": "https://github.com/radis/radis/projects/7",
          "description": "Radis is a line-by-line code for creating high-resolution infrared molecular spectra,\nas well as a post-processing library for analyzing spectral lines. Currently, in RADIS all calculations are done assuming that the molecule is present in air diluent. RADIS currently supports the calculation of nearly every possible molecule, but by default assumes that it is diluted in air.\n\nThe project goal is to automate it and expand it to multiple diluents (for instance: CO diluted in CO2 and H2O).",
          "difficulty": null,
          "id": "proj_openastronomy_2022_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/u0MSV3iB/",
          "proposal_id": null,
          "short_description": "Radis is a line-by-line code for creating high-resolution infrared molecular spectra, as well as a post-processing library for analyzing spectral...",
          "slug": "non-air-diluent",
          "status": "completed",
          "student_name": "Supriya_Kumari",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Non-Air Diluent"
        },
        {
          "code_url": "https://medium.com/@aman_p/gsoc-blog-4-final-submission-1c27a20f13a2",
          "description": "Time series analysis of astronomical data provides various tools to test advanced physical theories. This project seeks to implement a basic set of operations for X-Ray timing analysis in Julia. Although the Stingray python package already contains most of these tools, a Julian implementation has the potential to be faster and more flexible due to its multiple dispatch feature. \nI will start by creating a basic series of unit tests the code needs to pass, then implement core features from Stingray like LightCurves and EventLists, and move on to implementing power and cross spectra with different types of inputs. After implementing time lag and coherence, if the time permits, I will analyse and try to implement a basic variability vs energy spectra. Proper documentation and weekly blogs are other deliverables in this project.",
          "difficulty": "advanced",
          "id": "proj_openastronomy_2022_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/M1uhkggE/",
          "proposal_id": null,
          "short_description": "Time series analysis of astronomical data provides various tools to test advanced physical theories. This project seeks to implement a basic set of...",
          "slug": "spectral-timing-in-julia",
          "status": "completed",
          "student_name": "Aman Pandey",
          "student_profile": null,
          "tags": [
            "python",
            "ai"
          ],
          "title": "Spectral Timing in Julia"
        },
        {
          "code_url": "https://github.com/suzil/radis-app/projects/4",
          "description": "RADIS app is a web app for high-resolution infrared molecular spectra using RADIS. The goal of this project is to provide an easy-to-use UI instead of writing code. Currently, the RADIS app has a simple interface with basic functionalities that helps create a nice spectral graph using certain parameters but there is a lot of scope for improvements.\n\nThe goal of this project is to create a more responsive app while improving and implementing new features and fixing various issues.",
          "difficulty": "beginner",
          "id": "proj_openastronomy_2022_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/zeRQC6zF/",
          "proposal_id": null,
          "short_description": "RADIS app is a web app for high-resolution infrared molecular spectra using RADIS. The goal of this project is to provide an easy-to-use UI instead...",
          "slug": "radis-app-improvement",
          "status": "completed",
          "student_name": "Arunava Basu",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "ui"
          ],
          "title": "Radis App Improvement"
        },
        {
          "code_url": "https://github.com/radis/radis/projects/8",
          "description": "RADIS is a fast, line-by-line code for the computation of molecular absorption and emission spectra. It is built around the HITRAN, HITEMP, and CDSD databases for molecules in their electronic ground state. The algorithm of RADIS is very CPU/GPU efficient, but the RADIS code is still memory-hungry, due to the main computations taking place in the Pandas library. \nThis project will be a continuation of 2021's project \"Reduce Memory Usage,\" completed by Gagan Aryan.\nThe main aim of the project is to work on the current memory bottlenecks in RADIS in order to reduce the amount of memory used in calculations and reduce the amount of memory used by dataframes. We also need to move the main computations from Pandas to Vaex, which is generally faster with the bigger datasets that are currently being used in RADIS and also implements memory-mapping.",
          "difficulty": null,
          "id": "proj_openastronomy_2022_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/PBwWxVhk/",
          "proposal_id": null,
          "short_description": "RADIS is a fast, line-by-line code for the computation of molecular absorption and emission spectra. It is built around the HITRAN, HITEMP, and CDSD...",
          "slug": "performance-tweaks-in-radis",
          "status": "completed",
          "student_name": "Sagar Chotalia",
          "student_profile": null,
          "tags": [
            "ai",
            "database",
            "ui"
          ],
          "title": "Performance Tweaks in RADIS"
        },
        {
          "code_url": "https://jash-shah.github.io/Blogs/2022/07/20/Final-GSoC-Submission.html",
          "description": "Gnuastro is primarily written in C because astronomical datasets are large and thus need to be efficient with few dependencies. Therefore, its most commonly used interface are Gnuastro’s command-line programs. However, Gnuastro’s also has an extensive set of installed, dynamic C/C++ libraries, which are the actually beating heart of the programs. On the other hand, many projects today are done in Python, almost excuslively using Numpy for their numerical operations (like data arrays). \nPython and Numpy are actually written in C, therefore they have very well-defined interfaces for communicating with installed C libraries, using CPython. Since both Gnuastro and Numpy's core data structure are very similar, we plan on building a converter between the two. This will make it possible to perform all data operations using Numpys C-API. This will be followed by adding a low-level wrapper infra-structure which will allow easy usage of Gnuastro’s powerful libraries in Python.\nThus, the final goal is to have Gnuastro be an importable module in Python (just like Numpy) and have all the inner data operations of Gnuastro be performed using Numpy's C-API.",
          "difficulty": "beginner",
          "id": "proj_openastronomy_2022_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/8xPSxHSE/",
          "proposal_id": null,
          "short_description": "Gnuastro is primarily written in C because astronomical datasets are large and thus need to be efficient with few dependencies. Therefore, its most...",
          "slug": "gnuastro-library-in-python",
          "status": "completed",
          "student_name": "Jash Shah",
          "student_profile": null,
          "tags": [
            "python",
            "api",
            "ui"
          ],
          "title": "Gnuastro Library in Python"
        },
        {
          "code_url": "https://github.com/radis/radis/projects/6",
          "description": "RADIS is a fast line-by-line code featuring synthesis, processing and analysis of high-resolution infrared absorption and emission molecular spectra, under both equilibrium and nonequilibrium conditions. The goal of this project is to improve the RADIS fitting process to reduce the fitting time, by optimizing its models, fitting methods and other features under different reference cases.\n\nTo accomplish this, we create a massive database of labelled spectra as reference cases, run various benchmarks with different fitting settings to evaluate their impact on fitting performance, and finally implement the best acceptable settings into RADIS codebase.\n\nThis project also features enhancement of fitting process by implementing RADIS native features such as caching spectra, local databases, and GPU-augmented calculation.",
          "difficulty": null,
          "id": "proj_openastronomy_2022_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/BSZuXNeN/",
          "proposal_id": null,
          "short_description": "RADIS is a fast line-by-line code featuring synthesis, processing and analysis of high-resolution infrared absorption and emission molecular spectra,...",
          "slug": "radis-spectrum-fitting-improvement",
          "status": "completed",
          "student_name": "Tran Huu Nhat Huy",
          "student_profile": null,
          "tags": [
            "database",
            "ui"
          ],
          "title": "[RADIS] Spectrum Fitting Improvement"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2022/organizations/openastronomy/"
    },
    "year_2023": {
      "num_projects": 6,
      "projects": [
        {
          "code_url": "https://gist.github.com/exitflynn/3a8db95de7208456464db8c8b71b9b1d",
          "description": "The Scraper class in SunPy retrieves solar data from web sources using efficient file organization. The current implementation uses regex for the core functionality which limits the use-cases and has made the class difficult to maintain. The project aims to re-implement the Scraper to use parse instead and make it easier to work with. The goal also involves implementing newer functionality while keeping the same API for the rewritten parts.",
          "difficulty": null,
          "id": "proj_openastronomy_2023_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/2Gxxa7qS",
          "proposal_id": "okUQ9HFX",
          "short_description": "The Scraper class in SunPy retrieves solar data from web sources using efficient file organization. The current implementation uses regex for the...",
          "slug": "scraper-redesign",
          "status": "completed",
          "student_name": "Akshit Tyagi",
          "student_profile": null,
          "tags": [
            "web",
            "api",
            "ai"
          ],
          "title": "Scraper Redesign"
        },
        {
          "code_url": "https://gaurav17joshi.github.io/contrast/project-report/",
          "description": "Some of the most extreme and mysterious events in the universe like neutron star mergers, black hole accretions, and gamma-ray bursts are studied by the high energy radiations that they emit. Among all the brightness variations we can study in these sources, periodic and quasi-periodic oscillations are among the most interesting, because they can provide insights into the astrophysical processes in these objects. While the stingray package is a valuable tool for analyzing periodic data, its analysis of quasi-periodic data is limited by biases in frequency domain methods. To mitigate these limitations, a Gaussian process regression (a time domain method) can be used to model the time series for a kernel describing a QPO. Using Bayesian Inferencing, we can infer its parameters and assign them physical meaning related to the physics of the process and perform model selection between QPOs and alternative models. This can be used to reliably detect QPOs, and infer their physical properties. Such methods have already been implemented in recent papers (Huebner et al,2022), and the goal of this project will be to simplify their code and implement it in Stingray using the Tinygp library for the GP backend. It will also be accompanied by a tutorial and a demonstration on various datasets.",
          "difficulty": null,
          "id": "proj_openastronomy_2023_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/SXhGaPQt",
          "proposal_id": "RQvWqkhv",
          "short_description": "Some of the most extreme and mysterious events in the universe like neutron star mergers, black hole accretions, and gamma-ray bursts are studied by...",
          "slug": "quasi-periodic-oscillation-detection-using-gaussian-processes",
          "status": "completed",
          "student_name": "Gaurav17Joshi",
          "student_profile": null,
          "tags": [
            "ai",
            "backend"
          ],
          "title": "Quasi Periodic Oscillation detection using Gaussian Processes"
        },
        {
          "code_url": "https://labeeb-7z.github.io/Blogs/2023/08/22/Final-Report.html",
          "description": "Gnuastro is mainly written in the C, so are Python and Numpy. Utilising this fact, pyGnuastro uses Python wrappers to access the base C library while providing a converter between the Gnuastro and Numpy core data structure using Cpython. The project will extend pyGnuastro with additional module, a core data structure and develop a new error mechanism, to ensure accurate reporting in the Python interface. The new method will store the errors in a stack of linkedlist and share it with the caller rather then exiting the program which closes the Python shell.\n\nAdditionally, this project will extend Gnuastro to leverage GPU compute by incorporating CUDA modules for the corresponding C modules to offload the computationally intensive duties that GPUs can greatly assist with. NVCC and GCC will compile CUDA and C modules, respectively, with GCC performing the final linking and building of shared libraries(Gnuastro).",
          "difficulty": null,
          "id": "proj_openastronomy_2023_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/pwivQF02",
          "proposal_id": "2UpBkwUs",
          "short_description": "Gnuastro is mainly written in the C, so are Python and Numpy. Utilising this fact, pyGnuastro uses Python wrappers to access the base C library while...",
          "slug": "gnuastro-python-library-and-cuda-integration",
          "status": "completed",
          "student_name": "Labib Asari",
          "student_profile": null,
          "tags": [
            "python",
            "ai",
            "ui"
          ],
          "title": "Gnuastro Python Library and Cuda Integration"
        },
        {
          "code_url": "https://medium.com/@menasrac/the-end-of-my-google-summer-of-code-journey-8d31f989f0e6?source=friends_link&sk=2a32424a4ae65c56591f4c182b5cc82d",
          "description": "RADIS can handle different databases such as HITRAN, HITEMP, EXOMOL, GEISA, etc. Another open-source code, called EXOJAX, exchanged portions of code with RADIS until some parts of both codes became very similar. Currently, a database API is written in the RADIS code. The main goal of the current project is to improve this common API to download and manage databases. The mentee will not start from scratch because the community already worked on the problem and set up a frame for this big merge of code built around a DatabaseManager class.",
          "difficulty": null,
          "id": "proj_openastronomy_2023_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/rKho4M6m",
          "proposal_id": "cN92tWq3",
          "short_description": "RADIS can handle different databases such as HITRAN, HITEMP, EXOMOL, GEISA, etc. Another open-source code, called EXOJAX, exchanged portions of code...",
          "slug": "common-api-for-large-molecular-databases",
          "status": "completed",
          "student_name": "menasrac",
          "student_profile": null,
          "tags": [
            "api",
            "ai",
            "database",
            "ui"
          ],
          "title": "Common API for large molecular databases"
        },
        {
          "code_url": "https://medium.com/@1someshverma/gsoc23-openastronomy-radis-implementing-out-of-core-calculations-c67a3863c0d6",
          "description": "RADIS  is a fast line-by-line code for synthesizing and fitting infrared absorption and emission spectra, such as encountered in laboratory plasmas or exoplanet atmospheres. It uses a line-by-line approach, where each absorption or emission line of a molecule is computed by accounting for the influence of environmental parameters. High-temperature spectral calculations require resolving the shape of tens of millions of lines, which is the usual performance bottleneck. RADIS implements a new algorithm to compute these lineshapes and is already one of the fastest line-by-line spectral codes available. It can also compute many different types of spectra (absorption/emission/equilibrium / non-equilibrium). \n\nHowever, although the algorithm is very CPU/GPU efficient, the RADIS code is still memory hungry. Databases are currently loaded in RADIS using the VAEX [3] package, but the operations to calculate the spectra are performed using the PANDAS library. VAEX is a similar table management tool to PANDAS but uses memory mapping, a zero-memory copy policy, and lazy computations for the best performance. \n\n The main goal of the current project is to refactor RADIS so that dataframes are only manipulated via the VAEX format. Potentially, this work would make it possible to compute spectral databases of up to billions of lines (hundreds of GB or terabyte-scale databases).",
          "difficulty": null,
          "id": "proj_openastronomy_2023_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/pnYY9W0j",
          "proposal_id": "dBbl65rT",
          "short_description": "RADIS is a fast line-by-line code for synthesizing and fitting infrared absorption and emission spectra, such as encountered in laboratory plasmas or...",
          "slug": "out-of-core-calculations-to-reduce-memory-usesradis",
          "status": "completed",
          "student_name": "Somesh Verma",
          "student_profile": null,
          "tags": [
            "ai",
            "database",
            "ui"
          ],
          "title": "Out of Core Calculations to reduce memory uses[RADIS]"
        },
        {
          "code_url": "https://pupperemeritus.github.io/gsoc_blog/projectreport/",
          "description": "Stingray is a python package that provides X-ray spectral timing analysis tools to \nthe community of astronomers around the world. X-ray data may not always be evenly spaced. For example when Earth regularly blocks the object of interest as the space telescope orbits the Earth or when the instrument has faults due to system malfunction or cosmic rays hitting the instrument sensors. When the data is evenly spaced, we can use the Fourier domain methods such as power spectrum and cross spectrum in practical time frames to decompose the signal into its various periodic elements. But when the data is unevenly spaced we cannot use the same methods.\n\nLomb Scargle Periodograms and Cross Spectra can be used for analyzing unevenly spaced data. There are various ways to optimize the Lomb Scargle Periodogram's runtime speed such as those introduced by William H. Press and George B. Rybicki.\n\nDeliverables include Lomb Scargle Power Spectrum, Lomb Scargle Cross Spectrum, helper functions(to setup an object with certain inputs for example) and statistical functions(like time lags and phase lags).",
          "difficulty": null,
          "id": "proj_openastronomy_2023_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/C8Rwdz3J",
          "proposal_id": "Hs1DGS5u",
          "short_description": "Stingray is a python package that provides X-ray spectral timing analysis tools to the community of astronomers around the world. X-ray data may not...",
          "slug": "astronomy-using-unevenly-sampled-data",
          "status": "completed",
          "student_name": "Sri Guru Datta Pisupati",
          "student_profile": null,
          "tags": [
            "python",
            "ai"
          ],
          "title": "Astronomy using Unevenly Sampled Data"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2023/organizations/openastronomy"
    },
    "year_2024": {
      "num_projects": 8,
      "projects": [
        {
          "code_url": "https://deadspheroid.github.io/my-blog/post/FinalReport/",
          "description": "GNU Astronomy Utilities (Gnuastro) is an astronomical data processing package containing a dynamically linked library as well as command-line programs for high-level access. Astronomical data can be large and most operations highly parallelizable. Until now, only CPU parallelization has been implemented in Gnuastro, but not yet on GPUs. GPUs are special hardware which are specifically designed for such operations and can significantly reduce the overall execution time significantly for specific tasks.\n\nThis project aims at introducing a robust low level OpenCL integration to Gnuastro allowing common tasks, such as convolutions to be executed on both GPU and CPU in a parallel fashion.",
          "difficulty": null,
          "id": "proj_openastronomy_2024_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/ehBYTrDa/",
          "proposal_id": null,
          "short_description": "GNU Astronomy Utilities (Gnuastro) is an astronomical data processing package containing a dynamically linked library as well as command-line...",
          "slug": "opencl-integration-with-gnuastro",
          "status": "completed",
          "student_name": "Warren Jacinto",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "OpenCL Integration with GNUAstro"
        },
        {
          "code_url": "https://www.kartikmandar.com/gsoc-2024/stingray-explorer",
          "description": "This proposal outlines the development of an innovative dashboard utilizing the Stingray library for X-ray astronomy analysis. The Quicklook Dashboard aims to facilitate the exploration of astronomical data by providing interactive tools for the visualization of light curves, periodograms, spectral colors etc. \nThis project would make it much simpler for astronomers to focus on the problem at hand and reading the results of the data analysis techniques (of Stingray) and not go on to input one command after another. It would reduce the time invested in making the analysis work and even who are novice to command line tools to gain the benefits of Stingray. \nThe proposed solution involves creating a web-based dashboard that streamlines the process of data visualization and analysis. The dashboard will have predefined (parameter can be edited by users) functions that users can choose to analyse the data and get the required plots in the dashboard itself. \nThe aim is also to educate novice users/ UG-PG students to get to know about how the analysis is being done. Technologies used are: python, flask, bokeh, holoviz, HTML/TailwindCSS, vanillaJS/React.JS\n\nIf time permits, the project is open to make it the start for an interactive analysis interface.",
          "difficulty": null,
          "id": "proj_openastronomy_2024_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/rba4Di99/",
          "proposal_id": null,
          "short_description": "This proposal outlines the development of an innovative dashboard utilizing the Stingray library for X-ray astronomy analysis. The Quicklook...",
          "slug": "a-quicklook-dashboard-for-x-ray-astronomy-with-stingray",
          "status": "completed",
          "student_name": "Kartik Mandar",
          "student_profile": null,
          "tags": [
            "react",
            "python",
            "web",
            "ml",
            "ai"
          ],
          "title": "A Quicklook Dashboard for X-ray Astronomy with Stingray"
        },
        {
          "code_url": "https://medium.com/@manitsingh018/during-gsoc-2024-i-made-several-key-contributions-to-the-sunpy-soar-project-6fe71e4df084",
          "description": "The project aims to enhance the metadata support in sunpy-soar, enabling better searching and filtering of solar data in the Solar Orbiter Archive (SOAR). Currently, sunpy-soar offers only basic metadata, such as SOOP name, time, and level. However, there is a wealth of additional data in SOAR that is not yet accessible through sunpy-soar.\n\nTo address this, we propose adding support for various tables in SOAR, such as v_<ll/sc>data_item, v<ll/sc>repository_file, and v<instrument>_<ll/sc>_fits. These tables contain valuable metadata like filenames, filesize, sensors, and instrument-specific data. By implementing these tables, users will be able to access a broader range of metadata in sunpy-soar.\n\nAdditionally, we plan to enable querying multiple tables simultaneously to retrieve more comprehensive metadata. This involves updating the sunpy-soar/client module to support constructing queries with metadata from different tables. We will also refine the sunpy-soar/attrs module to handle new metadata attributes efficiently.\n\nOverall, the deliverables encompass the entire process of updating and enhancing metadata support in sunpy-soar, from implementation to documentation, ensuring that users can effectively utilize the improved functionality for solar data exploration.",
          "difficulty": null,
          "id": "proj_openastronomy_2024_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/eJMtHgDq/",
          "proposal_id": null,
          "short_description": "The project aims to enhance the metadata support in sunpy-soar, enabling better searching and filtering of solar data in the Solar Orbiter Archive...",
          "slug": "sunpy-enhancing-metadata-support-for-soar-in-sunpy-soar",
          "status": "completed",
          "student_name": "Nucleon",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "[SUNPY] Enhancing Metadata Support for SOAR in sunpy-soar"
        },
        {
          "code_url": "https://viciouseagle03.github.io/post/gsoc-pr_merged/",
          "description": "This proposal aims to enable the storage and retrieval of NDCube objects using the ASDF file format. Currently, ndcube lacks native support for saving NDCube objects to files and loading them back, limiting its usability. To address this, the project will implement converters and schema definitions for NDCube objects and related classes ensuring compatibility with ASDF. By leveraging ASDF's flexible structure and support for complex metadata, this project will enable seamless storage and retrieval of NDCube objects with their associated metadata, enhancing reproducibility and data management. Essentially, this project will enable any NDCube object to be saved to an ASDF file and loaded back in, making ndcube more user-friendly and improving how data is handled.",
          "difficulty": "advanced",
          "id": "proj_openastronomy_2024_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/gH1PCN1H/",
          "proposal_id": null,
          "short_description": "This proposal aims to enable the storage and retrieval of NDCube objects using the ASDF file format. Currently, ndcube lacks native support for...",
          "slug": "sunpy-serialization-of-ndcube-classes-to-asdf",
          "status": "completed",
          "student_name": "PiyushSharma",
          "student_profile": null,
          "tags": [
            "ml",
            "ai"
          ],
          "title": "[SunPy] Serialization of NDCube classes to ASDF"
        },
        {
          "code_url": "https://code29563.github.io/A-summary/",
          "description": "Adding support for calculating and analysing spectra from atomic databases to RADIS and building a user-friendly Common API with ExoJAX for interacting with supported databases.",
          "difficulty": null,
          "id": "proj_openastronomy_2024_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/qdMcDOud/",
          "proposal_id": null,
          "short_description": "Adding support for calculating and analysing spectra from atomic databases to RADIS and building a user-friendly Common API with ExoJAX for...",
          "slug": "common-api-for-large-molecular-databases",
          "status": "completed",
          "student_name": "kemvore",
          "student_profile": null,
          "tags": [
            "api",
            "database",
            "ui"
          ],
          "title": "Common API for large molecular databases"
        },
        {
          "code_url": "https://github.com/OpenAstronomy/rnn-lightcurve-gapfill",
          "description": "In an era where astronomical discovery is more vibrant than ever, the significant role of data cannot be overstated. However, the diversity and complexity of these datasets often pose substantial challenges, hampering their full potential for insights. This project, under the Open Astronomy initiative and in partnership with NASA's Science Platform Initiative, proposes a novel approach to transcend these barriers using artificial intelligence (AI). The project aims to tackle the inherent challenges presented by the vast and diverse nature of astronomical datasets, including variations in temporal spans, wavelength coverages, resolutions, and depths, thereby facilitating a more cohesive and comprehensive approach to astronomical research.\n\nThe core objectives include the design and optimization of a deep learning architecture adept at processing and improving astronomical data, and conducting comprehensive testing on large samples of Active Galactic Nuclei (AGNs) to validate the effectiveness and reliability of the proposed model. Deliverables encompass a fully developed deep learning architecture, complete with documentation and guidelines for implementation and use in astronomical data analysis, and a detailed report outlining testing methodologies, results, and a comparative analysis of data quality before and after the application of the deep learning model.\n\nThis project not only represents a significant technical achievement but also fosters collaboration within the astronomical community, building bridges between data science and astronomy. My enthusiasm for data science, combined with a commitment to open-source collaboration, aligns perfectly with the values of OpenAstronomy and the NASA Science Platform Initiative, presenting a unique opportunity to deploy AI and data analysis skills in a manner that enriches astronomical research and advances our understanding of the universe.",
          "difficulty": "advanced",
          "id": "proj_openastronomy_2024_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/CR12H6Wf/",
          "proposal_id": null,
          "short_description": "In an era where astronomical discovery is more vibrant than ever, the significant role of data cannot be overstated. However, the diversity and...",
          "slug": "astronomical-data-enhancement-with-dl",
          "status": "completed",
          "student_name": "Lucas Martin Garcia",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Astronomical Data Enhancement with DL"
        },
        {
          "code_url": "https://github.com/sunpy/sunpy/pull/7619",
          "description": "Sunpy provides access to solar features and events held by the Heliophysics Event Knowledgebase (HEK). Features and events include type, physical extent, location, lifetime, etc. However, the current implementation of HEK features/events in Sunpy does not leverage the full use of sunpy, for instance, many features/events properties are not utilizing Astropy units or sunpy coordinates, despite the availability of adequate information within the HEK description to facilitate this integration.\n\nThis project will be built upon the groundwork laid by a previous GSoC Project, providing a solid foundation. Leveraging this existing work will streamline the project's scope.",
          "difficulty": null,
          "id": "proj_openastronomy_2024_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/uu0dMUN2/",
          "proposal_id": null,
          "short_description": "Sunpy provides access to solar features and events held by the Heliophysics Event Knowledgebase (HEK). Features and events include type, physical...",
          "slug": "sunpy-improved-solar-feature-and-event-representation",
          "status": "completed",
          "student_name": "Ahmed Hossam Mohamed",
          "student_profile": null,
          "tags": [
            "ml",
            "ai",
            "ui"
          ],
          "title": "[SUNPY] Improved solar feature and event representation"
        },
        {
          "code_url": "https://gist.github.com/Deus1704/c534d7452e4247765376e234a33149ca",
          "description": "The sunkit-image package provides a comprehensive suite of tools for processing solar images, tailored to the specific requirements of solar physicists, space weather analysts, and renewable energy researchers. In solar physics, precise processing and analysis of solar images are essential for studying phenomena like solar flares, coronal mass ejections, and solar wind patterns.  This project aims to address various pending issues in this domain, enhancing the effectiveness and efficiency of solar image processing methods.",
          "difficulty": null,
          "id": "proj_openastronomy_2024_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/v6Px1LFT/",
          "proposal_id": null,
          "short_description": "The sunkit-image package provides a comprehensive suite of tools for processing solar images, tailored to the specific requirements of solar...",
          "slug": "sunpy-improve-sunkit-image",
          "status": "completed",
          "student_name": "Jayraj Dulange",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "[SunPy] Improve sunkit-image"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2024/organizations/openastronomy/"
    },
    "year_2025": {
      "num_projects": 5,
      "projects": [
        {
          "code_url": null,
          "description": "This project will extend RADIS to calculate electronic spectra, enabling analysis of high-temperature phenomena in plasmas, flames, and exoplanet atmospheres. Currently, RADIS excels at rovibrational calculations but lacks electronic capabilities. This project will implement electronic spectroscopy in RADIS by leveraging existing ExoMol integration, adding separate electronic temperature parameters, implementing population distributions for electronic states, and creating functions for manual adjustment of electronic band intensities. Deliverables include OH electronic spectra with manual band adjustment capability, implementation of electronic temperature handling, non-equilibrium OH spectrum calculation, and extension to support electronic spectra for all ExoMol molecules. This enhancement will make RADIS a comprehensive spectroscopic tool capable of handling the full range of molecular transitions within a unified framework.",
          "difficulty": null,
          "id": "proj_openastronomy_2025_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/P7UQlBwc",
          "proposal_id": "XZKy7plx",
          "short_description": "This project will extend RADIS to calculate electronic spectra, enabling analysis of high-temperature phenomena in plasmas, flames, and exoplanet...",
          "slug": "electronic-spectra-for-radis",
          "status": "in-progress",
          "student_name": "Darshan Patil",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "Electronic spectra for RADIS"
        },
        {
          "code_url": null,
          "description": "This project aims to enhance Stingray.jl, the Julia-based implementation of the Stingray library, to advance X-ray timing analysis in high-energy astrophysics. The primary goal is to leverage Julia’s performance benefits to develop analysis tools and workflows that are challenging to implement efficiently in Python-based environments. Key contributions include creating robust frameworks for handling EventLists and Lightcurves, improving Fourier transform and periodogram modules, updating dependencies, and building reusable plotting recipes for power spectra and periodograms. An important aspect of the project is to enhance I/O operations for FITS files, thereby supporting both simulated and real datasets such as NICER observations.\n\nHaving already gained familiarity with the Stingray codebase through multiple pull requests—demonstrating contributions in event reading, data plotting, and cross-spectral analysis—the proposal builds on this solid foundation. With continued guidance from mentors and proactive community engagement, the work focuses on refining timing tools, integrating advanced analysis features like coherence spectra and energy-resolved variability, and ensuring a stable, scalable, and modular framework. The final deliverable will empower the astrophysics community by providing a cutting-edge toolset that streamlines complex timing analysis tasks and drives novel scientific insights.",
          "difficulty": "advanced",
          "id": "proj_openastronomy_2025_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/bDXTorET",
          "proposal_id": "IfDjxgAi",
          "short_description": "This project aims to enhance Stingray.jl, the Julia-based implementation of the Stingray library, to advance X-ray timing analysis in high-energy...",
          "slug": "time-series-analysis-in-stingrayjl",
          "status": "in-progress",
          "student_name": "Kashish Shrivastav",
          "student_profile": null,
          "tags": [
            "python",
            "ml",
            "ai",
            "ui"
          ],
          "title": "Time Series Analysis in Stingray.jl"
        },
        {
          "code_url": null,
          "description": "The project aims to create an interactive database for X-ray observations, enabling on-the-fly visualization of data products generated with the Stingray library. The final product will be a quick-look dashboard application that stores, analyzes, and organizes key data products from multiple observations, allowing the astrophysics research community to track and predict the evolution of black hole binaries. By removing the difficulties of traditional data processing procedures—which vary across missions—this tool simplifies the workflow, enabling astrophysicists to extract all data products with just one click. It also provides the functionality to study multiple data products from an observation in real time, offering a comprehensive view of these sources' phenomenology and ultimately enhancing the efficiency of scientific decision-making.",
          "difficulty": null,
          "id": "proj_openastronomy_2025_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/j5YJQN6s",
          "proposal_id": "mddnlYxD",
          "short_description": "The project aims to create an interactive database for X-ray observations, enabling on-the-fly visualization of data products generated with the...",
          "slug": "interactive-database-for-x-ray-observations",
          "status": "in-progress",
          "student_name": "MOHAMMAD ADNAN",
          "student_profile": null,
          "tags": [
            "ai",
            "database",
            "ui"
          ],
          "title": "Interactive Database for X-ray observations"
        },
        {
          "code_url": null,
          "description": "The RADIS app is a web application designed for high-resolution infrared molecular spectra using RADIS. Instead of requiring users to write code, this project focuses on developing an intuitive user interface (UI). It leverages RADIS internally to generate spectra, with its optimized algorithms enabling the computation of millions of spectral lines within minutes. However, certain enhancements are needed. This project aims to improve the user experience by introducing advanced features, modernizing the UI, optimizing performance through caching, and ensuring system reliability by establishing comprehensive test coverage.",
          "difficulty": "advanced",
          "id": "proj_openastronomy_2025_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/iYVASbTw",
          "proposal_id": "HVgjDmRn",
          "short_description": "The RADIS app is a web application designed for high-resolution infrared molecular spectra using RADIS. Instead of requiring users to write code,...",
          "slug": "radis-optimizing-radis-app",
          "status": "in-progress",
          "student_name": "Mohy Elden Khalid",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "ui"
          ],
          "title": "[RADIS] Optimizing Radis app"
        },
        {
          "code_url": null,
          "description": "The RADIS code was developed for the characterization of plasmas, flames and atmospheres. High-temperature spectral calculations are required to resolve the shape of tens of millions of lines, which is the usual performance bottleneck. RADIS implements a new algorithm to compute these lineshapes and is already one of the fastest line-by-line spectral codes available. It can also compute many different types of spectra (absorption/emission/equilibrium / non-equilibrium). In a typical calculation, a database of coefficients is loaded and these coefficients are multiplied according to physics laws to generate a set of line strengths in a spectrum. RADIS can also handle different molecular databases such as HITRAN, HITEMP, EXOMOL, and GEISA.\n\nWith more and more lines added to the databases, some files grew considerably in size. To be as fast as possible, RADIS convert compressed databases into the HDF5 format. This conversion also increases the size of the files which can take hours to be written in the hard drive (2-3 hours for HITEMP CO2 in its 2025 version). The objective of this project is to accelerate the parsing to HDF5 files.",
          "difficulty": null,
          "id": "proj_openastronomy_2025_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/va1YConE",
          "proposal_id": "YccBzIme",
          "short_description": "The RADIS code was developed for the characterization of plasmas, flames and atmospheres. High-temperature spectral calculations are required to...",
          "slug": "fast-parsing-of-large-databases-and-execution-bottlenecks",
          "status": "in-progress",
          "student_name": "Pratham Hole",
          "student_profile": null,
          "tags": [
            "ai",
            "database",
            "ui"
          ],
          "title": "Fast Parsing of Large Databases and Execution Bottlenecks"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2025/organizations/openastronomy"
    }
  },
  "first_time": false,
  "contact": {
    "email": "openastronomy.organization@gmail.com",
    "guide_url": "https://openastronomy.org/gsoc/student_guidelines.html",
    "ideas_url": "https://openastronomy.org/gsoc/gsoc2025/#/projects",
    "irc_channel": "https://openastronomy.element.io/#/room/#openastronomy:openastronomy.org",
    "mailing_list": "https://community.openastronomy.org/"
  },
  "social": {
    "blog": "https://openastronomy.org/Universe_OA/",
    "discord": null,
    "facebook": null,
    "github": null,
    "gitlab": null,
    "instagram": null,
    "linkedin": null,
    "mastodon": null,
    "medium": null,
    "reddit": null,
    "slack": null,
    "stackoverflow": null,
    "twitch": null,
    "twitter": "https://astrodon.social/@OpenAstronomy",
    "youtube": null
  },
  "meta": {
    "version": 1,
    "generated_at": "2026-01-25T15:28:53.861Z"
  }
}