{
  "id": "692251df53dd9d7326d33e4d",
  "slug": "open-healthcare-network",
  "name": "Open HealthCare Network",
  "category": "Science and medicine",
  "description": "Reimagining Healthcare Delivery",
  "image_url": "https://summerofcode.withgoogle.com/media/org/open-healthcare-network/eutslgqeknc9vlgd-360.png",
  "img_r2_url": "https://pub-268c3a1efc8b4f8a99115507a760ca14.r2.dev/open-healthcare-network.webp",
  "logo_r2_url": null,
  "url": "https://ohc.network/",
  "active_years": [
    2024,
    2025
  ],
  "first_year": 2024,
  "last_year": 2025,
  "is_currently_active": true,
  "technologies": [
    "python",
    "django",
    "react",
    "typescript",
    "NextJs"
  ],
  "topics": [
    "electronic medical records",
    "Digital Public Goods",
    "Telemedicine and Remote Care",
    "AI in Health",
    "HMIS"
  ],
  "total_projects": 9,
  "stats": {
    "avg_projects_per_appeared_year": 4.5,
    "projects_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": null,
      "year_2019": null,
      "year_2020": null,
      "year_2021": null,
      "year_2022": null,
      "year_2023": null,
      "year_2024": 3,
      "year_2025": 6
    },
    "students_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": null,
      "year_2019": null,
      "year_2020": null,
      "year_2021": null,
      "year_2022": null,
      "year_2023": null,
      "year_2024": 3,
      "year_2025": 6
    },
    "total_students": 9
  },
  "years": {
    "year_2016": null,
    "year_2017": null,
    "year_2018": null,
    "year_2019": null,
    "year_2020": null,
    "year_2021": null,
    "year_2022": null,
    "year_2023": null,
    "year_2024": {
      "num_projects": 3,
      "projects": [
        {
          "code_url": "https://github.com/ohcnetwork/teleicu_middleware_backend/pull/1",
          "description": "Overview\nThe middleware server in the CARE project, currently implemented in TypeScript, requires a rewrite in Django to enhance integration and maintainability within the existing ecosystem.\n\nThe implementation includes a couple of steps \n\nResearch Compatible ONVIF Packages for Python\nIdentify and select Python packages compatible with ONVIF standards for interacting with ONVIF-enabled devices.\n\nImplement WebSocket functionality using Django Channels\nUtilize Django Channels to enable real-time transmission of vital data from various healthcare system sources.\n  \nIntegrate authentication mechanisms for HTTP requests and WebSockets\nEnsure proper authentication mechanisms for both HTTP requests and WebSocket connections from CARE and CARE_FE applications.\nEnsure Proper Typing Support\nEnhance codebase readability and maintainability by implementing type annotations throughout the Django middleware.\nWrite Migrations to Align Tables with Django Models\nCreate and apply Django migrations to modify existing database tables to align with Django model definitions.\n\n\nDeliverables\t\nA new django app which has all the functionalities of the existing typescript middleware \nAuthentication for websockets and http requests\nEnsuring Proper Typing throughout the django app",
          "difficulty": null,
          "id": "proj_open-healthcare-netw_2024_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/Y431hMSS/",
          "proposal_id": null,
          "short_description": "Overview The middleware server in the CARE project, currently implemented in TypeScript, requires a rewrite in Django to enhance integration and...",
          "slug": "rewriting-middleware-server-in-django",
          "status": "completed",
          "student_name": "Ankur Prabhu",
          "student_profile": null,
          "tags": [
            "python",
            "typescript",
            "web",
            "ai",
            "database"
          ],
          "title": "Rewriting Middleware Server in Django"
        },
        {
          "code_url": "https://github.com/coronasafe/leaderboard/pull/463",
          "description": "My proposal is centered around integrating GitHub discussions seamlessly into the leaderboard repository while concurrently enhancing the scraper's type safety. This comprehensive approach will involve a meticulous refactoring of the existing Python-based scraper to TypeScript, ensuring a robust and type-safe codebase. Leveraging the power of Octokit and GraphQL, I intend to optimize the process of scraping GitHub data, enhancing efficiency and reliability.\n\nFurthermore, I aim to introduce an innovative reward system for contributors, incentivizing active participation and fostering a collaborative environment. This system will recognize and reward contributors when their discussions are marked as answered, along with receiving an empathy badge as an acknowledgment of their valuable contribution.\n\nOverall, this proposal represents a strategic amalgamation of technical refinement and community enrichment, aligning with the overarching objectives of the project while enhancing its functionality and user experience.",
          "difficulty": null,
          "id": "proj_open-healthcare-netw_2024_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/6uaflpp3/",
          "proposal_id": null,
          "short_description": "My proposal is centered around integrating GitHub discussions seamlessly into the leaderboard repository while concurrently enhancing the scraper's...",
          "slug": "support-for-showing-github-discussions",
          "status": "completed",
          "student_name": "Dhrumit Parmar",
          "student_profile": null,
          "tags": [
            "python",
            "typescript",
            "api",
            "ml",
            "ai"
          ],
          "title": "Support for showing GitHub discussions"
        },
        {
          "code_url": "https://github.com/ohcnetwork/care/pull/2132",
          "description": "The CARE project aims to enhance healthcare management by digitizing patient records, streamlining workflows, and enabling TeleICU services.My proposal aims to improve the efficiency and streamline the PDF report generation process within the CARE system. The current browser-based rendering approach can be resource-intensive. I plan to implement Typst to generate PDF reports. This solution promises to reduce resource overhead and potentially improve performance. My project will involve evaluating Typst's capabilities, adjusting templates, benchmarking resource usage, and gathering user feedback to ensure a smooth transition. My goal is to enhance the report generation workflow, ultimately benefiting the CARE system.",
          "difficulty": null,
          "id": "proj_open-healthcare-netw_2024_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/rUkPNXYp/",
          "proposal_id": null,
          "short_description": "The CARE project aims to enhance healthcare management by digitizing patient records, streamlining workflows, and enabling TeleICU services.My...",
          "slug": "explore-other-alternatives-to-generate-pdf-reports",
          "status": "completed",
          "student_name": "Prafful_Sharma",
          "student_profile": null,
          "tags": [
            "ml",
            "ai"
          ],
          "title": "Explore other alternatives to generate PDF reports"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2024/organizations/open-healthcare-network/"
    },
    "year_2025": {
      "num_projects": 6,
      "projects": [
        {
          "code_url": null,
          "description": "Manual procedures on the CARE platform cover retrieval of patient information and appointment scheduling and FAQ answers and appointment reminders. These manual operations produce delays and errors together with restricted access particularly affecting users who find the basic WhatsApp communication method more efficient. I established a WhatsApp chatbot implementation which operated through a close technological connection with the CARE system.\n\nThe application uses the Meta WhatsApp Business API for its communication framework while integrating Django alongside database operations for backend functions. Dialogflow or Rasa NLP tools serve as optional enhancements for the bot allowing better processing of natural language verbalisations. Core features include:\n\n1. The system provides automatic appointment booking alongside immediate patient record availability.\n2. The system provides timely notification systems for upcoming meetings along with post-appointment check-up scheduling.\n3. The system provides immediate FAQs as part of its user satisfaction enhancement measures.\n4. Real-time communication on WhatsApp provides users with a smooth experience alongside extensive system reachability.\n\nThe solution enhances the CARE platform through workforce efficiency while it decreases human errors in addition to enabling accessible reliable and responsive communication. A reliable system retrieves patient records accurately more than 95% of the time and handles various user inquiries within under a second thus delivering enhanced operational performance.",
          "difficulty": null,
          "id": "proj_open-healthcare-netw_2025_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/bPx3niWK",
          "proposal_id": "3jNQwKRh",
          "short_description": "Manual procedures on the CARE platform cover retrieval of patient information and appointment scheduling and FAQ answers and appointment reminders....",
          "slug": "whatsapp-bot-for-the-care-platform",
          "status": "in-progress",
          "student_name": "Ashu_Choudhary",
          "student_profile": null,
          "tags": [
            "api",
            "ai",
            "database",
            "ui",
            "backend"
          ],
          "title": "WhatsApp Bot for the CARE Platform"
        },
        {
          "code_url": null,
          "description": "The proposed project aims to develop a FHIR-aligned HR management module for the CARE system, streamlining employee management, automating leave tracking, and providing insightful reports. By leveraging CARE's existing scheduling system and aligning with FHIR standards, the module ensures seamless integration, data consistency, and interoperability. The platform will enable HR to efficiently manage employee records, process leave requests with conflict detection, securely handle documents, and generate meaningful reports for better decision-making.",
          "difficulty": null,
          "id": "proj_open-healthcare-netw_2025_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/b3hFfKM4",
          "proposal_id": "HdQCgjob",
          "short_description": "The proposed project aims to develop a FHIR-aligned HR management module for the CARE system, streamlining employee management, automating leave...",
          "slug": "hr-management-module",
          "status": "in-progress",
          "student_name": "Gurukiran",
          "student_profile": null,
          "tags": [
            "ml",
            "ai"
          ],
          "title": "HR Management module"
        },
        {
          "code_url": null,
          "description": "The proposed project aims to build a lightweight, scalable, and extensible alternative to the Snowstorm Terminology Server by leveraging Django and etcd—a fast, atomic, and consistent key-value store—as the backend database. Unlike Snowstorm, which is resource-intensive, limited to SNOMED CT, and does not support concept authoring, the new server will support full FHIR operations like $lookup, $validate-code, and $expand, along with custom endpoints for authoring, updating, and deleting concepts. Data will be loaded into optimized in-memory data structures (DAG and description dictionaries) on server startup, enabling fast traversal, search, and filtering. Multi-language support, real-time syncing from etcd, and an intuitive micro-frontend UI will allow users to manage codes seamlessly. The project also includes full integration into the existing Care ecosystem via a dedicated backend plugin and a React-based admin dashboard, ensuring drop-in replacement with no changes required in existing workflows. This solution will empower open-source healthcare platforms in resource-constrained regions to build, customize, and manage terminology services without relying on costly proprietary systems.",
          "difficulty": null,
          "id": "proj_open-healthcare-netw_2025_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/9L9YN6qy",
          "proposal_id": "OmBioP5x",
          "short_description": "The proposed project aims to build a lightweight, scalable, and extensible alternative to the Snowstorm Terminology Server by leveraging Django and...",
          "slug": "terminology-server-from-google-sheet",
          "status": "in-progress",
          "student_name": "Raj_Kumar_",
          "student_profile": null,
          "tags": [
            "react",
            "ml",
            "ai",
            "database",
            "ui"
          ],
          "title": "Terminology Server from Google Sheet"
        },
        {
          "code_url": null,
          "description": "This project implements comprehensive patient-facing digital health capabilities in the CARE platform by integrating Ayushman Bharat Digital Mission (ABDM) Personal Health Record (PHR) flows. While CARE currently supports provider-side health information exchange through the existing ABDM module, it lacks patient-centered features that would allow individuals to access and control their health data.\nMy solution builds a complete set of APIs and interactive user interfaces to bridge this gap by implementing seven key components:\nABHA Enrollment - Digital identity creation with multiple verification methods\nProfile Login - Secure multi-channel authentication and session management\nUser Profile Management - Personal health information control and preferences\nDiscovery and Linking - Finding and connecting fragmented health records\nSubscriptions & Notifications - Automated health updates and alerts\nConsent Management - Granular control over data sharing permissions\nHealth Record Display - Unified view of medical history across providers\nThe implementation seamlessly integrates with the existing ABDM module while adding complementary PHR capabilities, enabling CARE to function effectively in dual roles—as both a provider-focused clinical system and a patient-centered health record platform.\nDeliverables include a fully functional implementation of all ABDM PHR APIs, an intuitive and responsive patient portal interface, comprehensive transaction tracking for compliance, and thorough documentation. All components will adhere to healthcare security and privacy standards while providing a cohesive user experience. The completed project will transform healthcare delivery by eliminating information gaps between providers and empowering patients as active participants in their care journey.",
          "difficulty": null,
          "id": "proj_open-healthcare-netw_2025_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/uIPCPdX9",
          "proposal_id": "5Iv0Gsdq",
          "short_description": "This project implements comprehensive patient-facing digital health capabilities in the CARE platform by integrating Ayushman Bharat Digital Mission...",
          "slug": "abdm-patient-centric-flows-phr-flows",
          "status": "in-progress",
          "student_name": "Siva Pidugu",
          "student_profile": null,
          "tags": [
            "api",
            "ml",
            "ui"
          ],
          "title": "ABDM – Patient Centric Flows (PHR Flows)"
        },
        {
          "code_url": null,
          "description": "The Diet Management module aims to bridge the gap between clinical care and nutritional health within CARE’s ecosystem. This module will empower patients to adjust their dietary plans, while also being able to monitor and track their eating habits. By integrating dietary data with existing patient records, CARE will unify medical and lifestyle interventions. My proposal gives detailed architectures for the Meal Plan Integration, Calorie Tracking, Nutritional Recommendations, and Patient Record Integration features. It comprises in depth descriptions, workflows and technologies that are needed to integrate the Diet Management module in CARE.",
          "difficulty": null,
          "id": "proj_open-healthcare-netw_2025_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/7T36c0fb",
          "proposal_id": "UEybaVE0",
          "short_description": "The Diet Management module aims to bridge the gap between clinical care and nutritional health within CARE’s ecosystem. This module will empower...",
          "slug": "diet-management-in-care",
          "status": "in-progress",
          "student_name": "Spandan Mishra",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Diet Management in CARE"
        },
        {
          "code_url": null,
          "description": "The project has the aim of providing offline data entry capability into the CARE form-based data collection system. Currently, users experience interruptions when network connectivity is lost, preventing data entry while in the field with the application opened in a disconnected state. This project will maintain coordination with CARE forms during offline status, allowing users to continue using the app normally.The approach will implement an offline-first architecture that includes application caching, local storage, and sync capabilities. I plan to implement caching while using Workbox and Service Workers to cache the appropriate application assets and form definitions so that the user interface can load and continue to operate without a network connection. I plan to use IndexedDB, managed through Dexie.js, to store the form responses as local data storage on the user’s device. After connectivity is re-established, an automatic background sync process will use React Query and PQueue to ensure reliable and conflict-free data sync with the established database on the central server. Conflict resolution strategies will be included to maintain integrity, safe and complete data from being 'lost' when multiple users could be updating the same data at the same time.",
          "difficulty": null,
          "id": "proj_open-healthcare-netw_2025_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/xVR92zlY",
          "proposal_id": "NFSxsJvs",
          "short_description": "The project has the aim of providing offline data entry capability into the CARE form-based data collection system. Currently, users experience...",
          "slug": "offline-data-entry-support",
          "status": "in-progress",
          "student_name": "vikaspal8923",
          "student_profile": null,
          "tags": [
            "react",
            "ai",
            "database"
          ],
          "title": "Offline Data Entry Support"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2025/organizations/open-healthcare-network"
    }
  },
  "first_time": false,
  "contact": {
    "email": "mohammed.nihal@egovernments.org",
    "guide_url": "https://oss.ohc.network/",
    "ideas_url": "https://contributors.ohc.network/projects",
    "irc_channel": "https://slack.ohc.network/",
    "mailing_list": "Info@ohc.network"
  },
  "social": {
    "blog": "https://www.linkedin.com/company/ohcnetwork/",
    "discord": null,
    "facebook": null,
    "github": null,
    "gitlab": null,
    "instagram": null,
    "linkedin": null,
    "mastodon": null,
    "medium": null,
    "reddit": null,
    "slack": null,
    "stackoverflow": null,
    "twitch": null,
    "twitter": null,
    "youtube": null
  },
  "meta": {
    "version": 1,
    "generated_at": "2026-01-25T15:28:53.835Z"
  }
}