{
  "id": "692251de53dd9d7326d33e40",
  "slug": "osgeo-open-source-geospatial-foundation",
  "name": "OSGeo (Open Source Geospatial Foundation)",
  "category": "End user applications",
  "description": "The Open Source Geospatial Foundation",
  "image_url": "https://summerofcode.withgoogle.com/media/org/osgeo-open-source-geospatial-foundation/yundulx00fbd1akm-360.png",
  "img_r2_url": "https://pub-268c3a1efc8b4f8a99115507a760ca14.r2.dev/osgeo-open-source-geospatial-foundation.webp",
  "logo_r2_url": null,
  "url": "https://www.osgeo.org/",
  "active_years": [
    2016,
    2017,
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "first_year": 2016,
  "last_year": 2025,
  "is_currently_active": true,
  "technologies": [
    "c",
    "python",
    "ogc standards",
    "c++",
    "sql",
    "java",
    "database",
    "standards",
    "open source databases",
    "javascript"
  ],
  "topics": [
    "science",
    "gis",
    "maps",
    "geospatial",
    "cartography",
    "open science",
    "citizen science",
    "mapping",
    "geoinformatics",
    "computer vision",
    "geolocation",
    "databases",
    "routing"
  ],
  "total_projects": 101,
  "stats": {
    "avg_projects_per_appeared_year": 10.1,
    "projects_by_year": {
      "year_2016": 20,
      "year_2017": 13,
      "year_2018": 10,
      "year_2019": 7,
      "year_2020": 10,
      "year_2021": 12,
      "year_2022": 6,
      "year_2023": 7,
      "year_2024": 7,
      "year_2025": 9
    },
    "students_by_year": {
      "year_2016": 20,
      "year_2017": 13,
      "year_2018": 10,
      "year_2019": 7,
      "year_2020": 10,
      "year_2021": 12,
      "year_2022": 6,
      "year_2023": 7,
      "year_2024": 7,
      "year_2025": 9
    },
    "total_students": 94
  },
  "years": {
    "year_2016": {
      "num_projects": 20,
      "projects": [
        {
          "code_url": "https://felipe07.github.io/VistSOS-1/",
          "description": "<p>In order to extent the available characteristic offered by the istSOS server, I propose the use of an open source Javascript library for the implementation of VistSOS: the istSOS Data Visualization Framework. The proposed solution shall allow users of the istSOS ecosystem to configure, customize and include a wide set of chart, bar, grid and map visualization types in their websites. The framework will offer complete support for the connection of the visualization widgets with multiple data-exchange formats like CSV, TSV and JSON. Considering the real-time nature of the data sources the framework will support the generation of real-time visualization widgets specially crafted to improve the readiness to display data of this kind. The framework shall be implemented with robustness, reliability and customization as its core development principles. Recommended practices for software development like Version Control Systems use and continous testing will be followed.</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2016_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/6347788522618880/",
          "proposal_id": null,
          "short_description": "In order to extent the available characteristic offered by the istSOS server, I propose the use of an open source Javascript library for the...",
          "slug": "vistsos-the-istsos-data-visualization-framework",
          "status": "completed",
          "student_name": "Felipe Poveda",
          "student_profile": null,
          "tags": [
            "java",
            "javascript",
            "web",
            "ai"
          ],
          "title": "VistSOS: the istSOS Data Visualization Framework"
        },
        {
          "code_url": "https://webpractice-lukag.github.io/istSOS-Web-API/",
          "description": "<p>Implementation of an easy to use framework that will offer to the final user the ability of building feature-rich web widget that will be easily embeddable into existing web sites. Developers used to implement everything from scratch, but with istSOS Web API, development would be more efficient and simplified.</p>\n",
          "difficulty": "beginner",
          "id": "proj_osgeo-open-source-ge_2016_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/6449630787141632/",
          "proposal_id": null,
          "short_description": "Implementation of an easy to use framework that will offer to the final user the ability of building feature-rich web widget that will be easily...",
          "slug": "istsos-web-api",
          "status": "completed",
          "student_name": "Luka G.",
          "student_profile": null,
          "tags": [
            "web",
            "api",
            "ui"
          ],
          "title": "istSOS Web API"
        },
        {
          "code_url": "https://github.com/GabrielePrestifilippo/MuViAS",
          "description": "<p>The idea behind this project is to create an application using Nasa Web World Wind to show metadata about environmental variables in more than three dimensions. \nThe model I'd like to implement to present 3D data is a Voxel model. Each voxel has three dimensions, that will be possible to customize with the interested metadata, but also more information can be shown thanks to Web World Wind capabilities. Coloring each Voxel might present another metadata and additionally creating an animation in time gives the opportunity to introduce a further variable. \n Users will be able to interact with the visualization, customizing the metadata on the Voxel and filtering data according to specific settings. \n As input data, I'm considering telecommunication data from \"Telecom Italia Big Data Challenge 2015\". \nMy idea is to create first the visualization environment and further import the data in a database to allow users to query the database for particular data. \nMoreover, depending on the time also would be interesting to allow users to import their own data set in a specific format to share the view on a specific globe with other people.</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2016_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5667947544576000/",
          "proposal_id": null,
          "short_description": "The idea behind this project is to create an application using Nasa Web World Wind to show metadata about environmental variables in more than three...",
          "slug": "nasa-web-world-wind-multidimensional-visualization-tool-for-environmental-variables",
          "status": "completed",
          "student_name": "gabry501",
          "student_profile": null,
          "tags": [
            "web",
            "database"
          ],
          "title": "NASA Web World Wind - Multidimensional Visualization Tool for Environmental Variables"
        },
        {
          "code_url": "https://trac.osgeo.org/grass/wiki/GSoC/2016/WebGrass",
          "description": "<p>This idea will focus on the development of web based GUI for the Grass “WebGrass” where people can use Grass modules through a web browser without actually installing GRASS. GRASS will be running on a server. The user interface will be built using wt web toolkit. Wt provides C++ API for developing web widgets. Wt is a page based framework. This means the web application written in Wt has are close to be alike desktop application. Wt’s Singal slot mechanism inspired from Qt allows to connect events from Wt widget to javascript calls. Also this can be the first step in making a Enterprise wide FOSS4G tool where GRASS is running on the server and user can use it with any client, processing being done on the server. In future, a cloud based application deployment can be done.</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2016_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5386472567865344/",
          "proposal_id": null,
          "short_description": "This idea will focus on the development of web based GUI for the Grass “WebGrass” where people can use Grass modules through a web browser without...",
          "slug": "webgrass",
          "status": "completed",
          "student_name": "Mayank Agrawal",
          "student_profile": null,
          "tags": [
            "java",
            "javascript",
            "web",
            "api",
            "cloud"
          ],
          "title": "WEBGRASS"
        },
        {
          "code_url": "http://www.geo-nred.nu.ac.th/zoo-pymodis",
          "description": "<p>The pyModis project has been developed and used to work with MODIS data, it provides wxPython user interfaces which are able to download and process data using pyModis scripts. pyModis depends on a desktop graphical user interface which does not make it directly usable from a web application. The idea of this GSoC proposal is to bring pyModis to the web by publishing Python Web Processing Services using the ZOO-Project technology accessible through a minimal web application.\nAn idea which can be implemented for the future, based on this initial work, include the creation of new services by combining pyModis, GRASS, OTB and SAGA-GIS services.</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2016_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5493393094344704/",
          "proposal_id": null,
          "short_description": "The pyModis project has been developed and used to work with MODIS data, it provides wxPython user interfaces which are able to download and process...",
          "slug": "bringing-pymodis-to-the-web-through-zoo-project",
          "status": "completed",
          "student_name": "Chingchai Humhong",
          "student_profile": null,
          "tags": [
            "python",
            "web"
          ],
          "title": "Bringing pyModis to the web through ZOO-Project"
        },
        {
          "code_url": "https://github.com/martidi/opencv_dsm/tree/imageStack",
          "description": "<p>My project proposal concerns the improvement and the implementation of new functionalities for the OSSIM plug-in that I developed in the last two years in the framework of the 2014 and 2015 GSoC programs.</p>\n<p>I was thinking, first of all, to finalize and consolidate all the work done so far, specifically, to:</p>\n<ul>\n<li>complete the workflow for generating DSMs from SAR images</li>\n<li>improve the automatization of the pyramidal approach implemented for DSM generation </li>\n</ul>\n<p>The main aim would then be to implement a processing tool able to merge various DSMs resulting from different pairs or triplets, acquired with different sensors or in different period in times. This is particular useful for SAR images for which usually you've got a stack of images over the same area.</p>\n<p>In particular, the idea is to create a new function able to generate a mask for exploiting only the best areas in the DSMs merging phase. Specifically, in SAR images lay-over and fore-shortening areas would be automatically detected in the input images; a mask can hence be generated and applied to the corresponding DSM in order to cross out those pixels not \"good\" and replace them with pixels more reliable coming from other DSMs.</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2016_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/4999444474888192/",
          "proposal_id": null,
          "short_description": "My project proposal concerns the improvement and the implementation of new functionalities for the OSSIM plug-in that I developed in the last two...",
          "slug": "a-complete-photogrammetric-ossim-tool-for-automatic-dsms-generation-using-multi-view-optical-and-sar-images",
          "status": "completed",
          "student_name": "martidi",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "A complete photogrammetric OSSIM tool for automatic DSMs generation using multi-view optical and SAR images"
        },
        {
          "code_url": "https://github.com/lazaa32/SoC16/commits",
          "description": "<p>Currently a GRASS GIS user is forced to use Cartographic Composer or use another software (e.g. QGIS) to create hard copy map outputs with all features. The aim of this project is to develop complete basic cartography suite for the wxGUI Map Display so it could serve for most of the science publications. The goal is not to substitute QGIS Cart Comp or similar, it's just about completing all features so the cartography scripting abilities of GRASS GIS and its potential can be fully used.</p>\n<p>GRASS GIS contains some modules which would be good to implement into cartography suite for wxGUI Map Display. There are d.barscale, d.graph, d.histogram, d.legend and many other d.* commands to use. There are bugs in some of them and it needs to be fixed(options for map window size). Then there are some modules which need to be enhanced. Legend background is currently transparent -&gt; add an options for opacity, border and corner settings. It's possible to set number of breaks/ticks for legend but values are not rounded -&gt; add an option for manual brakes/ticks, add an option for automatic breaks/ticks (every ten, hundred)</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2016_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5062270988058624/",
          "proposal_id": null,
          "short_description": "Currently a GRASS GIS user is forced to use Cartographic Composer or use another software (e.g. QGIS) to create hard copy map outputs with all...",
          "slug": "complete-basic-cartography-suite-in-grass-gis-wxgui-map-display",
          "status": "completed",
          "student_name": "ad.laza32",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Complete basic cartography suite in GRASS GIS wxGUI Map Display"
        },
        {
          "code_url": "https://github.com/pgRouting/pgrouting/wiki/GSoC-2016-Contraction",
          "description": "<p>Contraction is a technique used to speed up shortest-path computation by first creating contracted versions of the network. There are different ways of contracting a network. I am proposing a framework which supports the addition of new contraction techniques, and two contraction algorithms: dead end contraction and linear contraction.\nInstallation of the framework together with the dead end contraction and also the implementation of linear contraction which will be used to refine the framework is intended to be completed during the GSoC.</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2016_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5261601225572352/",
          "proposal_id": null,
          "short_description": "Contraction is a technique used to speed up shortest-path computation by first creating contracted versions of the network. There are different ways...",
          "slug": "implementation-of-a-framework-which-supports-addition-of-contraction-techniques-for-pgrouting",
          "status": "completed",
          "student_name": "Sankepally Rohith Reddy",
          "student_profile": null,
          "tags": [],
          "title": "Implementation of a framework which supports addition of contraction techniques for pgRouting."
        },
        {
          "code_url": "https://lists.osgeo.org/pipermail/soc/2016-August/003523.html",
          "description": "<p>PyWPS is an implementation of OGC WPS standard on the server side, written in Python programming language. Since it's perfectly designed for programs and machines, humans need a user-friendly tool to view and control all processes.</p>\n<p>PyWPS now works in the way, that you can send HTTP requests with an XML file as an input and you will get an output with an XML file or data immediately or after some time. The problem is, people cannot control and manage them.</p>\n<p>The project idea aims to create a web application, where users and administrators control and manage all processes. I will use existing Flask application to extend functions and interface to be easily usable for people. The interface, with modern web development approach and use of multiprocessing Python library, is going to allow people add, pause, remove, view progress.</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2016_009",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5340035113025536/",
          "proposal_id": null,
          "short_description": "PyWPS is an implementation of OGC WPS standard on the server side, written in Python programming language. Since it's perfectly designed for programs...",
          "slug": "web-based-administration-process-management-for-pywps",
          "status": "completed",
          "student_name": "Jan Rudolf",
          "student_profile": null,
          "tags": [
            "python",
            "web",
            "ml",
            "ai"
          ],
          "title": "Web-based administration & process management for PyWPS"
        },
        {
          "code_url": "https://github.com/pgRouting/pgrouting/wiki/GSoC-2016-Flow",
          "description": "<p>This project aims to add functionality in order to solve the maximum flow problem in pgRouting.</p>\n<p>A flow network is a directed graph where each edge has a capacity and a flow. The flow through an edge must not exceed the capacity of the edge. Additionally, the incoming and outgoing flow of a node must be equal except the for source which only has outgoing flow, and the destination(sink) which only has incoming flow.</p>\n<p>Maximum flow algorithms route one possible maximum flow through the graph and have several other applications in network routing, delivery &amp; transportation, circulation and more.</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2016_010",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/6192757919973376/",
          "proposal_id": null,
          "short_description": "This project aims to add functionality in order to solve the maximum flow problem in pgRouting.\nA flow network is a directed graph where each edge...",
          "slug": "flow-algorithms-for-pgrouting",
          "status": "completed",
          "student_name": "Illedran",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Flow Algorithms for pgRouting"
        },
        {
          "code_url": "https://lists.osgeo.org/pipermail/soc/2016-August/003506.html",
          "description": "<p>The current OGR core doesn't include three geometries according to OGC standards - Triangular Irregular Networks, Polyhedral Surfaces and Triangles. The proposal addresses the addition of  the same in OGR core as well as the introduction of support in existing OGR drivers for these geometries.</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2016_011",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/6202171414544384/",
          "proposal_id": null,
          "short_description": "The current OGR core doesn't include three geometries according to OGC standards - Triangular Irregular Networks, Polyhedral Surfaces and Triangles....",
          "slug": "introduce-triangulated-surface-polyhedral-surface-and-triangle-api-in-the-ogrgeometry-core-and-implement-their-support-in-ogr-drivers-for-gdal",
          "status": "completed",
          "student_name": "avyavkumar",
          "student_profile": null,
          "tags": [
            "angular",
            "api"
          ],
          "title": "Introduce Triangulated Surface, Polyhedral Surface and Triangle API in the OGRGeometry core and implement their support in OGR drivers for GDAL"
        },
        {
          "code_url": "https://masterflorin.github.io/gsoc16-istsos/",
          "description": "<p>Firstly, the aim of the project is to develop an Android App for the istSOS project. In order to achieve that objective, a main goal will be to develop an easy-to-use library in Java based on the istSOS, suitable for Android development. This way, developers can create and customize their own apps depending on the needs of their projects. As it is essential for users to access in real time current and historic sensor data the application will show sensors location, metadata, observed properties, data visualization trough plots and infographics, alerts and notifications, features provided by the application's main core functionality.</p>\n",
          "difficulty": "beginner",
          "id": "proj_osgeo-open-source-ge_2016_012",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/4529712491659264/",
          "proposal_id": null,
          "short_description": "Firstly, the aim of the project is to develop an Android App for the istSOS project. In order to achieve that objective, a main goal will be to...",
          "slug": "android-istsos-client",
          "status": "completed",
          "student_name": "masterflorin",
          "student_profile": null,
          "tags": [
            "java",
            "android",
            "ai",
            "ui"
          ],
          "title": "Android istSOS client"
        },
        {
          "code_url": "https://lists.osgeo.org/pipermail/soc/2016-August/003508.html",
          "description": "<p>In forested mountain landscapes wood can significantly increment the total flow volume during a flooding event. The presence of large wood on river sides has positive effects on hydrogeomorphological diversity of habitats and represents a source of organic nutrients in the water. Therefore a compromise should be reached in the management of vegetation (within river corridors and on connected unstable slopes) aiming to reduce flood hazard while preserving its function of large wood supply for river ecosystems.\nThe idea of the project is to develop in gvSIG a model for the evaluation of the hazard derived from large wood transportation during flooding events. The simplified GIS model should consider:</p>\n<ul>\n<li>the effective presence and characteristics of the vegetation in the inundable river corridors for the log requirement</li>\n<li>the characteristics of the flow in the stream network for the transportation of the logs downstream.\nWith this model the user will be able to make an analysis of the hazard and risk related to the transport of wood during flooding events on a complete river stream with known and commonly used/available GIS data, using directly in a GIS for displaying input and outputs.</li>\n</ul>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2016_013",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/4549839245279232/",
          "proposal_id": null,
          "short_description": "In forested mountain landscapes wood can significantly increment the total flow volume during a flooding event. The presence of large wood on river...",
          "slug": "development-of-a-model-for-woody-debris-flooding-hazard-in-gvsig",
          "status": "completed",
          "student_name": "Silvia Franceschi",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Development of a model for woody debris flooding hazard in gvSIG"
        },
        {
          "code_url": "https://lists.osgeo.org/pipermail/soc/2016-August/003499.html",
          "description": "<p>The objective is to extend GDAL/OGR supported formats with DWG, allowing to read geometries from it. It is going to be reached by writing a new DWG driver, without any third-party dependencies.</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2016_014",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/4638615413981184/",
          "proposal_id": null,
          "short_description": "The objective is to extend GDAL/OGR supported formats with DWG, allowing to read geometries from it. It is going to be reached by writing a new DWG...",
          "slug": "osgeo-gdal-dwg-support",
          "status": "completed",
          "student_name": "sandyre",
          "student_profile": null,
          "tags": [],
          "title": "OSGeo GDAL DWG support"
        },
        {
          "code_url": "https://lists.osgeo.org/pipermail/soc/2016-August/003521.html",
          "description": "<p>The main idea behind this project is to develop addons which allows to create/play tests and educational games. Also generate documentation specially oriented to users without any programming knowledge.</p>\n<p>The code will be mainly developed in Jython, an implementation of the Python programming language written in Java, through the scripting module of the gvSIG desktop 2.x branch.</p>\n<p>The developed tools will be used in geography and maps learning.</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2016_015",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/4670449980014592/",
          "proposal_id": null,
          "short_description": "The main idea behind this project is to develop addons which allows to create/play tests and educational games. Also generate documentation specially...",
          "slug": "add-tests-and-educational-games-support-to-gvsig-educa",
          "status": "completed",
          "student_name": "Carlos I. Colombana",
          "student_profile": null,
          "tags": [
            "python",
            "java",
            "ai"
          ],
          "title": "Add tests and educational games support to gvSIG Educa."
        },
        {
          "code_url": "https://github.com/niroshansb/GSoC2016/wiki",
          "description": "<p>JGrasstools is a library which contains a variety of geoprocessing functionalities. It has been used for many GIS framework to provide a comprehensive Java solution for GIS packages for data access, editing, visualization and analysis. On the other hand Geopaparazzi is a standalone mobile app for field data collection. It enables user to collect georeferenced field data. Idea of this proposal is to enable the JGrasstools library to serve as geoprocessing engine using the WPS standard implemented in the ZOO-Project (<a href=\"http://zoo-project.org/\" target=\"_blank\">http://zoo-project.org/</a>). The main task in this proposal would the preparation and conversion of field data from geopaparazzi projects to Web-GIS platform enabling data analysis and sharing. The project will demonstrate and document the methods to deploy WPS using JGrasstools as the geoprocessing engine. As a future possibility, the project would facilitate Web-GIS platform with rich set functionality especially in hydrology and water management needs.  The results of this project will be useful for deploying Web application for Monitoring and Evaluation (M&amp;E) needs.</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2016_016",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/4763907394633728/",
          "proposal_id": null,
          "short_description": "JGrasstools is a library which contains a variety of geoprocessing functionalities. It has been used for many GIS framework to provide a...",
          "slug": "implementing-wps-for-geopaparazzi-field-data-collection-tool-using-zoo-project-simplifying-integration-of-field-data-and-gis",
          "status": "completed",
          "student_name": "Niroshan",
          "student_profile": null,
          "tags": [
            "java",
            "web",
            "mobile",
            "ai"
          ],
          "title": "Implementing WPS for Geopaparazzi field data collection tool using ZOO-Project: Simplifying integration of field data and GIS"
        },
        {
          "code_url": "https://groups.google.com/forum/#!topic/onebusaway-developers/8oj_NZmH1vg",
          "description": "<p>Develop a quick start version to the Transit Time application. Currently the set up of transtime is very complex with little available documentation this creates the first barrier to entry preventing adoption and lowering ease of use, my goal is to create a QuickStart version of the TransitTime application similar to the current OneBusAway's Quickstart along with automating historical updating to allow better predictions of of route possible using kalman filters</p>\n",
          "difficulty": "advanced",
          "id": "proj_osgeo-open-source-ge_2016_017",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/6519999531319296/",
          "proposal_id": null,
          "short_description": "Develop a quick start version to the Transit Time application. Currently the set up of transtime is very complex with little available documentation...",
          "slug": "one-bus-away-quick-start",
          "status": "completed",
          "student_name": "Brendan Egan",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "One bus Away Quick start"
        },
        {
          "code_url": "http://lists.osgeo.org/pipermail/soc/2016-August/003479.html",
          "description": "<p>This library allows users to add Google Maps layers to an OpenLayers v3 map. To do this, the library replicates the OpenLayers objects to the Google Maps map using the Google Maps API. This makes it very easy for users to use a Google Maps basemap while still working with the OL3 syntax.</p>\n<p>The objectives for this summer is to integrate major features to the library such as support for WMS and TMS layers while integrating a few tools that will make future contributions to the library easier for everyone.</p>\n",
          "difficulty": "beginner",
          "id": "proj_osgeo-open-source-ge_2016_018",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/4915736099160064/",
          "proposal_id": null,
          "short_description": "This library allows users to add Google Maps layers to an OpenLayers v3 map. To do this, the library replicates the OpenLayers objects to the Google...",
          "slug": "ogc-protocols-support-within-ol3-google-maps",
          "status": "completed",
          "student_name": "SamuelLapointe",
          "student_profile": null,
          "tags": [
            "api"
          ],
          "title": "OGC protocols support within OL3-Google-Maps"
        },
        {
          "code_url": "http://www.akbargumbira.com/slide_gsoc2016/",
          "description": "<p>This project will focus on making styles (.qml), symbols definition (.xml), and SVG markers sharing possible through web services that later can be accessed and used in QGIS. The work includes:</p>\n<ul>\n<li>Developing a web application to allow QGIS users (through OSGeo LDAP account) upload their styles, symbols, and SVG’s.</li>\n<li>Integration in QGIS to allow users to fetch those resources and use them</li>\n</ul>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2016_019",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5981954214199296/",
          "proposal_id": null,
          "short_description": "This project will focus on making styles (.qml), symbols definition (.xml), and SVG markers sharing possible through web services that later can be...",
          "slug": "qgis-styles-symbols-and-svg-markers-sharing-repository",
          "status": "completed",
          "student_name": "akbargumbira",
          "student_profile": null,
          "tags": [
            "web",
            "ml"
          ],
          "title": "QGIS Styles, Symbols, and SVG Markers Sharing Repository"
        },
        {
          "code_url": "https://github.com/pesekon2/GRASS-Qt-based-GUI/commits/",
          "description": "<p>GUI forms (module dialogs) are now automatically generated from XML into wxPython. My idea is to create code that is generating the same code into more powerful Qt. It is possible also to include calling wxPython  modules from the PyQt core.</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2016_020",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5131196623224832/",
          "proposal_id": null,
          "short_description": "GUI forms (module dialogs) are now automatically generated from XML into wxPython. My idea is to create code that is generating the same code into...",
          "slug": "pyqt-implementation-of-gui-forms-generated-automatically-from-xml",
          "status": "completed",
          "student_name": "Ondřej Pešek",
          "student_profile": null,
          "tags": [
            "python",
            "ml",
            "ui"
          ],
          "title": "PyQt implementation of GUI forms generated automatically from XML"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2016/organizations/6434461499523072/"
    },
    "year_2017": {
      "num_projects": 13,
      "projects": [
        {
          "code_url": "https://lists.osgeo.org/pipermail/soc/2017-August/003844.html",
          "description": "<p>The goal of this project is to create a plugin API to display OpenStreetMap (OSM) data on NASA Web WorldWind (<a href=\"https://github.com/NASAWorldWind/WebWorldWind\" target=\"_blank\">https://github.com/NASAWorldWind/WebWorldWind</a>) virtual globe in three dimensions. The API fetches the OSM data in real time based on a bounding box, or uses a local file or the data itself in GeoJSON format. The project focuses on the performance of the visualization of 3D OSM buildings, and for this purpose creates triangle meshes based on the footprint available in OSM database. Height to the buildings can be assigned using the OSM database, a property in a GeoJSON file or an arbitrary value. The API can also create a heatmap based on the heights of the buildings. The API also offers caching and sectorizing (tiling) to improve the performance.</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2017_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6446195887046656/",
          "proposal_id": null,
          "short_description": "The goal of this project is to create a plugin API to display OpenStreetMap (OSM) data on NASA Web WorldWind...",
          "slug": "3d-osm-plugin-api",
          "status": "completed",
          "student_name": "Candan Eylül Kilsedar",
          "student_profile": null,
          "tags": [
            "web",
            "api",
            "ai",
            "database",
            "ui"
          ],
          "title": "3D OSM Plugin API"
        },
        {
          "code_url": "https://github.com/niroshansb/mapmint/wiki",
          "description": "<p>The idea of integrating istSOS as a data store in MapMint is able to provide a platform for data visualization which can be used as near real time, analysis such as interpolation analysis, conversion such as vector and raster data, and publish as maps and OGS standard services such as WMS, WFS,WMTS and WPS by utilizing the data from istSOS.</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2017_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6140850555846656/",
          "proposal_id": null,
          "short_description": "The idea of integrating istSOS as a data store in MapMint is able to provide a platform for data visualization which can be used as near real time,...",
          "slug": "integrating-istsos-as-a-data-store-in-mapmint",
          "status": "completed",
          "student_name": "Niroshan Bandara",
          "student_profile": null,
          "tags": [],
          "title": "Integrating istSOS as a data store in MapMint"
        },
        {
          "code_url": "https://luka-g.github.io/istSOS-Web-API/",
          "description": "<p>My proposal consists of making some crucial changes (event handling, authentication...) to the IstSOS JavaScript core library, that will solve the most important issues of the IstSOS Web API (GSoC 2016 project). As a result, plan is to publish the library to the npm. Also, IstSOS Web Widget Creator is going to be rewritten and extended with some additional functionalities using modern JavaScript framework, specifically ReactJS. Final result, should be a modernized, completely functional and easy-to-use IstSOS Web API.</p>\n",
          "difficulty": "beginner",
          "id": "proj_osgeo-open-source-ge_2017_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/4982617598328832/",
          "proposal_id": null,
          "short_description": "My proposal consists of making some crucial changes (event handling, authentication...) to the IstSOS JavaScript core library, that will solve the...",
          "slug": "improving-istsos-web-api-and-finalizing-istsos-javascript-core-library",
          "status": "completed",
          "student_name": "Luka G.",
          "student_profile": null,
          "tags": [
            "react",
            "java",
            "javascript",
            "web",
            "api"
          ],
          "title": "Improving IstSOS Web API and finalizing IstSOS Javascript Core Library"
        },
        {
          "code_url": "https://github.com/OneBusAway/onebusaway-android/pull/776/",
          "description": "<p>The General Transit Feed Specification (GTFS) has revolutionized multi-modal information and open transit data. Started as a simple way to represent fixed route transit systems by TriMet in Portland, Oregon and Google in 2005, GTFS data is now shared publicly by over 1,500 transit agencies worldwide, according to Transitland.</p>\n<p>There are exciting new developments in the world of bike share that could potentially mirror the success of the GTFS data format. The General Bikeshare Feed Specification (GBFS) was launched by the North American Bikeshare Association (NABSA) in 2016 as a standardized way for apps to access information about the availability and location of rental bikes, as well as the capacity of racks where bikes can be returned.</p>\n<p>This Google Summer of Code project will help accelerate the adoption and utilization of the GBFS format by implementing open-source tools to consume the data format and visualize it in an existing open-source transportation app:</p>\n<p>Integrate GBFS data in OpenTripPlanner\nVisualize GBFS data in the OneBusAway mobile app</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2017_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5552538552107008/",
          "proposal_id": null,
          "short_description": "The General Transit Feed Specification (GTFS) has revolutionized multi-modal information and open transit data. Started as a simple way to represent...",
          "slug": "integration-of-bikeshare-information-into-an-open-source-transportation-app",
          "status": "completed",
          "student_name": "Rodrigo Carvalho",
          "student_profile": null,
          "tags": [
            "mobile",
            "ai"
          ],
          "title": "Integration of Bikeshare Information into an Open-source Transportation App"
        },
        {
          "code_url": "https://simonebt92.github.io/NASA-WWW-MarkerCluster/",
          "description": "<p>Creating a Marker Cluster Plugin for NASA Web World Wind with the following features:</p>\n<ul>\n<li>Clustering based on different algorithms</li>\n<li>Set a custom cluster icon based on a parameter: number of cluster or variable for the clustered point</li>\n<li>Cluster over geometries and not only polygon</li>\n<li>Filter clusters based on different criteria</li>\n<li>Precache the cluster for all the zoom level</li>\n</ul>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2017_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5602094421639168/",
          "proposal_id": null,
          "short_description": "Creating a Marker Cluster Plugin for NASA Web World Wind with the following features:\n\nClustering based on different algorithms\nSet a custom cluster...",
          "slug": "nasa-webworldwind-markercluster-plugin",
          "status": "completed",
          "student_name": "Simone Battaglia",
          "student_profile": null,
          "tags": [
            "web"
          ],
          "title": "NASA WebWorldWind - MarkerCluster Plugin"
        },
        {
          "code_url": "https://lists.osgeo.org/pipermail/soc/2017-August/003846.html",
          "description": "<p>In graph theory, the shortest path problem is the problem of finding a path between two vertices (or nodes) in a graph such that the sum of the weights of its constituent edges is minimized. In real life scenario, the road network is modeled as a graph where the graph's vertices correspond to road junctions and the edges correspond to road segments, each weighted by the positive length of its road segment.</p>\n<p>A turn models a movement from one edge element to another. Often in the real world scenario, turn restrictions such as no-left-turn, no-right-turn etc. are imposed on the road network.</p>\n<p>The aim of the project was to come up with a solution for calculating the shortest path from a given source node to a destination node in the graph containing turn restrictions.</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2017_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/4730835743801344/",
          "proposal_id": null,
          "short_description": "In graph theory, the shortest path problem is the problem of finding a path between two vertices (or nodes) in a graph such that the sum of the...",
          "slug": "rewrite-for-turn-restricted-shortest-path-algorithm-in-pgrouting",
          "status": "completed",
          "student_name": "Vidhan Jain",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Rewrite for Turn Restricted Shortest Path Algorithm in PgRouting"
        },
        {
          "code_url": "https://github.com/pesekon2/GRASS-GIS-SOS-tools/tree/gsoc2017",
          "description": "<p>GRASS GIS doesn’t have any module to work with Sensor Observation Service (SOS). SOS is an Open Geospatial Consortium (OGC) standard and it is useful to implement modules to work with this standard into GRASS. \nIntended modules would enable the user to create a vector with or without the observation values, create a raster for each queried day and create a space time vector or raster dataset. One module would also allow the user to convert a space time vector dataset into a raster dataset. The user should be also allowed to get the capabilities to get info about sensors from these modules and filter the results.</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2017_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/4761529861799936/",
          "proposal_id": null,
          "short_description": "GRASS GIS doesn’t have any module to work with Sensor Observation Service (SOS). SOS is an Open Geospatial Consortium (OGC) standard and it is useful...",
          "slug": "sos-tools-in-grass-gis",
          "status": "completed",
          "student_name": "Ondřej Pešek",
          "student_profile": null,
          "tags": [],
          "title": "SOS tools in GRASS GIS"
        },
        {
          "code_url": "https://lists.osgeo.org/pipermail/soc/2017-August/003841.html",
          "description": "<p>The goal of this project is to create a QGIS Desktop plugin which provides a web service API that exposes QGIS' data processing and canvas drawing functionalities. The plugin provides a way to include QGIS in the data processing workflow of other (‘mapping-deficient’) programming languages over a HTTP interface which mirrors the existing QGIS API, without precluding the ability to make use of its interactive editing components. The project also covers the generation and documentation of automated geospatial analysis workflow examples using Jupyter notebooks for both Python and R. The example notebooks will integrate data obtained from Open Data repositories with use cases of the QGIS Web API as well as other OSGeo geospatial libraries to demonstrate the potential of automatic report generation for open source GIS analysis.</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2017_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/4854198344613888/",
          "proposal_id": null,
          "short_description": "The goal of this project is to create a QGIS Desktop plugin which provides a web service API that exposes QGIS' data processing and canvas drawing...",
          "slug": "qgis-web-api-and-remote-control-plugin-for-notebook-integration",
          "status": "completed",
          "student_name": "Kevin Stadler",
          "student_profile": null,
          "tags": [
            "python",
            "web",
            "api",
            "ai"
          ],
          "title": "QGIS Web API and remote control Plugin (for Notebook integration)"
        },
        {
          "code_url": "https://github.com/rahulworld/Data-analysis/blob/master/examples/GSoC.md",
          "description": "<p>istSOS has gone through a lot of improvements since 2009. This has somehow affected the simplified interaction with measurements and SOS service settings. \nThe aim of my project primarily is to create OAT extension in RESTFull Web api and OAT extension having data analysis and statistical tools for istSOS which will be used to automate the creation of statisticat documents using OAT library and harvesting the data from an istSOS server and then publishing the result on Open Data Portals(CKAN).</p>\n<p>The data analysis and statistical tools suite will cover all the features of OAT.Methods. Further I will create data analysis and statistical tools suite suite for istSOS.</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2017_009",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/4902267350155264/",
          "proposal_id": null,
          "short_description": "istSOS has gone through a lot of improvements since 2009. This has somehow affected the simplified interaction with measurements and SOS service...",
          "slug": "istsos-data-analysis-and-statistical-tools-suite",
          "status": "completed",
          "student_name": "rahulworld",
          "student_profile": null,
          "tags": [
            "web",
            "api",
            "ai",
            "ui"
          ],
          "title": "istSOS-Data analysis and statistical tools suite"
        },
        {
          "code_url": "https://github.com/omshinde/MapMint4ME/wiki/Final-Report:-GSoC-2017",
          "description": "<p><strong>MapMint4ME</strong> is an android application which allows its users to record alphanumeric data, photo and GPS locations. The data can be recorded even when there is no internet connectivity. When the user returns to a location with the internet connectivity, the data is uploaded to the database. MapMint4ME is very close to <a href=\"http://mapmint.github.io/userguide-fr/index.html\" target=\"_blank\">MapMint</a> web software which is built on the <strong>ZOO-Project</strong>. The <a href=\"http://zoo-project.org\" target=\"_blank\">ZOO-Project</a> is an SDI manager providing the capability to built map and web applications.</p>\n<p>In this project, I plan to <strong>add audio and video data recording</strong> facility to MapMint4ME. The main idea is to <strong>include SOS input support to MapMint4ME</strong> which will <strong>enable recording of sensor data directly within the app</strong>. The sensor data will be obtained from the sensors embedded on the Android platform. This project will help lots of GIS users, geologists, geographers <em>et cetera</em> who wish to retrieve data from remote areas (where it is not possible to reach) by accessing sensor data directly through the app. Certainly, more functions with extended capabilities could be added in future. I believe that by following a strict timeline as mentioned in the proposal, I will be able to finish the project successfully.</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2017_010",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5784917489221632/",
          "proposal_id": null,
          "short_description": "MapMint4ME is an android application which allows its users to record alphanumeric data, photo and GPS locations. The data can be recorded even when...",
          "slug": "adding-audiovideo-and-sos-input-support-in-the-mapmint4me",
          "status": "completed",
          "student_name": "Rajat Shinde",
          "student_profile": null,
          "tags": [
            "android",
            "web",
            "ml",
            "ai",
            "database"
          ],
          "title": "Adding Audio/Video and SOS input support in the MapMint4ME"
        },
        {
          "code_url": "https://github.com/zkwurst/GSoC2017-GRASS-GIS",
          "description": "<p>Novice GRASS GIS users often have difficulty with the complexities of re-formatting data, solving map projection issues, and working with centralized data organization. Existing solutions often require users to create their own custom scripts geared towards a specific use-case and are generally incompatible with other data sources or coordinate projection systems. My project will focus on creating scripts that convert widely-used open data sets into standardized formats for a given location or projection.</p>\n<p>Users will be able to download multiple data sets and appropriately format the data according to a user-defined location. Automated formatting will allow users to more efficiently utilize information and create ready-to-use data sets available for download. Furthermore, the underlying framework generated by my project will allow users to develop their own scripts for a given service and/or location.</p>\n",
          "difficulty": "advanced",
          "id": "proj_osgeo-open-source-ge_2017_011",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5871436652609536/",
          "proposal_id": null,
          "short_description": "Novice GRASS GIS users often have difficulty with the complexities of re-formatting data, solving map projection issues, and working with centralized...",
          "slug": "grass-gis-locations-created-from-public-data",
          "status": "completed",
          "student_name": "Zechariah Krautwurst",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "GRASS GIS Locations Created From Public Data"
        },
        {
          "code_url": "https://lists.osgeo.org/pipermail/soc/2017-August/003840.html",
          "description": "<p>The main idea behind this project is to develop an add-on which allows to create/play educational games. Also generate documentation specially oriented to users without any programming knowledge.</p>\n<p>The code will be mainly developed in Jython, an implementation of the Python programming language written in Java, through the scripting module of the gvSIG desktop 2.x branch.</p>\n<p>The developed tools will be used in geography and maps learning.</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2017_012",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6319623737704448/",
          "proposal_id": null,
          "short_description": "The main idea behind this project is to develop an add-on which allows to create/play educational games. Also generate documentation specially...",
          "slug": "educational-games-add-on-for-gvsig-batovíeduca",
          "status": "completed",
          "student_name": "Carlos I. Colombana",
          "student_profile": null,
          "tags": [
            "python",
            "java",
            "ai"
          ],
          "title": "Educational games add-on for gvSIG Batoví/Educa"
        },
        {
          "code_url": "https://lists.osgeo.org/pipermail/soc/2017-August/003843.html",
          "description": "<p>Connected components algorithms are used to analyze graph and solve problems (like 2-satisfiability problem). There are three parts of connected components algorithms in the Boost Graph Library (BGL),</p>\n<ol>\n<li>Connected components algorithm.</li>\n<li>Strongly connected components algorithm.</li>\n<li>Biconnected components algorithm.  </li>\n</ol>\n<p>I am proposing to add those BGL functionalities to pgRouting during this GSoC period.</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2017_013",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5135673321324544/",
          "proposal_id": null,
          "short_description": "Connected components algorithms are used to analyze graph and solve problems (like 2-satisfiability problem). There are three parts of connected...",
          "slug": "implement-connected-components-algorithms-for-pgrouting-by-the-boost-graph-library",
          "status": "completed",
          "student_name": "Maoguang Wang",
          "student_profile": null,
          "tags": [],
          "title": "Implement Connected Components Algorithms for pgRouting by the Boost Graph Library"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2017/organizations/4554340639440896/"
    },
    "year_2018": {
      "num_projects": 10,
      "projects": [
        {
          "code_url": "https://lists.osgeo.org/pipermail/soc/2018-August/004186.html",
          "description": "<p>The current GRASS GIS version has partial support for Python 3. This project aims to update core GRASS components for Python 3 and update all the python modules, libraries and components like script package, python/ctypes, pygrass, temporal, wxGUI, etc. At the end of this project, GRASS GIS will be compatible with both the versions of python, i.e Python 2.7 and Python 3 with its GUI having support for wxPython 4.</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2018_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5652161459388416/",
          "proposal_id": null,
          "short_description": "The current GRASS GIS version has partial support for Python 3. This project aims to update core GRASS components for Python 3 and update all the...",
          "slug": "full-support-of-python-3-in-grass-gis",
          "status": "completed",
          "student_name": "Sanjeet Bhatti",
          "student_profile": null,
          "tags": [
            "python",
            "ai",
            "ui"
          ],
          "title": "Full support of Python 3 in GRASS GIS"
        },
        {
          "code_url": "https://github.com/rahulworld/Support-of-Unit-Of-Measure-conversion-in-istSOS3/blob/master/gsoc/GSoC.md",
          "description": "<p>The aim of my project primarily is to add plugins in istSOS3 for unit of measure conversion. The user can convert unit in another specified unit using plugins. For Unit of measure conversion in istSOS3 we added postgresql-unit and pint libraries which has a powerful feature of unit conversion along with many unit conversion specified functions instantly and all types operations supports to istsos3 data like add, subtraction, multiplication and division with magnitude and units.</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2018_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5674440260059136/",
          "proposal_id": null,
          "short_description": "The aim of my project primarily is to add plugins in istSOS3 for unit of measure conversion. The user can convert unit in another specified unit...",
          "slug": "support-of-unit-of-measure-conversion-in-istsos3",
          "status": "completed",
          "student_name": "rahulworld",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Support of Unit Of Measure conversion in istSOS3"
        },
        {
          "code_url": "https://lists.osgeo.org/pipermail/soc/2018-August/004177.html",
          "description": "<p>Optical sensors are unable to penetrate clouds leading to related incorrect reflectance values. Unlike\nLandsat images, Sentinel 2 datasets do not include thermal and Quality Assessment bands that simplify\nthe detection of clouds avoiding erroneous classification. At the same time, clouds shadows on the ground lead to anomalous reflectance values which have to be taken into account during the image processing.\nThe project aim is the coding of a specific module for GRASS GIS application which implements the procedure developed within my PhD research. The procedure allows to automatically identify clouds and their shadows in Sentinel 2 images applying some rules on reflectance values (values thresholds, comparisons between bands, etc.). These have been defined starting from rules found in literature and conveniently refined. Then the detection of shadows is improved using an adapted shape index. In order to increase the accuracy of the final results, a control check is implemented. Clouds and shadows are spatially intersected in order to remove misclassified areas. The final outputs are two different vector files (OGR standard formats), one for clouds and one for shadows.</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2018_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/6151540461010944/",
          "proposal_id": null,
          "short_description": "Optical sensors are unable to penetrate clouds leading to related incorrect reflectance values. Unlike\nLandsat images, Sentinel 2 datasets do not...",
          "slug": "grass-gis-module-for-sentinel-2-cloud-and-shadow-detection",
          "status": "completed",
          "student_name": "Roberta Fagandini",
          "student_profile": null,
          "tags": [
            "ai",
            "cloud"
          ],
          "title": "GRASS GIS module for Sentinel-2 cloud and shadow detection"
        },
        {
          "code_url": "https://github.com/AasheeshT/pgRoutingLayer/wiki/Final-Report",
          "description": "<p>The new version of QGIS has introduced an API break. The key changes in QGIS 3.0 are as follows:</p>\n<p>Updated from Qt4 to Qt5</p>\n<p>Updated from PyQt4 to PyQt5</p>\n<p>Updated from Python 2.7 to Python 3.0</p>\n<p>QGIS API is improved , many classes have been deprecated or renamed.</p>\n<p>The above changes have implications that the pgRoutingLayer plugin is no longer compatible with QGIS 3.0 . For my GSoC project, I propose to accommodate these changes in pgRoutingLayer plugin code and also make use of the new features introduced in QGIS 3.0 to improve the functionality of plugin’s GUI. Also currently there is no test coverage for plugin code which makes it difficult to change features efficiently, so a complete unit test coverage will be built which not only will help in this project but also in future ventures. In addition to this I propose to add functionality for the proposed stable functions of following families:</p>\n<p>Astar : pgr_astarCost , pgr_astarCostMatrix</p>\n<p>Bidirectional astar : pgr_bdAstarCost , pgr_bdAstarCostMatrix</p>\n<p>Bidirectional Dijkstra : pgr_bdDijkstraCost , pgr_bdDijkstraCostMatrix</p>\n<p>Flow</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2018_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/4548857308381184/",
          "proposal_id": null,
          "short_description": "The new version of QGIS has introduced an API break. The key changes in QGIS 3.0 are as follows:\nUpdated from Qt4 to Qt5\nUpdated from PyQt4 to PyQt5...",
          "slug": "making-pgroutinglayer-plugin-compatible-with-qgis-30-and-adding-gui-support-for-proposed-stable-functions-which-are-scheduled-for-next-release",
          "status": "completed",
          "student_name": "Aasheesh Tiwari",
          "student_profile": null,
          "tags": [
            "python",
            "api",
            "ui"
          ],
          "title": "Making pgRoutingLayer plugin compatible with QGIS 3.0 and Adding GUI support for proposed stable functions which are scheduled for next release."
        },
        {
          "code_url": "https://trac.osgeo.org/postgis/wiki/GeospatialDataViewerInPgAdmin4ForPostGIS_FinalReport",
          "description": "<p>pgAdmin is the GUI management tool for PostgreSQL. The latest version pgAdmin4 is web-based and written in Python and jQuery with Bootstrap, using the Flask framework. But currently there is no geospatial data viewer in pgAdmin4, and external applications, such as QGIS are required if we want to  browser the data in a map. It’s not convenient for users to view geometries directly in pgAdmin4 “Data Output” table panel.</p>\n<p>I propose to implement a geospatial data viewer in pgAdmin4 that will allow users to view the tables in a spatial database and the results of queries executed. With the viewer I intend to develop, users can directly view geospatial data on a map within the pgAdmin4 GUI. Refer to the <a href=\"https://trac.osgeo.org/postgis/wiki/GeospatialDataViewerInPgAdmin4ForPostGIS\" target=\"_blank\">project wiki</a> to get more detail.</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2018_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/4832028394520576/",
          "proposal_id": null,
          "short_description": "pgAdmin is the GUI management tool for PostgreSQL. The latest version pgAdmin4 is web-based and written in Python and jQuery with Bootstrap, using...",
          "slug": "implement-geospatial-data-viewer-in-pgadmin4-for-postgis",
          "status": "completed",
          "student_name": "Xuri Gong",
          "student_profile": null,
          "tags": [
            "python",
            "web",
            "ai",
            "database",
            "ui"
          ],
          "title": "Implement Geospatial Data Viewer in pgAdmin4 for PostGIS"
        },
        {
          "code_url": "https://github.com/geopython/pywps/pull/371",
          "description": "<p>The Web Processing Service (WPS) is an Open Geospatial Consortium (OGC) standard that provides rules for publishing and executing processes on the web. PyWPS is an implementation of the WPS standard.  It allows to publish and consume geoprocessing services on a server. This project’s aim is to develop database storage support for PyWPS that would allow output data to be stored in a database in a way that is compliant with the OGC WPS Standard using the MapServer platform that implements OGC standards.</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2018_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/6067691425103872/",
          "proposal_id": null,
          "short_description": "The Web Processing Service (WPS) is an Open Geospatial Consortium (OGC) standard that provides rules for publishing and executing processes on the...",
          "slug": "database-output-storage-for-pywps",
          "status": "completed",
          "student_name": "Jan Pišl",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "database"
          ],
          "title": "Database Output Storage for PyWPS"
        },
        {
          "code_url": "https://github.com/pgRouting/pgrouting/wiki/GSoC-2018-Minimum-cost-flow-and-ChPP",
          "description": "<p>Minimum-cost flow problem is an extension of maximum flow problem with an added cost (per unit flow) for each edge. The Chinese Postman Problem (ChPP) in a directed graph or an undirected graph can be solved by Minimum-cost flow algorithm.<br>\nI am proposing to add Minimum-cost flow algorithm and directed ChPP algorithms to pgRouting during this GSoC period.</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2018_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/4843352612667392/",
          "proposal_id": null,
          "short_description": "Minimum-cost flow problem is an extension of maximum flow problem with an added cost (per unit flow) for each edge. The Chinese Postman Problem...",
          "slug": "implement-minimum-cost-flow-algorithm-by-the-boost-graph-library-and-chinese-postman-problem-for-pgrouting",
          "status": "completed",
          "student_name": "Maoguang Wang",
          "student_profile": null,
          "tags": [],
          "title": "Implement Minimum-cost flow Algorithm by the Boost Graph Library and Chinese Postman Problem for pgRouting"
        },
        {
          "code_url": "https://github.com/davidtethal/gisquick-gsoc2018/wiki/Final-Report-GSoC-2018",
          "description": "<p>My project will extend the current filtering tool that was developed as a part of my final thesis. Currently it is focused on spatio-temporal vector data filtering. I would like to add support for general spatio-temporal both vector and raster data, as well as other functionalities that will make it easy to handle by every client and make the data publishing more effective.</p>\n",
          "difficulty": "beginner",
          "id": "proj_osgeo-open-source-ge_2018_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5850679075667968/",
          "proposal_id": null,
          "short_description": "My project will extend the current filtering tool that was developed as a part of my final thesis. Currently it is focused on spatio-temporal vector...",
          "slug": "extension-of-gisquick-platform-filtering-tool-based-on-raster-and-vector-spatio-temporal-data",
          "status": "completed",
          "student_name": "David Těthal",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "Extension of Gisquick platform filtering tool based on raster and vector spatio-temporal data"
        },
        {
          "code_url": "https://lists.osgeo.org/pipermail/soc/2018-August/004181.html",
          "description": "<p>Graph connectivity is one of the classical subjects in graph theory and has many practical applications. A Minimum Spanning Tree in an undirected connected weighted graph is a spanning tree of minimum weight. For this we can implement two function that are Prim and Kruskal algorithms.</p>\n<p>Finding the minimum cut of an edge weighted graph is a fundamental algorithmic problem. Stoer–Wagner algorithm is a recursive algorithm to solve the minimum cut problem in undirected weighted graphs with non-negative weights. The essential idea of this algorithm is to shrink the graph by merging the most intensive vertices, until the graph only contains two combined vertex sets. Implement Min-Cut by Stoer Wagner function.</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2018_009",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5854279130677248/",
          "proposal_id": null,
          "short_description": "Graph connectivity is one of the classical subjects in graph theory and has many practical applications. A Minimum Spanning Tree in an undirected...",
          "slug": "implement-minimum-spanning-tree-and-min-cut-for-pgrouting-by-the-boost-graph-library",
          "status": "completed",
          "student_name": "Aditya Pratap Singh",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Implement Minimum Spanning Tree and Min-Cut for pgRouting by the Boost Graph Library."
        },
        {
          "code_url": "https://lists.osgeo.org/pipermail/soc/2018-August/004182.html",
          "description": "<p>Graph Algorithms like Dijkstra’s single source shortest path algorithm are widely applied in many routing applications, but for the Large-scale graph, computation problem may arise. It may be beneficial to exploit the high-performance parallel computing system, by implementing distributed graph algorithms in pgRouting.The current state of the pgRouting doesn’t support any parallel algorithm. I am proposing to add Parallel Dijkstra’s Algorithm using Parallel BGL functionalities and additionally a classical sequential graph algorithm namely, bellman_ford_shortest_paths to pgRouting during this GSoC period.</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2018_010",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5166614936813568/",
          "proposal_id": null,
          "short_description": "Graph Algorithms like Dijkstra’s single source shortest path algorithm are widely applied in many routing applications, but for the Large-scale...",
          "slug": "implement-parallel-dijkstras-and-bellman-ford-algorithm-by-the-parallel-bgl",
          "status": "completed",
          "student_name": "Sourabh Garg",
          "student_profile": null,
          "tags": [],
          "title": "Implement Parallel Dijkstra’s and Bellman-Ford algorithm by the Parallel BGL"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2018/organizations/4890968767594496/"
    },
    "year_2019": {
      "num_projects": 7,
      "projects": [
        {
          "code_url": "https://github.com/hecnita/gvsig-gsoc2019-topology/wiki/Work-Product",
          "description": "<p>The project consists of the creation of three new topological rules in the gvSIG desktop toolbox. These rules are '' Must be disjoint '', \"Must not have dangles\" and \"Must be larger than cluster tolerance\" that will help to verify the integrity of the spatial information, validate the representations and correct possible errors of the point, linear and poligonal geometries. Definitely, ensure the quality of geographic data with open source software.</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2019_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/6592130720464896/",
          "proposal_id": null,
          "short_description": "The project consists of the creation of three new topological rules in the gvSIG desktop toolbox. These rules are '' Must be disjoint '', \"Must not...",
          "slug": "create-of-new-topological-rules-in-gvsig-desktop",
          "status": "completed",
          "student_name": "Héctor Tundidor",
          "student_profile": null,
          "tags": [],
          "title": "Create of new topological rules in gvSIG desktop"
        },
        {
          "code_url": "https://ismailsunni.github.io/GSoC-2019/",
          "description": "<p>QGIS 3D is a great feature that has been introduced in QGIS 3.0 in 2018. It is still missing some features that are needed or can be helpful for the user though. In this project, I will work on 4 improvements to fill that missing features:</p>\n<ul>\n<li>On Screen Navigation: help the user to navigate the 3D view</li>\n<li>Bookmarks: help the user to save a 3D view and/or go back to a saved 3D view</li>\n<li>Rendering Point Feature as Billboard: show a point feature as a billboard (use case: show icon location and point cloud rendering)</li>\n<li>Measuring Tool: measure distance in 3D view</li>\n</ul>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2019_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5387550166876160/",
          "proposal_id": null,
          "short_description": "QGIS 3D is a great feature that has been introduced in QGIS 3.0 in 2018. It is still missing some features that are needed or can be helpful for the...",
          "slug": "qgis-3d-improvement-on-screen-navigation-bookmarks-rendering-point-feature-as-billboard-and-measuring-tool",
          "status": "completed",
          "student_name": "Ismail Sunni",
          "student_profile": null,
          "tags": [
            "cloud"
          ],
          "title": "QGIS 3D Improvement: On Screen Navigation, Bookmarks, Rendering Point Feature as Billboard, and Measuring Tool"
        },
        {
          "code_url": "https://github.com/pgRouting/pgrouting/wiki/GSoC-2019-Edward-Moore's-Algorithm,-Breadth-First-Search-and-Binary-Breadth-First-Search",
          "description": "<p><strong>Edward Moore's Algorithm</strong> is an improvement over Bellman-Ford's algorithm and can compute single-source shortest paths in weighted (including negative weights) directed graphs. It has an average running time of <strong><em>O(|E|)</em></strong> on random graphs and the same worst-case complexity as Bellman-Ford's algorithm of <strong><em>O(|V| x |E|)</em></strong>.</p>\n<p><strong>Boost::Breadth First Search</strong> is the implementation of the classic Breadth First Algorithm in the Boost Graph Library. It is a basic graph traversal algorithm which can be applied to any type of graph. One of its various applications is to find the path with minimum edges from a given source to an arbitrary destination. It has a linear time complexity of <strong><em>O(|V| + |E|)</em></strong>.</p>\n<p><strong>Binary Breadth First Search</strong> is a modification of the standard Breadth First Search algorithm and can calculate single-source shortest paths in a weighted graph where weights of all edges are either zero or some constant <em>C</em>. It has a linear time complexity of <strong><em>O(|V| + |E|)</em></strong> compared to <strong><em>O(|E| + |V| log |V|)</em></strong> of Dijkstra’s algorithm.</p>\n<p>I propose to add the above three algorithms to pgRouting during the GSoC period.</p>\n",
          "difficulty": "advanced",
          "id": "proj_osgeo-open-source-ge_2019_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/4969850387038208/",
          "proposal_id": null,
          "short_description": "Edward Moore's Algorithm is an improvement over Bellman-Ford's algorithm and can compute single-source shortest paths in weighted (including negative...",
          "slug": "implement-edward-moores-algorithm-breadth-first-search-and-binary-breadth-first-search-algorithms-in-pgrouting",
          "status": "completed",
          "student_name": "Gudesa Venkata Sai Akhil",
          "student_profile": null,
          "tags": [],
          "title": "Implement Edward Moore's Algorithm, Breadth First Search and Binary Breadth First Search Algorithms in pgRouting"
        },
        {
          "code_url": "https://github.com/pgRouting/pgrouting/wiki/GSoC-2019-GRAPH-C---Boost-graph-algorithms-for-pgRouting",
          "description": "<p>My project will focus on implementing topological sort, transitive closure and lengauer tarjan dominator tree.</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2019_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/6090469145051136/",
          "proposal_id": null,
          "short_description": "My project will focus on implementing topological sort, transitive closure and lengauer tarjan dominator tree.",
          "slug": "gsoc-19-graph-c-boost-graph-algorithms-for-pgrouting",
          "status": "completed",
          "student_name": "Hang Wu",
          "student_profile": null,
          "tags": [],
          "title": "GSoC 19: GRAPH C++ Boost graph algorithms for pgRouting"
        },
        {
          "code_url": "https://github.com/fenilgmehta/mapmint/wiki/GSoC-2019---Final-Report",
          "description": "<p>At present the <a href=\"https://github.com/mapmint/mapmint\" target=\"_blank\">MapMint</a> project is running on Python 2.x whose support will soon end in 2020 and MapMint is unable to take advantage of the improvements in Python 3.</p>\n<p>I intend to port the MapMint source code to Python 3.x and reformat the code to improve the readability of the program and ease maintenance.</p>\n<p>Future developments:</p>\n<ol>\n<li>Static type checking can be added to improve data validation and improve the quality of the code.</li>\n<li>Python documentation can be added to ease new users understandability.</li>\n</ol>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2019_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/4859857885200384/",
          "proposal_id": null,
          "short_description": "At present the MapMint project is running on Python 2.x whose support will soon end in 2020 and MapMint is unable to take advantage of the...",
          "slug": "mapmint-porting-from-python-2x-to-python-3x",
          "status": "completed",
          "student_name": "Fenil Mehta",
          "student_profile": null,
          "tags": [
            "python",
            "ai"
          ],
          "title": "MapMint - porting from Python 2.x to Python 3.x"
        },
        {
          "code_url": "https://github.com/Maureque/gvsig-gsoc2019-topology/wiki/8.-Final-Report",
          "description": "<p>Before starting the project only a few topology rules have been implemented, most of them pending to be developed. With the project was achieved implemented a new set of topology rules for vector datasets validation and fixing, that improve and expand the existing before.\nAt present, this tool provides a group of integrity rules that check the validation of the geometries relationship in the data. Is provided a new set of tools to navigate, find and fix validation errors different from each topology rule. This project analyzes, implement and optimize a new set of rules that are incorporated into the Topology Framework. These tools were created using Jython through the Scripting composer tool of gvSIG.\nTo future, in order to continue developing the project, some of the possible improvements would be implemented more actions and develop more rules.</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2019_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5915581163765760/",
          "proposal_id": null,
          "short_description": "Before starting the project only a few topology rules have been implemented, most of them pending to be developed. With the project was achieved...",
          "slug": "new-rules-for-the-topology-framework-in-gvsig-desktop",
          "status": "completed",
          "student_name": "Mauro Carlevaro",
          "student_profile": null,
          "tags": [],
          "title": "New rules for the Topology Framework in gvSIG Desktop"
        },
        {
          "code_url": "https://github.com/AdityaChondke/MapMint4ME/wiki/Final-Report-GSoC-2019",
          "description": "<p>MapMint4ME (MM4ME) is an android application allows user to take photos, record their positions, and view their current location on map based on configuration settings of their MapMint server. The Application stores data in the absence of internet connectivity and uploads recorded data to the server when it's online. The aim of the project is to add Augmented Reality (AR) support in MapMint4ME and add features like adding markers while capturing images, drawing shapes on scenes, calculating the distance between points, calculating the area of an object in the frame and geotagging captured data.</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2019_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5962182162907136/",
          "proposal_id": null,
          "short_description": "MapMint4ME (MM4ME) is an android application allows user to take photos, record their positions, and view their current location on map based on...",
          "slug": "adding-augmented-reality-ar-support-to-the-mapmint4me-android-application",
          "status": "completed",
          "student_name": "Aditya Vitthalrao",
          "student_profile": null,
          "tags": [
            "android",
            "ai"
          ],
          "title": "Adding Augmented Reality (AR) support to the MapMint4ME Android Application"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2019/organizations/6684630290268160/"
    },
    "year_2020": {
      "num_projects": 10,
      "projects": [
        {
          "code_url": "https://trac.osgeo.org/grass/wiki/GSoC/2020/StartupWindow#FinalReport",
          "description": "<p>This project will focus on the creation of a more user friendly GRASS GIS startup. The general idea is to make the initial user’s contact easier and with a less steep learning curve. While programming new GRASS startup GUI several tasks will be solved – changes in Location wizard structure, Data Catalog as well as general GUI.</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2020_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5713801627828224/",
          "proposal_id": null,
          "short_description": "This project will focus on the creation of a more user friendly GRASS GIS startup. The general idea is to make the initial user’s contact easier and...",
          "slug": "creation-of-a-new-grass-gis-startup-mechanism",
          "status": "completed",
          "student_name": "Linda Kladivova",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "Creation of a new GRASS GIS startup mechanism"
        },
        {
          "code_url": "https://github.com/jolicar/GSoC2020/wiki/GSoC2020-New-rules-for-the-Topology-Framework-in-gvSIG-Desktop",
          "description": "<p>My project seeks to improve the topology motor of gvSIG Desktop. Also I would like to correct some topology rules and implant three new rules.</p>\n<p>The topology rules that I want modify are TopologyRuleMustBeProperlyInsidePolygonsPoint and TopologyRuleContainsPointPolygon. The new rules to create are TopologyRuleContainsOnePointPolygon, TopologyRuleMustCoverEachOtherPolygon and UDR (TopologyRuleUserDefinedRule).</p>\n<p>I have to do code implementation, create or update the documentation and create a test plan too.</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2020_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5739605220917248/",
          "proposal_id": null,
          "short_description": "My project seeks to improve the topology motor of gvSIG Desktop. Also I would like to correct some topology rules and implant three new rules.\nThe...",
          "slug": "new-rules-for-the-topology-framework-in-gvsig-desktop",
          "status": "completed",
          "student_name": "Jose Olivas Carriquí",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "New rules for the Topology Framework in gvSIG Desktop"
        },
        {
          "code_url": "https://github.com/pgRouting/pgrouting/wiki/GSoC-2020-Implement-Boyer-Myrvold-Planarity-Testing-and-Make-Connected-in-pgRouting",
          "description": "<p><strong>Boost::boyer_myrvold_planarity_test</strong> A graph is planar if it can be drawn in two-dimensional space with no two of its edges crossing. Such a drawing of a planar graph is called a plane drawing. Every planar graph also admits a straight-line drawing, which is a plane drawing where each edge is represented by a line segment. When a graph has K5 or K3,3 as subgraph then the graph is not planar.  This algorithm is only applicable for <strong>undirected</strong> graphs. It has a linear time complexity of <strong>O(|V|)</strong>.</p>\n<p><strong>Boost::make_connected</strong> Adds the minimum number of edges needed to make the input graph connected. The algorithm first identifies all of the connected components in the graph, then adds edges to connect those components together in a path. For example, if a graph contains three connected components A, B, and C, make_connected will add two edges. The two edges added might consist of one connecting a vertex in A with a vertex in B and one connecting a vertex in B with a vertex in C.  This algorithm is only applicable for <strong>undirected</strong> graphs. It has a linear time complexity of <strong>O(|V| + |E|)</strong>.</p>\n<p>I propose to add the above two algorithms to pgRouting during the GSoC period.</p>\n",
          "difficulty": "advanced",
          "id": "proj_osgeo-open-source-ge_2020_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5404340644216832/",
          "proposal_id": null,
          "short_description": "Boost::boyer_myrvold_planarity_test A graph is planar if it can be drawn in two-dimensional space with no two of its edges crossing. Such a drawing...",
          "slug": "implement-boyer-myrvold-planarity-testing-and-make-connected-in-pgrouting",
          "status": "completed",
          "student_name": "Himanshu Raj",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Implement Boyer Myrvold Planarity Testing and Make Connected in pgRouting"
        },
        {
          "code_url": "https://github.com/alex-mathew/pygeoapi/wiki/Final-Report-GSoC-2020",
          "description": "<p>pygeoapi is a python server implementation of OGC RESTful API standards. The current implementation of OGC Features API in pygeoapi supports only read operations. I propose to implement simple transactions (create, replace, update, delete) in pygeoapi OGC Features API in accordance with <code>OGC API - Features - Part 4: Simple Transactions</code> proposal. This involves the following:</p>\n<ul>\n<li>Create a sample openapi specification doc in accordance with <a href=\"https://github.com/opengeospatial/ogcapi-features/tree/master/extensions/transactions\" target=\"_blank\">Simple Transactions Proposal</a></li>\n<li>Generate the proposed openapi doc from pygeoapi config</li>\n<li>Define REST endpoints for simple transactions (POST, PUT, PATCH, DELETE) in Flask and Starlette</li>\n<li>Update pygeoapi core API to handle feature transactions</li>\n<li>Implement simple transactions in schemaless data providers - GeoJSON, CSV</li>\n<li>Implement simple transactions in schemaful data providers - PostgreSQL, SQLite</li>\n</ul>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2020_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5072103415480320/",
          "proposal_id": null,
          "short_description": "pygeoapi is a python server implementation of OGC RESTful API standards. The current implementation of OGC Features API in pygeoapi supports only...",
          "slug": "data-transaction-implementation-on-pygeoapi",
          "status": "completed",
          "student_name": "Alex Mathew",
          "student_profile": null,
          "tags": [
            "python",
            "api"
          ],
          "title": "Data transaction implementation on pygeoapi"
        },
        {
          "code_url": "https://docs.google.com/document/d/1z7mNqrIhtgouOrdttNVQAr-yHJwFF55ry1KBts5-A8g/edit?usp=sharing",
          "description": "<h5>Improving QGIS 3D capabilites by adding :</h5>\n<p>Texturing support, 3D map exporting, new rendering techniques, shadow rendering</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2020_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5093774948040704/",
          "proposal_id": null,
          "short_description": "Improving QGIS 3D capabilites by adding :\nTexturing support, 3D map exporting, new rendering techniques, shadow rendering",
          "slug": "improving-qgis-3d",
          "status": "completed",
          "student_name": "Belgacem Nedjima",
          "student_profile": null,
          "tags": [],
          "title": "Improving QGIS 3D"
        },
        {
          "code_url": "https://github.com/Maureque/GSoC2020-topology-osgeo-gvsig/wiki",
          "description": "<p>A topology toolbox has been added to gvSIG Desktop. This tool provides a group of integrity rules that check the validation of the geometries relationship in the data. A new topology data model can be created for each project. This toolbox provide a set of tools to navigate, find and fix validation errors different from each topology rule. There is a set of topology rules implemented, most of them at GSoC 2019. This project will analize, implement and optimize a new set of rules that will be incorporated to this framework. This tools can be created in Java or in Jython through the Scripting composer tool.</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2020_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/4641551331885056/",
          "proposal_id": null,
          "short_description": "A topology toolbox has been added to gvSIG Desktop. This tool provides a group of integrity rules that check the validation of the geometries...",
          "slug": "new-rules-for-the-topology-framework-in-gvsig-desktop",
          "status": "completed",
          "student_name": "Giani Carlevaro",
          "student_profile": null,
          "tags": [
            "java"
          ],
          "title": "New rules for the Topology Framework in gvSIG Desktop"
        },
        {
          "code_url": "https://github.com/pgRouting/pgrouting/wiki/GSoC-2020-Lengauer-Tarjan-dominator-tree-and-Bipartite",
          "description": "<p>Graph algorithm Lengauer Tarjan Dominator Tree is applied in many routing applications, one application can be if the user wants to go from city A to city B and there are multiple routes but all the routes are diverting from city X then the user can find out city X by using this algorithm.\nThe first part of this project is to provide support for Lengauer Tarjan Dominator Tree in pgRouting and the second part of this project is to provide support for check any given graph is bipartite or not. If the graph is bipartite then function returns the vertex along with two colors 0 and 1 which represents two different sets. If graph is not bipartite then algorithm returns an empty set.\nThe algorithms are going to be taken from the Boost Graph Library (BGL).</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2020_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/4645571421274112/",
          "proposal_id": null,
          "short_description": "Graph algorithm Lengauer Tarjan Dominator Tree is applied in many routing applications, one application can be if the user wants to go from city A to...",
          "slug": "implement-lengauer-tarjan-dominator-tree-and-bipartite-algorithm-for-pgrouting",
          "status": "completed",
          "student_name": "Prakash Tiwari",
          "student_profile": null,
          "tags": [],
          "title": "Implement Lengauer Tarjan Dominator Tree and Bipartite algorithm for pgRouting"
        },
        {
          "code_url": "https://github.com/pgRouting/pgrouting/wiki/GSoC-2020-Depth-First-Search-and-Sequential-Vertex-Coloring",
          "description": "<p>The project aims to add the following two algorithms in pgRouting:</p>\n<p><strong>Depth First Search</strong>: It is the implementation of a standard graph traversal algorithm, and has been implemented in Boost Graph Library as two different algorithms - <code>boost::depth_first_search</code> for directed graphs and <code>boost::undirected_dfs</code> for undirected graphs. One of its applications is to find a path in the graph from a source vertex to all other vertices. It has a linear time complexity of <code>O(|V| + |E|)</code>.</p>\n<p><strong>Sequential Vertex Coloring</strong>: It is an algorithm to compute the vertex coloring of a graph. This involves assigning colors to the vertices of a graph sequentially in such a way that no two adjacent vertices have the same color. It has been implemented in the Boost Graph Library as <code>boost::sequential_vertex_coloring</code> for undirected graphs. One of its applications is to do a proper coloring of the graph or to check if a graph is bipartite. It has a time complexity of <code>O(|V| * (d + k))</code>, where <code>|V|</code> is the number of vertices, <code>d</code> is the maximum degree of the vertices in the graph, and <code>k</code> is the number of colors used.</p>\n<p>The project also analyzes the behavior of several algorithms after ordering the input rows in a particular order.</p>\n",
          "difficulty": "advanced",
          "id": "proj_osgeo-open-source-ge_2020_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/4678956906708992/",
          "proposal_id": null,
          "short_description": "The project aims to add the following two algorithms in pgRouting:\nDepth First Search: It is the implementation of a standard graph traversal...",
          "slug": "depth-first-search-sequential-vertex-coloring-and-analysis-of-graph-input-ordering-for-pgrouting",
          "status": "completed",
          "student_name": "Ashish Kumar",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Depth First Search, Sequential Vertex Coloring and analysis of Graph Input Ordering for pgRouting"
        },
        {
          "code_url": "https://github.com/FarheenB/pygeoapi/wiki/Final-Report-GSoC-2020",
          "description": "<p>Develop an efficient code to contribute to pygeoapi with advanced filter functionality on features. Implement CQL on pygeoapi for specifying enhanced filters in a request to the server. Currently pygeoapi responses are irrespective of any filters queries. If provided efficient and least time computing, complex filter based APIs that would add a high value to the existing system. The query filter could be a simpler expression or it could be an arbitrarily complex expression like a combination of spatial and temporal filters.</p>\n",
          "difficulty": "advanced",
          "id": "proj_osgeo-open-source-ge_2020_009",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/4699968423591936/",
          "proposal_id": null,
          "short_description": "Develop an efficient code to contribute to pygeoapi with advanced filter functionality on features. Implement CQL on pygeoapi for specifying enhanced...",
          "slug": "cql-filter-implementation-on-pygeoapi",
          "status": "completed",
          "student_name": "Farheen Bano",
          "student_profile": null,
          "tags": [
            "api"
          ],
          "title": "CQL filter implementation on pygeoapi"
        },
        {
          "code_url": "https://github.com/aditis1204/MapMint4ME/wiki/Final-Report:-GSoC-2020",
          "description": "<p>MapMint4ME (MM4ME) is an android application with the capability to record data on the field without internet connectivity. It gives users the facility to store any kind of alphanumeric data. Users are able to take photos, record their position, and view their current location on a map based on the configuration settings of their MapMint server. When the user returns back to a place with access to the internet, the recorded data can be uploaded back to the MapMint server. The aim of the project is to extend Augmented Reality (AR) support in the MapMint4ME application. The motivation for the project was to improve field data acquisition. AR Simulation module provides users capability to visualize 3D objects simulation in real world scenes. AR Area module allows users to export measured \"AR measurements\" into text format and which can be used for further analysis. MapMint4ME works without the internet too, so adding a GPS Satellite information module which gives detailed analysis about GPS Coordinates and GPS Satellite information improves the information gathering process and makes it more efficient.</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2020_010",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/6315957250686976/",
          "proposal_id": null,
          "short_description": "MapMint4ME (MM4ME) is an android application with the capability to record data on the field without internet connectivity. It gives users the...",
          "slug": "enhancing-ar-support-for-mapmint4me-and-adding-gps-satellite-tracking",
          "status": "completed",
          "student_name": "Aditi Sawant",
          "student_profile": null,
          "tags": [
            "android",
            "ai",
            "ui"
          ],
          "title": "Enhancing AR Support for MapMint4ME and adding GPS Satellite Tracking"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2020/organizations/5355444958134272/"
    },
    "year_2021": {
      "num_projects": 12,
      "projects": [
        {
          "code_url": "https://github.com/pgRouting/pgrouting/wiki/GSoC-2021-VRP-functionality-with-VROOM-on-the-database",
          "description": "<p>The project aims at implementing the VRP functionality in the <a href=\"https://github.com/pgRouting/vrprouting/\" target=\"_blank\">vrprouting</a> repository of pgrouting, using VROOM as a library in C++.</p>\n<p><a href=\"https://github.com/VROOM-Project/vroom\" target=\"_blank\">VROOM</a> is an open-source optimization engine, that aims at providing good solutions to well-known Vehicle Routing Problems (VRP), such as:</p>\n<ul>\n<li>TSP (Travelling Salesman Problem)</li>\n<li>CVRP (Capacitated VRP)</li>\n<li>VRPTW (VRP with Time Windows)</li>\n<li>MDHVRPTW (Multi-Depot Heterogeneous VRPTW)</li>\n<li>PDPTW (Pickup-and-Delivery Problem with TW)</li>\n</ul>\n<p>Implementing the VROOM functionality as a PostgreSQL function will be very beneficial to those users who want to use the VROOM functionality directly from the database. Users can use it to solve real-world vehicle routing problems efficiently, as VROOM provides a good solution to well-known vehicle routing problems within small computing times, and it can scale to handle very big instances.</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2021_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5684733287071744/",
          "proposal_id": null,
          "short_description": "The project aims at implementing the VRP functionality in the vrprouting repository of pgrouting, using VROOM as a library in C++.\nVROOM is an...",
          "slug": "vrp-functionality-with-vroom-on-the-database-for-pgrouting",
          "status": "completed",
          "student_name": "Ashish-Kumar",
          "student_profile": null,
          "tags": [
            "ai",
            "database"
          ],
          "title": "VRP functionality with VROOM on the database for pgRouting"
        },
        {
          "code_url": "https://aaronsms.github.io/gsoc/2021.html",
          "description": "<p>The project focuses on parallelizing existing modules that can benefit from parallelization with OpenMP, such as r.neighbors, r.mfilter, r.univar, r.texture etc.</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2021_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5418858269114368/",
          "proposal_id": null,
          "short_description": "The project focuses on parallelizing existing modules that can benefit from parallelization with OpenMP, such as r.neighbors, r.mfilter, r.univar,...",
          "slug": "parallelization-of-existing-modules-for-grass-gis",
          "status": "completed",
          "student_name": "Aaron Saw Min Sern",
          "student_profile": null,
          "tags": [],
          "title": "Parallelization of existing modules for GRASS GIS"
        },
        {
          "code_url": "https://trac.osgeo.org/grass/wiki/GSoC/2021/SingleWindowLayout#FinalReport",
          "description": "<p>My project will mainly focus on extensive Graphical User Interface (GUI) refactoring necessary to prepare GRASS GIS for Single-Window GUI. As the result, I will introduce a very simple Single-Window layout and importantly a good programming base allowing further convenient extension and improvement with additional functions.</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2021_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5505611139121152/",
          "proposal_id": null,
          "short_description": "My project will mainly focus on extensive Graphical User Interface (GUI) refactoring necessary to prepare GRASS GIS for Single-Window GUI. As the...",
          "slug": "first-steps-towards-a-new-grass-gis-single-window-gui",
          "status": "completed",
          "student_name": "Linda Kladivova",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "First steps towards a new GRASS GIS Single-Window GUI"
        },
        {
          "code_url": "https://github.com/ayoubft/Journey-GSoC-21/wiki/Final-Report",
          "description": "<p>Minimalist 3D scan (taking multiple pictures, recording camera position, using opendrone map  to rebuild the 3D scene) with the house faces (accessible/visible faces) then load it as georeferenced data with the database and being able to export the data back on MapMint for 3D viewing.</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2021_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5562519455793152/",
          "proposal_id": null,
          "short_description": "Minimalist 3D scan (taking multiple pictures, recording camera position, using opendrone map  to rebuild the 3D scene) with the house faces...",
          "slug": "integrating-a-module-to-3d-scan-a-house-within-the-mapmint4me-android-application",
          "status": "completed",
          "student_name": "ayoubft",
          "student_profile": null,
          "tags": [
            "android",
            "database",
            "ui"
          ],
          "title": "Integrating a module to 3d scan a house within the MapMint4ME android application."
        },
        {
          "code_url": "https://github.com/srvsingh1962/ARDraw-MM4ME/wiki/Final-Report-Google-Summer-of-Code-2021-Project",
          "description": "<p>Introducing the Augmented Reality experience in the present MapMint4ME project and working on Better UI and UX part for the Augmented Reality Experience.</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2021_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/4651587124854784/",
          "proposal_id": null,
          "short_description": "Introducing the Augmented Reality experience in the present MapMint4ME project and working on Better UI and UX part for the Augmented Reality...",
          "slug": "ar-draw-measure-experience-in-mapmint4me",
          "status": "completed",
          "student_name": "Sourav singh",
          "student_profile": null,
          "tags": [
            "ui",
            "ux"
          ],
          "title": "AR Draw + Measure experience in MapMint4me"
        },
        {
          "code_url": "https://gist.github.com/Franc-Brs/b533fde3bec4ba16978c8fd2ef5e064f#file-gsoc2021-md",
          "description": "<p>QGIS already has an integrated raster calculator, where user can enter an expression that will apply raster algebra functions to one or more input rasters and produce a new raster file. \nThis project aim is to develop a raster calculator as a new renderer for raster layers. It will be possible to perform the computation on the fly  when map gets rendered.\nIt will be therefore possible for the users to see the results of raster algebra expression that has been typed without the creation of derived raster files.\nFor example, it should be possible to compute the NDVI index on-the-fly.\nIt's possible to take inspiration from already existing raster renderers such as hillsahding and contours, these two render type work in a similar way. </p>\n<p>The work will be divided in two main big tasks, the first involves prototyping the new renderer, the second involves\nadding features for the user interface.</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2021_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/4676329726803968/",
          "proposal_id": null,
          "short_description": "QGIS already has an integrated raster calculator, where user can enter an expression that will apply raster algebra functions to one or more input...",
          "slug": "new-virtual-raster-data-provider-for-raster-calculator-in-qgis",
          "status": "completed",
          "student_name": "Francesco Bursi",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "New Virtual Raster Data Provider for Raster Calculator in QGIS"
        },
        {
          "code_url": "https://github.com/aryanxk02/mapmint/wiki/GSoC-2021:-Final-Report",
          "description": "<p>Implementation of 3D visualization support and integration with the MapMint instance. The 3D scenes are rendered with Potree Loaders along with Cesium as the backend. The datasets for this work being provided through OpenDroneMap are referred to as Geographic Information System data, containing files of the type obj, las, ply, point-clouds, kml, geoJSON. These files are of the UAV imagery format and can be loaded on browsers on the instance through Potree’s orbit tools and loaders by rendering them accordingly. This is followed by adding a switcher tab as an add-on feature to visualize the OpenLayersMap data and corresponding rendered output. Finally resulting to successful classified rendered object on the instance of a corresponding Georeferenced image.</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2021_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6036322531147776/",
          "proposal_id": null,
          "short_description": "Implementation of 3D visualization support and integration with the MapMint instance. The 3D scenes are rendered with Potree Loaders along with...",
          "slug": "implement-3d-scene-visualization-support-using-potree-and-integrate-with-mapmint",
          "status": "completed",
          "student_name": "Aryan Kenchappagol",
          "student_profile": null,
          "tags": [
            "ml",
            "ai",
            "cloud",
            "backend"
          ],
          "title": "Implement 3D scene visualization support using Potree and integrate with MapMint"
        },
        {
          "code_url": "https://github.com/postgis/postgis/pull/619",
          "description": "<p>Create and test pre-sorting methods of z-order and Hilbert curve for elements in GiST index to check if it will improve the performance of index building process.</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2021_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5762639296200704/",
          "proposal_id": null,
          "short_description": "Create and test pre-sorting methods of z-order and Hilbert curve for elements in GiST index to check if it will improve the performance of index...",
          "slug": "implement-sorting-methods-for-postgis-data-types-before-building-gist-index",
          "status": "completed",
          "student_name": "HanwGeek",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "Implement sorting methods for PostGIS data types before building GiST index"
        },
        {
          "code_url": "https://trac.osgeo.org/grass/wiki/GSoC/2021/JupyterAndGRASS",
          "description": "<p>My project will focus on 3 main tasks: (1) simplifying the launch of GRASS GIS sessions in Jupyter Notebooks, (2) creating a more intuitive way to display GRASS maps in Jupyter Notebooks and (3) introducing an interactive map display function for GRASS in Jupyter Notebooks using Folium.</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2021_009",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6277136683368448/",
          "proposal_id": null,
          "short_description": "My project will focus on 3 main tasks: (1) simplifying the launch of GRASS GIS sessions in Jupyter Notebooks, (2) creating a more intuitive way to...",
          "slug": "improved-integration-of-grass-gis-and-jupyter-notebooks",
          "status": "completed",
          "student_name": "CaitlinHaedrich",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Improved Integration of GRASS GIS and Jupyter Notebooks"
        },
        {
          "code_url": "https://github.com/AniketDGiri/mapmint/wiki/Final-Report-GSoC-2021",
          "description": "<p>With the 3D scene visualization, viewing data in three dimensions gives users new perspectives. 3D viewing can provide insights that would not be readily possible from the same data's georeferenced map. Currently, MapMint can process the georeferenced image but, since there is no feature provided to the user for viewing the data in three dimensions, which provides the user a new way of analyzing the data. In this project, I will be implementing a 3D visualization as an add-on feature to our earlier services provided by MapMint.</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2021_010",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6288524990480384/",
          "proposal_id": null,
          "short_description": "With the 3D scene visualization, viewing data in three dimensions gives users new perspectives. 3D viewing can provide insights that would not be...",
          "slug": "implement-3d-scene-visualization-support-using-potree-and-integrate-with-mapmint",
          "status": "completed",
          "student_name": "Aniket Giri",
          "student_profile": null,
          "tags": [],
          "title": "Implement 3D scene visualization support using Potree and integrate with MapMint"
        },
        {
          "code_url": "https://github.com/Sandeep10021/mapmint/wiki/Final-Report:-GSoC-2021",
          "description": "<p>At present  the user can only visualize the 2D datasets and can even generate one of them. So, my major approach in this project would be to create an user interface as WPS service within MapMint such that the user cannot only visualize the 3D dataset but can also build the same. This can be done either through either simply  capturing via camera or importing drone captured images. Further I am planning to integrate the various functionality as a toolbox to process the 3D datasets and 2D datasets as well. \nIf time permits the various additional functionality such as enhancement, smoothing, sharpening, brightness control will also be implemented.</p>\n",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2021_011",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5168188542681088/",
          "proposal_id": null,
          "short_description": "At present  the user can only visualize the 2D datasets and can even generate one of them. So, my major approach in this project would be to create...",
          "slug": "integrating-3d-scene-builder-as-wps-services-within-mapmint-administration-user-interface",
          "status": "completed",
          "student_name": "Sandeep Saurav",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "Integrating 3D scene builder as WPS services within MapMint administration User Interface"
        },
        {
          "code_url": "https://github.com/pgRouting/pgrouting/wiki/GSoC-2021-Implement-Edge-Coloring-Algorithm-for-pgRouting-by-the-Boost-Graph-Library",
          "description": "<p><strong>Edge Coloring</strong> is an algorithm used for coloring of the edges for the vertices in the graph. It is an assignment of colors to the edges of the graph so that no two adjacent edges have the same color.</p>\n<p>If edges are ordered as e1, e2, ..., en it assigns colors c1, c2, ..., cn in such a way that no vertex connects with 2 edges of the same color.\nFurthermore, at most <strong>Δ + 1</strong> colors are used, where <strong>Δ</strong> is the degree of the graph.</p>\n<p>It is used in several representations of real-world systems like traffic signalling, bi-processors, fiber-optic communication, etc. It can also tell us if a graph is <strong>Bipartite</strong>.\nIt is implemented in Boost Graph Library (BGL) as <a href=\"https://www.boost.org/doc/libs/1_76_0/libs/graph/doc/edge_coloring.html\" target=\"_blank\"><strong>Boost::Edge Coloring</strong></a>. It is applicable for <strong>undirected</strong> and <strong>loop-free</strong> (i.e <em>no self-loops and no parallel edges</em>) graph. It has a polynomial-time complexity of <em>O</em>(|<em>E</em> | |<em>V</em> |).</p>\n",
          "difficulty": "advanced",
          "id": "proj_osgeo-open-source-ge_2021_012",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5198869406679040/",
          "proposal_id": null,
          "short_description": "Edge Coloring is an algorithm used for coloring of the edges for the vertices in the graph. It is an assignment of colors to the edges of the graph...",
          "slug": "implement-edge-coloring-algorithm-for-pgrouting-by-the-boost-graph-library",
          "status": "completed",
          "student_name": "Veenit Kumar",
          "student_profile": null,
          "tags": [
            "ml"
          ],
          "title": "Implement Edge Coloring Algorithm for pgRouting by the Boost Graph Library"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2021/organizations/5115040503431168/"
    },
    "year_2022": {
      "num_projects": 6,
      "projects": [
        {
          "code_url": "https://github.com/mmomtchev/libnode",
          "description": "The ZOO-Project is a solid WPS server able to handle services implemented in various different programming languages. The existing `ZOO-Kernel` supports C, C++, and JS implementations with the embedded version of the SpiderMonkey engine.\n\nWith this project, the objective is to add support for NodeJS implementation of the `ZOO-Kernel`.",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2022_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/ZsLHGYTg/",
          "proposal_id": null,
          "short_description": "The ZOO-Project is a solid WPS server able to handle services implemented in various different programming languages. The existing `ZOO-Kernel`...",
          "slug": "adding-nodejs-support-for-service-implementation-to-the-zoo-kernel",
          "status": "completed",
          "student_name": "mmomtchev",
          "student_profile": null,
          "tags": [],
          "title": "Adding Node.js support for service implementation to the ZOO-Kernel"
        },
        {
          "code_url": "https://github.com/pgRouting/pgrouting/wiki/GSoC-2022-Implementing-hawick_circuits-algorithm-from-Boost-Graph-Library-to-pgRouting",
          "description": "The project aims at implementing Boost Graph Library Algorithm Hawick_circuits in pgRouting.Hawick circuit is an algorithm used for searching circuits in a graph. It can be used to enumerate all the circuits in a directed multigraph. Specifically, it can also enumerate self-loops and redundant circuits caused by parallel edges which is not detected by other available algorithm for circuits.It enumerates the circuits in linear order of vertex.This algorithm is an extension of Johnson's algorithm for circuits and presents a memory efficient and high-performance implementation.",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2022_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/7WWx9hAC/",
          "proposal_id": null,
          "short_description": "The project aims at implementing Boost Graph Library Algorithm Hawick_circuits in pgRouting.Hawick circuit is an algorithm used for searching...",
          "slug": "implementing-hawick_circuits-algorithm-from-boost-graph-library-to-pgrouting",
          "status": "completed",
          "student_name": "Nitish Chauhan",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Implementing hawick_circuits algorithm from Boost Graph Library to  pgRouting"
        },
        {
          "code_url": "https://github.com/pgRouting/pgrouting/wiki/GSoC-2022-Add-Google-OR-Tools-functionality-in-vrpRouting",
          "description": "Proposal : Add Google OR Tools functionality in vrpRouting.\n\nIntegrate Google-OR-tools, a combinatorial optimization software tool into pgRouting/vrpRouting. Proposing to add 3 functions from Bin Packing module. \n\nDeliverables : vrp_knapsack, vrp_multiple_knapsack and vrp_bin_packing vrprouting functions with appropriately commented code, well documented user's manual and carefully curated pgTAP's for testing.",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2022_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/lySCzc6L/",
          "proposal_id": null,
          "short_description": "Proposal : Add Google OR Tools functionality in vrpRouting. Integrate Google-OR-tools, a combinatorial optimization software tool into...",
          "slug": "osgeopgrouting-add-google-or-tools-functionality-in-vrprouting",
          "status": "completed",
          "student_name": "Manas_2001",
          "student_profile": null,
          "tags": [],
          "title": "Osgeo[Pgrouting] : Add Google OR-Tools functionality in vrpRouting"
        },
        {
          "code_url": "https://github.com/sdhoundiyal/GSoC_ZOO-Project",
          "description": "The ZOO-Project is an open-source WPS (Web Processing Service) platform. WPS allows GIS processing to be done remotely. Currently, the ZOO-Project consists of a set of native services based on various open-source libraries eg. OGR, GDAL, etc.\nThis proposal outlines the addition of QGIS processes as first citizen services of the ZOO-Project.",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2022_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/FxtReu6V/",
          "proposal_id": null,
          "short_description": "The ZOO-Project is an open-source WPS (Web Processing Service) platform. WPS allows GIS processing to be done remotely. Currently, the ZOO-Project...",
          "slug": "integrating-zoo-services-with-qgis",
          "status": "completed",
          "student_name": "Sandeepan Dhoundiyal",
          "student_profile": null,
          "tags": [
            "web"
          ],
          "title": "Integrating ZOO-services with QGIS"
        },
        {
          "code_url": "https://github.com/bhupendra1324/mapmint",
          "description": "MapMint is a web-based Geographic Information System (GIS), which is designed to facilitate deployment of Spatial Data Infrastructure (SDI). In an SDI, geographic data, metadata, tools, and the users are connected in an interactive manner in a framework so as to use the spatial information in an efficient and flexible way. MapMint combines various different software in a complete and coherent web mapping platform, thus helping users in building their own maps and web-applications. These web-services are built on top of the ZOO-Project. \nVisualizing geospatial data in front end is a challenging task. For this, adding Cesium support within MapMint is a great task of building interactive web interface.\nMy deliverables would be, \nComplete integration of Cesium Library within MapMint.",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2022_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/haiLMxnP/",
          "proposal_id": null,
          "short_description": "MapMint is a web-based Geographic Information System (GIS), which is designed to facilitate deployment of Spatial Data Infrastructure (SDI). In an...",
          "slug": "zoo-project-adding-cesium-support-within-mapmint",
          "status": "completed",
          "student_name": "Bhupendra",
          "student_profile": null,
          "tags": [
            "web",
            "ui"
          ],
          "title": "ZOO-Project - Adding Cesium support within MapMint"
        },
        {
          "code_url": "https://github.com/pgRouting/pgrouting/wiki/GSoC-2022-Implement-Cuthill-Mckee-Ordering-Algorithm-for-pgRouting-by-the-Boost-Graph-Library",
          "description": "The Cuthill-Mckee Ordering is an algorithm used to reduce the bandwidth of a graph by\nreordering the indices assigned to each vertex. The vertices are basically assigned a breadth-first search order, except that at each step, the adjacent vertices are placed in the queue in order of increasing degree. This algorithm is from the class of Sparse Matrix Ordering of Boost Graph Library. It is used to speed up various computations.\nIt is implemented in Boost Graph Library (BGL). It is applicable for undirected graphs. It has a time complexity of O(m log(m)|V|) where m = max { degree(v) | v in V }.",
          "difficulty": "advanced",
          "id": "proj_osgeo-open-source-ge_2022_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/4OxG2uIw/",
          "proposal_id": null,
          "short_description": "The Cuthill-Mckee Ordering is an algorithm used to reduce the bandwidth of a graph by reordering the indices assigned to each vertex. The vertices...",
          "slug": "implement-cuthill-mckee-ordering-boost-graph-library-algorithm-for-pgrouting",
          "status": "completed",
          "student_name": "Shobhit Chaurasia",
          "student_profile": null,
          "tags": [],
          "title": "Implement Cuthill-Mckee Ordering Boost Graph Library Algorithm for pgRouting"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2022/organizations/osgeo-open-source-geospatial-foundation/"
    },
    "year_2023": {
      "num_projects": 7,
      "projects": [
        {
          "code_url": "https://github.com/pgRouting/pgrouting/wiki/GSoC-2023-Implement-pgr_withPointsKSP-and-Add-Overloads",
          "description": "The project aims to implement pgr_withPointsKSP and all its overloads.\nYen's algorithm computes single-source K-shortest loopless paths for a graph with non-negative edge cost. It employs any shortest path algorithm to find the best path, then proceeds to find K − 1 deviations of the best path. \nSometimes the applications work “on the fly” starting from a location that is not a vertex in the graph. Those locations, in pgRouting, are called points of interest.\nSo this function will modify the graph to include these points of interest and, using Yen’s Algorithm finds K shortest paths.",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2023_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/6SNYZ0ph",
          "proposal_id": "8G0EFv8L",
          "short_description": "The project aims to implement pgr_withPointsKSP and all its overloads. Yen's algorithm computes single-source K-shortest loopless paths for a graph...",
          "slug": "implement-pgr_withpointsksp-and-add-overloads",
          "status": "completed",
          "student_name": "Abhinav_Jain",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Implement pgr_withPointsKSP and Add Overloads"
        },
        {
          "code_url": "https://github.com/pgRouting/pgrouting/wiki/GSoC-2023-Implement-pgr_KSP-and-Add-All-Overloads",
          "description": "The implementation of a pgr_ksp() function that can calculate K shortest paths for various scenarios is essential for many applications. This project aims to implement a pgr_ksp function that can handle four more different scenarios that are one-to-many, many-to-one, many-to-many, and combinations of (source, target). By implementing such a function, we can efficiently and accurately find multiple shortest paths for different scenarios and improve the performance of various applications that rely on this functionality.",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2023_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/8JpdTHk8",
          "proposal_id": "Tjaj2ujU",
          "short_description": "The implementation of a pgr_ksp() function that can calculate K shortest paths for various scenarios is essential for many applications. This project...",
          "slug": "implementation-of-the-pgr_ksp-and-add-all-the-overloads",
          "status": "completed",
          "student_name": "Aniket Agarwal",
          "student_profile": null,
          "tags": [
            "ios",
            "ai"
          ],
          "title": "Implementation of the pgr_KSP and add all the overloads."
        },
        {
          "code_url": "https://github.com/pgRouting/pgrouting/wiki/GSoC-2023-Implementing-Dijkstra%E2%80%99s-Driving-distance-Function-and-its-migration",
          "description": "The project aims to implement a new function called \"pgr_dijkstraDD\" that replaces the existing \"pgr_drivingDistance\" function. The new function will have all overloads, including single and multiple vertices as before. The function will return columns such as sequence, depth, start vertex ID, node, edge, cost, and aggregate cost for all overloads. The project will also include testing of the new function with pgTap Tests. Documentation for the new function and migration guides for users to switch to the new function will also be created.",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2023_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/tAxiQllV",
          "proposal_id": "VnmPgg0R",
          "short_description": "The project aims to implement a new function called \"pgr_dijkstraDD\" that replaces the existing \"pgr_drivingDistance\" function. The new function will...",
          "slug": "implementing-dijkstras-driving-distance-function-and-its-migration",
          "status": "completed",
          "student_name": "Aryan Gupta1",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Implementing Dijkstra’s Driving distance Function and its migration"
        },
        {
          "code_url": "https://blog.filippofinke.ch/posts/final-report-gsoc/",
          "description": "istSOS currently supports the Sensor Observation Service (SOS) standard, but to enhance its interoperability, we propose implementing some of the basic APIs from the SensorThings API (STA) in a prototype version. This project aims to test new technologies that could be adopted in a future revised version of istSOS.",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2023_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/wLDJ39zW",
          "proposal_id": "QII7BFfJ",
          "short_description": "istSOS currently supports the Sensor Observation Service (SOS) standard, but to enhance its interoperability, we propose implementing some of the...",
          "slug": "support-basic-sensorthings-api-sta-for-istsos",
          "status": "completed",
          "student_name": "filippofinke",
          "student_profile": null,
          "tags": [
            "api",
            "ai"
          ],
          "title": "Support basic SensorThings API (STA) for istSOS"
        },
        {
          "code_url": "https://github.com/Koushikey4596/ZOO-Project/wiki/Final-Report",
          "description": "The ZOO-Project is an SDI manager which gives the users the capability of building their own map and web applications using Map server as the Open Geospatial Consortium (OGC) services engine. It is an open-source implementation of the OGC's Web Processing Service (WPS) standard. WPS Interface Standard provides rules for standardizing how inputs and outputs (requests and responses) for geospatial processing services (eg. polygon overlay). WPS also standardizes how a client can request the execution of a process, and how the output from the process is handled.  The existing ZOO-Kernel supports C, C++, and JavaScript implementations. With this project, the objective is to have the ZOO-Kernel passing all the tests for WPS 1.0.0 and 2.0.0 OGC ETS. \r\n\r\nDuring the GSoC the main focus is on making the WPS 2.0.0 test suite working properly. The async tests are still wrong currently and should be fixed, this will be done during the GSoC. The next and final step will be to get the WPS 1.0.0 test suite working and comprehensive enough to get the Test Suite or the ZOO-Project fixed. Moving from OGC API - Processes - Part 1: Core to WPS 2.0.0. can also be added as second step for the project.",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2023_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/Wx8rnGL5",
          "proposal_id": "tqq0XyTn",
          "short_description": "The ZOO-Project is an SDI manager which gives the users the capability of building their own map and web applications using Map server as the Open...",
          "slug": "getting-ready-with-zoo-project-for-the-ogc-compliance-testing",
          "status": "completed",
          "student_name": "Koushikey Chhapariya",
          "student_profile": null,
          "tags": [
            "java",
            "javascript",
            "web",
            "api",
            "ai"
          ],
          "title": "Getting ready with ZOO-Project for the OGC Compliance Testing."
        },
        {
          "code_url": "https://saailn.github.io/Saail_GSoC23/",
          "description": "The goal of my project is to add OGC standard of Sensor Things API(STA) to istSOS project. The OGC SensorThings API provides an open, geospatial-enabled and unified way to interconnect the Internet of Things (IoT) devices, data, and applications over the Web. The project aims to extend interoperability and implement some of the basic APIs from STA that could be adopted in a new revised version of istSOS.\r\nFastAPI can be used for the request and response of the istSOS STA services. As PostgreSQL is used as the primary data store or data warehouse in istSOS project, data can be managed using postGIS which is a spatial database extender for PostgreSQL object-relational database.\r\nPostgREST is a standalone web server that could be used to turn the PostgreSQL database of STA data directly into a RESTful API.\r\nFinally the STA service can be integrated with the istSOS project.",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2023_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/TmvBTqrE",
          "proposal_id": "kZpgzLnz",
          "short_description": "The goal of my project is to add OGC standard of Sensor Things API(STA) to istSOS project. The OGC SensorThings API provides an open,...",
          "slug": "support-basic-sensor-things-api-sta-in-istsos",
          "status": "completed",
          "student_name": "Saail Narvekar",
          "student_profile": null,
          "tags": [
            "web",
            "api",
            "ai",
            "database"
          ],
          "title": "Support basic Sensor Things Api (STA) in istSOS"
        },
        {
          "code_url": "https://github.com/pgRouting/pgrouting/wiki/GSoC-2023-Improving-Parameters-and-Standardizing-Results-in-pgr_withPointsDD-Function-for-pgRouting",
          "description": "This project aims to enhance the functionality of the pgr_withPointsDD function in pgRouting  by improving the 'driver_side' optional parameter, adding a result column and normalizing the output. And all overloads will be implemented(Single vertex & Multiple vertices).\nThe pgr_withPointsDD function modifies the graph to include points and using Dijkstra algorithm, extracts all the nodes and points that have costs less than or equal to the value from the starting point. The edges extracted will conform to the corresponding spanning tree.",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2023_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/k9zuPo5a",
          "proposal_id": "EZOr7Mbn",
          "short_description": "This project aims to enhance the functionality of the pgr_withPointsDD function in pgRouting by improving the 'driver_side' optional parameter,...",
          "slug": "improving-parameters-and-standardizing-results-in-pgr_withpointsdd-function-for-pgrouting",
          "status": "completed",
          "student_name": "Yige Huang",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Improving Parameters and Standardizing Results in pgr_withPointsDD Function for pgRouting"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2023/organizations/osgeo-open-source-geospatial-foundation"
    },
    "year_2024": {
      "num_projects": 7,
      "projects": [
        {
          "code_url": "https://github.com/dhruvmehtaaa/ZOO-Project/tree/Week-12",
          "description": "The ZOO-Project is an open-source WPS (Web Processing Service) platform. This proposal entails designing and implementing a comprehensive unit test management framework to cover key capabilities and ensure software reliability. The focus will be on implementing test fixtures and setUp/tearDown methods to establish preconditions and clean up resources efficiently, ensuring consistent and reproducible test environments.",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2024_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/hLiX75zQ/",
          "proposal_id": null,
          "short_description": "The ZOO-Project is an open-source WPS (Web Processing Service) platform. This proposal entails designing and implementing a comprehensive unit test...",
          "slug": "advancing-the-zoo-project-testing-capabilities",
          "status": "completed",
          "student_name": "dhruvmehtaaa",
          "student_profile": null,
          "tags": [
            "web",
            "ai"
          ],
          "title": "Advancing the ZOO-Project testing capabilities"
        },
        {
          "code_url": "https://github.com/istSOS/istSOS4-STAC/wiki/Google-Summer-of-Code-2024-Final-Report-istSOS-STAC",
          "description": "The objective of the project is to add support for STAC(SpatioTemporal Asset Catalog) to istSOS. The STAC specification is an open specification developed to improve the discovery, accessibility, and interoperability of geospatial datasets. \nSTAC provides a common, interoperable metadata framework to expose geospatial assets, like satellite images either of optical or SAR, or other spatiotemporal data.\nSTAC allows ease of access to different format of spatial data through a common way to find more information about the geographic location over a period of time.\nExpected outcome of the project is adding support for STAC based metadata generation and serving through api server.",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2024_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/z1NoWrga/",
          "proposal_id": null,
          "short_description": "The objective of the project is to add support for STAC(SpatioTemporal Asset Catalog) to istSOS. The STAC specification is an open specification...",
          "slug": "istsosμ-support-for-stac",
          "status": "completed",
          "student_name": "Chetan Mahajan",
          "student_profile": null,
          "tags": [
            "api"
          ],
          "title": "istSOSμ support for STAC"
        },
        {
          "code_url": "https://github.com/istSOS/istsos-miu/wiki/GSOC-2024-Final-Report",
          "description": "Summary:\n\nThe project aims to extend istSOS to support the dataArray extension, which is commonly used in SensorThings for managing Observation entities. Currently, istSOS lacks support for dataArray, limiting its compatibility with SensorThings. By incorporating dataArray support, istSOS will become more versatile and user-friendly, allowing for efficient retrieval and creation of Observation entities. This extension is expected to enhance istSOS's performance by reducing the size of requests and responses, ultimately improving the user experience. The project's expected outcome is the successful integration of dataArray support into istSOS.",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2024_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/f9HRFQqL/",
          "proposal_id": null,
          "short_description": "Summary: The project aims to extend istSOS to support the dataArray extension, which is commonly used in SensorThings for managing Observation...",
          "slug": "istsos-support-for-data-array-extension",
          "status": "completed",
          "student_name": "filippofinke",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "istSOS support for data array extension"
        },
        {
          "code_url": "https://grasswiki.osgeo.org/wiki/GRASS_GSoC_2024_Improve_user_experience_in_Jupyter_Notebooks#Final_Report",
          "description": "Problem Statement:\n- The existing InteractiveMap lacks advanced features, rendering performance is suboptimal, and handling large datasets can be challenging.\n- Users desire a more interactive and user-friendly experience.\n\nDeliverables:\n- Interactive Data Retrieval: Empower users to explore data within the map.\n- Custom Projections: Flexibility in choosing map projections.\n- Optimized Rendering: Efficiently handle large datasets.\n- Comprehensive Documentation: Clear instructions for users and developers.\n\nStretch goals: \n- Improve Pandas integration.\n- Enable high-resolution display by tiling.\n- Implementing a graphical user interface (GUI) for tool presentation in Jupyter Notebook.",
          "difficulty": "advanced",
          "id": "proj_osgeo-open-source-ge_2024_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/1KXI3ewU/",
          "proposal_id": null,
          "short_description": "Problem Statement: - The existing InteractiveMap lacks advanced features, rendering performance is suboptimal, and handling large datasets can be...",
          "slug": "improve-grass-user-experience-in-jupyter-notebook",
          "status": "completed",
          "student_name": "29riyasaxena",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "Improve GRASS user experience in Jupyter  Notebook"
        },
        {
          "code_url": "https://github.com/pgRouting/pgrouting/wiki/GSoC-2024-Brandes-Betweenness-Centrality",
          "description": "The project aims to implement the Brandes betweenness centrality algorithm in pgRouting. Betweenness centrality is a measure of node importance based on the number of shortest paths between other node pairs that pass through that node. It is widely used in network analysis, transport and social networks, and other graph-related applications.",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2024_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/bgXBcKOA/",
          "proposal_id": null,
          "short_description": "The project aims to implement the Brandes betweenness centrality algorithm in pgRouting. Betweenness centrality is a measure of node importance based...",
          "slug": "implementing-brandes-betweenness-algorithm-from-boost-graph-library-to-pgrouting-for-gsoc-2024",
          "status": "completed",
          "student_name": "bedupako",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Implementing Brandes Betweenness Algorithm from Boost Graph Library to pgRouting for GSoC 2024"
        },
        {
          "code_url": "https://grasswiki.osgeo.org/wiki/GRASS_GSoC_2024_EODAG_Support",
          "description": "The project focuses on writing a Python library for GRASS GIS that utilizes EODAG API. Currently, GRASS uses different APIs for each satellite data provider. As a result, a lot of maintenance has to be done to keep up with the changes happening to all the different APIs. Thus, adding EODAG support to GRASS GIS will provide a lot of flexibility in the future development of GRASS, by decreasing the amount of maintenance needed to keep up with all the different APIs updated, and instead maintain the support for EODAG library. Deliverables for this proposal are supporting Sentinel, Landsat, and MODIS datasets with EODAG, and reimplementation of both i.sentinel.download and i.landsat.download modules with the new GRASS EODAG library.",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2024_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/eWqnFI4u/",
          "proposal_id": null,
          "short_description": "The project focuses on writing a Python library for GRASS GIS that utilizes EODAG API. Currently, GRASS uses different APIs for each satellite data...",
          "slug": "add-eodag-support-to-grass-gis",
          "status": "completed",
          "student_name": "<Hamed>",
          "student_profile": null,
          "tags": [
            "python",
            "api",
            "ai"
          ],
          "title": "Add EODAG support to GRASS GIS"
        },
        {
          "code_url": "https://grasswiki.osgeo.org/wiki/GRASS_GSoC_2024_Add_JSON_output",
          "description": "At the moment, most of the tools in Grass have custom human readable outputs in plain text. Some of these modules could benefit from storing their output in a portable and commonly used data format. The aim of my project is to use the parson library in various tools so that they can produce JSON outputs. The addition of JSON as an output format will be accompanied with addition of Python test cases to verify the output works as intended and to avoid regressions in future. An option to specify the desired output format (plain or JSON) will also be added to each of the tools updated. The layout of the JSON format will be discussed with mentors prior to implementation and will be optimized towards easy ingestion with Pandas.",
          "difficulty": "beginner",
          "id": "proj_osgeo-open-source-ge_2024_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/qKiBlvHG/",
          "proposal_id": null,
          "short_description": "At the moment, most of the tools in Grass have custom human readable outputs in plain text. Some of these modules could benefit from storing their...",
          "slug": "osgeo-grass-add-json-output-to-different-tools-in-c",
          "status": "completed",
          "student_name": "juno",
          "student_profile": null,
          "tags": [
            "python",
            "ai"
          ],
          "title": "OSGeo Grass: Add JSON output to different tools in C"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2024/organizations/osgeo-open-source-geospatial-foundation/"
    },
    "year_2025": {
      "num_projects": 9,
      "projects": [
        {
          "code_url": null,
          "description": "The ZOO-Project is an open-source WPS (Web Processing Service) platform. The propose of this proposal is to reorganize and improve the ZOO-Project CWL runner ecosystem by creating a unified and modular repository structure. The goal is to make the code for existing CWL runners (EOEPCA, Argo Workflows, Calrissian) more generic, facilitate the addition of new runners, and provide clear documentation. Proposal's plan includes using abstract classes to reduce code duplication, enhancing the entry point logic, and ensuring compatibility with ZOO-Kernel and CWL standards.",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2025_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/DHY55xFA",
          "proposal_id": "03qUkaij",
          "short_description": "The ZOO-Project is an open-source WPS (Web Processing Service) platform. The propose of this proposal is to reorganize and improve the ZOO-Project...",
          "slug": "migrating-and-updating-the-existing-cwl-runners",
          "status": "in-progress",
          "student_name": "Aryan Khare",
          "student_profile": null,
          "tags": [
            "web"
          ],
          "title": "Migrating and updating the existing CWL runners"
        },
        {
          "code_url": null,
          "description": "This project aims to integrate the Sloan sparse matrix ordering algorithm from the Boost Graph Library into pgRouting, enhancing its capabilities for graph optimization for both undirected and directed graphs. The Sloan algorithm generates optimal vertex ordering that reduces profile and bandwidth of graphs, significantly improving the efficiency of matrix operations in network analysis applications.\n\nWhile pgRouting includes several matrix manipulation algorithms, it lacks specific matrix ordering algorithms like Sloan ordering that are essential for optimizing sparse matrices in network analysis. Current workarounds require users to export data to external tools, breaking workflow continuity.\n\nI plan to develop a new function pgr_sloanOrdering() with complete integration, comprehensive error handling, and support for both directed and undirected graphs. The implementation will leverage the Boost Graph Library's existing algorithm with careful adaptation to pgRouting's architecture.\nThe project deliverables include a fully implemented Sloan ordering algorithm integration, comprehensive documentation and usage examples, an extensive test suite with performance benchmarks, and support for various graph types with configurable parameters.\n\nThis project will benefit the community by expanding pgRouting's graph analysis capabilities, particularly for applications in transportation networks, utility network management, and scientific computing where matrix ordering significantly impacts computational efficiency.",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2025_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/AYTTkvxI",
          "proposal_id": "HKakGlaE",
          "short_description": "This project aims to integrate the Sloan sparse matrix ordering algorithm from the Boost Graph Library into pgRouting, enhancing its capabilities for...",
          "slug": "implementing-sloan-ordering-algorithm-from-boost-graph-library-to-pgrouting",
          "status": "in-progress",
          "student_name": "Bipasha Gayary",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Implementing Sloan Ordering Algorithm from Boost Graph Library to pgRouting"
        },
        {
          "code_url": null,
          "description": "This project aims to implement the King Ordering Algorithm and Minimum Degree Ordering Algorithm from the Boost Graph Library into pgRouting, expanding its graph reordering capabilities beyond the existing Cuthill-McKee ordering. These algorithms optimize graph structures for improved numerical solver performance in scientific computing and network analysis. The King Ordering Algorithm minimizes graph bandwidth by reordering vertex indices based on pseudo-degree, reducing adjacency gaps and enhancing sparse matrix computations. The Minimum Degree Ordering Algorithm reduces fill-in during Cholesky factorization by reordering matrix rows to minimize nonzero elements introduced during Gaussian elimination. By integrating these algorithms, pgRouting will offer more efficient preprocessing options, benefiting large-scale network analysis and pathfinding tasks. Deliverables include the implementation of pgr_kingOrdering() and pgr_minimumDegreeOrdering(), comprehensive documentation, test cases ensuring correctness, and regular progress updates.",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2025_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/HijWa06g",
          "proposal_id": "3r3NWLiM",
          "short_description": "This project aims to implement the King Ordering Algorithm and Minimum Degree Ordering Algorithm from the Boost Graph Library into pgRouting,...",
          "slug": "implementing-king-ordering-algorithm-and-minimum-degree-ordering-algorithm-for-pgrouting",
          "status": "in-progress",
          "student_name": "Fan Wu",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Implementing King Ordering Algorithm and Minimum Degree Ordering Algorithm for pgRouting"
        },
        {
          "code_url": null,
          "description": "The project focuses on extending the ZOO-Project by adding support for the GeoCroissant metadata standard and implementing Data-Centric AI (DCAI) workflows. Currently, the ZOO-Project lacks built-in tools for generating AI-ready metadata or assessing the quality of annotated geospatial datasets, which are essential for robust and reusable GeoAI workflows. By integrating GeoCroissant, a JSON-LD-based metadata format tailored for geospatial machine learning, and exposing these capabilities as OGC API – Processes, the project will enable users to generate, validate, and share standardized metadata. Additionally, DCAI services will be developed using Cleanlab and confident learning techniques to detect label noise, assess reliability, and guide dataset improvement. Deliverables include metadata generation and validation tools, quality assessment services, and full integration of these features into the ZOO-Project to support AI-ready data pipelines.",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2025_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/Nkzade2v",
          "proposal_id": "h2JP1tXe",
          "short_description": "The project focuses on extending the ZOO-Project by adding support for the GeoCroissant metadata standard and implementing Data-Centric AI (DCAI)...",
          "slug": "ai-ready-dataset-metadata-as-a-service-using-zoo-project",
          "status": "in-progress",
          "student_name": "Harsh Shinde",
          "student_profile": null,
          "tags": [
            "api",
            "ai",
            "ui"
          ],
          "title": "AI-ready Dataset Metadata as a Service using ZOO-Project"
        },
        {
          "code_url": null,
          "description": "The project aims to develop a web-based administrative interface for istSOS,\nfocussed on simplify the management and monitoring of SensorThings API\ncomponents. The project will provide an intuitive method for log new sensors\nand devices, configuring metadata, and real-time tracking key sensor metrics,\nincluding received data, transmission delays, and overall system performance.\nThis will also enhance usability, getting rid of comple API interactions, making\nistSOS more accessible to researchers, engineers, and IoT enthusiasts.\nCurrently, the istSOS’ graphical interface appears outdated and not aligned with\nmodern software standards. My project will also focus on updating the visual\nappearance and usability of the interface to enhance the user experience and\nmake the system more accessible and simple to use.\nAll the code will be followed with detailed comments and documentation,\nmaking future maintenance easier.",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2025_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/A4bqz8NW",
          "proposal_id": "IgVUItM6",
          "short_description": "The project aims to develop a web-based administrative interface for istSOS, focussed on simplify the management and monitoring of SensorThings API...",
          "slug": "web-administration-interface-for-istsos",
          "status": "in-progress",
          "student_name": "Luca Abate",
          "student_profile": null,
          "tags": [
            "web",
            "api",
            "ai",
            "ui"
          ],
          "title": "Web Administration Interface for istSOS"
        },
        {
          "code_url": null,
          "description": "This project focuses on developing an advanced Grafana plugin for istSOS4 that supports full OGC SensorThings API queries with parametrization and real-time data streaming. As The existing SensorThings API DataSource plugins forces users to \nmanually write raw API queries in Grafana's code editor to apply queries and lacks real-time updates. it delivers\n- A fully functional Grafana data source plugin with full parametrization.\n- Support for real-time data streaming and historical data queries.\n- A user-friendly configuration UI for defining data sources and setting up custom queries.\n- Comprehensive documentation and examples for easy adoption by the community.",
          "difficulty": "beginner",
          "id": "proj_osgeo-open-source-ge_2025_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/tZDVJvPk",
          "proposal_id": "qMbT20iH",
          "short_description": "This project focuses on developing an advanced Grafana plugin for istSOS4 that supports full OGC SensorThings API queries with parametrization and...",
          "slug": "grafana-data-source-plugin-for-istsos4",
          "status": "in-progress",
          "student_name": "Mostafa Magdyy",
          "student_profile": null,
          "tags": [
            "api",
            "ui"
          ],
          "title": "Grafana Data Source Plugin for istSOS4"
        },
        {
          "code_url": null,
          "description": "Currently, most GRASS tools produce data in plain text, which forces users to write custom parsing code when processing output in Python. This project aims to leverage the recently integrated Parson library to expand JSON output capabilities across more GRASS GIS tools. By collaborating with mentors, I plan to finalise a robust JSON output structure and implement an option for users to choose between plain text and JSON for each updated tool. I will develop Python test cases to ensure the reliability of the JSON output, provide thorough documentation with example outputs, and create practical demonstrations—such as reading JSON data into pandas—to showcase how this enhancement can streamline data processing. This initiative will significantly improve the usability and flexibility of GRASS GIS tools, making them more accessible for data science workflows.",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2025_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/GPVGd3DH",
          "proposal_id": "2aMCjCiB",
          "short_description": "Currently, most GRASS tools produce data in plain text, which forces users to write custom parsing code when processing output in Python. This...",
          "slug": "add-json-output-to-different-tools-in-c-for-grass-gis",
          "status": "in-progress",
          "student_name": "Nishant Bansal",
          "student_profile": null,
          "tags": [
            "python",
            "ml",
            "ai"
          ],
          "title": "Add JSON output to different tools in C for GRASS GIS"
        },
        {
          "code_url": null,
          "description": "This project proposes the development of a graphical setup configuration wizard for istSOS4, an open-source Sensor Observation Service. Currently, configuring istSOS4 for Docker deployment requires manual editing of .env files, which can be error-prone and challenging for new users. To solve this, I will build a user-friendly React-based interface with a Node.js backend that guides users through the configuration process step-by-step, validates inputs, and automatically generates a valid .env file.\n\nThe final deliverables will include:\n\n . A multi-step web-based GUI wizard\n\n . Real-time validation and feedback\n\n . Support for database, API, logging, and advanced settings\n\n . Comprehensive documentation and tutorials for deployment\n\nThis tool will make deploying istSOS4 faster, easier, and more accessible for both technical and non-technical users.",
          "difficulty": "advanced",
          "id": "proj_osgeo-open-source-ge_2025_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/IBbXBca9",
          "proposal_id": "UBbKdIfG",
          "short_description": "This project proposes the development of a graphical setup configuration wizard for istSOS4, an open-source Sensor Observation Service. Currently,...",
          "slug": "istsos-setup-configuration-wizard",
          "status": "in-progress",
          "student_name": "Rahull004",
          "student_profile": null,
          "tags": [
            "react",
            "web",
            "api",
            "database",
            "docker"
          ],
          "title": "istSOS Setup Configuration Wizard"
        },
        {
          "code_url": null,
          "description": "This project intends to port the Boost Graph Library's 'Bandwidth' algorithm for pgRouting into OSGeo. Graph bandwidth is a primitive parameter in graph theory that measures the largest distance between adjacent vertices when placed in a linear manner. In the context of pgRouting and spatial databases, calculation of graph bandwidth can optimize routing algorithms and query performance on huge road networks.\nThe implementation will comprise:\n\nBuilding pgr_bandwidth() function with SQL interface\nC++ backend utilizing Boost Graph Library\nIntegration with current pgRouting algorithms (especially Cuthill-McKee ordering)\nThorough documentation and examples\nUnit testing using pgTap\n\nThe algorithm will assist users in examining structural features of road networks, locating bottlenecks, and database operation optimization using enhanced cache locality and query execution. This project fills the gap of existing pgRouting capabilities by providing another valuable graph metric utility for network topology examination.\nThe deployment will adhere to pgRouting's coding guidelines and will be thoroughly tested against diverse datasets such as pgRouting sample data, benchmark graphs, and real-world transport networks.RetryClaude may err. Kindly double-check responses.",
          "difficulty": null,
          "id": "proj_osgeo-open-source-ge_2025_009",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/KkW6RVJh",
          "proposal_id": "3VCyizLr",
          "short_description": "This project intends to port the Boost Graph Library's 'Bandwidth' algorithm for pgRouting into OSGeo. Graph bandwidth is a primitive parameter in...",
          "slug": "implementing-the-bandwidth-algorithm-for-pgrouting",
          "status": "in-progress",
          "student_name": "Saloni Kumari",
          "student_profile": null,
          "tags": [
            "ai",
            "database",
            "ui",
            "backend"
          ],
          "title": "Implementing the Bandwidth Algorithm for pgRouting"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2025/organizations/osgeo-open-source-geospatial-foundation"
    }
  },
  "first_time": false,
  "contact": {
    "email": "gsoc-admin@osgeo.org",
    "guide_url": "https://wiki.osgeo.org/wiki/Google_Summer_of_Code_Recommendations_for_Students",
    "ideas_url": "https://wiki.osgeo.org/wiki/Google_Summer_of_Code_2025_Ideas",
    "irc_channel": "https://wiki.osgeo.org/wiki/Google_Summer_of_Code_Recommendations_for_Students#How_to_get_in_contact_via_IRC",
    "mailing_list": "https://www.osgeo.org/community/communications/"
  },
  "social": {
    "blog": "http://planet.osgeo.org/",
    "discord": null,
    "facebook": null,
    "github": null,
    "gitlab": null,
    "instagram": null,
    "linkedin": null,
    "mastodon": null,
    "medium": null,
    "reddit": null,
    "slack": null,
    "stackoverflow": null,
    "twitch": null,
    "twitter": "https://x.com/osgeo",
    "youtube": null
  },
  "meta": {
    "version": 1,
    "generated_at": "2026-01-25T15:28:53.790Z"
  }
}