{
  "id": "692251e353dd9d7326d33e7f",
  "slug": "portland-state-university",
  "name": "Portland State University",
  "category": "Other",
  "description": "Individual and Academic Open Source",
  "image_url": "https://lh3.googleusercontent.com/sAIPHC0hT4utSZW0pR7kqUAbtNkZZJivcSJZrbA15Cs6adP4oxthezndn2EffbpBLBN-2lSyz-pHYjqiIvfZAqMrUWClvnw",
  "img_r2_url": "https://pub-268c3a1efc8b4f8a99115507a760ca14.r2.dev/portland-state-university.webp",
  "logo_r2_url": null,
  "url": "http://wiki.cs.pdx.edu/psu-gsoc",
  "active_years": [
    2016,
    2017
  ],
  "first_year": 2016,
  "last_year": 2017,
  "is_currently_active": false,
  "technologies": [
    "open hardware",
    "language-agnostic"
  ],
  "topics": [
    "new projects",
    "academic projects",
    "individual projects"
  ],
  "total_projects": 13,
  "stats": {
    "avg_projects_per_appeared_year": 6.5,
    "projects_by_year": {
      "year_2016": 6,
      "year_2017": 7,
      "year_2018": null,
      "year_2019": null,
      "year_2020": null,
      "year_2021": null,
      "year_2022": null,
      "year_2023": null,
      "year_2024": null,
      "year_2025": null
    },
    "students_by_year": {
      "year_2016": 6,
      "year_2017": 7,
      "year_2018": null,
      "year_2019": null,
      "year_2020": null,
      "year_2021": null,
      "year_2022": null,
      "year_2023": null,
      "year_2024": null,
      "year_2025": null
    },
    "total_students": 13
  },
  "years": {
    "year_2016": {
      "num_projects": 6,
      "projects": [
        {
          "code_url": "https://gsoc2016.wordpress.com/2016/08/19/cythonpython-wrapper-for-vlfeat-library-cyvlfeat-project-status/",
          "description": "<p>VLFeat Library implements popular computer vision algorithms specialising in image understanding and local features extraction and matching. \nAlgorithms include Fisher Vector, VLAD, SIFT, MSER, k-means, hierarchical k-means, agglomerative information bottleneck, SLIC superpixels, quick shift superpixels, large scale SVM training, and many others. \nIt is written in C, with interface in MATLAB.\nThough there exists Pyvlfeat, it does not contain all the functions. That’s why, I decided to improve it as a GSOC project under Portland State University.\nA Python Interface will make this robust library accessible to the open source computer vision community as a replacement to proprietary tools like MATLAB.</p>\n<p>The Matlab version of VLFeat is open source. The project is well documented too. So It’ll help me to develop at much faster pace.</p>\n",
          "difficulty": null,
          "id": "proj_portland-state-unive_2016_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5655793323999232/",
          "proposal_id": null,
          "short_description": "VLFeat Library implements popular computer vision algorithms specialising in image understanding and local features extraction and matching. ...",
          "slug": "python-interface-for-vlfeat-library",
          "status": "completed",
          "student_name": "machinex",
          "student_profile": null,
          "tags": [
            "python",
            "ai",
            "ui"
          ],
          "title": "Python Interface for VLFeat Library"
        },
        {
          "code_url": "https://github.com/aingerson/GSoC_2016_Compressor",
          "description": "<p>Last summer under Google Summer of Code, I coded the commonly used WAH (Word-Aligned Hybrid) compression algorithm in C under the direction of David Chiu.</p>\n<p>This summer, I will be coding a different compression algorithm with significant promise. Unlike WAH which has a constant compression length, VAL (Variable-Aligned Length) compression varies depending on the column being compressed. By allowing different compression lengths, VAL can anticipate noisier columns and can compress them more efficiently than WAH can.</p>\n<p>VAL currently only exists coded in Java and can be optimized if extended into C. Then, if run in parallel, VAL would yield even greater benefits. Over the course of the summer, I intend to implement VAL in C and allow for parallelized compression and querying as well to demonstrate the benefits of VAL.</p>\n",
          "difficulty": null,
          "id": "proj_portland-state-unive_2016_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/6165966719287296/",
          "proposal_id": null,
          "short_description": "Last summer under Google Summer of Code, I coded the commonly used WAH (Word-Aligned Hybrid) compression algorithm in C under the direction of David...",
          "slug": "variable-segment-length-bitmap-compression",
          "status": "completed",
          "student_name": "aingerson",
          "student_profile": null,
          "tags": [
            "java"
          ],
          "title": "Variable Segment Length Bitmap Compression"
        },
        {
          "code_url": "http://devansh-psu-2016.blogspot.in/",
          "description": "<p>Virtual worlds like Google Earth or NASA WorldWind do not show subsurface features with negative elevation. This projects aims to be a proof-of-concept for how such a system would use opacity and translucency rendered in a virtual world to accommodate negatively elevated features.\nNASA WorldWind is an open source Java project and is the perfect candidate for this project.\nSpecifically one or two data sets of different scales and regional extents that have negative elevation values will be taken and plotted in the subsurface. The algorithm will continuously modify the opacity of the surface in order to distinguish these features clearly.</p>\n",
          "difficulty": null,
          "id": "proj_portland-state-unive_2016_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/6246763644059648/",
          "proposal_id": null,
          "short_description": "Virtual worlds like Google Earth or NASA WorldWind do not show subsurface features with negative elevation. This projects aims to be a...",
          "slug": "displaying-subsurface-features-in-the-virtual-world-using-nasas-worldwind",
          "status": "completed",
          "student_name": "Devansh T Shah",
          "student_profile": null,
          "tags": [
            "java",
            "ai",
            "ui"
          ],
          "title": "Displaying SUBSURFACE features in the virtual world using NASA's WorldWind"
        },
        {
          "code_url": "https://github.com/hpedskis/google-summer-of-code",
          "description": "<p>As someone who loves to cook, I wish that the Amazon Echo could provide recipes while cooking so this summer I'll be working to integrate an open source recipe database to create a new Amazon Echo skill. This new skill would allow a user to search for a desired recipe and then hear each ingredient, quantity, and step through the Echo.</p>\n",
          "difficulty": null,
          "id": "proj_portland-state-unive_2016_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/4717969498177536/",
          "proposal_id": null,
          "short_description": "As someone who loves to cook, I wish that the Amazon Echo could provide recipes while cooking so this summer I'll be working to integrate an open...",
          "slug": "amazon-echo-recipe-integration",
          "status": "completed",
          "student_name": "Hannah Pedersen",
          "student_profile": null,
          "tags": [
            "database"
          ],
          "title": "Amazon Echo Recipe Integration"
        },
        {
          "code_url": "https://github.com/abyardim/GIFScript/releases/tag/v1.0.0",
          "description": "<p>Graphical animations are powerful tools for delivering ideas to an audience quickly and effectively. Very simple animations can often efficiently communicate abstract ideas, especially in technical fields. However, with many of the currently available tools, designing even simple animations can involve heavy design loads which technically inclined creators are not always eager to carry. This project aims to solve this issue by providing simple tools to create expressive GIFs by writing small scripts. The scripting language provides means to describe technical animations by typing code, instead of relying on click-and-drag interfaces of most design programs, which is in fact more practical when the animation we intend to create involves objects describable mathematically or programmatically.\nThe core tool will thus be a small program which takes a script written by the user and outputs the GIF animation described in the script.</p>\n",
          "difficulty": null,
          "id": "proj_portland-state-unive_2016_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5855207313375232/",
          "proposal_id": null,
          "short_description": "Graphical animations are powerful tools for delivering ideas to an audience quickly and effectively. Very simple animations can often efficiently...",
          "slug": "gifscript-a-tool-for-scripting-technical-gif-animations",
          "status": "completed",
          "student_name": "ntrstd",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "GIFScript: A tool for scripting technical GIF animations"
        },
        {
          "code_url": "https://github.com/karthiksenthil/ruby_curry/commits/master?author=karthiksenthil",
          "description": "<p>Curry is a functional logic programming language that combines the most appealing features of the functional and logic programming paradigms. There are various implementations for Curry such as PAKCS, mcc and KiCS2 which differ in the target language used for object code generation. In this project, we propose to develop a compiler of Curry in which Ruby is the target language. Ruby is not efficient but simplifies the compiler for its high-level features including dynamic typing and reflection.  The end-product of this project will be an ideal tool that can be used by students and researchers to understand compilation techniques for functional logic programming languages, and to experiment with and prototype specific aspects of the language and the compiler, in particular parallelism, security, optimizations and language extensions.</p>\n",
          "difficulty": null,
          "id": "proj_portland-state-unive_2016_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5218342314967040/",
          "proposal_id": null,
          "short_description": "Curry is a functional logic programming language that combines the most appealing features of the functional and logic programming paradigms. There...",
          "slug": "ruby_curry-a-compiler-implementation-for-curry-built-in-ruby",
          "status": "completed",
          "student_name": "karthiksenthil",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "ruby_curry : A compiler implementation for Curry built in Ruby"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2016/organizations/5206770867765248/"
    },
    "year_2017": {
      "num_projects": 7,
      "projects": [
        {
          "code_url": "https://github.com/abhishek-sehgal954/Inkscape_extensions_for_halftone_filters",
          "description": "<p>Digital halftoning refers to the process of converting a continuous-tone image or photograph into a pattern of black and white picture elements for reproduction by a binary display device such as an ink jet printer, which can only choose to print or not print dots. The human visual, acting like a low-pass filter, blurs these printed and not printed dots together to create the illusion of continuous shades of gray. Typical halftoning algorithms produce bitmaps as output. However, there are cases when scalable halftone patterns would be useful.</p>\n<p>Scalable Vector Graphics (SVG) is an XML-based vector image format for two-dimensional graphics with support for interactivity and animation and thus obvious choice for scalable graphics. The project aims to create SVG equivalents of standard halftone patterns. These would allow a lower resolution grayscale image to be approximated by an infinite resolution monochrome vector image.</p>\n",
          "difficulty": null,
          "id": "proj_portland-state-unive_2017_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6452015836168192/",
          "proposal_id": null,
          "short_description": "Digital halftoning refers to the process of converting a continuous-tone image or photograph into a pattern of black and white picture elements for...",
          "slug": "svg-digital-halftoning",
          "status": "completed",
          "student_name": "Abhishek Sehgal",
          "student_profile": null,
          "tags": [
            "ml",
            "ai",
            "ui"
          ],
          "title": "SVG Digital Halftoning"
        },
        {
          "code_url": "https://github.com/djokester/sangita",
          "description": "<p>Creation of an NLP Toolkit to deal with Indian languages. I shall start with Hindi first and then follow it up with Bengali over the course of summer. The basic features which I want to implement in both these languages is</p>\n<ul>\n<li>An Indian Tokenizer</li>\n<li>A tool for non-contextual normalisation, </li>\n<li>A POS Tagger (pre-trained, slow and fast tagger)</li>\n<li>A Lemmatizer (a backoff Lemmatizer based on a Dictionary Lookup method)</li>\n</ul>\n<p>The proposed timeline is to complete Hindi over the course of summer. Bengali is a future/additional deliverable.</p>\n",
          "difficulty": null,
          "id": "proj_portland-state-unive_2017_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6139887946301440/",
          "proposal_id": null,
          "short_description": "Creation of an NLP Toolkit to deal with Indian languages. I shall start with Hindi first and then follow it up with Bengali over the course of...",
          "slug": "creation-of-an-nlp-toolbox-for-indian-languages",
          "status": "completed",
          "student_name": "djokester",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Creation of an NLP Toolbox for Indian Languages"
        },
        {
          "code_url": "https://github.com/teogenesmoura/votechain",
          "description": "<p>For the last few years we've seen an ongoing debate around the security of voting: Be it the incident in Florida[1] during 2000's election or the controversy around Donald Trump's election[2] - taking into account that it might have even interfered with candidates of his own party[9] -  as well as other international events[3], society's trust on voting methods has never been a matter of consensus. Voter confidence - the trust voters have that their vote is being counted correctly in an election - is one of the most fundamental aspects of any election and therefore democracy itself. How can we use recent tech advancements to enhance transparency and increase security during elections for millions of people around the globe who trust electronic voting for electing representatives? More than that - how can we provide better transparency and security for decision taking processes in general, be the final user a human or a machine?  Also, how can we do that without requiring extensive social and political efforts, so that we could deploy a solution by the end of the summer?</p>\n",
          "difficulty": null,
          "id": "proj_portland-state-unive_2017_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6146004516601856/",
          "proposal_id": null,
          "short_description": "For the last few years we've seen an ongoing debate around the security of voting: Be it the incident in Florida[1] during 2000's election or the...",
          "slug": "votechain",
          "status": "completed",
          "student_name": "Teógenes Moura",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "VoteChain"
        },
        {
          "code_url": "https://github.com/sakshamgupta006/face_align",
          "description": "<p>Aim of the project is to implement the state of the art technique on Face Alignment i.e. \"One Millisecond Face Alignment with an Ensemble of Regression Trees\" by Vahid Kazemi using OpenCV version 3.2.</p>\n",
          "difficulty": null,
          "id": "proj_portland-state-unive_2017_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5283823117926400/",
          "proposal_id": null,
          "short_description": "Aim of the project is to implement the state of the art technique on Face Alignment i.e. \"One Millisecond Face Alignment with an Ensemble of...",
          "slug": "aligning-faces-using-opencv",
          "status": "completed",
          "student_name": "Saksham Gupta",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Aligning Faces Using OpenCV"
        },
        {
          "code_url": "https://github.com/gatlinnewhouse/driveraker",
          "description": "<p>Static Page Site Generator with Google Drive as a Content Management System. Using Pandoc, Google Drive via the drive go client, and Hugo to create a static HTML page website from placing documents into a specific google drive folder. <a href=\"https://github.com/gatlinnewhouse/driveraker\" target=\"_blank\">GitHub repo</a></p>\n",
          "difficulty": null,
          "id": "proj_portland-state-unive_2017_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6520078451343360/",
          "proposal_id": null,
          "short_description": "Static Page Site Generator with Google Drive as a Content Management System. Using Pandoc, Google Drive via the drive go client, and Hugo to create a...",
          "slug": "driveraker",
          "status": "completed",
          "student_name": "Gatlin Newhouse",
          "student_profile": null,
          "tags": [
            "web",
            "ml"
          ],
          "title": "driveraker"
        },
        {
          "code_url": "https://github.com/Lrakulka/Double_Bottom_USB_Stick",
          "description": "<p>I propose to create a USB Flash Drive with the possibility to conceal the fact that the flash drive contains hidden information. I mean that hidden folders will not be displayed if the USB drive is connected to a computer.\nThe microcontroller of the USB drive will carry the process of encryption and concealment of files. That is why the only solution to break protection will be to physically read memory from the memory component and break the encryption algorithm to get the plain data.</p>\n",
          "difficulty": null,
          "id": "proj_portland-state-unive_2017_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5906524656369664/",
          "proposal_id": null,
          "short_description": "I propose to create a USB Flash Drive with the possibility to conceal the fact that the flash drive contains hidden information. I mean that hidden...",
          "slug": "double-bottom-usb-stick-usb-flash-drive-with-possibility-to-conceal-information",
          "status": "completed",
          "student_name": "Oleksandr Borysov",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Double Bottom USB Stick (USB Flash Drive with possibility to conceal information)"
        },
        {
          "code_url": "https://gitlab.com/andrralv/i7-books/commits/master",
          "description": "<p>Interactive Fiction programs have been around for a while, <a href=\"http://www.ifiction.org/\" target=\"_blank\">http://www.ifiction.org/</a> is a website that holds many of the classics released for DOS, Atari, Amiga, among other computing and videogame systems from the seventies and eighties. Inform7 is a modern platform that lets the user create their own text-based games, or interactive fiction stories to be shared with others. Inform7 displays an easy to use graphical interface that is intuitive and lets users without programming experience to develop their own stories.</p>\n<p>The purpose of this project is to enhance the experience by finishing the book description extension developed by Bart Massey, already available for download in the inform7 website.</p>\n<p>This proposal is based on the ideas list set by the organization found here [<a href=\"http://wiki.cs.pdx.edu/psu-gsoc/ideas.html\" target=\"_blank\">http://wiki.cs.pdx.edu/psu-gsoc/ideas.html</a>]</p>\n",
          "difficulty": "beginner",
          "id": "proj_portland-state-unive_2017_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5227181089226752/",
          "proposal_id": null,
          "short_description": "Interactive Fiction programs have been around for a while, http://www.ifiction.org/ is a website that holds many of the classics released for DOS,...",
          "slug": "book-description-extension-for-inform-7",
          "status": "completed",
          "student_name": "andrralv",
          "student_profile": null,
          "tags": [
            "web",
            "ml",
            "ai",
            "ui"
          ],
          "title": "Book Description extension for Inform 7"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2017/organizations/5827042528460800/"
    },
    "year_2018": null,
    "year_2019": null,
    "year_2020": null,
    "year_2021": null,
    "year_2022": null,
    "year_2023": null,
    "year_2024": null,
    "year_2025": null
  },
  "first_time": false,
  "contact": {
    "email": "psu-gsoc-2017@googlegroups.com",
    "guide_url": null,
    "ideas_url": null,
    "irc_channel": null,
    "mailing_list": null
  },
  "social": {
    "blog": "http://psu-gsoc-info.blogspot.com/",
    "discord": null,
    "facebook": null,
    "github": null,
    "gitlab": null,
    "instagram": null,
    "linkedin": null,
    "mastodon": null,
    "medium": null,
    "reddit": null,
    "slack": null,
    "stackoverflow": null,
    "twitch": null,
    "twitter": null,
    "youtube": null
  },
  "meta": {
    "version": 1,
    "generated_at": "2026-01-25T15:28:54.006Z"
  }
}