{
  "id": "692251e653dd9d7326d33ea5",
  "slug": "sagemath",
  "name": "SageMath",
  "category": "Science and medicine",
  "description": "Open-source mathematics software system",
  "image_url": "https://summerofcode.withgoogle.com/media/org/sagemath/1tcj7svgwadc13cj-360.png",
  "img_r2_url": "https://pub-268c3a1efc8b4f8a99115507a760ca14.r2.dev/sagemath.webp",
  "logo_r2_url": null,
  "url": "https://www.sagemath.org",
  "active_years": [
    2016,
    2017,
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "first_year": 2016,
  "last_year": 2025,
  "is_currently_active": true,
  "technologies": [
    "python",
    "cython",
    "javascript",
    "c++",
    "c",
    "python 3"
  ],
  "topics": [
    "mathematics",
    "math",
    "science",
    "mathematical software",
    "combinatorics",
    "algorithms",
    "toolbox",
    "education",
    "research"
  ],
  "total_projects": 55,
  "stats": {
    "avg_projects_per_appeared_year": 5.5,
    "projects_by_year": {
      "year_2016": 5,
      "year_2017": 5,
      "year_2018": 5,
      "year_2019": 4,
      "year_2020": 5,
      "year_2021": 7,
      "year_2022": 5,
      "year_2023": 6,
      "year_2024": 6,
      "year_2025": 7
    },
    "students_by_year": {
      "year_2016": 5,
      "year_2017": 5,
      "year_2018": 5,
      "year_2019": 4,
      "year_2020": 5,
      "year_2021": 7,
      "year_2022": 5,
      "year_2023": 6,
      "year_2024": 6,
      "year_2025": 7
    },
    "total_students": 51
  },
  "years": {
    "year_2016": {
      "num_projects": 5,
      "projects": [
        {
          "code_url": "https://arpitdm.wordpress.com/2016/08/23/project-linear-rank-metric-codes-in-sage-gsoc-2016/",
          "description": "<p>In this project, our goal is to extend the Coding Theory library in Sage by implementing\nbase classes for linear rank-metric codes and Gabidulin codes. We also aim to add\nfunctionality for encoding and decoding algorithms and methods to answer basic queries\nabout these codes while ensuring efficient operations.</p>\n",
          "difficulty": null,
          "id": "proj_sagemath_2016_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5721008107421696/",
          "proposal_id": null,
          "short_description": "In this project, our goal is to extend the Coding Theory library in Sage by implementing\nbase classes for linear rank-metric codes and Gabidulin...",
          "slug": "rank-metric-codes-in-sage",
          "status": "completed",
          "student_name": "arpitdm",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Rank Metric Codes in Sage"
        },
        {
          "code_url": "http://lifebynumber.org/life-by-blog/final-gsoc-report",
          "description": "<p>There is functionality for working with dynamical systems over projective space in Sage. However, one of the areas lacking in functionality is the moduli space. We say two self-maps of projective space are equivalent if there is an element of the Projective Linear Group that conjugates one to the other. The following two algorithms should be implemented, in order to create more functionality in moduli space.\nThe first algorithm would be that given two endomorphisms of projective space determine if they are conjugate. In other words, determine if they are in the same class in the moduli space. If they are, also return the PGL element that conjugates one to the other.The second algorithm would be that given an endomorphism of projective space to compute a reduced form. This conjugation would that makes the coefficients small. There is already an algorithm implemented to return the minimal model in terms of resultant, but the coefficients can be non-optimal. The simplest approach would be to reduce the binary form describing the fixed points or if the binary form describing the fixed points is not sufficiently nice then reduce the binary form for points of period n for some small n.</p>\n",
          "difficulty": null,
          "id": "proj_sagemath_2016_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5344615427211264/",
          "proposal_id": null,
          "short_description": "There is functionality for working with dynamical systems over projective space in Sage. However, one of the areas lacking in functionality is the...",
          "slug": "moduli-space-of-dynamical-systems",
          "status": "completed",
          "student_name": "Rebecca Lauren Miller",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "Moduli Space of Dynamical Systems"
        },
        {
          "code_url": "https://grayjorgenson.wordpress.com/2016/08/23/gsoc-project-summary/",
          "description": "<p>The aim of this project is to build on the functionality Sage has for algebraic curves. The primary topics for this expansion are intersection analysis, analysis and resolution of singularities, plane curve models, and rational parameterizations. This functionality should be implemented for generic curves rather than just for plane curves whenever possible.</p>\n",
          "difficulty": null,
          "id": "proj_sagemath_2016_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/4758095901229056/",
          "proposal_id": null,
          "short_description": "The aim of this project is to build on the functionality Sage has for algebraic curves. The primary topics for this expansion are intersection...",
          "slug": "expand-the-generic-algebraic-curve-functionality-in-sage",
          "status": "completed",
          "student_name": "gjorgenson",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Expand the generic algebraic curve functionality in Sage"
        },
        {
          "code_url": "http://extendingmatroidfunctionality.blogspot.com",
          "description": "<p>The goal is to improve the functionality of the matroid package in terms of usefulness to researchers. In particular, we plan on the following.</p>\n<p>We will add certificates to various functions which give a boolean response, a feature to find the automorphisms of a matroid, and the ability to test if a given matroid is quaternary.</p>\n<p>Currently the test to see if a matroid is graphic cannot return a graph in the case that the matroid is graphic. It also runs in exponential time. We plan on implementing an algorithm from Bixby and Wagner which will both be able to produce the graph and run in near linear time.</p>\n<p>We will add a class for laminar matroids: This will serve as a warm up project, and could potentially be useful, as laminar matroids are important to some aspects of optimization.</p>\n",
          "difficulty": null,
          "id": "proj_sagemath_2016_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/6306447583346688/",
          "proposal_id": null,
          "short_description": "The goal is to improve the functionality of the matroid package in terms of usefulness to researchers. In particular, we plan on the following.\nWe...",
          "slug": "extending-matroid-theory-functionality",
          "status": "completed",
          "student_name": "Tara",
          "student_profile": null,
          "tags": [],
          "title": "Extending Matroid Theory functionality"
        },
        {
          "code_url": "https://github.com/williamstein/sage_modabvar/commits/master?author=kevinywlui",
          "description": "<p>There are several key features missing in Sage for modular abelian varieties. The goal of this project is to implement as much as possible. I will start with functions related to l-series and homology classes that currently raise a NotImplementedError. Then I will implement as much as possible from 16.5 of the <a href=\"https://magma.maths.usyd.edu.au/magma/overview/2/17/16/\" target=\"_blank\">Magma documentation</a>.</p>\n",
          "difficulty": null,
          "id": "proj_sagemath_2016_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5220187808727040/",
          "proposal_id": null,
          "short_description": "There are several key features missing in Sage for modular abelian varieties. The goal of this project is to implement as much as possible. I will...",
          "slug": "modular-abelian-variety",
          "status": "completed",
          "student_name": "klui",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Modular Abelian Variety"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2016/organizations/5316387828400128/"
    },
    "year_2017": {
      "num_projects": 5,
      "projects": [
        {
          "code_url": "https://picturesofmatroids.wordpress.com/2017/08/21/summer-summary/",
          "description": "<p>This project seeks to implement several common matroid classes in SageMath, along with algorithms for their display and relevant computations. The graphic matroid class in particular will be implemented with a representative graph with methods for Whitney switching and minor operations. This will be accompanied by improvements to the graph theory library, with methods relevant to matroids enabled to support multigraphs. Other modules for this project include improved plotting of rank 3 matroids to eliminate false colinearities, computation of a matroid's automorphism group using SageMath's group theory libraries, and faster minor testing based on an existing trac ticket.</p>\n",
          "difficulty": null,
          "id": "proj_sagemath_2017_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/4988116498644992/",
          "proposal_id": null,
          "short_description": "This project seeks to implement several common matroid classes in SageMath, along with algorithms for their display and relevant computations. The...",
          "slug": "implementing-matroid-classes-and-plotting-improvements",
          "status": "completed",
          "student_name": "Zachary Gershkoff",
          "student_profile": null,
          "tags": [],
          "title": "Implementing matroid classes and plotting improvements"
        },
        {
          "code_url": "http://lifebynumber.org/life-by-blog/gsoc-final-post",
          "description": "<p>As a member of the sage-dynamics community, researchers have compiled a wishlist for algorithms and functionality they would like added. I would like to shorten the wish list for us.For my project I will be completing some desired additions to SAGE from the Sage Dynamics Wiki. I will implement Well’s Algorithm, strengthen the numerical precision in cannonical_height, as well as implement reduced_form for higher dimensions.</p>\n",
          "difficulty": null,
          "id": "proj_sagemath_2017_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5032997027840000/",
          "proposal_id": null,
          "short_description": "As a member of the sage-dynamics community, researchers have compiled a wishlist for algorithms and functionality they would like added. I would like...",
          "slug": "expanding-the-functionality-of-dynamical-systems",
          "status": "completed",
          "student_name": "Rebecca Lauren  Miller",
          "student_profile": null,
          "tags": [],
          "title": "Expanding the Functionality of Dynamical Systems"
        },
        {
          "code_url": "https://benbarros.wordpress.com/2017/08/29/gsoc-2017-final-report/",
          "description": "<p>There are three major things that I would like to implement to improve the functionality of Sage in the area Complex Dynamics.  By the conclusion of my project, I will have implemented the functionality to plot the following objects in Sage efficiently:</p>\n<ul>\n<li><em>Mandelbrot Set</em></li>\n<li><em>External Rays</em></li>\n<li><em>Julia Sets</em></li>\n</ul>\n",
          "difficulty": "advanced",
          "id": "proj_sagemath_2017_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5608589620150272/",
          "proposal_id": null,
          "short_description": "There are three major things that I would like to implement to improve the functionality of Sage in the area Complex Dynamics.  By the conclusion of...",
          "slug": "improvement-of-complex-dynamics-in-sage",
          "status": "completed",
          "student_name": "Ben Barros",
          "student_profile": null,
          "tags": [],
          "title": "Improvement of Complex Dynamics in Sage"
        },
        {
          "code_url": "https://mariannaspyrakou.github.io/",
          "description": "<p>Modular decomposition of (di)graphs is a generalization of the concept of the decomposition of (di)graphs into connected components. Its current implementation in Sage relies on badly broken abandoned C code, and badly needs to be replaced by something that works and is not too slow. However, the only open-source implementations of some of these procedures are either in Java or in Perl, and thus aren't really useful for Sage.</p>\n",
          "difficulty": null,
          "id": "proj_sagemath_2017_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/4572723367903232/",
          "proposal_id": null,
          "short_description": "Modular decomposition of (di)graphs is a generalization of the concept of the decomposition of (di)graphs into connected components. Its current...",
          "slug": "modular-decomposition-of-graphs-and-digraphs",
          "status": "completed",
          "student_name": "Maria Ioanna Spyrakoy",
          "student_profile": null,
          "tags": [
            "java"
          ],
          "title": "Modular Decomposition of graphs and digraphs"
        },
        {
          "code_url": "http://coolconceptz.blogspot.in/2017/08/gsoc-modular-decompositionundirected.html",
          "description": "<p>This project is aimed at providing linear time implementation for modular decomposition of graphs and digraphs. Modular decomposition is decomposition of graph into modules. A module is a subset of vertices and it is a generalization of connected component in graph. Let us take for example a module X. For any vertex v ∉ X it is either connected or not connected to every vertex of X. Another property of module is that a module can be subset of another module. There are various algorithms which have been published for modular decomposition of graphs. The focus in this project is on linear time complexity algorithms which can be practically implemented. The project further aims to use the modules developed for modular decomposition to implement other functionality like skew partitions. Skew partition is partition of graph into two sets of vertices such that induced graph formed by one set is disconnected and induced graph formed by other set is complement of the first. \nModular decomposition is a very important concept in Graph Theory and it has a number of use cases. For instance it has been an important tool for solving optimization and combinatorics problems.</p>\n",
          "difficulty": "advanced",
          "id": "proj_sagemath_2017_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6539255211884544/",
          "proposal_id": null,
          "short_description": "This project is aimed at providing linear time implementation for modular decomposition of graphs and digraphs. Modular decomposition is...",
          "slug": "linear-time-implementation-of-modular-decomposition-of-undirected-and-directed-graphs",
          "status": "completed",
          "student_name": "Lokesh Jain",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Linear-time Implementation of Modular Decomposition of Undirected and Directed Graphs"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2017/organizations/5071296056524800/"
    },
    "year_2018": {
      "num_projects": 5,
      "projects": [
        {
          "code_url": "https://filipion.github.io/optimal-linear-codes/",
          "description": "<p>The following proposal detail some possible improvements of the coding theory component of SageMath. We aim to build databases of precomputed bounds and optimal examples of linear codes for each choice of parameters below a maximum range.</p>\n",
          "difficulty": null,
          "id": "proj_sagemath_2018_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/6673452673007616/",
          "proposal_id": null,
          "short_description": "The following proposal detail some possible improvements of the coding theory component of SageMath. We aim to build databases of precomputed bounds...",
          "slug": "databases-and-bounds-of-codes",
          "status": "completed",
          "student_name": "Filip Ion",
          "student_profile": null,
          "tags": [
            "ai",
            "database",
            "ui"
          ],
          "title": "Databases and bounds of codes"
        },
        {
          "code_url": "https://gist.github.com/raghukul01/60d5b0b2475d9d0524e25b2654a24c94",
          "description": "<p>This project aims at implementing basic algorithms for finding rational points on varieties. Classically algebraic variety is defined as the set of solutions of polynomial equations over a number field. A rational point of an algebraic variety is a solution of set of equations in the given field (rational field if not mentioned). Much of the number theory can be viewed as the study of rational point of algebraic varieties. Some of the great achievements of number theory amount to determining the rational points on particular curves.\nFor example, Fermat’s last theorem is equivalent to the statement that for an integer n ≥ 3, the only rational point of the curve xn+yn=zn in P2 over Qare the obvious ones.  Common variants of these question include determining the set of all points of V(K) of height up to some bound. The aim of this project is to implement some basic rational point finding algorithms (sieving modulo prime and Doyle Krumm Algorithm) and extend these to product_projective_space scheme.</p>\n",
          "difficulty": null,
          "id": "proj_sagemath_2018_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/6233744188899328/",
          "proposal_id": null,
          "short_description": "This project aims at implementing basic algorithms for finding rational points on varieties. Classically algebraic variety is defined as the set of...",
          "slug": "rational-point-on-varieties",
          "status": "completed",
          "student_name": "Raghukul Raman",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Rational Point on Varieties"
        },
        {
          "code_url": "https://saiharsh.github.io/gsoc-spqrtree.html",
          "description": "<p>In this project, our goal is to extend the graph theory library in Sage by implementing functionality to find triconnected subgraphs, which will partition an undirected graph into 3-connected components and the construction of the corresponding SPQR-tree. These modules can later be used as pre-processing for several graph problems such as Hamiltonian Cycle, traveling salesman problem.</p>\n",
          "difficulty": null,
          "id": "proj_sagemath_2018_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/4666113942093824/",
          "proposal_id": null,
          "short_description": "In this project, our goal is to extend the graph theory library in Sage by implementing functionality to find triconnected subgraphs, which will...",
          "slug": "addition-of-spqr-tree-to-graph-module",
          "status": "completed",
          "student_name": "Sai Harsh Tondomker",
          "student_profile": null,
          "tags": [],
          "title": "Addition of SPQR-tree to graph module"
        },
        {
          "code_url": "https://indoraptors.wordpress.com/gsoc-2018/",
          "description": "<p>The aim of the project is to code the linear time algorithm for partitioning a graph into 3-connected components and constructing the corresponding SPQR-tree of the graph. Further, this algorithm can be used as a subroutine for several other graph problems such as recognition of chordless graphs, hamiltonian cycle etc.</p>\n",
          "difficulty": null,
          "id": "proj_sagemath_2018_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/4752576599818240/",
          "proposal_id": null,
          "short_description": "The aim of the project is to code the linear time algorithm for partitioning a graph into 3-connected components and constructing the corresponding...",
          "slug": "addition-of-spqr-trees-to-the-graph-module-of-sage-math",
          "status": "completed",
          "student_name": "Meghana M Reddy",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Addition of SPQR-trees to the graph module of Sage Math"
        },
        {
          "code_url": "https://healty.github.io/",
          "description": "<p>Currently SageMath checks for graph isomorphism through an internal package with a corresponding method, called <em>isomorphic</em> and contained in <strong>sage.groups.perm_gps.partn_ref.refinement_graphs</strong>. This method, in addition to being quite convoluted and without much documentation about its inner workings, was last updated in a significant manner in 2011.<br>\nThe project aims at creating a new package which implements an efficient in practice heuristic method to check if two graphs are isomorphic, using one of the members of the Weisfeiler-Lehman (WL) algorithm hierarchy. An attempt was made in the past at the same task (but with a narrower scope, limited to only implementing the second order version of the WL algorithm), but the code was found to contain a bug and was never implemented/removed from the codebase (see Trac #10482).<br>\nTo the best of my knowledge, this would be the first working open-source implementation of k-WL, for k &gt; 1.</p>\n",
          "difficulty": null,
          "id": "proj_sagemath_2018_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5145057824866304/",
          "proposal_id": null,
          "short_description": "Currently SageMath checks for graph isomorphism through an internal package with a corresponding method, called isomorphic and contained in...",
          "slug": "checking-graph-isomorphism-using-the-weisfeiler-lehman-algorithm",
          "status": "completed",
          "student_name": "Dario Asprone",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Checking graph isomorphism using the Weisfeiler-Lehman algorithm"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2018/organizations/5677303661068288/"
    },
    "year_2019": {
      "num_projects": 4,
      "projects": [
        {
          "code_url": "https://rajat1433.github.io/#/app/education",
          "description": "<p>This project aims to implement an iterator over k- shortest source to destination paths using improved versions of Yen’s algorithm for simple paths. Apart from working on these methods the scope of this project will be improving and cleaning the methods that are currently too slow in python as these methods will be a dependency for implementing the other algorithms.</p>\n",
          "difficulty": null,
          "id": "proj_sagemath_2019_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5006225522032640/",
          "proposal_id": null,
          "short_description": "This project aims to implement an iterator over k- shortest source to destination paths using improved versions of Yen’s algorithm for simple paths....",
          "slug": "enumeration-of-paths-and-improvements-in-the-graph-module",
          "status": "completed",
          "student_name": "Rajat Mittal",
          "student_profile": null,
          "tags": [
            "python",
            "ai"
          ],
          "title": "Enumeration of paths and improvements in the Graph Module"
        },
        {
          "code_url": "https://giorgosgiapis.github.io/GSoC19-Blog/",
          "description": "<p>This project consists of the following parts:</p>\n<ol>\n<li>Cythonize current methods</li>\n<li>Improve graph traversals and add new ones</li>\n</ol>\n",
          "difficulty": null,
          "id": "proj_sagemath_2019_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5080883747356672/",
          "proposal_id": null,
          "short_description": "This project consists of the following parts:\n\nCythonize current methods\nImprove graph traversals and add new ones",
          "slug": "improvements-of-the-graph-module",
          "status": "completed",
          "student_name": "Giapitzakis Tzintanos G.",
          "student_profile": null,
          "tags": [],
          "title": "Improvements of the graph module"
        },
        {
          "code_url": "https://github.com/emes4/gsoc-finalreport",
          "description": "<p>Implement necessary tools for rank metric McEliece cryptosystems. Namely finish work on rank metric and Gabidulin codes (tickets #21226 and #20970). Use these to create a McEliece cryptosystem class with encoding and decoding.</p>\n",
          "difficulty": null,
          "id": "proj_sagemath_2019_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5563545326977024/",
          "proposal_id": null,
          "short_description": "Implement necessary tools for rank metric McEliece cryptosystems. Namely finish work on rank metric and Gabidulin codes (tickets #21226 and #20970)....",
          "slug": "rank-metric-mceliece-cryptosystem",
          "status": "completed",
          "student_name": "Marketa Slukova",
          "student_profile": null,
          "tags": [],
          "title": "Rank Metric McEliece Cryptosystem"
        },
        {
          "code_url": "https://github.com/ChamanAgrawal/GSoC19_Report",
          "description": "<p>The Robinson-Schensted-Knuth (RSK) correspondence is a generalization of the famous Robinson-Schensted (RS) correspondence and plays an important role in representation theory. The RS correspondence described a bijection between permutations and pairs of same-shape standard tableaux while the RSK correspondence extends it to achieve a bijection between two-line arrays of letters called ‘Biwords’ (which are in natural bijection with matrices of non-negative integers) and pairs of same-shape semistandard tableaux.</p>\n<p>SageMath already has an implementation of RSK correspondence with some insertion rules like Edelman-Greene insertion, and Hecke insertion implemented but the implementation is not extensible. As combinatorialists are using RSK  and its generalizations in their research, as well as continuing to develop even more variations, having an extensible class structure and new algorithms from recent research implemented in SageMath will increase SageMath's utility.</p>\n",
          "difficulty": null,
          "id": "proj_sagemath_2019_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/4862615841406976/",
          "proposal_id": null,
          "short_description": "The Robinson-Schensted-Knuth (RSK) correspondence is a generalization of the famous Robinson-Schensted (RS) correspondence and plays an important...",
          "slug": "refactor-rsk-and-implement-new-insertion-rules",
          "status": "completed",
          "student_name": "Chaman Agrawal",
          "student_profile": null,
          "tags": [
            "ai",
            "ui",
            "ux"
          ],
          "title": "Refactor RSK and implement new insertion rules"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2019/organizations/4925411685826560/"
    },
    "year_2020": {
      "num_projects": 5,
      "projects": [
        {
          "code_url": "https://jcuevas-rozo.github.io/gsoc2020/",
          "description": "<p>In this project we pretend to continue with the integration of the Kenzo program and SageMath. Specifically, we propose to combine the functions and techniques of algebraic topology for simplicial sets developed in Kenzo and those existing in the module SimplicialSets of SageMath, in order to complement and enrich the functionalities for computing invariants of such spaces in SageMath.</p>\n",
          "difficulty": null,
          "id": "proj_sagemath_2020_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/6677757880172544/",
          "proposal_id": null,
          "short_description": "In this project we pretend to continue with the integration of the Kenzo program and SageMath. Specifically, we propose to combine the functions and...",
          "slug": "integration-of-kenzo-program-with-simplicialsets",
          "status": "completed",
          "student_name": "Julian Cuevas-Rozo",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Integration of Kenzo program with SimplicialSets"
        },
        {
          "code_url": "https://gist.github.com/Ivo-Maffei/f4f2ae18df3c592e1023c4cb118731f9",
          "description": "<p>This project aims to construct a database of distance-regular graphs in SageMath.</p>\n",
          "difficulty": null,
          "id": "proj_sagemath_2020_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5586314080026624/",
          "proposal_id": null,
          "short_description": "This project aims to construct a database of distance-regular graphs in SageMath.",
          "slug": "constructing-a-database-of-distance-regular-graphs",
          "status": "completed",
          "student_name": "Ivo",
          "student_profile": null,
          "tags": [
            "ai",
            "database"
          ],
          "title": "Constructing a database of distance-regular graphs"
        },
        {
          "code_url": "https://trac.sagemath.org/ticket/29687",
          "description": "<p>Linear extensions of partially ordered sets are fundamental in order theory and in algebraic combinatorics, holding high importance in the study of permutations and Young tableaux. Computing the number of linear extensions, in general, takes O(n!) time, given a poset of n elements. However, many efficient algorithms are known for certain large classes of posets. SageMath offers a single function to calculate the linear extensions of a poset. For even small posets, this quickly becomes impossible to use. The goal of this project would be to implement efficient methods of computing linear extensions of several important classes of posets, and introduce uniform sampling of linear extensions. This includes tree posets, d-complete posets, skew diagrams, mobile posets, and more.</p>\n",
          "difficulty": null,
          "id": "proj_sagemath_2020_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/6232997776326656/",
          "proposal_id": null,
          "short_description": "Linear extensions of partially ordered sets are fundamental in order theory and in algebraic combinatorics, holding high importance in the study of...",
          "slug": "efficiently-counting-linear-extensions-of-posets",
          "status": "completed",
          "student_name": "Stefan Grosser",
          "student_profile": null,
          "tags": [
            "mobile",
            "ai",
            "ui",
            "ux"
          ],
          "title": "Efficiently Counting Linear Extensions of Posets"
        },
        {
          "code_url": "https://docs.google.com/spreadsheets/d/1XUMkuLx3TKEePtkzNRvL749FOjMUqf3V8eWB5CbiPAE/edit?usp=sharing",
          "description": "<p>The goal of this project is to implement the Berkovich projective line in Sage, along with dynamical systems acting the Berkovich projective line. If time allows, some additional additional dynamical algorithms could be implemented.</p>\n",
          "difficulty": null,
          "id": "proj_sagemath_2020_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/4951102811799552/",
          "proposal_id": null,
          "short_description": "The goal of this project is to implement the Berkovich projective line in Sage, along with dynamical systems acting the Berkovich projective line. If...",
          "slug": "berkovich-project-line",
          "status": "completed",
          "student_name": "Alexander Galarraga",
          "student_profile": null,
          "tags": [],
          "title": "Berkovich Project Line"
        },
        {
          "code_url": "https://vipul79321.github.io/Google-Summer-of-Code-2020/",
          "description": "<p>Currently, the algorithms for Radius, Diameter, and all eccentricities calculations in SageMath are too brute and hence too slow. They involve computing eccentricity of each vertex using the shortest path (all pair or single source) method.\nThis project aims at implementing best-known methods for Radius, Diameter, and All eccentricities computation for (weighted) (Directed) graphs. All these algorithms will definitely improve the efficiency in the area of Network Routing problems, Facility location problem, measuring the closeness of groups of individuals in sociology, etc, and will improve the overall functionality of graphs module of SageMath.</p>\n<p>Also, refactoring and improving some distance computation methods such as Wiener Index, Distance Distribution, etc. Also, Improving the overall consistency of weight function in the graph module.</p>\n",
          "difficulty": null,
          "id": "proj_sagemath_2020_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5793673255583744/",
          "proposal_id": null,
          "short_description": "Currently, the algorithms for Radius, Diameter, and all eccentricities calculations in SageMath are too brute and hence too slow. They involve...",
          "slug": "efficient-methods-for-diameter-radius-and-all-eccentricities-computations",
          "status": "completed",
          "student_name": "Vipul Gupta",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Efficient methods for Diameter, radius and all eccentricities computations"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2020/organizations/6190385258299392/"
    },
    "year_2021": {
      "num_projects": 7,
      "projects": [
        {
          "code_url": "https://wiki.sagemath.org/interact/groups",
          "description": "<p>The goal of this project is to improve the conversation between Sage and GAP (the SmallGrp package). We want to create convenient ways for mathematicians to access lists or information about all small groups with certain properties. The current configuration only allows for you to call one group at a time, but we aim to allow for lists of groups which meet certain parameters, as well has improving the information that can be provided about each group. The group properties we aim to address include abelian, solvable, nilpotent, given order, dihedral, semi-direct products, alternating, symmetric, permutation, general linear, and special linear.</p>\n<p>Along with this we hope to create a sample web page (wiki) for undergraduate abstract algebra students that introduces interesting ways to use the features that we have created. This is to help provide better instruction and introduction to all the ways Sage can be used even in the beginning stages of higher-level mathematics classes.</p>\n",
          "difficulty": null,
          "id": "proj_sagemath_2021_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6446726352732160/",
          "proposal_id": null,
          "short_description": "The goal of this project is to improve the conversation between Sage and GAP (the SmallGrp package). We want to create convenient ways for...",
          "slug": "implement-small-groups",
          "status": "completed",
          "student_name": "Alexis Newton",
          "student_profile": null,
          "tags": [
            "web",
            "ai"
          ],
          "title": "Implement Small Groups"
        },
        {
          "code_url": "https://trac.sagemath.org/ticket/31929",
          "description": "<p>For a finite-dimensional algebra A equipped with the action of a group G, the invariant algebra A^G has many useful interpretations in topology and combinatorics. For example, when A is the cohomology ring of a topological space X and G is a covering space action, A^G is the cohomology ring of the space X/G. I aim to implement a class for computation of A^G for a generic finite-dimensional A and group G.\nGiven a matroid M = (E,I), and a G-action on the ground set E, the Orlik-Terao algebra (OT(M)) and the Orlik-Solomon algebra (OS(M)) have a G-action induced by the action on E. Motivated by the mathematical definition of OT(M) and OS(M), I also intend to implement a class for ideals and quotients of graded supercommutative rings, using Groebner basis algorithms which are in the literature but not yet implemented in Sage. Finally, for a field k, there are canonical maps k[E] → OT(M) and Λ^k[E] → OS(M). I hope to implement coercion from the polynomial ring k[E] to OT(M) and from the exterior algebra Λ^k[E] to OS(M) and OS(M)^G.</p>\n",
          "difficulty": null,
          "id": "proj_sagemath_2021_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5016233975480320/",
          "proposal_id": null,
          "short_description": "For a finite-dimensional algebra A equipped with the action of a group G, the invariant algebra A^G has many useful interpretations in topology and...",
          "slug": "g-invariants-of-the-orlik-solomon-and-orlik-terao-algebras",
          "status": "completed",
          "student_name": "Trevor Karn",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "G-invariants of the Orlik-Solomon and Orlik-Terao algebras"
        },
        {
          "code_url": "https://gist.github.com/thhagelmayer/4ca31eae7abd5889f5822d3d70cf5c69",
          "description": "<p>An asymptotic expression typically contains exact terms and O-terms, for example n3 + 2n2 + O(n). The basic framework for this asymptotic ring is already implemented. The main aim of this summer of code project is to extend its functionality up to the point where asymptotic expressions with explicit constants are fully supported. In his book, “Asymptotic Methods in Analysis” on page 5, deBruijn calls it an “L-term”, but we will call it “B-term”. B_{20}(3z) is a B-term, which stands for an expression which is bounded in absolute value by\n3|z| for |z| ≥ 20. Sometimes, in research, it is important to know from which values of the variable on the asymptotic expression has enough precision to decide wether it is larger than a given bound. This cannot be achieved by O-terms (because the unknown implicit constant might be very large). For example, the average number of comparisons of classical quicksort is 2n log n + O(n). When comparing with recent variants, such as dual pivot quicksort with average number of comparisons 1.8n log n + O(n), it is interesting to know how large the O-terms are in order to know when dual-pivot quicksort will be more efficient than classical quicksort.</p>\n",
          "difficulty": null,
          "id": "proj_sagemath_2021_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5050342693142528/",
          "proposal_id": null,
          "short_description": "An asymptotic expression typically contains exact terms and O-terms, for example n3 + 2n2 + O(n). The basic framework for this asymptotic ring is...",
          "slug": "add-support-for-error-terms-with-explicit-constants-to-asymptoticring",
          "status": "completed",
          "student_name": "Thomas Hagelmayer",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Add support for error terms with explicit constants to AsymptoticRing"
        },
        {
          "code_url": "https://trac.sagemath.org/ticket/31651",
          "description": "<p>A formal power series is a (potentially) infinite sequence of coefficients. It turns out to be practical to denote it as an infinite series, although it does no longer represent a function.  However, the usual operations on power series, such as addition and multiplication, can be given combinatorial meaning, which makes them an indispensable tool in discrete mathematics. Lazy Formal Power Series are an implementation of the Formal Power Series for a computer where coefficients are only computed on-demand, to deal with the problem that we can store only a finite amount of information.\nSageMath has an implementation of the Lazy Formal Power Series in the combinatorial species code. The project aims to disentangle the code from the unrequired submodules and create a robust structure. Another aim of the project is to implement Puiseux Series and bring in the implementation of the Laurent Series code into the same module. There are also bugs in the code that computes the coefficients of series which are defined implicitly by a system of functional equations.  Fixing these is another milestone. A detailed list of issues and tasks can be found in ticket #31651 on the Sage Trac server.</p>\n",
          "difficulty": null,
          "id": "proj_sagemath_2021_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5077172414316544/",
          "proposal_id": null,
          "short_description": "A formal power series is a (potentially) infinite sequence of coefficients. It turns out to be practical to denote it as an infinite series, although...",
          "slug": "lazy-formal-power-series",
          "status": "completed",
          "student_name": "Tejasvi Chebrolu",
          "student_profile": null,
          "tags": [
            "ai",
            "ui",
            "ux"
          ],
          "title": "Lazy Formal Power Series"
        },
        {
          "code_url": "https://davidayotte.github.io/posts/2021/08/gsoc-final/",
          "description": "<p>The goal of this project is twofold: first, we wish to implement the graded ring of quasimodular forms and, second, we wish to implement the Bloch-Okounkov bracket that, given a shifted symmetric polynomial, produces a quasimodular forms.</p>\n",
          "difficulty": null,
          "id": "proj_sagemath_2021_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5259448846647296/",
          "proposal_id": null,
          "short_description": "The goal of this project is twofold: first, we wish to implement the graded ring of quasimodular forms and, second, we wish to implement the...",
          "slug": "implementation-of-the-graded-ring-of-quasimodular-forms",
          "status": "completed",
          "student_name": "David Ayotte",
          "student_profile": null,
          "tags": [],
          "title": "Implementation of the graded ring of quasimodular forms"
        },
        {
          "code_url": "https://docs.google.com/spreadsheets/d/1taOMt-xbHix3Hb4D7V4nKWNM8cr5kwOE9eawCKtdGHo/edit?usp=sharing",
          "description": "<p>We aim to improve several computations in dynamics and also implement new features. Improvements include optimizing the automorphic group calculation, as well as extending several minor functions to work with  dynamical systems on subschemes and in higher dimensions. These minor improvements include extending the computation of the sigma invariants and the multipliers to higher dimensional dynamical systems, as well as extending wronskian ideal and critical subschemes to dynamical systems on subschemes. Finally, we aim to implement computation of the dynatomic cycle, which gives equations defining the minimal preperiodic points, as well as Stoll's reduction algorithm for zero dimensional varieties, which computes reduced equations defining a given variety.</p>\n",
          "difficulty": null,
          "id": "proj_sagemath_2021_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/4842048724664320/",
          "proposal_id": null,
          "short_description": "We aim to improve several computations in dynamics and also implement new features. Improvements include optimizing the automorphic group...",
          "slug": "dynamics-algorithmic-improvements",
          "status": "completed",
          "student_name": "Alexander Galarraga",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Dynamics Algorithmic Improvements"
        },
        {
          "code_url": "https://github.com/DisneyHogg/Abel-Jacobi-in-SageMath",
          "description": "<p>Riemann surfaces are key objects in many areas of maths, from mathematical physics to algebraic and arithmetic geometry. As such there is considerable interest in implementing computational methods to understand these objects, with packages with various levels of utility and accuracy exists in multiple Computer Algebra Systems (CASs), and a meeting with active members of the community demonstrated an appetite and need for a centralised CAS with which to complete calculations. Sage is, we believe,  the best candidate. This project would then build upon the existing work of Nils Bruin to implement and improve the necessary backend tools for such a system, before proceeding to utilise these to create a method for the Abel-Jacobi map, an important object in the study of Riemann surfaces.</p>\n",
          "difficulty": null,
          "id": "proj_sagemath_2021_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5167043967451136/",
          "proposal_id": null,
          "short_description": "Riemann surfaces are key objects in many areas of maths, from mathematical physics to algebraic and arithmetic geometry. As such there is...",
          "slug": "rigorous-integration-and-the-abel-jacobi-map",
          "status": "completed",
          "student_name": "Linden Disney-Hogg",
          "student_profile": null,
          "tags": [
            "ai",
            "ui",
            "backend"
          ],
          "title": "Rigorous integration and the Abel-Jacobi map"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2021/organizations/5180088957534208/"
    },
    "year_2022": {
      "num_projects": 5,
      "projects": [
        {
          "code_url": "https://github.com/NicoleLiQi/GSoC2022/blob/main/README.md",
          "description": "In this project, we aim to implement piecewise function on the polyhedral complex for general purpose for SageMath. Generally, this project should achieve efficient symbolic and numerical evaluation of piecewise functions given sub-domains and functional coefficients provided by users. Considering the computational complexity, efficient piece searching algorithm should also be designed, especially for the case of a large number of pieces being provided. Besides general purposes, improvements would also be considered with specific purposes, if provided, of piecewise linear function including but not limited to approximation, evaluation of definite integrals, and regression. Lastly, the whole project should be compatible and communicate well with other objects in SageMath.",
          "difficulty": "advanced",
          "id": "proj_sagemath_2022_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/0jtQAeNA/",
          "proposal_id": null,
          "short_description": "In this project, we aim to implement piecewise function on the polyhedral complex for general purpose for SageMath. Generally, this project should...",
          "slug": "2022-gsoc-implement-piecewise-functions-of-one-or-several-variables-proposal",
          "status": "completed",
          "student_name": "Nicole Li",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "2022 GSoC Implement piecewise functions of one or several variables Proposal"
        },
        {
          "code_url": "https://guoj.org/sage-gsoc.html",
          "description": "The goals of this project are to fix and improve current implementations of height functionalities, and to implement the Arakelov-Zhang pairing of rational maps in SageMath.",
          "difficulty": null,
          "id": "proj_sagemath_2022_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/wTY9HI6P/",
          "proposal_id": null,
          "short_description": "The goals of this project are to fix and improve current implementations of height functionalities, and to implement the Arakelov-Zhang pairing of...",
          "slug": "improve-height-functionality",
          "status": "completed",
          "student_name": "Jing Guo",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Improve Height Functionality"
        },
        {
          "code_url": "https://github.com/georgiachanning/gsoc",
          "description": "The current method used for finding edge disjoint spanning trees in directed graphs (digraphs) relies on mixed integer linear programming and it may fail on some instances. The goal of this project is to implement a combinatorial solution as presented in H.N. Gabow's A Matroid Approach to Finding Edge Connectivity and Packing Arborescences. The final deliverable will be an optimized implementation of this algorithm as well as docstrings and doctests that conform to SageMath's Conventions and Guidelines.",
          "difficulty": null,
          "id": "proj_sagemath_2022_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/dK74KMqd/",
          "proposal_id": null,
          "short_description": "The current method used for finding edge disjoint spanning trees in directed graphs (digraphs) relies on mixed integer linear programming and it may...",
          "slug": "edge-connectivity-and-edge-disjoint-spanning-trees-in-digraphs",
          "status": "completed",
          "student_name": "cgeorgia",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Edge connectivity and edge disjoint spanning trees in digraphs"
        },
        {
          "code_url": "https://gist.github.com/enjeck/825653ba7687eecf16104db02a57cb53",
          "description": "The current method used for finding edge disjoint spanning trees in directed graphs fails in some instances. The goal of this project is to implement two combinatorial algorithms for finding edge disjoint spanning trees in digraphs.",
          "difficulty": null,
          "id": "proj_sagemath_2022_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/J4J1ITUL/",
          "proposal_id": null,
          "short_description": "The current method used for finding edge disjoint spanning trees in directed graphs fails in some instances. The goal of this project is to implement...",
          "slug": "edge-connectivity-and-edge-disjoint-spanning-trees-in-digraphs",
          "status": "completed",
          "student_name": "c1e0",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Edge connectivity and edge disjoint spanning trees in digraphs"
        },
        {
          "code_url": "https://trac.sagemath.org/ticket/33988",
          "description": "An exterior algebra E is a mildly non-commutative algebra with fundamental applications in physics and geometry. The first goal of this project is to improve the performance and functionality of the implementation of exterior algebras in SageMath. The performance will be improved by rewriting the basis to require less memory, and the functionality will be improved by implementing Gröbner basis computations which will allow Sage to detect non-trivial equalities in quotients of E. The second goal of this project is to implement Rothe diagrams, D-peelable tableaux in the sense of Reiner and Shimozono, and to implement Reiner and Shimozono's algorithm for computing the number of reduced words of a permutation.",
          "difficulty": null,
          "id": "proj_sagemath_2022_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/UpKWcuIO/",
          "proposal_id": null,
          "short_description": "An exterior algebra E is a mildly non-commutative algebra with fundamental applications in physics and geometry. The first goal of this project is to...",
          "slug": "rewrite-exterior-algebra-implement-groebner-bases-and-peelable-tableaux-for-northwest-diagrams",
          "status": "completed",
          "student_name": "Trevor Karn",
          "student_profile": null,
          "tags": [
            "ui",
            "ux"
          ],
          "title": "Rewrite exterior algebra, implement Groebner bases, and peelable tableaux for northwest diagrams"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2022/organizations/sagemath/"
    },
    "year_2023": {
      "num_projects": 6,
      "projects": [
        {
          "code_url": "https://github.com/Bruno-TT/GSOC-writeup-public/blob/main/writeup.pdf",
          "description": "I've been working on extending SageMath's capabilities to calculate parameterizations for invariant rings of matrix groups over finite fields. While the general linear group's invariants can be parameterized using Dickson invariants, it's more challenging for smaller groups like the special linear group. I aim to implement known methods for computing these spaces, like subring decomposition, to make them more accessible and known to researchers. I also plan to tackle invariant rings of characteristic 0 representations of finite groups, focusing on permutation representations.",
          "difficulty": null,
          "id": "proj_sagemath_2023_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/6vgtw5XH",
          "proposal_id": "Y9v3UkmH",
          "short_description": "I've been working on extending SageMath's capabilities to calculate parameterizations for invariant rings of matrix groups over finite fields. While...",
          "slug": "parameterizing-invariant-spaces",
          "status": "completed",
          "student_name": "Bruno Edwards",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Parameterizing invariant spaces"
        },
        {
          "code_url": "https://drive.google.com/file/d/1uesZJcV3PCd-v2j27cluIds2VpFGrYQe/view?usp=sharing",
          "description": "Sage does not have support for dynamical semigroups, which are dynamical systems involving multiple functions. This project aims to create a class that encapsulates dynamical semigroups, which can be use to further explore this field of mathematics.",
          "difficulty": null,
          "id": "proj_sagemath_2023_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/OCowCmCj",
          "proposal_id": "4CgV1DoJ",
          "short_description": "Sage does not have support for dynamical semigroups, which are dynamical systems involving multiple functions. This project aims to create a class...",
          "slug": "dynamical-systems-with-multiple-functions",
          "status": "completed",
          "student_name": "Dang",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Dynamical Systems with Multiple Functions"
        },
        {
          "code_url": "https://guoj.org/second-gsoc.html",
          "description": "The goals of this project is to implement two algorithmic improvements for Sage: 1) Improve current implementation of Krumm's algorithms for points of bounded heights to work over rings of integers in number fields, and 2) generalize Wells' algorithm for computing the canonical heights beyond QQ to other applicable number fields.",
          "difficulty": null,
          "id": "proj_sagemath_2023_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/pOEctuOr",
          "proposal_id": "cqktOgw0",
          "short_description": "The goals of this project is to implement two algorithmic improvements for Sage: 1) Improve current implementation of Krumm's algorithms for points...",
          "slug": "algorithms-for-dynamical-systems",
          "status": "completed",
          "student_name": "Jing Guo",
          "student_profile": null,
          "tags": [],
          "title": "Algorithms for Dynamical Systems"
        },
        {
          "code_url": "https://marizee.github.io/GSoC-2023/",
          "description": "Sage incorporates state-of-the-art libraries for exact linear algebra computations, such as matrix multiplication, reduced echelon form, linear system solving, when the coefficients are in an exact domain such as the integers or finite fields. However, several aspects make the integration of these libraries not yet fully satisfactory. For example, working over a prime field with a prime below about 20 bits, the mere creation of a zero matrix in SageMath takes roughly as long as the call of the underlying fast reduced echelon form procedure (performed by LinBox / FFLAS-FFPACK in this case). Still about FFLAS-FFPACK: several available tools in this library are not offered through the Sage interface, constraining the user experience; for example, some pivoting strategies are not available, despite their usefulness in some situations e.g. when one is interested in the preservation of some rank profile properties. Finally, the integration of linear algebra implementations from Flint has been initiated, with a good amount of work already done, but is not fully finalized and has not been merged into Sage. This project aims to make this kind of enhancements, which would lead to more efficient and more versatile finite field linear algebra operations in Sage.",
          "difficulty": null,
          "id": "proj_sagemath_2023_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/0ieRwUMU",
          "proposal_id": "878mnk3a",
          "short_description": "Sage incorporates state-of-the-art libraries for exact linear algebra computations, such as matrix multiplication, reduced echelon form, linear...",
          "slug": "enhancements-in-linear-algebra",
          "status": "completed",
          "student_name": "Marie B",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Enhancements in linear algebra"
        },
        {
          "code_url": "https://github.com/sagemath/sage/issues/35640",
          "description": "The aim of this project is to further expand Sage's library for topology, by implementing various functions from toric topology. Though this field might sound specific, a lot of properties can be viewed combinatorially, and that's why they are particularly interesting.\nThese functions are also of interest to researchers in other fields, not just toric topologists. The main idea is to implement as many functions as possible to broaden the library and further make research in this and related areas much easier.",
          "difficulty": null,
          "id": "proj_sagemath_2023_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/lo7rrkvs",
          "proposal_id": "voa3ocuR",
          "short_description": "The aim of this project is to further expand Sage's library for topology, by implementing various functions from toric topology. Though this field...",
          "slug": "implementing-functions-from-toric-topology",
          "status": "completed",
          "student_name": "Ognjen Petrov",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Implementing functions from toric topology"
        },
        {
          "code_url": "https://docs.google.com/document/d/15RI1gI85ekOQeUJetFdlwS_Kmuc9m0jOjQc4_UdgLZg/edit?usp=sharing",
          "description": "This project aims at improving the optimization capabilities of SageMath by connecting SageMath to interfaces to optimization solvers that are maintained outside of the Sage project. The goal is mainly achieved by replacing existing templates for solver backends and adding backends of selected solvers as well as testing and documenting for them.\n\nSeveral stages of development will be involved in this project, including deciding which issues to work on, solver selection based on in-depth investigation, code implementation and modification, testing, documenting and logging. Some steps of these will be iterated over and over to achieve consensus and approval under peer review until finalized.  \n\nIn general, we hope that the implementations of this coding project will empower more advanced research and applications regarding optimization and solver interface integration. The project is expected to have a significant impact on the optimization capabilities of SageMath, making it a more powerful and flexible tool for mathematical research and education.",
          "difficulty": "advanced",
          "id": "proj_sagemath_2023_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/tBkLOJ5z",
          "proposal_id": "rOUf4pJV",
          "short_description": "This project aims at improving the optimization capabilities of SageMath by connecting SageMath to interfaces to optimization solvers that are...",
          "slug": "enhanced-optimization-solver-interfaces-for-sage",
          "status": "completed",
          "student_name": "Zhongling Xu",
          "student_profile": null,
          "tags": [
            "ai",
            "backend"
          ],
          "title": "Enhanced optimization solver interfaces for Sage"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2023/organizations/sagemath"
    },
    "year_2024": {
      "num_projects": 6,
      "projects": [
        {
          "code_url": "https://janmenjayap.github.io/GSoC-2024/",
          "description": "Matchings and perfect matchings have received considerable attention in graph theory as well as in other related domains (such as, but not limited to, algorithms and optimization). There still remain many open problems — such as Barnette’s conjecture, Berge-Fulkerson conjecture, and so on — due to which it continues to remain an active area of research. For problems concerning perfect matchings, it is well-known that it suffices to solve them for matching covered graphs (that is, those connected graphs wherein each edge belongs to some perfect matching).\n\n\nThe objective of this project is to implement efficient algorithms pertaining to the canonical partition, tight cut decomposition, dependency relations, (optimal) ear decomposition, brick and brace generation methods and related concepts in the theory of matching covered graphs, and to make all of these available freely\nto students, educators as well as researchers all across the world.",
          "difficulty": null,
          "id": "proj_sagemath_2024_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/iY5gx4Ls/",
          "proposal_id": null,
          "short_description": "Matchings and perfect matchings have received considerable attention in graph theory as well as in other related domains (such as, but not limited...",
          "slug": "on-decompositions-generation-methods-and-related-concepts-in-the-theory-of-matching-covered-graphs",
          "status": "completed",
          "student_name": "Janmenjaya Panda",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "On Decompositions, Generation Methods and related concepts in the theory of Matching Covered Graphs"
        },
        {
          "code_url": "https://verreld7.github.io/bblog/posts/2024/gsoc-final-report/",
          "description": "In tropical algebra, where addition resembles taking the maximum and multiplication is like regular addition, tropical polynomials come into play. Every tropical polynomial of degree d has exactly d so-called tropical roots when counted with multiplicities. The graph of these polynomials are piecewise linear functions which also called tropical hypersurfaces. This project aims to provide tools for working with tropical polynomials by means of:\n1. Implementation of custom class for tropical polynomials.\n2. Method to find the tropical roots of any tropical polynomials.\n3. Plotting the tropical hypersurfaces for tropical polynomials in one or two variables.\n4. Plotting the dual subdivision and balanced graph for tropical curve in two variables.",
          "difficulty": null,
          "id": "proj_sagemath_2024_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/j1yAryTd/",
          "proposal_id": null,
          "short_description": "In tropical algebra, where addition resembles taking the maximum and multiplication is like regular addition, tropical polynomials come into play....",
          "slug": "implementation-of-tropical-polynomials-and-its-corresponding-tropical-hypersurfaces",
          "status": "completed",
          "student_name": "Verrel Rievaldo Wijaya",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Implementation of Tropical Polynomials and its Corresponding Tropical Hypersurfaces"
        },
        {
          "code_url": "https://github.com/sagemath/sage/issues/38014",
          "description": "I'm Nate Bolin a mathematics graduate student, and I'm working with my mentor Benjamin Hutz to Expand the Dynamical Systems capabilities of Sagemath. We would like to fix several small bugs in the normal form and reduce form commands. Then we'd like to add several checks functions to help expand a database, Dr. hutz has been compiling. Namely, a check for lattes, newton and chebychev maps. then expand on that work by implementing several functions. We'd like to add a function which creates an elliptic curve from a lattes map, a function which computes the minimal resultant locus following the algorithm laid out by Robert Rumely in his 2015 paper.finnaly,  We'll add a function that Computes attracting periodic points by iterating critical points, using an algorithm provided by Milnor's 1990 paper.",
          "difficulty": null,
          "id": "proj_sagemath_2024_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/HFCrNTtn/",
          "proposal_id": null,
          "short_description": "I'm Nate Bolin a mathematics graduate student, and I'm working with my mentor Benjamin Hutz to Expand the Dynamical Systems capabilities of Sagemath....",
          "slug": "expanding-sagemaths-dynamical-systems-capabilities",
          "status": "completed",
          "student_name": "NateBolin",
          "student_profile": null,
          "tags": [
            "ai",
            "database"
          ],
          "title": "Expanding SageMath’s Dynamical systems capabilities"
        },
        {
          "code_url": "https://github.com/amanmoon/GSoC-Writeup/blob/master/Tensor%20Operations%20in%20Sage%20using%20Python%20libraries%20as%20backend.pdf",
          "description": "In SageMath, tensors are presently stored within the Components class as a dictionary, with each key representing indices and values indicating the tensor's corresponding values. This project seeks to advance tensor handling within SageMath by leveraging Python libraries such as PyTorch, NumPy, and SymPy.\n\nThe primary objective is to develop classes similar to the existing Components class and its subclasses, storing tensors as numpy.ndarray and torch.tensor objects. This change promises memory-efficient storage of tensors and performance enhancements in tensor operations. Additionally, methods like sympy and sympysage_tensor will be implemented to streamline tensor porting between Sage and SymPy.\n\nThe project's development stages will include code implementation and modification, testing across a variety of inputs, comprehensive code documentation, and building robust tests to ensure functionality and reliability.",
          "difficulty": null,
          "id": "proj_sagemath_2024_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/4Re68qys/",
          "proposal_id": null,
          "short_description": "In SageMath, tensors are presently stored within the Components class as a dictionary, with each key representing indices and values indicating the...",
          "slug": "tensor-operations-in-sage-using-python-libraries-as-backends",
          "status": "completed",
          "student_name": "Aman Moon",
          "student_profile": null,
          "tags": [
            "python",
            "ml",
            "ui",
            "backend"
          ],
          "title": "Tensor operations in Sage using Python libraries as backends"
        },
        {
          "code_url": "https://gist.github.com/Newtech66/d687884f15f334b82cddc167e89408c8",
          "description": "Sage already has a working implementation of combinatorial species, but it is old, ad-hoc, and not entirely generic. This project aims to reimplement combinatorial species in a better and more generic way with a group theoretic approach. We will implement molecular and atomic decompositions, construction from group actions, and common operations on species like addition, multiplication, and partitional composition. Furthermore, we will also implement multivariate species, which to our knowledge, has not been implemented in any software package prior to this.",
          "difficulty": null,
          "id": "proj_sagemath_2024_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/Gc29Z6yB/",
          "proposal_id": null,
          "short_description": "Sage already has a working implementation of combinatorial species, but it is old, ad-hoc, and not entirely generic. This project aims to reimplement...",
          "slug": "improving-combinatorial-species",
          "status": "completed",
          "student_name": "Mainak Roy",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Improving combinatorial species"
        },
        {
          "code_url": "https://github.com/sagemath/sage/issues/37987",
          "description": "This Google Summer of Code project aims to build a custom class in SageMath for the\r\nChow rings of matroids by using a result which explicitly computes a Gröbner basis for the same. This implementation would improve speed and provide\r\nmany additional features to the class, resulting from the properties the basis\r\nof monomials of the Chow ring enjoys.",
          "difficulty": null,
          "id": "proj_sagemath_2024_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/kcmBd7yA/",
          "proposal_id": null,
          "short_description": "This Google Summer of Code project aims to build a custom class in SageMath for the Chow rings of matroids by using a result which explicitly...",
          "slug": "direct-implementation-of-chow-rings-of-matroids",
          "status": "completed",
          "student_name": "Shriya Meenakshisundaram",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Direct Implementation of Chow Rings of Matroids"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2024/organizations/sagemath/"
    },
    "year_2025": {
      "num_projects": 7,
      "projects": [
        {
          "code_url": null,
          "description": "This project will enhance SageMath to systematically handle maximal exceptional sequences on smooth Fano toric varieties. We will add new Fano examples from known classifications, develop methods for detecting line bundles with zero cohomology, and automate the construction of maximal-length exceptional collections. Our module will support mutation and normalization of these sequences and offer fullness verification to confirm whether a sequence generates the derived category. Along with a publicly accessible library of full exceptional collections, we will provide thorough documentation and examples to streamline computational research in toric geometry and strengthen SageMath’s capabilities in algebraic geometry.",
          "difficulty": null,
          "id": "proj_sagemath_2025_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/DacbFeo5",
          "proposal_id": "WbR7qXMG",
          "short_description": "This project will enhance SageMath to systematically handle maximal exceptional sequences on smooth Fano toric varieties. We will add new Fano...",
          "slug": "classification-of-maximal-exceptional-sequences-on-smooth-fano-toric-varieties",
          "status": "in-progress",
          "student_name": "Aolong Li",
          "student_profile": null,
          "tags": [
            "ml",
            "ai"
          ],
          "title": "Classification of Maximal Exceptional Sequences on Smooth Fano Toric Varieties"
        },
        {
          "code_url": null,
          "description": "The project aims to compute the Poincaré normal form of Riemann matrices in SageMath.  This computation enables the decomposition of theta functions into a product of lower-dimensional theta functions, which can be evaluated much faster.  The project will implement the methods described by Martens to equip SageMath with tools for detecting and performing these reductions.  \n\nThe solution involves finding the reduction matrix M (if it exists), computing the Poincaré normal form of M, and applying a transformation to the period matrix. We aim to deliver a SageMath module for computing M and its normal form, a function for transforming the period matrix, a fully tested implementation for Poincaré reduction, and comprehensive documentation.",
          "difficulty": null,
          "id": "proj_sagemath_2025_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/jnvwvAbh",
          "proposal_id": "v5Lz80Pp",
          "short_description": "The project aims to compute the Poincaré normal form of Riemann matrices in SageMath. This computation enables the decomposition of theta functions...",
          "slug": "poincaré-normal-form-of-riemann-matrices",
          "status": "in-progress",
          "student_name": "Caleb Aryee",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Poincaré normal form of Riemann matrices"
        },
        {
          "code_url": null,
          "description": "Matchings and perfect matchings have received considerable attention in graph theory as well as in other related domains (such as, but not limited to, algorithms and optimization). There still remain many open problems — such as Barnette’s conjecture, Berge-Fulkerson conjecture, and so on — due to which it continues to remain an active area of research. At the heart of all this research lies the bottleneck of finding a maximum cardinality matching in undirected graphs. The objective of this project is to implement the Micali-Vazirani algorithm in SageMath — which achieves the best known theoretical runtime of O(|E|⋅√|V|) for computing such a matching — and to make all of this available freely to students, educators as well as researchers all across the world.",
          "difficulty": null,
          "id": "proj_sagemath_2025_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/0BAiIfUe",
          "proposal_id": "3ABTqQvc",
          "short_description": "Matchings and perfect matchings have received considerable attention in graph theory as well as in other related domains (such as, but not limited...",
          "slug": "on-the-implementation-of-the-oev-micali-vazirani-algorithm",
          "status": "in-progress",
          "student_name": "Janmenjaya Panda",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "On the Implementation of the O(|E|⋅√|V|) Micali-Vazirani Algorithm"
        },
        {
          "code_url": null,
          "description": "The boson-fermion correspondence is an isomorphism of two representations of the Heisenberg algebra. It can be stated as a way to construct a special family of symmetric functions called Schur functions, using certain objects called vertex operators. The goal of this project is to implement vertex operators in SageMath, and to thereby verify the boson-fermion correspondence by computer. A detailed description of the problem, including mathematical background, a list of deliverables, and more, can be found in the attached pdf.",
          "difficulty": null,
          "id": "proj_sagemath_2025_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/qZ75cron",
          "proposal_id": "SgO8QlA4",
          "short_description": "The boson-fermion correspondence is an isomorphism of two representations of the Heisenberg algebra. It can be stated as a way to construct a special...",
          "slug": "the-boson-fermion-correspondence-and-vertex-operators",
          "status": "in-progress",
          "student_name": "Joe McDonough",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "The Boson-Fermion Correspondence and Vertex Operators"
        },
        {
          "code_url": null,
          "description": "This project aims to add Krylov subspace methods for matrices over exact fields: representation of the kernel, co-kernel of a matrix of univariate polynomials over an exact field as a module, and associated invariants, as well as computation of the characteristic polynomial if the matrix is square via recent methods.\n\nThe performance relies heavily on a few core linear algebra operations, so care must be taken to use the most efficient implementations and to exploit any additional characteristics of the specific use cases. Consideration may also be given to more general optimisation of methods for matrices over univariate polynomials.\n\nKey goals for the project are to have the above functionalities implemented efficiently, with accompanying documentation and tests to meet the project standards.",
          "difficulty": null,
          "id": "proj_sagemath_2025_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/BUMbi6Vs",
          "proposal_id": "ddRVJd8c",
          "short_description": "This project aims to add Krylov subspace methods for matrices over exact fields: representation of the kernel, co-kernel of a matrix of univariate...",
          "slug": "functionalities-for-krylov-methods-over-exact-fields",
          "status": "in-progress",
          "student_name": "Nicholas Bell",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Functionalities for Krylov methods over exact fields"
        },
        {
          "code_url": null,
          "description": "This project focuses on enumeartion of k shotest simple paths.\nThis problem has practical applications in various networks, such as road\nand transporation networks. Thus, solving this problem practically as\nfast as possible is essential. There are several algorithms to achieve the\ncurrent best order of time complexity in research field, but in practice one\nof them is faster than others depending on an input graph or the amount\nof memory used. The goal of this project is to implement a unified function\nof these algorithms. It will help Sage users to choose a suitable algorithm\nin each scenario. This project also aims to extend the cycle enumeartion\nmethod in directed graphs currently implemented in Sage to undirected or\nweighted graphs.",
          "difficulty": "advanced",
          "id": "proj_sagemath_2025_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/cTcLUQcj",
          "proposal_id": "I6iCzD6j",
          "short_description": "This project focuses on enumeartion of k shotest simple paths. This problem has practical applications in various networks, such as road and...",
          "slug": "paths-and-cycles-enumeration-methods-in-graphs",
          "status": "in-progress",
          "student_name": "Yuta",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Paths and cycles enumeration methods in graphs"
        },
        {
          "code_url": null,
          "description": "This project implements the combinatorial Hopf algebra of double posets. A double poset is a set with two partial orders, and their isomorphism classes form the basis of a graded Hopf algebra \\(\\mathbb{Z}\\mathbf{D}\\), equipped with a bilinear pairing via \\emph{pictures}.\n\nThe implementation includes a \\texttt{DoublePoset} class, picture counting, and the bialgebra structure using Sage’s \\texttt{Bialgebra} framework. It also defines a homomorphism to quasisymmetric functions via \\(\\pi\\)-partitions, supports internal products, and develops the sub-bialgebra of special double posets mapping to permutations.",
          "difficulty": null,
          "id": "proj_sagemath_2025_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/fSP7xErF",
          "proposal_id": "BAC9ElkI",
          "short_description": "This project implements the combinatorial Hopf algebra of double posets. A double poset is a set with two partial orders, and their isomorphism...",
          "slug": "self-paired-hopf-algebra-on-double-posets",
          "status": "in-progress",
          "student_name": "Yuxuan Sun",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Self Paired Hopf Algebra on Double Posets"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2025/organizations/sagemath"
    }
  },
  "first_time": false,
  "contact": {
    "email": "tcscrims@gmail.com",
    "guide_url": "https://wiki.sagemath.org/GSoC/Contributors",
    "ideas_url": "https://wiki.sagemath.org/GSoC/2025",
    "irc_channel": "https://sagemath.zulipchat.com/",
    "mailing_list": "https://groups.google.com/g/sage-gsoc"
  },
  "social": {
    "blog": "http://planet.sagemath.org/",
    "discord": null,
    "facebook": null,
    "github": null,
    "gitlab": null,
    "instagram": null,
    "linkedin": null,
    "mastodon": null,
    "medium": null,
    "reddit": null,
    "slack": null,
    "stackoverflow": null,
    "twitch": null,
    "twitter": "https://twitter.com/sagemath",
    "youtube": null
  },
  "meta": {
    "version": 1,
    "generated_at": "2026-01-25T15:28:54.175Z"
  }
}