{
  "id": "692251e653dd9d7326d33eaa",
  "slug": "scilab",
  "name": "Scilab",
  "category": "End user applications",
  "description": "Cross-platform numerical computational package and programming language.",
  "image_url": "https://lh3.googleusercontent.com/lIs5ySAf3RTl47fydovwKV_c6iXAVC9iSG_tuhDg_uq7EWYQCwqKasW3EF7C4xM8SCm8Q7KNpmrkoYHb0FkCZPxfrFUXL8w",
  "img_r2_url": "https://pub-268c3a1efc8b4f8a99115507a760ca14.r2.dev/scilab.webp",
  "logo_r2_url": null,
  "url": "https://www.scilab.org",
  "active_years": [
    2016,
    2017,
    2018
  ],
  "first_year": 2016,
  "last_year": 2018,
  "is_currently_active": false,
  "technologies": [
    "c",
    "java",
    "c++",
    "fortran",
    "scilab",
    "python",
    "opengl"
  ],
  "topics": [
    "engineering",
    "graphics",
    "vision",
    "user interface",
    "mechanics",
    "programming language",
    "numerical computing",
    "scientific visualization",
    "mathematics",
    "science",
    "numerical computation"
  ],
  "total_projects": 14,
  "stats": {
    "avg_projects_per_appeared_year": 4.67,
    "projects_by_year": {
      "year_2016": 5,
      "year_2017": 5,
      "year_2018": 4,
      "year_2019": null,
      "year_2020": null,
      "year_2021": null,
      "year_2022": null,
      "year_2023": null,
      "year_2024": null,
      "year_2025": null
    },
    "students_by_year": {
      "year_2016": 5,
      "year_2017": 5,
      "year_2018": 4,
      "year_2019": null,
      "year_2020": null,
      "year_2021": null,
      "year_2022": null,
      "year_2023": null,
      "year_2024": null,
      "year_2025": null
    },
    "total_students": 13
  },
  "years": {
    "year_2016": {
      "num_projects": 5,
      "projects": [
        {
          "code_url": "http://bitiquinho.github.io/2016-08-18-notebook/",
          "description": "<p>Jupyter project provides a way to perform scientific/mathematical computations with several different programming languages using the same user interface. It achieves that by distributing the processing between a front-end (Jupyter clients, like the web based Jupyter Notebook) and a back-end (Jupyter kernels, written in Python, R, Java, etc.), that communicate among themselves with standardized format messages, transmitted through ZeroMQ connection.</p>\n<p>Besides the ability to switch across different kernels from the same common interface, another advantage of this approach is the possibility to run the two software components on different machines, e.g., offloading the heavier backend processing to a remote server while sending commands and visualizing data from a mobile device running the frontend.</p>\n<p>For Scilab, there is currently a kernel that uses a compatibility layer with file access data exchange and numpy calls to communicate with clients through the Python reference implementation.</p>\n<p>This Google Summer of Code proposal aims to adapt or rewrite the current suboptimal solution, to make it a truly native kernel, linking ZeroMQ messages directly to Scilab API.</p>\n",
          "difficulty": null,
          "id": "proj_scilab_2016_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/6165785793789952/",
          "proposal_id": null,
          "short_description": "Jupyter project provides a way to perform scientific/mathematical computations with several different programming languages using the same user...",
          "slug": "native-scilab-kernel-for-jupyter",
          "status": "completed",
          "student_name": "leonardojc",
          "student_profile": null,
          "tags": [
            "python",
            "java",
            "web",
            "mobile",
            "api"
          ],
          "title": "Native Scilab Kernel for Jupyter"
        },
        {
          "code_url": "https://wiki.scilab.org/GSoC2016_ChenfengZHU",
          "description": "<p>Xcos is a great tool for modeling and simulation. However, as the number of the blocks increases, an Xcos schema can become quickly messy.\nThis idea of is to provide options to automatically update the layout of an Xcos schema including its links and blocks, so that the diagrams could be kept well-presented. Based on the optimal route for a link, I will try to improve the positions of blocks and implement the preview functionality.</p>\n",
          "difficulty": null,
          "id": "proj_scilab_2016_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/4710427267170304/",
          "proposal_id": null,
          "short_description": "Xcos is a great tool for modeling and simulation. However, as the number of the blocks increases, an Xcos schema can become quickly messy.\nThis idea...",
          "slug": "xcos-automatic-layout-ii",
          "status": "completed",
          "student_name": "sampig",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "Xcos Automatic Layout II"
        },
        {
          "code_url": "http://batcode17.blogspot.in/",
          "description": "<p>Scilab being a software used worldwide, needs to focus on how its users (potential developers) interact with Scilab and how comfortable they are with using the features  provided by Scilab. Scilab already incorporates the facility to make figures such as tables labels etc and allows insertion and manipulation of data. Unfortunately even though the  facility is provided the features have been found buggy and not well documented making its usage very limited and  which incapacitates the current users and fails to attract new users .There are some most wanted features like spreadsheets, progress bar etc which are not present and are highly wished for by the users of Scilab,and others.</p>\n<p>My aim is to improve/upgrade the already existing facility to such a level that the users become very comfortable using it and to further introduce much needed user interface elements in Scilab User Interface Control to make it most favoured software. My work starts with modifying and documenting Uitables and Uitrees and extends upto incorporating ProgressBar. These development would solve major issues with GUI,would attract more users to Scilab and would help in retaining already existing users</p>\n",
          "difficulty": null,
          "id": "proj_scilab_2016_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/4823522614444032/",
          "proposal_id": null,
          "short_description": "Scilab being a software used worldwide, needs to focus on how its users (potential developers) interact with Scilab and how comfortable they are with...",
          "slug": "improving-ui-elements",
          "status": "completed",
          "student_name": "Rishubh Jain",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Improving UI-Elements"
        },
        {
          "code_url": "https://codereview.scilab.org/#/q/owner:dhruv%2540khattarindia.com",
          "description": "<p>The main objective of this project is to reduce the memory errors faced by the Scilab code-base and ensure memory safety.</p>\n",
          "difficulty": null,
          "id": "proj_scilab_2016_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5994243994681344/",
          "proposal_id": null,
          "short_description": "The main objective of this project is to reduce the memory errors faced by the Scilab code-base and ensure memory safety.",
          "slug": "memory-safety",
          "status": "completed",
          "student_name": "Dhruv Khattar",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Memory Safety"
        },
        {
          "code_url": "https://wiki.scilab.org/GSoC_2016_Caio_SOUZA",
          "description": "<p>This project aims to polish the current graphics features of Scilab such as zooming, datatips and interactive curve edition through plotting.\nUsually the Scilab is widely used by students and engineers as a completely free and open source numerical software solution for fast prototyping and data visualization. In this context the user experience is dictated by how well one can view and easily interact with its data. This makes the plotting capabilities and interactions, besides performance, a key factor of the perceived easiness and software quality.</p>\n",
          "difficulty": null,
          "id": "proj_scilab_2016_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5180804300800000/",
          "proposal_id": null,
          "short_description": "This project aims to polish the current graphics features of Scilab such as zooming, datatips and interactive curve edition through plotting.\nUsually...",
          "slug": "general-graphics-improvements",
          "status": "completed",
          "student_name": "Caio Souza",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "General Graphics Improvements"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2016/organizations/5960176045654016/"
    },
    "year_2017": {
      "num_projects": 5,
      "projects": [
        {
          "code_url": "http://bitiquinho.github.io/2017-08-24-almost_there/",
          "description": "<p><strong>Modelica</strong> is an object-oriented and declarative language specification for description/modeling of dynamic systems (mechanical, electrical, thermal, mixed, etc.). <strong>Scilab</strong> uses it inside <strong>Xcos</strong> to describe more complex blocks/components, taking advantage of existing compiler/translator implementations to generate correspondent <strong>C</strong> code for actual simulation.</p>\n<p>For now, <strong>Modelica</strong> in <strong>Scilab</strong> is managed by an out-of tree compiler developed by <strong>LMS</strong> released under the <strong>GPL</strong> license, which is not actively maintained and support only a subset of the current language specification. The idea of this project is to allow the usage of <strong>OpenModelica</strong>’s <strong>OMCompiler</strong> (<strong>omc</strong>) as an alternative. Being a more up-to-date solution, <strong>omc</strong> integration would provide <strong>Scilab</strong>/<strong>Xcos</strong> the ability to use more advanced features, and avoid bugs, issues and maintenance burden of the current <strong>modelicac</strong> compiler.</p>\n<p>Adapting <strong>Xcos</strong> blocks to support the <strong>FMI2 API</strong> standard would allow not only omc-generated code to be called but also any other FMI2-compliant applications to be easily integrate in the future.</p>\n",
          "difficulty": "advanced",
          "id": "proj_scilab_2017_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6706348901269504/",
          "proposal_id": null,
          "short_description": "Modelica is an object-oriented and declarative language specification for description/modeling of dynamic systems (mechanical, electrical, thermal,...",
          "slug": "openmodelica-integration",
          "status": "completed",
          "student_name": "Leonardo José Consoni",
          "student_profile": null,
          "tags": [
            "api",
            "ai"
          ],
          "title": "OpenModelica Integration"
        },
        {
          "code_url": "https://github.com/aashay201297/OpenFOAM-toolbox/tree/1.0",
          "description": "<p>The main objective of this project is to connect OpenFOAM solver to Scilab. This will give the user a better interface to use computational fluid dynamics(CFD) analysis in Scilab and setup meshes easily. Currently, there are ways to solve a flow equation(using ode) but there is no CFD solver toolbox or module in Scilab. This project will benefit a large fraction of Scilab users as CFD analysis is significant in vast areas like industries, research purpose, etc. The major work will include porting elbow flow demo in OpenFOAM to scilab which will include wrapping the functions in icoFoam solver of OpenFOAM to scilab.</p>\n",
          "difficulty": null,
          "id": "proj_scilab_2017_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/4720873164505088/",
          "proposal_id": null,
          "short_description": "The main objective of this project is to connect OpenFOAM solver to Scilab. This will give the user a better interface to use computational fluid...",
          "slug": "openfoam",
          "status": "completed",
          "student_name": "Aashay Singhal",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "OpenFOAM"
        },
        {
          "code_url": "https://github.com/Rui517/do_profile_superblock42",
          "description": "<p>Since Scilab is an open source, various practitioners use it to simulate real-time applications and systems. However, Simulation cannot be achieved in zero time. Knowing execution time is a key to develop an accurate simulation in real-time areas. Precise measurement of execution time is important in area about life safety, such as military equipments, automotive and aerospace industries.\nAs we known, Matlab has a Profiler function which could measure where a program spends time. By using Matlab Profiler, we could evaluate and improve performance of programs. What I want to do is to make a similar function for Scilab.\nWe use Xcos to make models that have many blocks. In some cases, we want to know execution time of these blocks. A variety of literatures introduce the way of measuring execution time but they did not present directly time to users. Therefore, in this project, I will measure time and present time to users.</p>\n",
          "difficulty": null,
          "id": "proj_scilab_2017_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6069519202123776/",
          "proposal_id": null,
          "short_description": "Since Scilab is an open source, various practitioners use it to simulate real-time applications and systems. However, Simulation cannot be achieved...",
          "slug": "xcos-profiler",
          "status": "completed",
          "student_name": "Rui Shi",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "Xcos Profiler"
        },
        {
          "code_url": "https://github.com/mandroid6/machine-learning-Toolbox-SCILAB",
          "description": "<p>Machine learning has been implemented in all major software languages( C++, Java, Python, MATLAB) , with each having their individual set of libraries to support and improve existing numerical analysis and computation.</p>\n<p>This project aims to develop machine learning features in SCILAB, which will be available to the end-user as a toolbox or direct function calls. The proejct has been divided into two sections:</p>\n<p>[1] all major machine learning algorithms will be implemented through Scilab code.</p>\n<p>[2] an integration approach will be followed to adapt popular ml library Tensorflow for SCILAB.</p>\n<p>ml libraries to be adapted from python to Scilab-</p>\n<ol>\n<li>Scikit-learn</li>\n<li>tensorflow</li>\n</ol>\n",
          "difficulty": null,
          "id": "proj_scilab_2017_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/4877103942074368/",
          "proposal_id": null,
          "short_description": "Machine learning has been implemented in all major software languages( C++, Java, Python, MATLAB) , with each having their individual set of...",
          "slug": "machine-learning-features-in-scilab",
          "status": "completed",
          "student_name": "Mandar Deshpande",
          "student_profile": null,
          "tags": [
            "python",
            "java",
            "ml",
            "ai"
          ],
          "title": "Machine Learning features in Scilab"
        },
        {
          "code_url": "https://wiki.scilab.org/siddhartha.gairola18%40gmail.com",
          "description": "<p>The main aim of this project is to provide a wrapper of Matlab MEX-Files headers on the current API Scilab. By using the MEX-Files wrapper the toolboxes in Matlab will be very easy to port to Scilab and also existing libraries using Matlab MEX could be directly used in Scilab. A module - mexlib module already exists in Scilab which is compatible with the Matlab-Mex API. Extending the current module and writing tests for each extension will be the major part of the project. Adding tests and a working demo for the already existing MEX functions will be included.</p>\n",
          "difficulty": "beginner",
          "id": "proj_scilab_2017_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/4882600426471424/",
          "proposal_id": null,
          "short_description": "The main aim of this project is to provide a wrapper of Matlab MEX-Files headers on the current API Scilab. By using the MEX-Files wrapper the...",
          "slug": "matlab-mex-files-management",
          "status": "completed",
          "student_name": "Siddhartha Gairola",
          "student_profile": null,
          "tags": [
            "api",
            "ai"
          ],
          "title": "Matlab MEX-Files management"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2017/organizations/6603475844595712/"
    },
    "year_2018": {
      "num_projects": 4,
      "projects": [
        {
          "code_url": "https://wiki.scilab.org/Working%20Demo%20with%20Usage%20Docs%20for%20the%20Mex%20Module",
          "description": "<p>The aim of this project is to write a working Demo for the Matlab Mex modules present in Scilab. The Matlab MEX-Files is an API which is a wrapper on the current API Scilab. This would make it very easy to port existing Matlab Mex toolboxes into Scilab. A module - mexlib module already exists in Scilab which is compatible with the Matlab-Mex API. Currently the mex support for Scilab is good but there is a lack of a concrete demo. Thus, it is necessary to have a working demo for Mex within Scilab.</p>\n",
          "difficulty": "beginner",
          "id": "proj_scilab_2018_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/4984602812743680/",
          "proposal_id": null,
          "short_description": "The aim of this project is to write a working Demo for the Matlab Mex modules present in Scilab. The Matlab MEX-Files is an API which is a wrapper on...",
          "slug": "working-demo-with-usage-docs-for-the-mex-module",
          "status": "completed",
          "student_name": "Siddhartha Gairola",
          "student_profile": null,
          "tags": [
            "api",
            "ai"
          ],
          "title": "Working Demo with Usage Docs for the Mex Module"
        },
        {
          "code_url": "https://dvkcool.github.io/gsoc-2018/blog/FinalProjectReport.html",
          "description": "<p>A proposal for MacOS signed applications with basically three agendas:</p>\n<ol>\n<li>To write a script that installs all the third party automatically, in short create a CLI that lets user know what dependency is lacking and installs them easily.</li>\n<li>Include JRE as a bundle with the application.</li>\n<li>Self sign the MacOS application and to automate this process with make install</li>\n</ol>\n",
          "difficulty": null,
          "id": "proj_scilab_2018_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5113954611232768/",
          "proposal_id": null,
          "short_description": "A proposal for MacOS signed applications with basically three agendas:\n\nTo write a script that installs all the third party automatically, in short...",
          "slug": "macos-1013-signed-app",
          "status": "completed",
          "student_name": "Divyanshu Kumar",
          "student_profile": null,
          "tags": [],
          "title": "MacOS 10.13 signed app"
        },
        {
          "code_url": "https://soumitraagarwal.github.io/Scilab-gsoc/",
          "description": "<p>The project aims to enhance machine learning features in SCILAB, for SCILAB and by SCILAB. The main concentration would be to integrate deep learning functionality (Keras/TensorFlow) with a possibility of working on the data science usability as well (R/SAS integration).There are tits-bits here and there that would drive the developer pool towards SCILAB in the future. The project in itself draws inspiration from the <a href=\"https://github.com/mandroid6/machine-learning-Toolbox-SCILAB/tree/master/Final%20Submission\" target=\"_blank\">GSoC project last year</a> with the same header but is not necessarily an extension to it.</p>\n",
          "difficulty": null,
          "id": "proj_scilab_2018_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5243621217402880/",
          "proposal_id": null,
          "short_description": "The project aims to enhance machine learning features in SCILAB, for SCILAB and by SCILAB. The main concentration would be to integrate deep learning...",
          "slug": "machine-learning-features-in-scilab-an-autobiography",
          "status": "completed",
          "student_name": "Soumitra Agarwal",
          "student_profile": null,
          "tags": [
            "android",
            "ai"
          ],
          "title": "Machine learning features in Scilab : An autobiography"
        },
        {
          "code_url": "https://wiki.scilab.org/Nimish%20Kapoor",
          "description": "<p>The aim of this project is to improve the code quality of Scilab with the help of various Static Analysis Tools like Scan Coverity(Java and C/C++), Cppcheck, Valgrind(Dynamic Analysis tool) and Clang-Tidy (last three for C/C++) by fixing  Java, JNI and C/C++ related errors.</p>\n",
          "difficulty": null,
          "id": "proj_scilab_2018_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/6122154563207168/",
          "proposal_id": null,
          "short_description": "The aim of this project is to improve the code quality of Scilab with the help of various Static Analysis Tools like Scan Coverity(Java and C/C++),...",
          "slug": "code-quality",
          "status": "completed",
          "student_name": "Nimish Kapoor",
          "student_profile": null,
          "tags": [
            "java",
            "ai"
          ],
          "title": "Code Quality"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2018/organizations/4786317862895616/"
    },
    "year_2019": null,
    "year_2020": null,
    "year_2021": null,
    "year_2022": null,
    "year_2023": null,
    "year_2024": null,
    "year_2025": null
  },
  "first_time": false,
  "contact": {
    "email": "gsoc@lists.scilab.org",
    "guide_url": null,
    "ideas_url": null,
    "irc_channel": "https://www.scilab.org/resources/user_community/irc",
    "mailing_list": "http://www.scilab.org/en/development/ml"
  },
  "social": {
    "blog": "https://www.scilab.org/community/news",
    "discord": null,
    "facebook": null,
    "github": null,
    "gitlab": null,
    "instagram": null,
    "linkedin": null,
    "mastodon": null,
    "medium": null,
    "reddit": null,
    "slack": null,
    "stackoverflow": null,
    "twitch": null,
    "twitter": "https://twitter.com/scilab",
    "youtube": null
  },
  "meta": {
    "version": 1,
    "generated_at": "2026-01-25T15:28:54.193Z"
  }
}