{
  "id": "692251e853dd9d7326d33ebe",
  "slug": "submitty",
  "name": "Submitty",
  "category": "End user applications",
  "description": "Homework Autograding and Course Management Tools",
  "image_url": "https://summerofcode.withgoogle.com/media/org/submitty/jlpoxlj2rvpot6zv-360.png",
  "img_r2_url": "https://pub-268c3a1efc8b4f8a99115507a760ca14.r2.dev/submitty.webp",
  "logo_r2_url": null,
  "url": "https://submitty.org",
  "active_years": [
    2018,
    2019,
    2020,
    2022,
    2023,
    2024
  ],
  "first_year": 2018,
  "last_year": 2024,
  "is_currently_active": false,
  "technologies": [
    "python",
    "c++",
    "databases",
    "web",
    "html",
    "css",
    "php",
    "javascript",
    "ajax",
    "postgresql"
  ],
  "topics": [
    "education",
    "web",
    "data visualization",
    "privacy/security",
    "communication",
    "visualization"
  ],
  "total_projects": 19,
  "stats": {
    "avg_projects_per_appeared_year": 3.17,
    "projects_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": 2,
      "year_2019": 4,
      "year_2020": 3,
      "year_2021": null,
      "year_2022": 3,
      "year_2023": 3,
      "year_2024": 4,
      "year_2025": null
    },
    "students_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": 2,
      "year_2019": 4,
      "year_2020": 3,
      "year_2021": null,
      "year_2022": 3,
      "year_2023": 3,
      "year_2024": 4,
      "year_2025": null
    },
    "total_students": 19
  },
  "years": {
    "year_2016": null,
    "year_2017": null,
    "year_2018": {
      "num_projects": 2,
      "projects": [
        {
          "code_url": "http://submitty.org/developer/GSOC2018_TusharGurjar",
          "description": "<p>Plagiarism Detection is among the significant and crucial tools provided by Submitty. I would like to work on improvising the current Plagiarism Detector by implementing following features- Plagiarism detector extension to pdf/txt files, extending the language support to further include Matlab.</p>\n",
          "difficulty": null,
          "id": "proj_submitty_2018_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/6579818627858432/",
          "proposal_id": null,
          "short_description": "Plagiarism Detection is among the significant and crucial tools provided by Submitty. I would like to work on improvising the current Plagiarism...",
          "slug": "instructor-interface-for-plagiarism-detection",
          "status": "completed",
          "student_name": "Tushar Gurjar",
          "student_profile": null,
          "tags": [],
          "title": "Instructor Interface for Plagiarism Detection"
        },
        {
          "code_url": "http://submitty.org/developer/GSOC2018_GaganKumar",
          "description": "<p>Submitty has a student-faculty portal named \"Discussion Forum\". It can be used for asking queries, announcements, notes sharing, etc.\nI would like to work on this module to implement more features/optimizations such as -</p>\n<ul>\n<li>Notifications</li>\n<li>End to end tests</li>\n<li>Scalability</li>\n<li>Refactoring code/queries</li>\n<li>And working on other feature requests.</li>\n</ul>\n",
          "difficulty": null,
          "id": "proj_submitty_2018_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5114290021335040/",
          "proposal_id": null,
          "short_description": "Submitty has a student-faculty portal named \"Discussion Forum\". It can be used for asking queries, announcements, notes sharing, etc.\nI would like to...",
          "slug": "discussion-forum",
          "status": "completed",
          "student_name": "Gagan Kumar",
          "student_profile": null,
          "tags": [],
          "title": "Discussion Forum"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2018/organizations/5076076959105024/"
    },
    "year_2019": {
      "num_projects": 4,
      "projects": [
        {
          "code_url": "https://submitty.org/developer/google_summer_of_code/2019_FonNoel",
          "description": "<p>Infrastructure management is an important part of every project as we are always faced with the need to make regular releases of new features and applying consistent testing methods while doing so. The aim of this project is to expand the code coverage of the unit and integration tests for the Submitty project. This project will not just focus on introducing new tests to increase code coverage but will also focus on the best ways to implement, automate and execute the suites. In short, this GSoC project is about the Continuous Integration (CI) of Submitty projects mainly in PHP and Python where the majority of the tests are written and would be concerned mainly with writing tests (testing), automating the building and deployment of Submitty.</p>\n",
          "difficulty": null,
          "id": "proj_submitty_2019_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5606968301977600/",
          "proposal_id": null,
          "short_description": "Infrastructure management is an important part of every project as we are always faced with the need to make regular releases of new features and...",
          "slug": "continuous-integration-testing-automation-for-submitty",
          "status": "completed",
          "student_name": "Fenn25",
          "student_profile": null,
          "tags": [
            "python",
            "ai",
            "ui"
          ],
          "title": "Continuous Integration Testing (Automation) for Submitty."
        },
        {
          "code_url": "https://submitty.org/developer/google_summer_of_code/2019_XiaoHan",
          "description": "<p>The project aims to establish a REST API for Submitty. The API provides an alternative way of interacting with Submitty, which helps system administrators write scripts to automate database operations, enables developers to work out their front-ends and facilitates tests for methods that previously only return fully rendered pages.</p>\n<p>The project mainly consists of two parts: replacing the original router of Submitty and implementing API endpoints.</p>\n",
          "difficulty": null,
          "id": "proj_submitty_2019_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/4645685633220608/",
          "proposal_id": null,
          "short_description": "The project aims to establish a REST API for Submitty. The API provides an alternative way of interacting with Submitty, which helps system...",
          "slug": "rest-api-for-submitty",
          "status": "completed",
          "student_name": "Xiao Han",
          "student_profile": null,
          "tags": [
            "api",
            "ai",
            "database"
          ],
          "title": "REST API for Submitty"
        },
        {
          "code_url": "https://submitty.org/developer/google_summer_of_code/2019_DrumilPatel",
          "description": "<p>Autograding is one of the greatest features which makes the instructor work more easier. It helps the instructor by grading score without reading the code. It basically compares the output file for a predefined input file with predefined output file given by the instructor.</p>\n<p>Currently, instructors must write a configuration as a config.json (and any necessary additional files) and upload or store these files on the local file system. Automated grading can be improved by implementing the following features:-</p>\n<ul>\n<li>Graphical User Interface for creation config.json, input, etc</li>\n<li>Automated Creation of Expected Output Files</li>\n<li>Randomly Generate Testcases Input</li>\n</ul>\n<p>We can reduce learning curve for new instructor by providing getting started tour feature.</p>\n<ul>\n<li>Getting started tour feature can be implemented using introjs</li>\n</ul>\n",
          "difficulty": null,
          "id": "proj_submitty_2019_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/4878251485298688/",
          "proposal_id": null,
          "short_description": "Autograding is one of the greatest features which makes the instructor work more easier. It helps the instructor by grading score without reading the...",
          "slug": "automating-configuration-for-assignment-uploads",
          "status": "completed",
          "student_name": "Patel Drumil",
          "student_profile": null,
          "tags": [
            "ml"
          ],
          "title": "Automating configuration for Assignment uploads"
        },
        {
          "code_url": "https://submitty.org/developer/google_summer_of_code/2019_AnubhavSingh",
          "description": "<p>The project was an upgrade to the Discussion Forum module of the Submitty web application. The Discussion Forum allows students in a course to discuss their coursework, upload images, links and embed code. My work over the summer made the Discussion Forum more user-friendly in terms of accessibility and speed of using the Forum. Some of the major areas I worked upon were -</p>\n<ol>\n<li><p>Forum Refactor Templates\nIn this task, I was responsible for utilizing the Twig template engine all over the Forum, in sync with the rest of the code. This allowed to unify the structure of code all over Submitty, and hence making it easier for future developers to bring in changes.</p>\n</li>\n<li><p>Solving VPAT issues\nA very exciting part of working on Submitty for me was to discover the depth of making websites accessible. Working on the VPAT introduced me to tools I had not known to exist such as the WAVE and ChromeVox (don’t install it during a meeting).</p>\n</li>\n<li><p>AJAXify Forum &amp; WebSocket Integration\nI migrated the usage behaviour of the Discussion Forum from reloading at nearly every interaction to using Ajax for performing actions. Also, I added the support of WebSockets for real-time interactivity and posts/threads fetch.</p>\n</li>\n</ol>\n",
          "difficulty": null,
          "id": "proj_submitty_2019_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5857080622186496/",
          "proposal_id": null,
          "short_description": "The project was an upgrade to the Discussion Forum module of the Submitty web application. The Discussion Forum allows students in a course to...",
          "slug": "discussion-forum-upgrades",
          "status": "completed",
          "student_name": "Anubhav Singh",
          "student_profile": null,
          "tags": [
            "web"
          ],
          "title": "Discussion Forum Upgrades"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2019/organizations/6109881407373312/"
    },
    "year_2020": {
      "num_projects": 3,
      "projects": [
        {
          "code_url": "https://submitty.org/developer/google_summer_of_code/2020_Harsh_Joshi",
          "description": "<p>The project aims to develop a system for grading in online learning modules so that grading can include peer grading in addition to the already existing detailed rubric manual grading for student assignments. The project also plans to include evaluation of the quality of peer grading done along with the anonymity of student names while grading and security to ensure students only see the submission material of peers they have been assigned to grade.</p>\n",
          "difficulty": null,
          "id": "proj_submitty_2020_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5335387796406272/",
          "proposal_id": null,
          "short_description": "The project aims to develop a system for grading in online learning modules so that grading can include peer grading in addition to the already...",
          "slug": "peer-grading",
          "status": "completed",
          "student_name": "Harsh Joshi",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Peer Grading"
        },
        {
          "code_url": "https://submitty.org/developer/google_summer_of_code/2020_Marwan_Atef",
          "description": "<p>WebSockets allow users’ pages to get dynamically refreshed/updated without the need to manually refresh the page every now and then.\nThis behaviour is useful in pages that are accessed by multiple users simultaneously. So, new updates are fetched automatically and only the necessary parts of the page are re-rendered without refreshing the whole page to get the updates reducing the load on the server.</p>\n",
          "difficulty": null,
          "id": "proj_submitty_2020_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/4879317634383872/",
          "proposal_id": null,
          "short_description": "WebSockets allow users’ pages to get dynamically refreshed/updated without the need to manually refresh the page every now and then.\nThis behaviour...",
          "slug": "websockets-for-live-page-updates",
          "status": "completed",
          "student_name": "Marwan Atef",
          "student_profile": null,
          "tags": [
            "web"
          ],
          "title": "WebSockets for live page updates"
        },
        {
          "code_url": "https://submitty.org/developer/google_summer_of_code/2020_Mukul_Kumar_Jha",
          "description": "<p>This project was focused on making Submitty mobile friendly and a progressive web-app with adding push notification feature but during the summer I worked equally on a number of other features which involved adding and updating the database, writing SQL queries, and adding corresponding migrations file. I also added unit tests using PHPUnit for different Models and used Selenium (with python) to write end-to-end tests.</p>\n<p>During the summer I used the following tools and technologies for completing my project Figma, HTML, Twig, CSS, Bootstrap, JS, JQuery,  Service-workers, PHP (Symfony), PostgreSQL, SQLAlchemy, Datagrip, Vagrant, Selenium, Python, PHPUnit, TravisCI</p>\n<p>To sum things up, this was a great full-stack project and I enjoyed working on all the major parts of Submitty!</p>\n",
          "difficulty": null,
          "id": "proj_submitty_2020_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5953544957460480/",
          "proposal_id": null,
          "short_description": "This project was focused on making Submitty mobile friendly and a progressive web-app with adding push notification feature but during the summer I...",
          "slug": "mobile-friendly-website-and-pwa",
          "status": "completed",
          "student_name": "Mukul Kumar Jha",
          "student_profile": null,
          "tags": [
            "python",
            "web",
            "mobile",
            "ml",
            "database"
          ],
          "title": "Mobile Friendly Website and PWA"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2020/organizations/5702344097923072/"
    },
    "year_2021": null,
    "year_2022": {
      "num_projects": 3,
      "projects": [
        {
          "code_url": "https://submitty.org/developer/google_summer_of_code/2022_Akshat_Batra",
          "description": "I will be performing a holistic security assessment of Submitty. Patching once a potential vulnerability is found and documenting the flaw. Development of CI tools to automate the process of checks and validations will be done so as to prevent vulnerabilities from popping up. Considering the three major user roles of Instructor, TA and student,  I'll be performing a thorough scrutiny of the implementation of authorization. I'll be bolstering the configuration standard to prevent security risks posed due to misconfigurations. At the end of the project, Submitty will be more secure along with having stronger mechanisms to catch vulnerabilities at an early stage and thus making continuous integration more reliable.",
          "difficulty": null,
          "id": "proj_submitty_2022_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/cgmh6Hr7/",
          "proposal_id": null,
          "short_description": "I will be performing a holistic security assessment of Submitty. Patching once a potential vulnerability is found and documenting the flaw....",
          "slug": "website-security-and-penetration-testing",
          "status": "completed",
          "student_name": "Akshat Batra",
          "student_profile": null,
          "tags": [
            "web"
          ],
          "title": "Website Security and Penetration Testing"
        },
        {
          "code_url": "https://submitty.org/developer/google_summer_of_code/2022_Poorna_Gunathilaka",
          "description": "Static analysis is used in the Submitty platform for verifying that the student submissions for programming courses contain specific language features. Current implementation of this uses a simple lexical (token-based) static analysis which is not up to date with the newer features in the Python language and it does not fully support C++. In order to expand these checks, the proposed solution for this is to produce and analyze the Abstract syntax tree (AST) of the submitted code. This generated AST can also be integrated with the implementation of the Lichen Plagiarism Detection module. It is also expected to create additional autograding tutorial examples and corresponding continuous integration regression testing by the end of the project.",
          "difficulty": null,
          "id": "proj_submitty_2022_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/TjeLz8zH/",
          "proposal_id": null,
          "short_description": "Static analysis is used in the Submitty platform for verifying that the student submissions for programming courses contain specific language...",
          "slug": "static-program-analysis-for-autograding",
          "status": "completed",
          "student_name": "Poorna Gunathilaka",
          "student_profile": null,
          "tags": [
            "python",
            "ai"
          ],
          "title": "Static Program Analysis for Autograding"
        },
        {
          "code_url": "https://submitty.org/developer/google_summer_of_code/2022_Madhur_Jain",
          "description": "With today's dynamic technology , people interact more with their phones and tablets and in order to adapt with this change , PWAs offer a great solution with their ability to leverage the resource of a website and provide  a cross platform experience on any device with almost all features  a mobile app has to offer , like push notifications etc. One of essential prerequisites for PWAs is good integration of the web app in various resolutions. Submitty already has good support for most of it’s web features on mobiles and tablets and I would like to carry the work forward in the assimilation of more of its features and webpages in variety of display resolutions. With this done we can experiment and analyze various platforms in order to successfully implement the creation and maintenance of PWA for submitty , this will include exploring a platform that provides best support for all feature on variety of devices in the most optimal way.\nAfter we are done with selection , work on essential components like Manifest,  Service worker , Caching and fetching of the assets, Optimal UI/UX for installation and other features could we worked upon. Then the work on some errors and compatibility issues could be done. Atlast the proper documentation for all the work including the usage , installation etc could be done.",
          "difficulty": null,
          "id": "proj_submitty_2022_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/1P0Nl08m/",
          "proposal_id": null,
          "short_description": "With today's dynamic technology , people interact more with their phones and tablets and in order to adapt with this change , PWAs offer a great...",
          "slug": "submitty-progressive-web-app",
          "status": "completed",
          "student_name": "Madhur Jain",
          "student_profile": null,
          "tags": [
            "web",
            "mobile",
            "ai",
            "ui",
            "ux"
          ],
          "title": "Submitty Progressive Web App"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2022/organizations/submitty/"
    },
    "year_2023": {
      "num_projects": 3,
      "projects": [
        {
          "code_url": "https://submitty.org/developer/google_summer_of_code/2023_Cameron_Peterson",
          "description": "Submitty currently has unit and integration tests that take over an hour to complete, the goal is to reduce the run time of the tests by at least half, while adding more tests to increase the code coverage, in order to limit the amount of inaccurate changes being merged.",
          "difficulty": null,
          "id": "proj_submitty_2023_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/buBnvtEr",
          "proposal_id": "WwRwrgbq",
          "short_description": "Submitty currently has unit and integration tests that take over an hour to complete, the goal is to reduce the run time of the tests by at least...",
          "slug": "continuous-integration-optimization",
          "status": "completed",
          "student_name": "Cameron Peterson",
          "student_profile": null,
          "tags": [],
          "title": "Continuous Integration Optimization"
        },
        {
          "code_url": "https://submitty.org/developer/google_summer_of_code/2023_Musaab_Imran",
          "description": "Submitty is a web-based platform responsible for managing confidential information, and it is\r\nessential to assess its security regularly. This project aims to conduct a comprehensive security\r\nrisk assessment of the Submitty system, identify and repair specific security vulnerabilities,\r\nand expand and create continuous integration tools to prevent the introduction of new\r\nvulnerabilities. To mitigate the vulnerabilities in Submitty, it is essential to implement best practices in secure coding, such as input validation, access control, and encryption.",
          "difficulty": null,
          "id": "proj_submitty_2023_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/jjv12quT",
          "proposal_id": "jxIzYT5j",
          "short_description": "Submitty is a web-based platform responsible for managing confidential information, and it is essential to assess its security regularly. This...",
          "slug": "website-security-and-penetration-testing",
          "status": "completed",
          "student_name": "Musaab Imran",
          "student_profile": null,
          "tags": [
            "web",
            "ai"
          ],
          "title": "Website Security and Penetration Testing"
        },
        {
          "code_url": "https://submitty.org/developer/google_summer_of_code/2023_Saumya_Borwankar",
          "description": "The overall UI design of Submitty can get a little overwhelming for the general public. Submitty is feature-rich but lacks simplicity for non-technical users navigating the application. The autograding feature of submitty is an important and mature feature allowing instructors to assign points for various checkpoints in the student-submitted code. All the autograding details are contained in a config.json file \nThe autograding configuration is however a little difficult task for non-technical users. They have to make sure that the format is correct and that all the fields are valid, which can be overwhelming. Hence a GUI page can help more people be accustomed to designing their own configuration files. I am willing to introduce some more features in the GUI which will allow richer and greater engagement with the configuration file for the instructors. \n\nAdditional features\n\nAdd test cases automatically for programming/non-programming courses.\nAdd plagiarism check of 2 types: 1) student vs student  2) student vs internet\nVerify if the config file created is valid or not\nAdd a verification process for the input form text field\nEdit an already existing configuration file with the GUI interface.\n\nDeliverables\n\nGUI for technical and non-technical interface\nPlagiarism checker for all categories\nAdditional features implementation (as discussed above) in the GUI \nDocumentation and tutorials for all implemented features",
          "difficulty": null,
          "id": "proj_submitty_2023_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/nwwlQpp7",
          "proposal_id": "nmcTI7eV",
          "short_description": "The overall UI design of Submitty can get a little overwhelming for the general public. Submitty is feature-rich but lacks simplicity for...",
          "slug": "streamline-instructor-configuration-of-automated-grading",
          "status": "completed",
          "student_name": "saumyaborwankar",
          "student_profile": null,
          "tags": [
            "ml",
            "ai",
            "ui"
          ],
          "title": "Streamline Instructor Configuration of Automated Grading"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2023/organizations/submitty"
    },
    "year_2024": {
      "num_projects": 4,
      "projects": [
        {
          "code_url": "https://submitty.org/developer/google_summer_of_code/2024_Rahul_Vishwakarma",
          "description": "Submitty, the TA grading interface is elaborate, highly-featured, and customizable. However, the interface is visually overwhelming to new graders, and some of our TA grading features are not adequately tested by automated unit and end-to-end (Cypress) regression testing. The primary goals for this project include the expansion of our automated testing of the TA Grading pages and patching bugs uncovered by this improved testing. And the project is to enhance the TA experience, especially for graders who are new to the interface and grading process.",
          "difficulty": null,
          "id": "proj_submitty_2024_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/CJ2GEkRL/",
          "proposal_id": null,
          "short_description": "Submitty, the TA grading interface is elaborate, highly-featured, and customizable. However, the interface is visually overwhelming to new graders,...",
          "slug": "expand-testing-of-the-manualta-rubric-grading-interface",
          "status": "completed",
          "student_name": "Rahul Vishwakarma_",
          "student_profile": null,
          "tags": [],
          "title": "Expand Testing of the Manual/TA Rubric Grading Interface"
        },
        {
          "code_url": "https://submitty.org/developer/google_summer_of_code/2024_Nithish_Reddy_Banda",
          "description": "Instructors face significant challenges when configuring autograding systems for their courses due to limited examples, insufficient documentation, and a lack of coverage for various features. To address these issues, I propose a comprehensive solution aimed at reducing the learning curve for instructors and enhancing the functionality of autograding systems. The project focuses on three primary areas: Firstly, I aim to improve autograding examples by creating tailored solutions for specific use cases, such as evaluating compilation speed and handling distributed/networked applications. These examples will feature detailed configurations in config.json, accompanied by comprehensive documentation. Additionally, existing examples will be revamped to meet current standards and encompass a broader range of programming languages and features. Secondly, I will enhance documentation and provide illustrative examples for new autograding features that lack proper guidance. Through thorough research and collaboration with mentors, I will develop demonstrations for features like generating random input/output and utilizing customized Docker containers. The aim is to facilitate understanding and usage of these features by instructors. Lastly, to provide instructors with a user-friendly platform for configuring autograding across various educational levels, I will establish a structured repository. This repository will house a diverse array of autograding examples organized by educational level, ranging from introductory to advanced courses. Furthermore, I will encourage crowd-sourced contributions to create a comprehensive collection of programming assignments and exercises, complete with their autograding configurations. To streamline the contribution process and ensure consistency in configurations, I will implement GitHub Workflow Actions. The repository will include detailed documentation and guidelines to facilitate contribution and usage.",
          "difficulty": "advanced",
          "id": "proj_submitty_2024_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/x4SFJiVp/",
          "proposal_id": null,
          "short_description": "Instructors face significant challenges when configuring autograding systems for their courses due to limited examples, insufficient documentation,...",
          "slug": "expansion-of-examples-and-documentation-of-intermediate-and-advanced-autograding-features",
          "status": "completed",
          "student_name": "Nithish Reddy Banda",
          "student_profile": null,
          "tags": [
            "ml",
            "ai",
            "docker",
            "ui"
          ],
          "title": "Expansion of Examples and Documentation of Intermediate and Advanced Autograding Features"
        },
        {
          "code_url": "https://submitty.org/developer/google_summer_of_code/2024_Sophia_Oliinik",
          "description": "After taking time to discuss the Submitty system with a professor that uses it daily as a grading tool for their classes, a place for improvement that I have found lies in the design and depth of accessible statistics and reports on how students are doing in their class. The Submitty system currently does not have a user-friendly way of viewing student grades for the instructor or TA. This creates an issue for the instructor in being able to clearly see how their students are doing in the class, trends in which problem sets might cause issues. Having a clearer user designed portion for instructors and graders to easily access understandable graphs, stats, and updates on student progress would benefit the Submitty system greatly by having a better user experience on the instructor and graders end.",
          "difficulty": null,
          "id": "proj_submitty_2024_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/NZIEKNQo/",
          "proposal_id": null,
          "short_description": "After taking time to discuss the Submitty system with a professor that uses it daily as a grading tool for their classes, a place for improvement...",
          "slug": "enhancing-user-interface-for-viewing-grades",
          "status": "completed",
          "student_name": "Sophia Oliinik",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Enhancing User Interface for Viewing Grades"
        },
        {
          "code_url": "https://submitty.org/developer/google_summer_of_code/2024_Sahil_Suman",
          "description": "Submitty's autograding is complex for instructors. This project will revamp the Notebook Builder interface to be more user-friendly. Instructors will be able to create autograding configurations more easily through as new interface, improved documentation, and tutorials. The project will also add features to support compiled languages and complex grading.",
          "difficulty": "advanced",
          "id": "proj_submitty_2024_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/nDmGrbzX/",
          "proposal_id": null,
          "short_description": "Submitty's autograding is complex for instructors. This project will revamp the Notebook Builder interface to be more user-friendly. Instructors will...",
          "slug": "notebook-builder-ui-to-streamline-instructor-configuration-of-automated-grading",
          "status": "completed",
          "student_name": "Sahil Suman",
          "student_profile": null,
          "tags": [
            "ml",
            "ui"
          ],
          "title": "Notebook Builder: UI To Streamline Instructor Configuration of Automated Grading"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2024/organizations/submitty/"
    },
    "year_2025": null
  },
  "first_time": false,
  "contact": {
    "email": "submitty-admin@googlegroups.com",
    "guide_url": null,
    "ideas_url": null,
    "irc_channel": "https://submitty.zulipchat.com/join/7keujybzs4ismpedptpqsqpv/",
    "mailing_list": "https://submitty.org/index/contact"
  },
  "social": {
    "blog": null,
    "discord": null,
    "facebook": null,
    "github": null,
    "gitlab": null,
    "instagram": null,
    "linkedin": null,
    "mastodon": null,
    "medium": null,
    "reddit": null,
    "slack": null,
    "stackoverflow": null,
    "twitch": null,
    "twitter": "https://twitter.com/submitty",
    "youtube": null
  },
  "meta": {
    "version": 1,
    "generated_at": "2026-01-25T15:28:54.301Z"
  }
}