{
  "id": "692251e853dd9d7326d33ec5",
  "slug": "systers-an-anita-borg-institute-community",
  "name": "Systers, an Anita Borg Institute community",
  "category": "Other",
  "description": "Helping women find their potential in code.",
  "image_url": "https://lh3.googleusercontent.com/tFOFnRaUTNGblP4QyLG6X0IlRCU6PNrYL6VgZbGuLVX2MMJc0tSM-LHaGEGfhJ8_eQKoq7Zu4oOzBQWBW8brmLP9uji0fg",
  "img_r2_url": "https://pub-268c3a1efc8b4f8a99115507a760ca14.r2.dev/systers-an-anita-borg-institute-community.webp",
  "logo_r2_url": null,
  "url": "http://systers.org",
  "active_years": [
    2016,
    2017
  ],
  "first_year": 2016,
  "last_year": 2017,
  "is_currently_active": false,
  "technologies": [
    "python",
    "mysql",
    "android",
    "ruby on rails",
    "ios",
    "javascript",
    "java"
  ],
  "topics": [
    "women in tech",
    "systers",
    "women in open source",
    "web",
    "games",
    "mobile",
    "peace corps"
  ],
  "total_projects": 30,
  "stats": {
    "avg_projects_per_appeared_year": 15,
    "projects_by_year": {
      "year_2016": 19,
      "year_2017": 11,
      "year_2018": null,
      "year_2019": null,
      "year_2020": null,
      "year_2021": null,
      "year_2022": null,
      "year_2023": null,
      "year_2024": null,
      "year_2025": null
    },
    "students_by_year": {
      "year_2016": 19,
      "year_2017": 11,
      "year_2018": null,
      "year_2019": null,
      "year_2020": null,
      "year_2021": null,
      "year_2022": null,
      "year_2023": null,
      "year_2024": null,
      "year_2025": null
    },
    "total_students": 29
  },
  "years": {
    "year_2016": {
      "num_projects": 19,
      "projects": [
        {
          "code_url": "http://systers-opensource.blogspot.in/2016/08/divya-upadhyay-gis-crowd-final-status.html",
          "description": "<p>The Peace Corps have taken up the task of working with PCVs to educate the differently-abled students of Guyana who are unable to hear. The volunteers identify such students in need and shall upload their location along with other necessary details on the Guyana Crowdsourcing portal. I worked on this project last year to build the portal using Ushahidi. For implementing GIS, integration of Google Glass with the Ushahidi Portal is desired. This shall serve to post images and videos of differently abled students on the map. Closed Captioning to aid communication using Glass shall also be implemented as a Glassware.</p>\n",
          "difficulty": null,
          "id": "proj_systers-an-anita-bor_2016_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/6629263499329536/",
          "proposal_id": null,
          "short_description": "The Peace Corps have taken up the task of working with PCVs to educate the differently-abled students of Guyana who are unable to hear. The...",
          "slug": "crowdsourcing-for-the-guyana-deaf-community-google-glass-integration",
          "status": "completed",
          "student_name": "divyaupadhyay",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Crowdsourcing for the Guyana Deaf Community - Google Glass Integration"
        },
        {
          "code_url": "http://gsoc16experience.blogspot.in/",
          "description": "<p>PCSA (Peace Corps Safety App) is a web application developed to help the volunteers if they become victims of sexual harassment.It also ensures safety by sending messages to fellow volunteers when in trouble. Usually, the victims are uncomfortable  to report the crime or unwilling to get support. This app ensures that the victim can be sure of getting all the help he/she needs.\nThe sexually assaulted volunteer can get information of Peace Corps reporting and safety procedures and also contact Peace Corps for help.</p>\n",
          "difficulty": null,
          "id": "proj_systers-an-anita-bor_2016_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5675574601187328/",
          "proposal_id": null,
          "short_description": "PCSA (Peace Corps Safety App) is a web application developed to help the volunteers if they become victims of sexual harassment.It also ensures...",
          "slug": "pcsa-web-app-firstaide",
          "status": "completed",
          "student_name": "Akanksha Bodhankar",
          "student_profile": null,
          "tags": [
            "web",
            "ai"
          ],
          "title": "PCSA Web-App (FirstAide)"
        },
        {
          "code_url": "http://systers.org/systers-dev/doku.php/chamika",
          "description": "<p>Peace Corps Safety App (PCSA) helps the volunteers to get information about the Peace Corps’ safety and security procedures in a button click. It also has the functionality in reporting and sending messages when the PCV’s (Peace Corps Volunteers) are in trouble. The purpose of my proposal is to suggest the iOS version for the Peace Corps Safety App. The scope covers the initial development of the iOS version to reflect the already developed Android app and the remaining development which is suggested by the UI and general content update by the Peace Corps.</p>\n",
          "difficulty": null,
          "id": "proj_systers-an-anita-bor_2016_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5700176710729728/",
          "proposal_id": null,
          "short_description": "Peace Corps Safety App (PCSA) helps the volunteers to get information about the Peace Corps’ safety and security procedures in a button click. It...",
          "slug": "peace-corps-safety-app-ios",
          "status": "completed",
          "student_name": "Chamika",
          "student_profile": null,
          "tags": [
            "android",
            "ios",
            "ai",
            "ui"
          ],
          "title": "Peace Corps Safety App - iOS"
        },
        {
          "code_url": "https://drive.google.com/drive/folders/0B1qLSXsGqNTPdkJFYnUwcy1pb3c",
          "description": "<p>The project aims at creating a Java based testing framework for PCSA(Peace Corps Safety App) Web application project undertaken by Systers on the Ideas Page for GSoC 2016. The goal is to create efficient, reusable, executable and maintainable test scripts for regression, functional and integration testing. The framework will be configured on a continuous integration tool and will be tested and configured on a cloud service for cross browser and platform compatibility. It will be implemented in Java using Selenium WebDriver and Maven.</p>\n",
          "difficulty": null,
          "id": "proj_systers-an-anita-bor_2016_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5723533548191744/",
          "proposal_id": null,
          "short_description": "The project aims at creating a Java based testing framework for PCSA(Peace Corps Safety App) Web application project undertaken by Systers on the...",
          "slug": "testing-automation-for-peace-corps-safety-web-applicationpcsa-web",
          "status": "completed",
          "student_name": "Anjali",
          "student_profile": null,
          "tags": [
            "java",
            "web",
            "ai",
            "cloud"
          ],
          "title": "Testing Automation for Peace Corps Safety Web Application(PCSA Web)"
        },
        {
          "code_url": "https://gist.github.com/teo029/ab3ab8de6443e83ced97731bd2499fd3",
          "description": "<p>Malaria Prevention is a Swift application that will aid the Peace Corps volunteers in Africa defend against the Malaria disease. I am responsible with developing the second version of the application and launching it on the App Store.</p>\n",
          "difficulty": null,
          "id": "proj_systers-an-anita-bor_2016_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5509901874888704/",
          "proposal_id": null,
          "short_description": "Malaria Prevention is a Swift application that will aid the Peace Corps volunteers in Africa defend against the Malaria disease. I am responsible...",
          "slug": "malaria-ios-malaria-prevention-ios-app",
          "status": "completed",
          "student_name": "Teodor Ciuraru",
          "student_profile": null,
          "tags": [
            "ios",
            "ai"
          ],
          "title": "[Malaria - iOS] Malaria Prevention iOS App"
        },
        {
          "code_url": "https://gist.github.com/izacristina/3d2216473c02c2469d15c47e633ceca6",
          "description": "<p>Aiming at the goal of PCSA, which is to help victims of sexual assault, I propose through this, add a feature to the application, which enables a collaborative mapping of areas that offer risk to the volunteers.</p>\n",
          "difficulty": null,
          "id": "proj_systers-an-anita-bor_2016_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/6136682290085888/",
          "proposal_id": null,
          "short_description": "Aiming at the goal of PCSA, which is to help victims of sexual assault, I propose through this, add a feature to the application, which enables a...",
          "slug": "pcsa-android-collaborative-map-of-risk-areas",
          "status": "completed",
          "student_name": "Izabela Cardoso",
          "student_profile": null,
          "tags": [
            "android",
            "ai"
          ],
          "title": "[PCSA-Android] Collaborative Map of Risk Areas"
        },
        {
          "code_url": "https://github.com/daisyab/pchub/commits/new",
          "description": "<p>Systers has a lot of social impact projects it undertakes.  It is important that these projects are tested before released to the public.  This project seeks to create reusable selenium webdriver scripts to test one of the Systers web app projects for regressions.  The project also provides the ability to test the web app across multiple browsers, configuring a continuous integration tool and testing the web app in conjunction to its database.</p>\n",
          "difficulty": null,
          "id": "proj_systers-an-anita-bor_2016_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/4969441443971072/",
          "proposal_id": null,
          "short_description": "Systers has a lot of social impact projects it undertakes.  It is important that these projects are tested before released to the public.  This...",
          "slug": "testing-automation",
          "status": "completed",
          "student_name": "Daisy",
          "student_profile": null,
          "tags": [
            "web",
            "database"
          ],
          "title": "Testing Automation"
        },
        {
          "code_url": "https://docs.google.com/document/d/1ryU5TJ-NKbSj2YWEaqH35AhlFcDnnY1siQF4JC7kgXE/edit?usp=sharing",
          "description": "<p>Systers’ Volunteer Management System  currently uses function based views. It repeats certain patterns again and again, and is mostly redundant. Function based views are deprecated after Python version 1.3.  Class Based generic views helps to streamline common use cases, saving development time and effort.\nConsidering various advantages of shifting to CBV,  I propose this migration for all the apps in VMS.</p>\n<p>The project also aims at implementing a django-haystack powered Search functionality to VMS to search volunteers by region/city, job/task etc. Haystack helps to write search code once and choose the search engine we want it to run on, and is particularly modular.</p>\n",
          "difficulty": null,
          "id": "proj_systers-an-anita-bor_2016_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5000811885101056/",
          "proposal_id": null,
          "short_description": "Systers’ Volunteer Management System  currently uses function based views. It repeats certain patterns again and again, and is mostly redundant....",
          "slug": "migrating-volunteer-management-system-to-class-based-views-and-search-engine-implementation",
          "status": "completed",
          "student_name": "Amrutha S",
          "student_profile": null,
          "tags": [
            "python",
            "ml",
            "ai"
          ],
          "title": "Migrating Volunteer Management System to Class based views and Search Engine Implementation"
        },
        {
          "code_url": "https://docs.google.com/document/d/1tDD1Y6XT8k5LEmEOCDb9p8_i-Zt-vky7ZE_ju-InVis/edit?usp=sharing",
          "description": "<p>The goal of this project is to create a female empowerment app which spreads awareness among  the preadolescent girls on sensitive issues like reproductive health, teenage pregnancy, sexually transmitted infections and low self esteem. It is and educational app which will help the young girls in taking decisions when such situations arise in life. To address this issue, PowerUp uses Social and Emotional Learning (SEL) to empower middle school girls to take ownership of their health and sexual activity. The proposal is to create a mobile application that will incorporate quality and relevant information surrounding self-esteem and reproductive health, and will offer interactive activities to help concertize corresponding concepts through a choose-your-own-adventure game that puts preadolescent girls in the driver’s seat, making their own decisions to learn about reproductive health and self-esteem.</p>\n",
          "difficulty": null,
          "id": "proj_systers-an-anita-bor_2016_009",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5082861866582016/",
          "proposal_id": null,
          "short_description": "The goal of this project is to create a female empowerment app which spreads awareness among  the preadolescent girls on sensitive issues like...",
          "slug": "powerup-proposal",
          "status": "completed",
          "student_name": "Aanchal Somani",
          "student_profile": null,
          "tags": [
            "mobile"
          ],
          "title": "PowerUp Proposal"
        },
        {
          "code_url": "https://everybodyneedsablog.wordpress.com/2016/08/20/systers-portal-meetup-application/",
          "description": "<p>After Meetup Everywhere was discontinued, Systers needed a Meetup app within the Systers Portal. This project was started last year but several features are yet to be added to it. This project aims at adding some extra features and completing the Meetup app.</p>\n",
          "difficulty": null,
          "id": "proj_systers-an-anita-bor_2016_010",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5233399933435904/",
          "proposal_id": null,
          "short_description": "After Meetup Everywhere was discontinued, Systers needed a Meetup app within the Systers Portal. This project was started last year but several...",
          "slug": "portal-completion-of-systers-portal-meetup-app",
          "status": "completed",
          "student_name": "payal97",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "[portal] Completion of Systers Portal Meetup App"
        },
        {
          "code_url": "https://docs.google.com/document/d/1QXlycV24xGfdp1PV735F09dDEDsXUK-ALtefQp7YFG4/edit?usp=sharing",
          "description": "<p>I would like to work on Automated Unit Testing and build off the current base that was developed last year, partly by me.  The goal is to create a comprehensive suite of tests for Systers projects such as Photo Language Translation, expanding and improving the code base that  is currently there and developing new tests for new features added to the program that I would be testing along with more tests for previously existing features.  I would like to try to continue integrating the tests  with Travis CI and Sauce Connect or something similar and also create more documentation to make it easier for other developers to be able to start contributing to the project!</p>\n",
          "difficulty": null,
          "id": "proj_systers-an-anita-bor_2016_011",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/6195637427109888/",
          "proposal_id": null,
          "short_description": "I would like to work on Automated Unit Testing and build off the current base that was developed last year, partly by me.  The goal is to create a...",
          "slug": "automated-unit-testing",
          "status": "completed",
          "student_name": "maditparis",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "Automated Unit Testing"
        },
        {
          "code_url": "http://yatna1.blogspot.com/2016/08/i-worked-on-malaria-prevention.html",
          "description": "<p>The aim behind Malaria-app-android is to help PeaceCorps volunteers sustain protective practices against malaria. Currently the application serves the function of a medication reminder with a trip planner and Information Hub.<br>\nThe current application does not have a mechanism to push user's data to web back-end. Hence, I plan to create a mechanism to push and store user's data from all devices on a single database. I also plan to game-ify the application by adding a point system, a reward system, a sharing feature and 2 mini-games. Last, I intend to add a 'medication check' and 'refill' feature.</p>\n",
          "difficulty": null,
          "id": "proj_systers-an-anita-bor_2016_012",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/6258539639078912/",
          "proposal_id": null,
          "short_description": "The aim behind Malaria-app-android is to help PeaceCorps volunteers sustain protective practices against malaria. Currently the application serves...",
          "slug": "malaria-prevention-application-proposal-android",
          "status": "completed",
          "student_name": "yatna",
          "student_profile": null,
          "tags": [
            "android",
            "web",
            "ai",
            "database"
          ],
          "title": "Malaria Prevention Application Proposal (Android)"
        },
        {
          "code_url": "https://github.com/smarshy/vms/wiki/GSOC-16--Work-:-AUT-VMS-%5Bvatsala%5D",
          "description": "<p>Systers has many projects wherein it is crucial to ensure that applications function as expected. Volunteer Management System is one such project, which is currently in a state of active development. However there is no testing system in place to monitor the changes being proposed to the project.</p>\n<p>The existing tests are housed in a different repository, brittle in nature, extremely sensitive to changes in the UI and take up a lot of time to execute. In addition to these, the coverage is low and the tests are limited in nature to unit and functional.</p>\n<p>My plan for the summer is to add continuous integration for the project, migrate the entire test framework to follow a more scalable and maintainable design pattern, reduce test time as well as duplication and to add a series of python scripts to increase test coverage and variety for different scenarios applicable. Also, I hope to setup Cross Browser Testing via Open Sauce/Browserstack.</p>\n",
          "difficulty": null,
          "id": "proj_systers-an-anita-bor_2016_013",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/4748188619636736/",
          "proposal_id": null,
          "short_description": "Systers has many projects wherein it is crucial to ensure that applications function as expected. Volunteer Management System is one such project,...",
          "slug": "automated-testing-vms",
          "status": "completed",
          "student_name": "smarshy",
          "student_profile": null,
          "tags": [
            "python",
            "ios",
            "ai",
            "ui"
          ],
          "title": "Automated Testing - VMS"
        },
        {
          "code_url": "http://rupinderwadali.github.io/Final/",
          "description": "<p>Photo Language Translation project is helpful for the Peace Corps Volunteers who are working  in different countries and sites which are developing local languages. The photos uploading, Chuukese and English translation are already done and the main requirements of the project are the offline usage of “application”, categorization of the article, add geolocation using OSM, refactoring code and removing the bugs of the existing code.</p>\n",
          "difficulty": null,
          "id": "proj_systers-an-anita-bor_2016_014",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/4754493900062720/",
          "proposal_id": null,
          "short_description": "Photo Language Translation project is helpful for the Peace Corps Volunteers who are working  in different countries and sites which are developing...",
          "slug": "photo-language-translator-plt",
          "status": "completed",
          "student_name": "Rupinderjit Kaur",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Photo Language Translator (PLT)"
        },
        {
          "code_url": "https://github.com/systers/powerup-iOS/commits/develop?author=sanyajain",
          "description": "<p>An educational mobile game app that will allow young girls to learn about reproductive health and self-esteem by navigating the life of their Avatar in a virtual world! The iOS app would cover a variety of features including mini-games and choose-your-own-adventure scenarios that would teach SEL (Social Emotional Learning), conflict resolution, health skills in a fun, interactive way.</p>\n",
          "difficulty": null,
          "id": "proj_systers-an-anita-bor_2016_015",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/6490536055668736/",
          "proposal_id": null,
          "short_description": "An educational mobile game app that will allow young girls to learn about reproductive health and self-esteem by navigating the life of their Avatar...",
          "slug": "powerup-ios",
          "status": "completed",
          "student_name": "sanya",
          "student_profile": null,
          "tags": [
            "ios",
            "mobile"
          ],
          "title": "PowerUp (iOS)"
        },
        {
          "code_url": "https://docs.google.com/document/d/1fzjT84IN6R9FhJP5kwXof2rHXpBzGNJonSxStJDASJ8/edit?usp=sharing",
          "description": "<p>This project is about extending the automated test suite for the Mobile App Control Center(MACC) which is one of the many projects undertaken by Systers, an Anita Borg Institute Community. The objective of this project is to create, maintain, and execute automated tests for this web software applications on the Systers platform. The project's main goal is to have reusable and automated scripts for regression testing.</p>\n",
          "difficulty": null,
          "id": "proj_systers-an-anita-bor_2016_016",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/6533553911234560/",
          "proposal_id": null,
          "short_description": "This project is about extending the automated test suite for the Mobile App Control Center(MACC) which is one of the many projects undertaken by...",
          "slug": "test-automation-for-mobile-app-control-center",
          "status": "completed",
          "student_name": "Thyr Nat",
          "student_profile": null,
          "tags": [
            "web",
            "mobile",
            "ai",
            "ui"
          ],
          "title": "Test Automation for Mobile App Control Center"
        },
        {
          "code_url": "http://systers.org/systers-dev/doku.php/medha_chakravarthula",
          "description": "<p>A server-side support platform for Peace Corps' mobile projects</p>\n",
          "difficulty": null,
          "id": "proj_systers-an-anita-bor_2016_017",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/6095102040604672/",
          "proposal_id": null,
          "short_description": "A server-side support platform for Peace Corps' mobile projects",
          "slug": "mobile-app-control-center",
          "status": "completed",
          "student_name": "Medha Chakravarthula",
          "student_profile": null,
          "tags": [
            "mobile"
          ],
          "title": "Mobile App Control Center"
        },
        {
          "code_url": "https://github.com/systers/PCSA-Android/commits/develop?author=rohands",
          "description": "<p>Sexual assault is a major concern in today's world. PCSA is a mobile application that aims to serve as a safety resource to the PeaceCorp Volunteers (PCVs). The sole purpose of the app is to guide the volunteers to protect/defend themselves from sexual assault.</p>\n",
          "difficulty": null,
          "id": "proj_systers-an-anita-bor_2016_018",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5927586102247424/",
          "proposal_id": null,
          "short_description": "Sexual assault is a major concern in today's world. PCSA is a mobile application that aims to serve as a safety resource to the PeaceCorp Volunteers...",
          "slug": "peacecorps-safety-app-android",
          "status": "completed",
          "student_name": "Rohan Doddaiah",
          "student_profile": null,
          "tags": [
            "android",
            "mobile",
            "ai",
            "ui"
          ],
          "title": "PeaceCorps Safety App (Android)"
        },
        {
          "code_url": "https://github.com/systers/postorius/pull/4/commits",
          "description": "<p>Currently,a customized version of Mailman2 is used by Systers. My main goal will be porting Systers customized features to Mailman 3.The features that are ported include Essays and Stats for admins like: - Number of subscribers/unsubscribes: - Number of total unique subject lines - Number of subscribers that posted.</p>\n",
          "difficulty": null,
          "id": "proj_systers-an-anita-bor_2016_019",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5163212114755584/",
          "proposal_id": null,
          "short_description": "Currently,a customized version of Mailman2 is used by Systers. My main goal will be porting Systers customized features to Mailman 3.The features...",
          "slug": "systers-features-for-mailman-3",
          "status": "completed",
          "student_name": "Aditi Gupta",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Systers Features for Mailman 3"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2016/organizations/5689792285114368/"
    },
    "year_2017": {
      "num_projects": 11,
      "projects": [
        {
          "code_url": "https://systers-opensource.blogspot.com/2017/08/kim-huynh-powerup-final-report-gsoc-2017.html",
          "description": "<p>A sleek, minimalist, and modern update for all the graphics in the game to bring it up to speed with other mobile games in the app store.</p>\n",
          "difficulty": null,
          "id": "proj_systers-an-anita-bor_2017_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6427479493312512/",
          "proposal_id": null,
          "short_description": "A sleek, minimalist, and modern update for all the graphics in the game to bring it up to speed with other mobile games in the app store.",
          "slug": "powerup-uiux-graphics-update",
          "status": "completed",
          "student_name": "Kim Huynh",
          "student_profile": null,
          "tags": [
            "mobile",
            "ui",
            "ux"
          ],
          "title": "PowerUp UI/UX & Graphics Update"
        },
        {
          "code_url": "https://drive.google.com/drive/folders/0Bz3Qq-vklUUZNFAzZ0ZwTlh5MFk",
          "description": "<p>The project consists in porting Systers customized features to Mailman3. The main goal of the project has been to port :</p>\n<ul>\n<li>Essay Feature</li>\n<li>Stats for Admins<ul>\n<li>Number of subscribers/unsubscribers.</li>\n<li>Number of total unique subject lines.</li>\n<li>Number of subscribers that posted.</li>\n</ul>\n</li>\n</ul>\n<p>New features to be implemented in Systers Mailman3 :</p>\n<ul>\n<li>Promoting good Posts</li>\n<li>Keyword Summary</li>\n<li>Top 10 threads of all-time</li>\n<li>Crowd-sourced Thread metadata</li>\n<li>List Monthly health</li>\n<li>Mentioned in Thread References</li>\n<li>List Summary Page</li>\n</ul>\n",
          "difficulty": null,
          "id": "proj_systers-an-anita-bor_2017_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6706691290693632/",
          "proposal_id": null,
          "short_description": "The project consists in porting Systers customized features to Mailman3. The main goal of the project has been to port :\n\nEssay Feature\nStats for...",
          "slug": "systers-features-for-mailman-3",
          "status": "completed",
          "student_name": "Aditi Gupta",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Systers Features for Mailman 3"
        },
        {
          "code_url": "https://github.com/systers/volunteers-iOS/compare/development@%7B05-31-17%7D...development@%7B08-29-17%7D",
          "description": "<p>Proposal to develop the Hoppers iOS app, a companion to the Conference App. The Hoppers Apps will allow conference volunteers to view and manage their assigned shifts. It will also allow volunteers to trade shifts with each other. This proposal outlines the features to be developed to create an MVP and is designed with the Grace Hopper Celebration conference in mind.</p>\n",
          "difficulty": null,
          "id": "proj_systers-an-anita-bor_2017_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5508656065937408/",
          "proposal_id": null,
          "short_description": "Proposal to develop the Hoppers iOS app, a companion to the Conference App. The Hoppers Apps will allow conference volunteers to view and manage...",
          "slug": "hoppers-app-ios",
          "status": "completed",
          "student_name": "Connie Nguyen",
          "student_profile": null,
          "tags": [
            "ios"
          ],
          "title": "Hoppers App - iOS"
        },
        {
          "code_url": "https://github.com/GunpreetAhuja/macc/wiki/Gunpreet-Ahuja---GSoC-2017-Contribution",
          "description": "<p>Mobile Application Control Center (MACC), Peace Corps GSoC project, is a web application helpful for Peace Corps Volunteers to handle data for Malaria and FirstAide applications. It uses Python’s framework Django to handle the backend while bootstrap aides the frontend mechanism. The web application has the basic build up that includes interfaces for posts and contact information for both the aforesaid applications. The signup, login, post creating and editing pages have been given a decent makeup to start with. However, the code really needs a brush up as it is built using Django 1.6.5, having a somewhat messy structure that needs to be optimized and its user interface is lacking interesting features. One of the major motives of my GSoC would be to improve the existing code, to complete the things that are almost complete and to bring a sound and cogent change in the User Interface. Also, the new features I am adding aren't completely new, they are commonly used features only. By the end of GSoC, I want MACC to be production ready and available to use for a wider majority of people who can rely on its generic view to aide their own applications control.</p>\n",
          "difficulty": null,
          "id": "proj_systers-an-anita-bor_2017_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/4989588598685696/",
          "proposal_id": null,
          "short_description": "Mobile Application Control Center (MACC), Peace Corps GSoC project, is a web application helpful for Peace Corps Volunteers to handle data for...",
          "slug": "macc-user-interface-brushup-and-feature-enhancement",
          "status": "completed",
          "student_name": "Gunpreet Ahuja",
          "student_profile": null,
          "tags": [
            "python",
            "web",
            "mobile",
            "ai",
            "ui"
          ],
          "title": "MACC: User Interface Brushup and Feature Enhancement"
        },
        {
          "code_url": "https://github.com/systers/macc/commits/develop?author=yatna",
          "description": "<p>The purpose behind MACC is to provide a web application to manage content and provide APIs to manage data for the First-Aide Mobile App and the Malaria Prevention Mobile app. The current application suffers from various UI issues and incomplete features. I intent to complete all the existing features and recreate the UI for the entire application. The API end points needs to be made functional as well. I propose to add social media login/signup feature as well along with modifying Malaria and  FirstAide Post's structure by adding apt fields to them . I also intend to create a feature to segregate  basic user data from malaria prevention app into MACC and integrated the project with Sphinx and Travis CI .</p>\n",
          "difficulty": null,
          "id": "proj_systers-an-anita-bor_2017_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5097417510748160/",
          "proposal_id": null,
          "short_description": "The purpose behind MACC is to provide a web application to manage content and provide APIs to manage data for the First-Aide Mobile App and the...",
          "slug": "mobile-application-control-center-macc",
          "status": "completed",
          "student_name": "Yatna Verma",
          "student_profile": null,
          "tags": [
            "web",
            "mobile",
            "api",
            "ai",
            "ui"
          ],
          "title": "Mobile Application Control Center (MACC)"
        },
        {
          "code_url": "https://github.com/systers/powerup-android/pulls?page=1&q=is%3Apr+created%3A%3E%3D2017-05-04++author%3Acodingblazer&utf8=%E2%9C%93",
          "description": "<p>The PowerUp-Android is an Android application for empowering preadolescent girls between the ages of 12 to 14. The game is based on Social &amp; Emotional Learning model to help girls to learn conflict resolution, negotiation &amp; other social skills needed to build their confidence against tough situations. \nThe user creates a character and tours through different scenarios each dealing with the different subject of importance. These scenarios contain mini-games which are launched between the scenarios to keep user the engaged.</p>\n",
          "difficulty": null,
          "id": "proj_systers-an-anita-bor_2017_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6192013011582976/",
          "proposal_id": null,
          "short_description": "The PowerUp-Android is an Android application for empowering preadolescent girls between the ages of 12 to 14. The game is based on Social &amp;...",
          "slug": "powerup-android",
          "status": "completed",
          "student_name": "Sachin Aggarwal",
          "student_profile": null,
          "tags": [
            "android",
            "ios",
            "ai",
            "ui"
          ],
          "title": "PowerUp-Android"
        },
        {
          "code_url": "http://systers-opensource.blogspot.in/2017/08/pc-prepkit-gsoc-2017-final-report.html",
          "description": "<p>PC Prep Kit is a web application aimed at helping the peace corps volunteers with awareness about Malaria and its prevention techniques. The application uses various interactive activities to make the process effective.  The App focuses on causes, prevention and medication of Malaria.</p>\n",
          "difficulty": null,
          "id": "proj_systers-an-anita-bor_2017_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6488604930998272/",
          "proposal_id": null,
          "short_description": "PC Prep Kit is a web application aimed at helping the peace corps volunteers with awareness about Malaria and its prevention techniques. The...",
          "slug": "pc-prep-kit",
          "status": "completed",
          "student_name": "Shreyans Shrimal",
          "student_profile": null,
          "tags": [
            "web",
            "ai"
          ],
          "title": "PC-Prep-Kit"
        },
        {
          "code_url": "https://github.com/systers/volunteers-android/commits/develop?author=pandilladivya",
          "description": "<p>Hopper App is a mobile application which helps manage the Hoppers at the Grace Hopper Celebration. Hoppers are <strong>volunteers</strong>. These volunteers work multiple shifts, up to eight hours, spread over the three days of the conference. They must commit to their assigned shifts, attend an orientation and be in the area during the conference week.</p>\n",
          "difficulty": null,
          "id": "proj_systers-an-anita-bor_2017_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6532904297431040/",
          "proposal_id": null,
          "short_description": "Hopper App is a mobile application which helps manage the Hoppers at the Grace Hopper Celebration. Hoppers are volunteers. These volunteers work...",
          "slug": "hoppers-app-android",
          "status": "completed",
          "student_name": "Divya Pandilla",
          "student_profile": null,
          "tags": [
            "android",
            "mobile"
          ],
          "title": "Hoppers-app Android"
        },
        {
          "code_url": "https://github.com/systers/language-translation/commits?author=adityathiru",
          "description": "<ul>\n<li>Working on the Photo Language Translation Project with Systers for the UN Peace Corps volunteers.</li>\n<li>You may contact me either via Email : <code>aditya.thiruvengadam@gmail.com</code> / <code>T.Aditya@iiitb.org</code></li>\n</ul>\n",
          "difficulty": null,
          "id": "proj_systers-an-anita-bor_2017_009",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6550460513124352/",
          "proposal_id": null,
          "short_description": "Working on the Photo Language Translation Project with Systers for the UN Peace Corps volunteers.\nYou may contact me either via Email :...",
          "slug": "automated-testing-photo-language-translation",
          "status": "completed",
          "student_name": "Aditya T",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Automated Testing - Photo Language Translation"
        },
        {
          "code_url": "https://gist.github.com/casd82/b1f7710319161823f4f16ce038c720e0",
          "description": "<p>PowerUp is an educational mobile for adolescent girls. The game is based on Social &amp; Emotional Learning model to empower young girls to take charge of their reproductive health and self esteem.</p>\n<p>I will be working on PowerUp-iOS during GSoC 2017, and I plan to achieve the following tasks.</p>\n<h3>Code Refactoring</h3>\n<p>I will cut some redundant classes and view controllers as well as redesign the class structure and Storyboard segues. Future developers would benefit from the refactored code significantly due to the enhanced readability and flexibility.</p>\n<h3>Mini Games</h3>\n<p>Mini game is a nice way to make a choose-your-own adventure game more interactive. I will implement three mini games during GSoC 2017.</p>\n<ol>\n<li>Minesweeper Game: This is a game of pure chance, simulating the success rate of various contraceptive methods.</li>\n<li>Sink to Swim: This is a \"myth buster\" game to clear the myths and false information which public media and internet feed to young girls.</li>\n<li>Vocab Matching: This game is designed to teach players various terms related to contraceptives and body growth in puberty.</li>\n</ol>\n<h3>UI Update</h3>\n<p>I will be working along with a UI designer, so I will be applying the newly designed UI assets to the project.</p>\n",
          "difficulty": null,
          "id": "proj_systers-an-anita-bor_2017_010",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5856735650643968/",
          "proposal_id": null,
          "short_description": "PowerUp is an educational mobile for adolescent girls. The game is based on Social &amp; Emotional Learning model to empower young girls to take...",
          "slug": "powerup-ios",
          "status": "completed",
          "student_name": "Yu Chao (casd82)",
          "student_profile": null,
          "tags": [
            "ios",
            "mobile",
            "ui"
          ],
          "title": "PowerUp-iOS"
        },
        {
          "code_url": "http://systers-opensource.blogspot.in/2017/08/pc-prepkit-gsoc-2017-final-report-s-j.html",
          "description": "<p>This project implements a web application that will spread awareness on Malaria by completing fun activities and games.</p>\n",
          "difficulty": null,
          "id": "proj_systers-an-anita-bor_2017_011",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5900744704131072/",
          "proposal_id": null,
          "short_description": "This project implements a web application that will spread awareness on Malaria by completing fun activities and games.",
          "slug": "pc-prep-kit",
          "status": "completed",
          "student_name": "S J Rajath Krishna",
          "student_profile": null,
          "tags": [
            "web"
          ],
          "title": "PC Prep Kit"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2017/organizations/5429781541683200/"
    },
    "year_2018": null,
    "year_2019": null,
    "year_2020": null,
    "year_2021": null,
    "year_2022": null,
    "year_2023": null,
    "year_2024": null,
    "year_2025": null
  },
  "first_time": false,
  "contact": {
    "email": "gsoc-admins@anitaborg.org",
    "guide_url": null,
    "ideas_url": null,
    "irc_channel": "http://systers.io/slack-systers-opensource/",
    "mailing_list": "http://systers.org/mailman/listinfo/systers-dev"
  },
  "social": {
    "blog": "http://systers-opensource.blogspot.com/",
    "discord": null,
    "facebook": null,
    "github": null,
    "gitlab": null,
    "instagram": null,
    "linkedin": null,
    "mastodon": null,
    "medium": null,
    "reddit": null,
    "slack": null,
    "stackoverflow": null,
    "twitch": null,
    "twitter": "https://twitter.com/systers_org",
    "youtube": null
  },
  "meta": {
    "version": 1,
    "generated_at": "2026-01-25T15:28:54.319Z"
  }
}