{
  "id": "692251ea53dd9d7326d33edf",
  "slug": "the-tor-project",
  "name": "The Tor Project",
  "category": "Web",
  "description": "Defend yourself against tracking and surveillance.",
  "image_url": "https://summerofcode.withgoogle.com/media/org/the-tor-project/1w40vc9lqddvbfoa-360.png",
  "img_r2_url": "https://pub-268c3a1efc8b4f8a99115507a760ca14.r2.dev/the-tor-project.webp",
  "logo_r2_url": null,
  "url": "https://www.torproject.org/",
  "active_years": [
    2016,
    2017,
    2022,
    2023,
    2025
  ],
  "first_year": 2016,
  "last_year": 2025,
  "is_currently_active": true,
  "technologies": [
    "c",
    "python",
    "javascript",
    "golang",
    "browser extensions",
    "c++",
    "rust",
    "web"
  ],
  "topics": [
    "security",
    "privacy",
    "research",
    "anonymity",
    "anti-censorship",
    "counter-censorship",
    "free-speech",
    "Human Rights",
    "Surveillance"
  ],
  "total_projects": 19,
  "stats": {
    "avg_projects_per_appeared_year": 3.8,
    "projects_by_year": {
      "year_2016": 5,
      "year_2017": 4,
      "year_2018": null,
      "year_2019": null,
      "year_2020": null,
      "year_2021": null,
      "year_2022": 3,
      "year_2023": 4,
      "year_2024": null,
      "year_2025": 3
    },
    "students_by_year": {
      "year_2016": 5,
      "year_2017": 4,
      "year_2018": null,
      "year_2019": null,
      "year_2020": null,
      "year_2021": null,
      "year_2022": 3,
      "year_2023": 4,
      "year_2024": null,
      "year_2025": 3
    },
    "total_students": 19
  },
  "years": {
    "year_2016": {
      "num_projects": 5,
      "projects": [
        {
          "code_url": "https://docs.google.com/document/d/1oZdgrF0ovcq61QuH7vVqNUv7SNQd7fg3GaGW8HnpEWE/edit",
          "description": "<p>This project consists of two parts: a CONIKS server for key verification and a CONIKS client which integrates with the Tor Messenger client. The functionalities include key registrations, key change, lookups and monitoring.</p>\n",
          "difficulty": null,
          "id": "proj_the-tor-project_2016_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5478985358114816/",
          "proposal_id": null,
          "short_description": "This project consists of two parts: a CONIKS server for key verification and a CONIKS client which integrates with the Tor Messenger client. The...",
          "slug": "coniks-for-tor-messenger",
          "status": "completed",
          "student_name": "Vu Huy",
          "student_profile": null,
          "tags": [],
          "title": "CONIKS for Tor Messenger"
        },
        {
          "code_url": "https://zma0.dreamwidth.org/306.html",
          "description": "<p>Ahmia is a working search engine that indexes, searches, and catalogs content published on Tor Hidden Services. Furthermore, it is an environment to share meaningful insights, statistics and news about the Tor network itself. In this context, there is a lot of work to do.</p>\n<p>During GSoC, I plan to work on several aspects of this search engine from fixing bugs to improving search results.</p>\n<p>First I’m going to start working on bugs and automation so users and developers can see immediate results and so I can learn my way around the codebase quickly.</p>\n<p>Then I will start developing new features like search commands, additional search results information (like screenshots). I will also work a lot on improving the search results.</p>\n<p>Finally I will work on statistics which is not an easy problem when you also want to respect privacy.</p>\n<p>I also have a couple ideas for optional goals or additional projects I could make after GSoC is done.</p>\n",
          "difficulty": "beginner",
          "id": "proj_the-tor-project_2016_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/4519911913160704/",
          "proposal_id": null,
          "short_description": "Ahmia is a working search engine that indexes, searches, and catalogs content published on Tor Hidden Services. Furthermore, it is an environment to...",
          "slug": "ahmia-search-engine-for-hidden-services",
          "status": "completed",
          "student_name": "zma",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "Ahmia search engine for hidden services"
        },
        {
          "code_url": "https://github.com/amoghbl1/tor-browser/commits?author=amoghbl1",
          "description": "<p>Orfox, Tor browser for Android, requires a few updates that would help it move from beta to a release.</p>\n<p>I hope to achieve this this summer!</p>\n<p>Some of the updates include:</p>\n<ul>\n<li>Rebasing</li>\n<li>Code audits</li>\n<li>API updates</li>\n<li>More Orbot integration</li>\n<li>Tor Button for Orfox</li>\n</ul>\n",
          "difficulty": null,
          "id": "proj_the-tor-project_2016_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/4698651272151040/",
          "proposal_id": null,
          "short_description": "Orfox, Tor browser for Android, requires a few updates that would help it move from beta to a release.\nI hope to achieve this this summer!\nSome of...",
          "slug": "orfox",
          "status": "completed",
          "student_name": "amoghbl1",
          "student_profile": null,
          "tags": [
            "android",
            "api",
            "ui"
          ],
          "title": "Orfox"
        },
        {
          "code_url": "https://lists.torproject.org/pipermail/tor-dev/2016-August/011316.html",
          "description": "<p>The Tails Server should provide a user-friendly way to start onion services that facilitate group collaboration, communication, and data sharing. See the <a href=\"https://tails.boum.org/blueprint/tails_server/\" target=\"_blank\">Tails Server Blueprint</a> for further information on the entire Tails Server project.</p>\n<p>During GSoC 2016, I plan to implement the basis of the Tails Server. It should be possible to use a GUI or CLI (I will implement both) in Tails to automatically install a service and set everything up so it is reachable as an onion service. It should be a generic solution which makes it easy to add many different services (web server, Etherpad, Mumble server, file sharing service, etc.), but I don't plan to add many of them during this project, because that might go beyond scope. I will instead use a simple web server serving a static page as a first service.</p>\n<p>The user should be able to choose:</p>\n<ul>\n<li>whether s/he wants to require client authentication (using HiddenServiceAuthorizeClient).</li>\n<li>whether the server's configuration and data and the onion service's keys and address are stored persistently (i.e. being restored after reboot) or not.</li>\n<li>whether the service is supposed to automatically start after booting Tails.</li>\n<li>whether it should allow LAN connections.</li>\n</ul>\n",
          "difficulty": "beginner",
          "id": "proj_the-tor-project_2016_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5783137762148352/",
          "proposal_id": null,
          "short_description": "The Tails Server should provide a user-friendly way to start onion services that facilitate group collaboration, communication, and data sharing. See...",
          "slug": "tails-server",
          "status": "completed",
          "student_name": "segfault",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "ui"
          ],
          "title": "Tails Server"
        },
        {
          "code_url": "https://github.com/plaperdr/fp-central",
          "description": "<p>The capabilities of browser fingerprinting as a tool to track users online has been demonstrated by Panopticlick and other research papers since 2010. The Tor community is fully aware of the problem and the Tor browser has been modified to follow the \"one fingerprint for all\" approach. However, due to the constant evolution of the web and its underlying technologies, it has become a true challenge to always stay ahead of the latest fingerprinting techniques.</p>\n<p>For this Google Summer of Code project, I propose to develop the Fingerprint Central website that will run a fingerprinting test suite and collect data from Tor browsers to help developers design and test new defences against browser fingerprinting. The website will be similar to AmIUnique.org or Panopticlick for users where they will get a complete summary with statistics after the test suite has been executed. It can be used to test new fingerprinting protection as well as making sure that fingerprinting-related bugs were correctly fixed with specific regression tests. The expected long-term impact of this project is to reduce the differences between Tor users and reinforce their privacy and anonymity online.</p>\n",
          "difficulty": null,
          "id": "proj_the-tor-project_2016_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5915605559410688/",
          "proposal_id": null,
          "short_description": "The capabilities of browser fingerprinting as a tool to track users online has been demonstrated by Panopticlick and other research papers since...",
          "slug": "fingerprint-central",
          "status": "completed",
          "student_name": "Pierre Laperdrix",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "ui"
          ],
          "title": "Fingerprint Central"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2016/organizations/6183886396588032/"
    },
    "year_2017": {
      "num_projects": 4,
      "projects": [
        {
          "code_url": "https://forums.whonix.org/t/graphical-gui-whonix-setup-wizard-anon-connection-wizard-technical-discussion/650/303",
          "description": "<p>The anon-connection-wizard is a Python-clone of the Tor Launcher which aims at providing Tor users with a graphical instruction on configuring the Tor. This program is especially helpful for users who live in Tor-censored area. This is because those users can only connect to the Tor network with the help of other censorship circumvention tools which include but are not limited to Tor bridges, pluggable transports and other third party Internet censorship circumvention tools like Lantern and VPN.</p>\n<p>The current implementation of the Tor Launcher heavily relies on the Tor Browser. Besides, the current instructions provided by the anon-connection-wizard and Tor launcher is not be clear enough for user to configure Tor correctly. Therefore I would like to implement and redesign the anon-connection-wizard. I hope that my work will help more people to connect to the Tor network efficiently and successfully.</p>\n",
          "difficulty": null,
          "id": "proj_the-tor-project_2017_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5417890790506496/",
          "proposal_id": null,
          "short_description": "The anon-connection-wizard is a Python-clone of the Tor Launcher which aims at providing Tor users with a graphical instruction on configuring the...",
          "slug": "anon-connection-wizard",
          "status": "completed",
          "student_name": "iry",
          "student_profile": null,
          "tags": [
            "python",
            "ai"
          ],
          "title": "anon-connection-wizard"
        },
        {
          "code_url": "https://gist.github.com/mdhash/2bc637ff15545fa58366ee0bb1d93680",
          "description": "<p>Ahmia is a search engine that indexes, searches, and catalogs content published on Tor Hidden Services. Furthermore, it is a medium to share meaningful insights, statistics, and news about the Tor network itself. There are several improvements and upgrades required in Ahmia.</p>\n<p>Initial tasks include automating blacklisting and tweaking 'Add' page. Then 'Statistics' page should be fixed and graphs need to be plotted to visualize analytical data. Then I will move on to replacing Polipo with Torsocks in ahmia-crawler and upgrading Elasticsearch support from 2.4 to 5.X. Once these major tasks are done, documentation and software dependancies need to be updated. If time permits, I plan to add advance search options like double quotes(\"\") for exact matching of query and boolean operators like AND &amp; OR.</p>\n",
          "difficulty": "medium",
          "id": "proj_the-tor-project_2017_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6171539573571584/",
          "proposal_id": null,
          "short_description": "Ahmia is a search engine that indexes, searches, and catalogs content published on Tor Hidden Services. Furthermore, it is a medium to share...",
          "slug": "improving-ahmia-hidden-service-search",
          "status": "completed",
          "student_name": "Pushkar Pathak",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "Improving Ahmia - Hidden Service Search"
        },
        {
          "code_url": "https://nmago.github.io/GSoC-2017/",
          "description": "<p>Crash Reporter will be helping developers to improve Tor Browser, find bugs and crash reasons easier, that would make Tor Browser more stable and user-friendly. The goal of this project is to adapt Crash Reporter (from Mozilla) for Tor Browser and make crash reports and statistic completely anonymous.</p>\n",
          "difficulty": null,
          "id": "proj_the-tor-project_2017_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6102453011349504/",
          "proposal_id": null,
          "short_description": "Crash Reporter will be helping developers to improve Tor Browser, find bugs and crash reasons easier, that would make Tor Browser more stable and...",
          "slug": "crash-reporter-for-tor-browser",
          "status": "completed",
          "student_name": "Nur-Magomed Dzhamiev",
          "student_profile": null,
          "tags": [],
          "title": "Crash Reporter for Tor Browser"
        },
        {
          "code_url": "https://gist.github.com/felipedau/86045f6ca7e11c81b4373af9d3db811e",
          "description": "<p><a href=\"https://github.com/AnemoneLabs/unmessage\" target=\"_blank\">unMessage</a> is a privacy\nenhanced instant messenger that uses its own end-to-end encrypted\nprotocol to maintain conversations, not depending on servers, metadata\nor transport.</p>\n<p>Designed by Felipe Dau and David R. Andersen, unMessage's initial\nPython implementation had issues such as improper use of the Python\nTwisted asynchronous network IO framework, lack of a test suite and others\nthat would harm its maintainability and quality.</p>\n<p>Mentored by David Stainton and meejah, the goal of this project is\nteaching Felipe how to work with asynchronous programming, how to use\nTwisted better, how to test the software and how to use Continuous\nIntegration, while applying it to unMessage to improve its code\nquality and contributing to its maturity as a messenger which the\ncommunity can benefit from.</p>\n",
          "difficulty": null,
          "id": "proj_the-tor-project_2017_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5136415813795840/",
          "proposal_id": null,
          "short_description": "unMessage is a privacy\nenhanced instant messenger that uses its own end-to-end encrypted\nprotocol to maintain conversations, not depending on...",
          "slug": "improving-unmessages-code-quality",
          "status": "completed",
          "student_name": "dau",
          "student_profile": null,
          "tags": [
            "python",
            "ai",
            "ui"
          ],
          "title": "Improving unMessage's Code Quality"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2017/organizations/5273949793419264/"
    },
    "year_2018": null,
    "year_2019": null,
    "year_2020": null,
    "year_2021": null,
    "year_2022": {
      "num_projects": 3,
      "projects": [
        {
          "code_url": "https://gitlab.torproject.org/sarthikg/tor-weather/-/wikis/home",
          "description": "The Tor Project aims at providing anonymous communication. This requires the internet traffic to be directed through relays, which are operated by organisations & individuals across the world. Currently, if any relay disappears from the network, no one will know!\n\nTor Weather is a service for relay operators that will send them email notifications for updates & incidents with their relays. Users will have an option to customise the subscription according to their needs.\n\nBy the end of this summer, I aim at creating the tor-weather service from the ground-up which is capable of:\n\n1. Sending notifications to the subscribed relay operators upon incidents.\n\n2. Providing a web-frontend for the users to signup & tinker with the notification preferences.\n\n3. Sending welcome emails to the newly onboarded relay operators.",
          "difficulty": null,
          "id": "proj_the-tor-project_2022_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/UElieGno/",
          "proposal_id": null,
          "short_description": "The Tor Project aims at providing anonymous communication. This requires the internet traffic to be directed through relays, which are operated by...",
          "slug": "tor-weather-improving-the-tor-network",
          "status": "completed",
          "student_name": "Sarthik Gupta",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "ui",
            "frontend"
          ],
          "title": "Tor Weather: Improving the Tor network"
        },
        {
          "code_url": "https://github.com/ooni/probe/issues/2272",
          "description": "The project aims to expand the functionality and reach of the OONI probe tool by introducing TLS middlebox and port-filtering experiments. This will provide a measurement standard for TLS and port-based censorship mechanisms that common users, as well as researchers, will be able to employ without writing their own independent implementations.",
          "difficulty": null,
          "id": "proj_the-tor-project_2022_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/GAEEQk5w/",
          "proposal_id": null,
          "short_description": "The project aims to expand the functionality and reach of the OONI probe tool by introducing TLS middlebox and port-filtering experiments. This will...",
          "slug": "tor-project-ooni-probe-network-experiments",
          "status": "completed",
          "student_name": "Mehul Gulati",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Tor Project: OONI Probe Network Experiments"
        },
        {
          "code_url": "https://github.com/ooni/design-system/tree/dev",
          "description": "The goal of this is to improve the OONI Explorer. The improvements will include things like modernizing the codebase, improving the UI and UX of the application, and fixing the bugs present as issues in the repository. Alongside this, one of the major task is the modification of the OONI Design-system.",
          "difficulty": null,
          "id": "proj_the-tor-project_2022_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2022/projects/EMOQ4Zai/",
          "proposal_id": null,
          "short_description": "The goal of this is to improve the OONI Explorer. The improvements will include things like modernizing the codebase, improving the UI and UX of the...",
          "slug": "tor-project-ooni-explorer-design-system-improvements",
          "status": "completed",
          "student_name": "Vaibhav Dangra",
          "student_profile": null,
          "tags": [
            "ui",
            "ux"
          ],
          "title": "Tor Project: OONI Explorer & Design System Improvements"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2022/organizations/the-tor-project/"
    },
    "year_2023": {
      "num_projects": 4,
      "projects": [
        {
          "code_url": "https://mattrighetti.com/2023/09/26/network-status-apis.html",
          "description": "In an effort to improve current resource utilisation and optimisation, the Tor team is developing a new version of their pipeline (v2.0). This update involves transferring much of the data related to Tor nodes and bridges from files stored on a single server's disk to two separate databases: Postgres and Victoria Metrics.\n\nThe main objective of this project is to design a RESTful API service using the `actix_web` framework that is going to be integrated in the new pipeline v2.0 to support data retrival from the two databases. In particular, the focus will be on designing the new APIs, its requests, and response formats. The project will also involve defining appropriate endpoints and data models, ensuring scalability, performance, and security. The final goal is to achieve a web service that is going to extend/replace the current onionoo protocol used by stakeholders interested in the status of the Tor network and its individual nodes.",
          "difficulty": null,
          "id": "proj_the-tor-project_2023_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/9Jt0KtWV",
          "proposal_id": "TAVmoVz3",
          "short_description": "In an effort to improve current resource utilisation and optimisation, the Tor team is developing a new version of their pipeline (v2.0). This update...",
          "slug": "the-tor-network-status-api",
          "status": "completed",
          "student_name": "Mattia Righetti",
          "student_profile": null,
          "tags": [
            "web",
            "api",
            "ai",
            "database"
          ],
          "title": "The Tor Network Status API"
        },
        {
          "code_url": "https://gitlab.torproject.org/rishadbaniya/erpc",
          "description": "Within a Tor Network, there are different computers which we term as \"Relay\" which creates a circuit(path) in a Tor Network, so that the user can surf the internet Anonymously. If these Relay's cannot communicate with each other, they seriously affect the Tor Network and the performance of the Network degrades, which ultimately affects the anonymity, bandwidth, latency the Tor Network aims to provide.\n\nMy proposal aims to create a tool called eRPC(An efficient Relay Partition Checker), that can be used to scan for partitions among these Relays and provide an output that can be used to visualise the data further, so that the condition can be monitored properly.",
          "difficulty": null,
          "id": "proj_the-tor-project_2023_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/1EXXf3b5",
          "proposal_id": "QNOrspXx",
          "short_description": "Within a Tor Network, there are different computers which we term as \"Relay\" which creates a circuit(path) in a Tor Network, so that the user can...",
          "slug": "erpc-an-efficient-relay-partition-checker",
          "status": "completed",
          "student_name": "Rishad Baniya",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "eRPC : An efficient Relay Partition Checker"
        },
        {
          "code_url": "https://gotlou.srht.site/gsoc-final.html",
          "description": "Some programs should be created and curated using Arti to illustrate to other developers how they can use its APIs and to also find bugs. This includes 3 example programs to let developers get their feet wet with Arti and 2 bigger projects which would have a legitimate, production use case and can benefit from all that Arti provides, even in its current infancy.\n\nThere will also be documentation improvements made, especially to APIs that these example projects rely on, in order to more directly contribute upstream to Arti.",
          "difficulty": null,
          "id": "proj_the-tor-project_2023_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/UXQdBvLj",
          "proposal_id": "xqfqMV4A",
          "short_description": "Some programs should be created and curated using Arti to illustrate to other developers how they can use its APIs and to also find bugs. This...",
          "slug": "arti-api-exploration-to-build-example-tools",
          "status": "completed",
          "student_name": "Saksham Mittal",
          "student_profile": null,
          "tags": [
            "api",
            "ui"
          ],
          "title": "Arti API exploration to build example tools"
        },
        {
          "code_url": "https://gist.github.com/ashishsoniii/d139cd9b427d340342ef1ff04fae8960",
          "description": "Snowflake is a pluggable transport that helps users bypass censorship and access the Tor network. It uses webRTC technology to create a peer-to-peer connection between the user's browser and a volunteer proxy server.\nThe Tor project aims to create a new and improved website for Snowflake that provides a better user experience for both new and existing users. As the Snowflake has gained a lot of popularity recently, it has seen a significant increase in the number of visitors with various doubts and queries The existing website does not effectively address these concerns, so our goal is to create a user-friendly static & secured website that is easy to navigate and provides clear information about Snowflake and its proxies.\nAt the End of this summer: \n1. A new static website with a modern and intuitive layout for desktop and mobile devices integrated with other Tor Web products & follows tor's brand guidelines.\n2. Improved Snowflake proxy guide for new and existing user\n3. Ensuring the website is sustainable and easy to maintain by new contributors & developers over the long term.",
          "difficulty": "beginner",
          "id": "proj_the-tor-project_2023_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2023/projects/zQRvTgia",
          "proposal_id": "62Q8081I",
          "short_description": "Snowflake is a pluggable transport that helps users bypass censorship and access the Tor network. It uses webRTC technology to create a peer-to-peer...",
          "slug": "tors-snowflake-revitalising-snowflakes-landing-page-for-a-better-user-experience",
          "status": "completed",
          "student_name": "SoniAshish",
          "student_profile": null,
          "tags": [
            "web",
            "mobile",
            "ai",
            "ui"
          ],
          "title": "Tor’s SnowFlake: Revitalising Snowflake's Landing Page for a Better User Experience"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2023/organizations/the-tor-project"
    },
    "year_2024": null,
    "year_2025": {
      "num_projects": 3,
      "projects": [
        {
          "code_url": null,
          "description": "The goal of this project is to rewrite the current Java-based Tor Metrics Library in Rust. This library is a crucial component for parsing and analyzing Tor network descriptors used by various services and researchers.\n\nBy reimplementing the library in Rust, we aim to improve performance, take advantage of Rust’s modern language features, and provide a more ergonomic API. This rewrite will also allow the Network Health Team (and others) to migrate some of their services to Rust.\n\nIn addition to replicating current features, the new library will include some features from the DescriptorParser for exporting parsed descriptor data into formats like CSV, Parquet, or PostgreSQL tables, thereby enabling more advanced integrations and analysis capabilities.",
          "difficulty": "advanced",
          "id": "proj_the-tor-project_2025_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/dlQVNFec",
          "proposal_id": "XIpWFYmP",
          "short_description": "The goal of this project is to rewrite the current Java-based Tor Metrics Library in Rust. This library is a crucial component for parsing and...",
          "slug": "rewrite-of-the-tor-metrics-library-in-rust",
          "status": "in-progress",
          "student_name": "Axyom",
          "student_profile": null,
          "tags": [
            "java",
            "api",
            "ai"
          ],
          "title": "Rewrite of the Tor Metrics Library in Rust"
        },
        {
          "code_url": null,
          "description": "My proposal involves expanding Arti's state management subcommands: hss and hsc (very limited in functionalities at the moment).\n\nThese new features will be added after the completion of GSoC:\n a subcommand for listing keys and certificates from the configured keystores; \n a subcommand for listing keystores by their identifier;\n a subcommand for performing consistency, validity, and integrity checks on the specified stores; \n an arti hss destroy subcommand, for removing the persistent state and all the keys of a onion service; \n an arti hss destroy-and-recreate subcommand, for generating a new identity for an existing onion service;\n miscellaneous low-level \"plumbing\" subcommands, which deal with individual files from the keystore and state directories;\n a C Tor to Arti key migration tool, which will enable onion service operators to seamlessly migrate from C Tor to Arti;\n field-formatted output to be easily parseable by other programs.\n\nThese objectives will be achieved mostly by extending already existing facilities, like InertTorClient and OnionService, and by creating new ones.",
          "difficulty": null,
          "id": "proj_the-tor-project_2025_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/lFvAwMfD",
          "proposal_id": "hrQuEdHf",
          "short_description": "My proposal involves expanding Arti's state management subcommands: hss and hsc (very limited in functionalities at the moment). These new features...",
          "slug": "the-tor-project-onion-service-support-tooling-for-arti",
          "status": "in-progress",
          "student_name": "Omar Gorni",
          "student_profile": null,
          "tags": [
            "ml"
          ],
          "title": "The Tor Project: Onion Service Support Tooling for Arti"
        },
        {
          "code_url": null,
          "description": "The Tor network's anonymity guarantee depends heavily on the connectivity between relays.\nPartitioning in the network can significantly compromise these guarantees by limiting the\npossible paths available to users. During GSoC 2023, the eRPC tool was built to detect such\npartitions by building two-hop circuits between relays and storing the results in a Neo4j graph database, where vertices represent relay fingerprints and edges represent successful or failed circuit builds. \n\nThis project aims to enhance the existing eRPC tool by developing analysis capabilities to\ndetect, visualize, and understand network partitions. The focus will be on implementing\nefficient graph algorithms to identify disconnected components and communities within\nthe Tor network. By utilizing Neo4j's Graph Data Science (GDS) library, we can apply\ncommunity detection and clustering algorithms to find potential partitions in the directed\ngraph that represents the Tor network. \n\nBy the end of the project, I aim to deliver an enhanced eRPC tool with robust analysis\ncapabilities, interactive visualizations, and comprehensive documentation. This will provide\nthe Tor community with valuable insights into the network's connectivity patterns and help\nidentify areas that need attention to strengthen Tor's anonymity guarantees.",
          "difficulty": null,
          "id": "proj_the-tor-project_2025_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/hKZzP0GA",
          "proposal_id": "GxNa3CWi",
          "short_description": "The Tor network's anonymity guarantee depends heavily on the connectivity between relays. Partitioning in the network can significantly compromise...",
          "slug": "the-tor-project-network-health-enhancing-erpc-network-partition-analysis-and-visualization",
          "status": "in-progress",
          "student_name": "Shivam Vats",
          "student_profile": null,
          "tags": [
            "ai",
            "database",
            "ui"
          ],
          "title": "The Tor Project - Network Health: Enhancing eRPC - Network Partition Analysis and Visualization"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2025/organizations/the-tor-project"
    }
  },
  "first_time": false,
  "contact": {
    "email": "gsoc@torproject.org",
    "guide_url": "https://gitlab.torproject.org/tpo/team/-/wikis/How-To-Apply-to-Google-Summer-of-Code",
    "ideas_url": "https://gitlab.torproject.org/tpo/team/-/wikis/GSoC",
    "irc_channel": "https://support.torproject.org/get-in-touch/#irc-help",
    "mailing_list": "https://forum.torproject.net/"
  },
  "social": {
    "blog": "https://blog.torproject.org/",
    "discord": null,
    "facebook": null,
    "github": null,
    "gitlab": null,
    "instagram": null,
    "linkedin": null,
    "mastodon": null,
    "medium": null,
    "reddit": null,
    "slack": null,
    "stackoverflow": null,
    "twitch": null,
    "twitter": "https://mastodon.social/@torproject",
    "youtube": null
  },
  "meta": {
    "version": 1,
    "generated_at": "2026-01-25T15:28:54.401Z"
  }
}