{
  "id": "692251ea53dd9d7326d33ede",
  "slug": "the-terasology-foundation",
  "name": "The Terasology Foundation",
  "category": "End user applications",
  "description": "Voxel world game/engine with a large focus on extensibility and developer tools",
  "image_url": "https://lh3.googleusercontent.com/M0PBCc2Ddh0Ld7fkCNbaZdH-0yAdu9lgG3d39rmhGQstkM-gXLaN_C5DPPBD8TnOqkKI4GqMU7VbuAj_Qo0onNzCne6wxEANQbx5AzkhPG6_",
  "img_r2_url": "https://pub-268c3a1efc8b4f8a99115507a760ca14.r2.dev/the-terasology-foundation.webp",
  "logo_r2_url": null,
  "url": "https://terasology.org/",
  "active_years": [
    2016,
    2017,
    2018,
    2019,
    2020,
    2021
  ],
  "first_year": 2016,
  "last_year": 2021,
  "is_currently_active": false,
  "technologies": [
    "java",
    "opengl",
    "blender",
    "gradle",
    "lwjgl",
    "json",
    "github",
    "lwgjl",
    "kotlin"
  ],
  "topics": [
    "game",
    "voxel",
    "minecraft",
    "sandbox",
    "modding",
    "games",
    "ai",
    "graphics",
    "graphics / video / audio / virtual reality",
    "game engines"
  ],
  "total_projects": 43,
  "stats": {
    "avg_projects_per_appeared_year": 7.17,
    "projects_by_year": {
      "year_2016": 3,
      "year_2017": 10,
      "year_2018": 9,
      "year_2019": 9,
      "year_2020": 8,
      "year_2021": 4,
      "year_2022": null,
      "year_2023": null,
      "year_2024": null,
      "year_2025": null
    },
    "students_by_year": {
      "year_2016": 3,
      "year_2017": 10,
      "year_2018": 9,
      "year_2019": 9,
      "year_2020": 8,
      "year_2021": 4,
      "year_2022": null,
      "year_2023": null,
      "year_2024": null,
      "year_2025": null
    },
    "total_students": 42
  },
  "years": {
    "year_2016": {
      "num_projects": 3,
      "projects": [
        {
          "code_url": "https://rzats.github.io/gsoc/2016-final-report",
          "description": "<p>Currently, <strong>Terasology</strong> uses its own <strong>NUI</strong> (New User Interface) framework to render in-game UI elements. This solution works great for the game’s purposes and has the potential to stand out as a separate library, used in MovingBlocks’ open-source adoptee <strong>Destination Sol </strong>and various other game projects. The proposed project aims to extract the framework into a standalone library and create a visual editor application for <strong>NUI</strong> interface definition files to facilitate developer and modder interest.</p>\n",
          "difficulty": null,
          "id": "proj_the-terasology-found_2016_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/6688294335152128/",
          "proposal_id": null,
          "short_description": "Currently, Terasology uses its own NUI (New User Interface) framework to render in-game UI elements. This solution works great for the game’s...",
          "slug": "standalone-nui-extraction-and-visual-nui-editor",
          "status": "completed",
          "student_name": "Rostyslav Zatserkovnyi",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Standalone NUI extraction and visual NUI editor"
        },
        {
          "code_url": "http://tdgunes.org/2016/08/23/gsoc2016/",
          "description": "<p>DAG (Directed Acyclic Graph) pipelines for Terasology, is an extensive refactor of the current rendering engine of Terasology. While refactors are primarily considered to make the implemented code much cleaner and efficient, the proposed project includes enabling rendering engine to be able to support many different features that are not easily supported by the current implementation. Renderer extensibility, VR headsets, multiple cameras with different effects, minimizing state changes in OpenGL and reducing render time (by checking possible alternative  DAG configuration) are features that will become available through this project.</p>\n",
          "difficulty": null,
          "id": "proj_the-terasology-found_2016_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5464468368654336/",
          "proposal_id": null,
          "short_description": "DAG (Directed Acyclic Graph) pipelines for Terasology, is an extensive refactor of the current rendering engine of Terasology. While refactors are...",
          "slug": "dag-based-rendering-pipelines-for-terasology",
          "status": "completed",
          "student_name": "tdgunes",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "DAG-based Rendering Pipelines for Terasology"
        },
        {
          "code_url": "http://forum.terasology.org/threads/gsoc-2016-city-simulation-project.1587/",
          "description": "<p>A conceptual framework for a population based city simulation is developed in this proposal. Concrete implementation approaches for the steps involved, city spot searching, population growth, building spot selection and road generation were devised based on own ideas and literature. The approach to solve those task is a conjuction between agent based reasoning and stochastic methods as well as growth models. In the case of time left after finishing those goals, need based resource usage and production are talked about until the stage of a market development.\nBriefly, possible future developments are discussed.</p>\n",
          "difficulty": null,
          "id": "proj_the-terasology-found_2016_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/6565433037553664/",
          "proposal_id": null,
          "short_description": "A conceptual framework for a population based city simulation is developed in this proposal. Concrete implementation approaches for the steps...",
          "slug": "application-for-city-generation-and-dynamic-simulation",
          "status": "completed",
          "student_name": "Cpt. Crispy Crunchy",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "Application for City Generation and dynamic Simulation"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2016/organizations/5187993270747136/"
    },
    "year_2017": {
      "num_projects": 10,
      "projects": [
        {
          "code_url": "https://gabrielxia.github.io/gsoc2017Final.html",
          "description": "<p>Telemetry System for Terasology has two goals: to gather players' gameplay information and to gather their error logs enriched with system details. Telemetry for Terasology will help developers know better about player's experience and improve the game. <strong>NOTE</strong> that the whole telemetry stuffs depends on user's options.</p>\n<p>This project requires both work on client side and on server side. On client side, the snowplow tracker lib is used to track metrics and the Logstash appender is used to report errors. On the server side, ELK stacks and snowplow tools are used to collect metrics, analyze and visualize data.</p>\n",
          "difficulty": null,
          "id": "proj_the-terasology-found_2017_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6620829257302016/",
          "proposal_id": null,
          "short_description": "Telemetry System for Terasology has two goals: to gather players' gameplay information and to gather their error logs enriched with system details....",
          "slug": "telemetry-system-for-terasology",
          "status": "completed",
          "student_name": "Jin XIA",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Telemetry System for Terasology"
        },
        {
          "code_url": "http://forum.terasology.org/threads/gsoc-2017.1896/#post-15188",
          "description": "<p>Started back in 2015 as a demo, Destination Sol is a Space Shooter that gives the player a chance to be the captain of his own fantasy ship, fighting enemies and looting gold. After the initial hype settled down, the developers who originally made the game drifted off to other projects, and Destination Sol came to be managed by Moving Blocks. However, the game has gone too long without updates, the associated tools that were once used to create assets for the game are no longer functioning, and a lot of features just leave the player discontent. This proposal aims to change all that, and more.</p>\n",
          "difficulty": null,
          "id": "proj_the-terasology-found_2017_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6754962965004288/",
          "proposal_id": null,
          "short_description": "Started back in 2015 as a demo, Destination Sol is a Space Shooter that gives the player a chance to be the captain of his own fantasy ship, fighting...",
          "slug": "destination-sol-resurrected",
          "status": "completed",
          "student_name": "Aresh Mishra",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Destination Sol Resurrected"
        },
        {
          "code_url": "https://vizaxo.github.io/permalinks/gsoc2017/",
          "description": "<p>The focus of this project is to add sectors to the Terasology engine. Sectors are a level of entity storage between block-scope and world-scope, which allows entities that would usually be put in the global scope to be split into multiple groups. Each of these groups can be run on a separate thread, or even on a separate server node.</p>\n<p>Sector-level entities are still loaded when their chunks are unloaded, allowing simulations to continue when the player is away, but they can be stopped if a whole sector is unloaded to increase performance.</p>\n",
          "difficulty": null,
          "id": "proj_the-terasology-found_2017_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5120865616265216/",
          "proposal_id": null,
          "short_description": "The focus of this project is to add sectors to the Terasology engine. Sectors are a level of entity storage between block-scope and world-scope,...",
          "slug": "sectors",
          "status": "completed",
          "student_name": "Vizaxo",
          "student_profile": null,
          "tags": [],
          "title": "Sectors"
        },
        {
          "code_url": "http://arpan98.github.io/2017/08/23/gsoc-wrap-up-post.html",
          "description": "<p>Currently, <strong>Terasology</strong> has a simple HP bar for a character's health and no anatomy. This project aims to add <strong>anatomical body parts</strong> (like head, arms, legs etc.) to creatures and implement a <em>Dwarf Fortress style</em> health system which has <strong>effects on specific body parts</strong> (like a broken leg from falling) instead of an overall HP system. Another part of this project would be to <strong>integrate the Genome module</strong> for genetics effects with other modules like SimpleFarming and WildAnimals.</p>\n",
          "difficulty": null,
          "id": "proj_the-terasology-found_2017_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5304929124089856/",
          "proposal_id": null,
          "short_description": "Currently, Terasology has a simple HP bar for a character's health and no anatomy. This project aims to add anatomical body parts (like head, arms,...",
          "slug": "anatomy-system-and-genome-integrations",
          "status": "completed",
          "student_name": "Arpan Banerjee",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Anatomy System and Genome integrations"
        },
        {
          "code_url": "https://gist.github.com/0shine0/aba355bbc437b57b3c5d8aaeaa2a0296",
          "description": "<p>Currently, Terasology lacks a proper Physics-based combat system. Basic combat, based entirely on proximity and angles, can be simulated currently but creating a combat system that could use high velocity projectiles and reacts with environment much more dynamically(bouncing off surfaces) will be an important addition to the gameplay. The proposed project aims at restoring much of the functionality of old branch of the legacy combat system while also improving the Combat based AI for computer controlled characters. The project also aims at defining the characters in anatomical way with different body parts and susceptible to disease.</p>\n",
          "difficulty": null,
          "id": "proj_the-terasology-found_2017_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5617791721799680/",
          "proposal_id": null,
          "short_description": "Currently, Terasology lacks a proper Physics-based combat system. Basic combat, based entirely on proximity and angles, can be simulated currently...",
          "slug": "physics-based-combat-system",
          "status": "completed",
          "student_name": "Swastik Garg",
          "student_profile": null,
          "tags": [
            "react",
            "ai"
          ],
          "title": "Physics-based Combat System"
        },
        {
          "code_url": "http://nihal111.github.io/2017/08/15/GSoC-wrap-up.html",
          "description": "<p>Add WildAnimals, Puzzles, Exploration and other content to create a new gameplay module.\nThe new gameplay module would pack together the best of whatever is created yet, to create a new gameplay setting that would add meaning and purpose for the end user.</p>\n",
          "difficulty": null,
          "id": "proj_the-terasology-found_2017_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/4610784562774016/",
          "proposal_id": null,
          "short_description": "Add WildAnimals, Puzzles, Exploration and other content to create a new gameplay module.\nThe new gameplay module would pack together the best of...",
          "slug": "exploration-world-improved-gameplay",
          "status": "completed",
          "student_name": "Nihal Singh",
          "student_profile": null,
          "tags": [],
          "title": "Exploration World- Improved gameplay"
        },
        {
          "code_url": "https://gist.github.com/gianluca-nitti/80cef8062b0cc15a734c28943943676a",
          "description": "<p>The main goal of my project is implementing an HTTP/WebSocket server running inside the game server process that will allow access to Terasology functionalities for players and server admins (for example kicking players, teleporting, changing game properties, adjusting game time, etc - according to user permissions) through those protocols, and appropriate user-friendly clients to interact with the service.</p>\n",
          "difficulty": null,
          "id": "proj_the-terasology-found_2017_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/4624709383618560/",
          "proposal_id": null,
          "short_description": "The main goal of my project is implementing an HTTP/WebSocket server running inside the game server process that will allow access to Terasology...",
          "slug": "apis-for-out-of-game-interaction-with-terasology-server",
          "status": "completed",
          "student_name": "Gianluca Nitti",
          "student_profile": null,
          "tags": [
            "web",
            "api",
            "ai"
          ],
          "title": "API(s) for out-of-game interaction with Terasology server"
        },
        {
          "code_url": "https://kartikey0303.github.io/GSOC-wrapup",
          "description": "<p>Improving the current md5 exporter for blender which is better suited to the needs of Terasology. The script will automate most of the tasks while providing an easy to use GUI for the blender environment. Features like automating triangulation of faces, separating faces, exporting multiple animations, creating a prefab file for specific AI animations and GUI development will be implemented during this project. Using the bpy library for blender script will be written in python.</p>\n",
          "difficulty": "beginner",
          "id": "proj_the-terasology-found_2017_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/4912248854151168/",
          "proposal_id": null,
          "short_description": "Improving the current md5 exporter for blender which is better suited to the needs of Terasology. The script will automate most of the tasks while...",
          "slug": "better-blender-md5-exporter",
          "status": "completed",
          "student_name": "Kartikey Agrawal",
          "student_profile": null,
          "tags": [
            "python",
            "ai",
            "ui"
          ],
          "title": "Better blender md5 exporter"
        },
        {
          "code_url": "https://dkambersky.github.io/tera/2017/08/24/google-summer-of-code-2017-final-report.html",
          "description": "<p>[from the proposal's synopsis]</p>\n<p>For my Google Summer of Code project, I want to complete Terasology’s behavior tree AI implementation, to the point where it is easily usable by module authors and generally whomever wants to give their mobs behavior of any kind.</p>\n<p>The end result would be a well documented behavior system living in the Behaviors module with pre-defined behaviors, behavior nodes, easy hooks from a behavior node to check an Actor’s status, or communicate with other Actors. \nThe project would also include tutorials, predefined behaviors and example creatures using the system.</p>\n",
          "difficulty": "beginner",
          "id": "proj_the-terasology-found_2017_009",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/4934034270453760/",
          "proposal_id": null,
          "short_description": "[from the proposal's synopsis]\nFor my Google Summer of Code project, I want to complete Terasology’s behavior tree AI implementation, to the point...",
          "slug": "behavior-trees",
          "status": "completed",
          "student_name": "David Kambersky",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Behavior Trees"
        },
        {
          "code_url": "https://thompsontyler.github.io/gsoc/2017/08/25/scenario-gsoc.html",
          "description": "<p>The inspiration for this proposal is from elements of Minecraft along with some pre-existing suggestions and ideas within Terasology. The concept of Scenarios has been suggested in the past and would be very important in order to properly develop any notion of “static” worlds such as what would exist for Light &amp; Shadow. In addition, it would provide assistance to creation of exploration worlds such as the suggested Maze world.</p>\n<p>The implementation of scenarios can be thought of as basically creating a “game maker” style engine built into Terasology.</p>\n<p>As additional smaller, but very important goals attached to this idea, I intend to extend the currently existing tools for creation which mostly include BlockPicker and StructureTemplates both of these tools work well at what they do, but both are still limited for large creations as they require placing everything by hand. This is where the brush tool I propose can come in handy. The brush tool is designed to allow for “brush-strokes” being made using blocks to quickly create large structures and terraforming. These brush tools would allow for the following interactions.</p>\n",
          "difficulty": null,
          "id": "proj_the-terasology-found_2017_010",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5756370854871040/",
          "proposal_id": null,
          "short_description": "The inspiration for this proposal is from elements of Minecraft along with some pre-existing suggestions and ideas within Terasology. The concept of...",
          "slug": "terasology-scenario-creation",
          "status": "completed",
          "student_name": "Tyler Thompson",
          "student_profile": null,
          "tags": [
            "ios",
            "ui"
          ],
          "title": "Terasology Scenario Creation"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2017/organizations/4985951029821440/"
    },
    "year_2018": {
      "num_projects": 9,
      "projects": [
        {
          "code_url": "https://forum.terasology.org/threads/gsoc-2018-improving-the-server-facade.2170/#post-16059",
          "description": "<p>During Google summer of code 2017, one student worked on making a backend that exposes information about Terasology servers. He also made a frontend using the ReactXP framework, which can build to multiple platforms, such as web, Android, and iOS. However, both the backend and the frontend need some work done on them to make them acceptable for end users. That is what this project is going to try to help accomplish.</p>\n",
          "difficulty": null,
          "id": "proj_the-terasology-found_2018_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/6415776378519552/",
          "proposal_id": null,
          "short_description": "During Google summer of code 2017, one student worked on making a backend that exposes information about Terasology servers. He also made a frontend...",
          "slug": "improving-the-server-facade",
          "status": "completed",
          "student_name": "Neil Moon",
          "student_profile": null,
          "tags": [
            "react",
            "android",
            "ios",
            "web",
            "ui"
          ],
          "title": "Improving the Server Facade"
        },
        {
          "code_url": "https://naman-sopho.github.io/2018-08-07-GSoCWrapUp/",
          "description": "<p>Renovation of Master of Oreon is an extensive refactor of the current Master of Oreon module. The vision behind MOO is to create a game-play scenario akin to a mixture fortress management of Dwarf Fortress and wizard research in Dungeon Keeper, which will be made available through this project.</p>\n",
          "difficulty": null,
          "id": "proj_the-terasology-found_2018_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5686147871145984/",
          "proposal_id": null,
          "short_description": "Renovation of Master of Oreon is an extensive refactor of the current Master of Oreon module. The vision behind MOO is to create a game-play scenario...",
          "slug": "renovation-of-masteroforeon",
          "status": "completed",
          "student_name": "Naman Tiwari",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Renovation of MasterOfOreon"
        },
        {
          "code_url": "http://dacharya64.postach.io/post/gsoc-final-project-wrapup",
          "description": "<p>My goal for Google Summer of Code is to work on improvements for the current Light and Shadow module. My hope for the end of the summer is to create a minimal viable product that implements unique assets, gameplay, level design, and mechanics, and can serve as a new mode of gameplay for Terasology.</p>\n",
          "difficulty": null,
          "id": "proj_the-terasology-found_2018_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5510538872225792/",
          "proposal_id": null,
          "short_description": "My goal for Google Summer of Code is to work on improvements for the current Light and Shadow module. My hope for the end of the summer is to create...",
          "slug": "extending-light-and-shadow-gameplay-and-functionality",
          "status": "completed",
          "student_name": "Devi Acharya @dacharya64",
          "student_profile": null,
          "tags": [],
          "title": "Extending “Light and Shadow” Gameplay and Functionality"
        },
        {
          "code_url": "https://iaronaraujo.wixsite.com/meusite/blog/google-summer-of-code-2018-final-report",
          "description": "<p>At present, Terasology has a very limited amount of types of automated\ntesting, which includes standard unit tests, environment-based tests and some minor\nbenchmarking. Recently a new module (ModuleTestingEnvironment) was created to\nsupport integration tests, in which a JUnit tests are used to check more than one\ngame component together executing in a headless client. Since the creation of this\nmodule was recent, not much was done using it yet. Besides this, another very\nrequested test feature is the ability to record and replay events of a game session.\nWith these facts in mind, I propose to create an event saving feature, that record all\nEvents of a game session, and extend MTE to be able to create integration tests for\nthe events recorded through this new feature.</p>\n",
          "difficulty": null,
          "id": "proj_the-terasology-found_2018_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/4962146240692224/",
          "proposal_id": null,
          "short_description": "At present, Terasology has a very limited amount of types of automated\ntesting, which includes standard unit tests, environment-based tests and some...",
          "slug": "event-recording-feature",
          "status": "completed",
          "student_name": "Iaron da Costa Araújo",
          "student_profile": null,
          "tags": [],
          "title": "Event Recording Feature"
        },
        {
          "code_url": "https://forum.terasology.org/threads/gsoc-2018-frameworks-and-content.2175/#post-16063",
          "description": "<p>This proposal involves creating a “base game”, or gameplay template, usable by players and expansion mod developers alike. I have spent a long time implementing game design concepts for a more fleshed out sandbox experience, particularly in the areas of building infrastructure and automation (but not focusing strictly on it - this is better left to dedicated games like Factorio), but also the overall progression of gameplay.</p>\n",
          "difficulty": null,
          "id": "proj_the-terasology-found_2018_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/4791743614550016/",
          "proposal_id": null,
          "short_description": "This proposal involves creating a “base game”, or gameplay template, usable by players and expansion mod developers alike. I have spent a long time...",
          "slug": "developing-an-assortment-of-sandbox-friendly-framework-and-content-modules",
          "status": "completed",
          "student_name": "Adrian Siekierka",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "Developing an assortment of sandbox-friendly framework and content modules"
        },
        {
          "code_url": "https://gist.github.com/l0ftyWhizZ/121194027c49b2b11a4997b0e3e822bb",
          "description": "<p>The aim of this project is to bring SuperSnark’s brilliant game design to life - GooKeeper!  In GooKeeper the player has to setup and maintain a GooZoo, which as the name suggests, is a zoo with different varieties of gooeys. The player has to capture these gooeys from the wild using a special tool, the revolutionary  PlazMaster 3000 into slime-pods and bring them back to the zoo.\nThese gooeys have different behaviors, some are aggressive, some are passive, and hence capturing them would have different levels of difficulty, and also different payoffs in the zoo.\nSo, the main aim of the player is to capture exotic varieties of gooeys, keep them fed and happy, and possibly have them mate with one another to give birth to a new, interesting gooey type!</p>\n",
          "difficulty": null,
          "id": "proj_the-terasology-found_2018_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/6524215712808960/",
          "proposal_id": null,
          "short_description": "The aim of this project is to bring SuperSnark’s brilliant game design to life - GooKeeper!  In GooKeeper the player has to setup and maintain a...",
          "slug": "gookeeper-implementation",
          "status": "completed",
          "student_name": "Shreyas Iyer",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "GooKeeper Implementation"
        },
        {
          "code_url": "https://github.com/Terasology/GooeyDefence/wiki/Summer-of-Code",
          "description": "<p><strong>Terasology</strong><br>\nOne of the main goals of Teraoslogy is to be <em>Overwhelmingly Customisable</em>. This means that the base engine only provides the bare minimum to create a functioning sandbox environment. Content is provided through modules which build on, tweak and integrate with both the engine and each other. This creates a wealth of content for the player to choose from.<br>\nOr at least that is the intention. Currently the major content for Terasology is extremely similar to content seen in other games like Minecraft, MineTest and similar sandbox games. However due to how modular the design is, it has the potential to have a breadth of content that eclipses either of those two. Which is where this project comes in.</p>\n<p><strong>GooeyDefence</strong><br>\nTower Defence is a very well known game genre, and one that is also consistently popular. This project aims to add a tower defence game mode to Terasology, with a sandbox spin on it. The game mode allows for modular tower building and freeform block placement. It is intended to show off the best of Terasology and thus is designed to be extremely extensible as well as to use content from other modules.<br>\n<a href=\"https://docs.google.com/document/d/1DN4LxL8nSd9ZUbqhpXIfasmm8PQykJonOw7nUpKXpoo/edit?usp=sharing\" target=\"_blank\">The original proposal can be seen here</a></p>\n<p>Hope you enjoy!</p>\n",
          "difficulty": null,
          "id": "proj_the-terasology-found_2018_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/6559586647539712/",
          "proposal_id": null,
          "short_description": "Terasology\nOne of the main goals of Teraoslogy is to be Overwhelmingly Customisable. This means that the base engine only provides the bare minimum...",
          "slug": "tower-defence-gameplay-template",
          "status": "completed",
          "student_name": "jellysnake",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Tower Defence Gameplay Template"
        },
        {
          "code_url": "https://theflash98.github.io/main/2018/08/12/GSoC-Wrap-Up.html",
          "description": "<p>Terasology is an open world, open source game but it’s open in the sense that one can explore a single world as much as possible. The idea of this proposal is to add multiple worlds to the game and enable teleportation between two worlds. With Sector’s proof of concept done and ready, this project will serve to be a proof of concept of multiple worlds and efficient entity pool splitting.\nThe deliverables of this project would be:</p>\n<p>1) An improved and more optimized way of queuing chunks for efficient loading and unloading whenever needed.</p>\n<p>2) A game with multiple worlds where a player can select multi-world options and can teleport among them using portals.</p>\n",
          "difficulty": null,
          "id": "proj_the-terasology-found_2018_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/6321608952119296/",
          "proposal_id": null,
          "short_description": "Terasology is an open world, open source game but it’s open in the sense that one can explore a single world as much as possible. The idea of this...",
          "slug": "multiple-worlds",
          "status": "completed",
          "student_name": "Sarthak Khandelwal",
          "student_profile": null,
          "tags": [
            "ui"
          ],
          "title": "Multiple Worlds"
        },
        {
          "code_url": "https://ar0ne.github.io/gsoc/",
          "description": "<p>From my perspective, we could redo some game menus and improve user's experience. The general idea is to provide more opportunities to manage module dependencies and add possibility configure them. And other useful changes, e.g. previews for saved games, full description, e.t.c.</p>\n",
          "difficulty": null,
          "id": "proj_the-terasology-found_2018_009",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2018/projects/5170686498701312/",
          "proposal_id": null,
          "short_description": "From my perspective, we could redo some game menus and improve user's experience. The general idea is to provide more opportunities to manage module...",
          "slug": "game-saved-world-module-preview-image-content",
          "status": "completed",
          "student_name": "Siarhei Shalyhaila",
          "student_profile": null,
          "tags": [],
          "title": "Game / saved world / module preview image content"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2018/organizations/4941292362530816/"
    },
    "year_2019": {
      "num_projects": 9,
      "projects": [
        {
          "code_url": "https://dave2s.github.io/gsoc/posts/final_report.html",
          "description": "<p>The rendering pipeline of Terasology is represented by a direct acyclic graph (DAG) consisting of sets of <em>nodes</em> and <em>edges</em>. Nodes being (sets of) features, bearing <em>frame-buffers</em> and <em>shaders</em>. The expected semantics behind the graph's edges is communicating inter-node dependencies, which is currently not possible. The current state only defines ordering of node calls while relying on the dependencies to be hardcoded right inside the nodes themselves.</p>\n<p>This project sets as its goal, among others, to provide a code-base for expressing inter-node dependencies and integrating this into the current pipeline, introducing modularity. An API for game modules might be provided.</p>\n",
          "difficulty": null,
          "id": "proj_the-terasology-found_2019_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5669443114369024/",
          "proposal_id": null,
          "short_description": "The rendering pipeline of Terasology is represented by a direct acyclic graph (DAG) consisting of sets of nodes and edges. Nodes being (sets of)...",
          "slug": "the-render-dag-enhancements",
          "status": "completed",
          "student_name": "David S",
          "student_profile": null,
          "tags": [
            "api"
          ],
          "title": "The render DAG enhancements"
        },
        {
          "code_url": "https://sndwv.net/post-gsoc.html",
          "description": "<p>The project proposes the creation of content bringing content inspired by the Forestry and ExtraBees mods for Minecraft to Terasology.</p>\n<p>The content proposed includes an improved framework for merging items and blocks common to multiple modules (e.g. metals); a system providing tools for storing and simulating various genomes and their interactions; and a gameplay module, integrated with the currently existing JoshariasSurvival module, featuring bee breeding, genetic modification of bees, and renewable resource generation using bees.</p>\n",
          "difficulty": null,
          "id": "proj_the-terasology-found_2019_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5425565794828288/",
          "proposal_id": null,
          "short_description": "The project proposes the creation of content bringing content inspired by the Forestry and ExtraBees mods for Minecraft to Terasology.\nThe content...",
          "slug": "apiculture",
          "status": "completed",
          "student_name": "Cameron McWilliams",
          "student_profile": null,
          "tags": [
            "api"
          ],
          "title": "Apiculture"
        },
        {
          "code_url": "https://darshan3.github.io/gsoc-wrap-up/",
          "description": "<p>The aim of this project would be to enhance and complete the basic gameplay mode which would be a fast-paced Capture The Flag set up in the Dark Fantasy world of Light and Shadow. One has to choose between the game’s two major factions and try to capture opposition's flag. The gameplay will also include features like in-game shop, defence towers and magic wands.</p>\n",
          "difficulty": null,
          "id": "proj_the-terasology-found_2019_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/6176684523388928/",
          "proposal_id": null,
          "short_description": "The aim of this project would be to enhance and complete the basic gameplay mode which would be a fast-paced Capture The Flag set up in the Dark...",
          "slug": "light-and-shadow-remastered",
          "status": "completed",
          "student_name": "darshan3",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Light And Shadow Remastered"
        },
        {
          "code_url": "https://e-aakash.github.io/2019/08/23/gsoc-wrap.html",
          "description": "<p>Health is one of the fundamental logic for any game. The proposal is to make the Health component, which takes care of the health of the player and other NPCs, more extensible by moving it to a separate module and adding more logic flow into it.</p>\n",
          "difficulty": null,
          "id": "proj_the-terasology-found_2019_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5315743967608832/",
          "proposal_id": null,
          "short_description": "Health is one of the fundamental logic for any game. The proposal is to make the Health component, which takes care of the health of the player and...",
          "slug": "restoration-100",
          "status": "completed",
          "student_name": "E. Aakash",
          "student_profile": null,
          "tags": [],
          "title": "Restoration 100"
        },
        {
          "code_url": "https://forum.terasology.org/threads/gsoc-2019-terasology-launcher-4-0.2268/",
          "description": "<p>Terasology uses a desktop launcher to help users manage different game versions and tweak additional settings. The launcher is developed using JavaFX, but the mode of distribution of JavaFX has caused multiple issues for users. This project proposes to enhance the launcher while continuing the use of JavaFX and embedding a runtime to provide a hassle-free experience for end-users who don’t have Java installed.</p>\n",
          "difficulty": null,
          "id": "proj_the-terasology-found_2019_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/6197056140476416/",
          "proposal_id": null,
          "short_description": "Terasology uses a desktop launcher to help users manage different game versions and tweak additional settings. The launcher is developed using...",
          "slug": "terasology-launcher-40",
          "status": "completed",
          "student_name": "Priyadarshi Raj",
          "student_profile": null,
          "tags": [
            "java",
            "ui"
          ],
          "title": "Terasology Launcher 4.0"
        },
        {
          "code_url": "https://andytechguy.blogspot.com/2019/08/gsoc-2019-final-report.html",
          "description": "<p>Metal Renegades originally started as an idea on the MovingBlocks forum for a brand new gameplay module for use the Terasology engine. The new game would be an open-world sandbox, where the player is dropped into a futuristic western world populated by robots. The core gameplay would be driven by faction conflict, building mechanical systems, advanced NPC interaction, resource gathering, and much more. This project takes some of the first steps to start bringing the ideas mentioned in the post to life. Specifically, this project focuses on the underlying world of Metal Renegades, and the interactions of AI agents that populate it. This world provides a strong backbone to build the core gameplay elements upon.</p>\n",
          "difficulty": "advanced",
          "id": "proj_the-terasology-found_2019_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/4655180329517056/",
          "proposal_id": null,
          "short_description": "Metal Renegades originally started as an idea on the MovingBlocks forum for a brand new gameplay module for use the Terasology engine. The new game...",
          "slug": "metal-renegades-initial-world-implementation",
          "status": "completed",
          "student_name": "AndyTechGuy",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Metal Renegades: Initial World Implementation"
        },
        {
          "code_url": "https://casals.io/code/gsoc-final-post/",
          "description": "<p>The objective of this project is to Improve the behavior mechanism in Terasology in order to allow collective behaviors among multiple actors. Existing research on cooperative planning mechanisms for intelligent agents will be used in the implementation.</p>\n",
          "difficulty": null,
          "id": "proj_the-terasology-found_2019_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5946247498694656/",
          "proposal_id": null,
          "short_description": "The objective of this project is to Improve the behavior mechanism in Terasology in order to allow collective behaviors among multiple actors....",
          "slug": "collective-behavior-in-terasology",
          "status": "completed",
          "student_name": "casals",
          "student_profile": null,
          "tags": [],
          "title": "Collective Behavior in Terasology"
        },
        {
          "code_url": "https://wabadump.postach.io/post/final-report-gsoc-2019",
          "description": "<p>Metal Renegades will be a sandbox style game mode set in the wild west where humans and machines coexist. Players will play as robots themselves. It aims to give players an RPG style gameplay with different factions and quests in a sandbox environment. This project will focus on getting basic gameplay systems right and have a playable multiplayer. The result will be a module which allows players to fight, hunt and loot. This would provide the necessary framework to build upon and implement more complex systems.</p>\n",
          "difficulty": "advanced",
          "id": "proj_the-terasology-found_2019_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5989395344130048/",
          "proposal_id": null,
          "short_description": "Metal Renegades will be a sandbox style game mode set in the wild west where humans and machines coexist. Players will play as robots themselves. It...",
          "slug": "metal-renegades-multiplayer-implementation",
          "status": "completed",
          "student_name": "Mayant Mukul",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Metal Renegades - Multiplayer Implementation"
        },
        {
          "code_url": "https://docs.google.com/document/d/1-ukkz9Fy4hEx_mdKvB35dUa62Q72hM6CEDV44unIoEY/edit?usp=sharing",
          "description": "<p>Terasology is designed to be a modular voxel engine but as said: “with great power comes great responsibility”. Keeping track of all the modules can be tough. The idea of the proposal is to provide an automation system that aggregates all the modules and display their information on a generated website. Provide a way for the user to download, list dependencies. With a stretch-goal of improving the UX of the website along with speed and accessibility.</p>\n",
          "difficulty": null,
          "id": "proj_the-terasology-found_2019_009",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2019/projects/5144970413998080/",
          "proposal_id": null,
          "short_description": "Terasology is designed to be a modular voxel engine but as said: “with great power comes great responsibility”. Keeping track of all the modules can...",
          "slug": "module-showcase-website",
          "status": "completed",
          "student_name": "Tejas \"majordwarf\" Tank",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "ux"
          ],
          "title": "Module Showcase Website!"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2019/organizations/5741667284418560/"
    },
    "year_2020": {
      "num_projects": 8,
      "projects": [
        {
          "code_url": "https://dev.to/theshubham99/gsoc-final-code-submission-3aad",
          "description": "<p>The journey of a contributor in open source projects is exciting, especially when the contributors can map their abilities with the workflow of the vast open source projects like terasology.</p>\n<h3>Aim</h3>\n<p>In this project I am willing to work on an Interactive experience for the contributor which will take them through all the possible paths according to his/her interests for the contribution journey in the terasology project.</p>\n<p>Currently, there are a lot of modules in terasology and the documentation is distributed in forms of wikis, tutorials,forums, etc. and It is a bit Intimidating for a newbie (as a contributor or gamer) to understand the file structures &amp; workflow. So, I am targeting to remove this obstacle for new contributors by implementing an Interactive web experience as a <strong>Tutorial Journey</strong> with the help of vector graphics &amp; implement a system where all the steps &amp; documentations will integrate together to simplify the experience for the contributors as well as enthusiast gamers. It will be guiding the new contributor to reach the required resources in which they are interested. The end goal is to deploy a web app having a stepwise guide to follow for newbies.</p>\n",
          "difficulty": null,
          "id": "proj_the-terasology-found_2020_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5560977531076608/",
          "proposal_id": null,
          "short_description": "The journey of a contributor in open source projects is exciting, especially when the contributors can map their abilities with the workflow of the...",
          "slug": "interactive-journey-in-terasology-contributions",
          "status": "completed",
          "student_name": "Prathmesh Sahasrabhojane",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "ui"
          ],
          "title": "Interactive Journey in Terasology Contributions"
        },
        {
          "code_url": "https://medium.com/@vedant.294/gsoc-2020-genome-expansion-wrapping-up-87ab8fd3047b?sk=282a1a392b6a0b38e3948b46716a5ac1",
          "description": "<p>This project is a gameplay specific project which aims to bring additional elements of fun for the player base by forming a working genome module which can be used flexibly with modules like SimpleFarming, WildAnimals and any other modules which may be developed in the future which have the scope of expanding with genetics. A prime focus of this project would be to get the genetics module completely integrated with SimpleFarming and EdibleFlora so that plants can now be bred with genetics. Since this adds different traits to different varieties of plants or any entities that have genetics, it creates a fun and immersive experience for a player to find desirable varieties of the entities he needs to craft ideal food sources from superior ingredients. The project also aims to enhance certain gameplay elements like cooking, health, and thirst to work with genetics to provide a good point of interaction between the player and genomes.</p>\n",
          "difficulty": null,
          "id": "proj_the-terasology-found_2020_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/4718212236705792/",
          "proposal_id": null,
          "short_description": "This project is a gameplay specific project which aims to bring additional elements of fun for the player base by forming a working genome module...",
          "slug": "genome-expansion",
          "status": "completed",
          "student_name": "Vedant Shroff",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Genome Expansion"
        },
        {
          "code_url": "https://forum.terasology.org/threads/biome-specific-content-weekly-updates.2322/post-16881",
          "description": "<p>Currently in Terasology, changing biomes only serve as a change in background of the game.This project aims to change this and give some of these biomes some features of their own. This will be made possible by incorporating an element of body temperature in the game. The body temperature comes into play in the climatically extreme biomes namely- Desert and Snow.\nThe players will suffer some consequences should they choose to traverse these biomes without any preparation. To explore these biomes the player will have to look for ways to overcome these obstacles. However, these ways will not be present so readily. The players will have to look for these ways in other biomes. This will be made possible by some other enhancements in the form of additional items such as Wool Armor, Arabic Thawb, Water skins, Sand Slippers and an additional feature- hunting with traps. \nPlayers who are up to the challenge to explore the extreme biomes despite the obstacles  would have something to look forward to. Certain surprise structures namely Oasis for the Desert and Igloos for the Snow will be incorporated which would also be beneficial to the players in avoiding the extreme conditions.</p>\n",
          "difficulty": null,
          "id": "proj_the-terasology-found_2020_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/4895180290785280/",
          "proposal_id": null,
          "short_description": "Currently in Terasology, changing biomes only serve as a change in background of the game.This project aims to change this and give some of these...",
          "slug": "biome-specific-content-enhancements-for-terasology",
          "status": "completed",
          "student_name": "ktksan",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Biome-specific Content Enhancements for Terasology"
        },
        {
          "code_url": "http://destinationsol.org/2020/08/27/gsoc-wrap-up.html",
          "description": "<p>This project starts the transition of Destination: Sol systems from OOP design to Entity-Component-System architecture, using the new Gestalt library. The systems that will be converted will help for future changes as well.</p>\n",
          "difficulty": null,
          "id": "proj_the-terasology-found_2020_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/4915727984754688/",
          "proposal_id": null,
          "short_description": "This project starts the transition of Destination: Sol systems from OOP design to Entity-Component-System architecture, using the new Gestalt...",
          "slug": "converting-destination-sol-systems-to-use-ecs",
          "status": "completed",
          "student_name": "Isaac lichter",
          "student_profile": null,
          "tags": [],
          "title": "Converting Destination: Sol systems to use ECS"
        },
        {
          "code_url": "https://gist.github.com/stefaniamak/44ae4cb491d0bec61e77ab7cb513c721",
          "description": "<p>My vision is to make Terasology a more player-friendly game. I would like to guide the player through the basics of the game (by both modifying the HUD &amp; adding guidance through the Journal), for instance, showcase the available buttons there are to use and use the journal as a safe place for the player to go back to and get help or guidance. Furthermore, to that vision and stretched goal, I want to improve the launcher’s UI and make the navigation to it a bit more distinct, clean and game-like.</p>\n",
          "difficulty": null,
          "id": "proj_the-terasology-found_2020_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5930004543700992/",
          "proposal_id": null,
          "short_description": "My vision is to make Terasology a more player-friendly game. I would like to guide the player through the basics of the game (by both modifying the...",
          "slug": "terasology-game-hud-graphics-improvement-gameplay-guide",
          "status": "completed",
          "student_name": "Stefania Mak",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Terasology Game HUD,  Graphics improvement &  Gameplay Guide"
        },
        {
          "code_url": "https://docs.google.com/document/d/1zBGk21N2nD7kmrG8sMad-lbwR3HnfdZAbTIU-d9kc0E/edit?usp=sharing",
          "description": "<p>This project revolves around developing a mechanism allowing individual developers to reach out to Open-source organizations and pledge a research project directly within the donut platform from submitting a proposal within the donut platform all the way through to the completion of the project.</p>\n<p>When a developer or a certain user wants to suggest/propose an idea to an open-source\norganization it mostly ends up being communicated through IRC messages or other\ninformal ways. In most cases, their suggestions/proposals go unanswered or ignored\namong hundreds of messages in the IRC resulting in the original user getting frustrated.</p>\n<p>The issue here is that there is no clear cut procedure/pathway that a user can follow in\norder to propose a project to the upper echelons of an organization</p>\n<p>The project at its core focuses on eliminating that issue by providing the users with a\nbuilt-in platform with which the users can create, edit, communicate, publish and share the\nproposals directly with the organization all within a single platform.</p>\n",
          "difficulty": null,
          "id": "proj_the-terasology-found_2020_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5954050756968448/",
          "proposal_id": null,
          "short_description": "This project revolves around developing a mechanism allowing individual developers to reach out to Open-source organizations and pledge a research...",
          "slug": "codeuino-proposal-functionality-in-donut",
          "status": "completed",
          "student_name": "Asel Peiris",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "CODEUINO: Proposal Functionality in Donut"
        },
        {
          "code_url": "https://medium.com/codeuino/google-summer-of-code-2020-final-report-56ed6860a0f2",
          "description": "<p>This project is all about the development of <strong>Admin Management System</strong> for <strong>Donut</strong> platform which is an open-source Social Network Kit that aims to give the customized social network, social intranet or huge social enterprise application for any communities that really fits their needs.</p>\n<p>The <strong>main objective</strong> of the project  is:</p>\n<ol>\n<li>To make the donut-platform a <strong>customized social network</strong>, <strong>social intranet</strong> or <strong>huge social enterprise application</strong> for communities. So that will allow individuals or community <strong>admins/moderators</strong> to set-up the platform for themselves.</li>\n<li>To make it user-friendly and enhance the user experience.</li>\n</ol>\n",
          "difficulty": null,
          "id": "proj_the-terasology-found_2020_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5189667038691328/",
          "proposal_id": null,
          "short_description": "This project is all about the development of Admin Management System for Donut platform which is an open-source Social Network Kit that aims to give...",
          "slug": "codeuino-development-of-admin-management-mechanism-for-donut",
          "status": "completed",
          "student_name": "Rupesh Jha",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "CODEUINO: Development of Admin Management mechanism for DONUT"
        },
        {
          "code_url": "https://andytechguy.blogspot.com/2020/08/gsoc-2020-final-report.html",
          "description": "<p>The Metal Renegades module created last year is a great foundational implementation of the original game proposed on the forums. The focus was to create a strong technical backbone to build engaging gameplay. Now that the backbone has been created, the rather sparce &amp; plain world must be brought to life. The project accomplishes this in three ways:</p>\n<ol>\n<li>Creating compelling goals and tasks for the player to accomplish</li>\n<li>Embedding a unique personality into the world, through creating creative details for the player to experience.</li>\n<li>Fixing immersion-breaking issues remaining from last year, that may damper the player's experience.</li>\n</ol>\n",
          "difficulty": null,
          "id": "proj_the-terasology-found_2020_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2020/projects/5207344922755072/",
          "proposal_id": null,
          "short_description": "The Metal Renegades module created last year is a great foundational implementation of the original game proposed on the forums. The focus was to...",
          "slug": "metal-renegades-refining-gameplay",
          "status": "completed",
          "student_name": "AndyTechGuy",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Metal Renegades: Refining Gameplay"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2020/organizations/4504833932918784/"
    },
    "year_2021": {
      "num_projects": 4,
      "projects": [
        {
          "code_url": "https://destinationsol.org/2021/08/20/gsoc-project-summary.html",
          "description": "<p>This project will create a modular framework for world generation in Destination: Sol. This will allow more flexibility in the way the world can be generated. Instead of the current system which has very few options for world generation, this project will lay the foundation for a system which can support many options.</p>\n",
          "difficulty": null,
          "id": "proj_the-terasology-found_2021_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/5478260250509312/",
          "proposal_id": null,
          "short_description": "This project will create a modular framework for world generation in Destination: Sol. This will allow more flexibility in the way the world can be...",
          "slug": "destination-sol-world-gen-modularization",
          "status": "completed",
          "student_name": "Isaiah Blanks",
          "student_profile": null,
          "tags": [],
          "title": "Destination: Sol World-Gen Modularization"
        },
        {
          "code_url": "https://forum.terasology.org/threads/metal-renegades-terrain-generation-improvements.2350/#post-17190",
          "description": "<p>Metal Renegades is meant to feel like an immersive Old West-style world. Right now, it’s just a desert, with some mountains made out of sand. I propose to expand that with more interesting terrain typical of the Old West: mesas where rock around a plateau has eroded away, canyons where rivers have cut deep into the rock, mountains made of rock instead of sand, and more. Additionally, I plan to create a realistic distribution of flora and fauna.</p>\n",
          "difficulty": null,
          "id": "proj_the-terasology-found_2021_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6193515112955904/",
          "proposal_id": null,
          "short_description": "Metal Renegades is meant to feel like an immersive Old West-style world. Right now, it’s just a desert, with some mountains made out of sand. I...",
          "slug": "distinct-terrain-features-for-metal-renegades",
          "status": "completed",
          "student_name": "Lorxu",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Distinct Terrain Features for Metal Renegades"
        },
        {
          "code_url": "https://forum.terasology.org/threads/light-and-shadow-quality-improvements-for-light-shadow.2349/post-17189",
          "description": "<p>Light &amp; Shadow is an Alice in Wonderland themed gameplay mode which involves players working as two opposing teams to secure a flag from the enemy’s base and bring it back to their home base. The problem with the current implementation of Light &amp; Shadow is the lack of viable resources/weapons in the inventory of the player that can be used to prevent the advance of the enemy team. This makes the game a race for the flag rather than a battle for the flag which definitely sounds less interesting.\nThis project first focuses on stabilizing the current gameplay mode by fixing certain bugs and making a few improvements to the existing gameplay mechanisms and UI.  It then tackles the problem mentioned above by introducing currencies and improving the inventory a player spawns with to allow for more defensive structures to be built and additional weapons/traps to be used along with various effects to help change the pace of the game. In addition to this, the entire module which is split in two has to be merged, interaction with the external modules improved, unnecessary code removed and documentation added.</p>\n",
          "difficulty": null,
          "id": "proj_the-terasology-found_2021_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6260439561797632/",
          "proposal_id": null,
          "short_description": "Light & Shadow is an Alice in Wonderland themed gameplay mode which involves players working as two opposing teams to secure a flag from the enemy’s...",
          "slug": "quality-improvements-for-light-shadow",
          "status": "completed",
          "student_name": "Alluri Harshit Varma",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Quality Improvements for Light & Shadow"
        },
        {
          "code_url": "https://forum.terasology.org/threads/migrate-web-presence-to-new-module-site.2353/post-17187",
          "description": "<p>The project mainly concentrates on automating the module site for collecting information about modules from all over Terasology organization and display their generated information on the module site it also focuses on migrating the web presence and it will include working on frontend layout and improving the UX and UI of the module site.</p>\n",
          "difficulty": null,
          "id": "proj_the-terasology-found_2021_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2021/projects/6035505111629824/",
          "proposal_id": null,
          "short_description": "The project mainly concentrates on automating the module site for collecting information about modules from all over Terasology organization and...",
          "slug": "migrate-web-presence-to-new-module-site",
          "status": "completed",
          "student_name": "Yash Patel",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "ui",
            "ux",
            "frontend"
          ],
          "title": "Migrate Web Presence to new Module Site"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2021/organizations/4867306789797888/"
    },
    "year_2022": null,
    "year_2023": null,
    "year_2024": null,
    "year_2025": null
  },
  "first_time": false,
  "contact": {
    "email": "terasology@gmail.com",
    "guide_url": null,
    "ideas_url": null,
    "irc_channel": "https://discord.gg/terasology",
    "mailing_list": "https://forum.terasology.org/forum/"
  },
  "social": {
    "blog": "https://terasology.org/",
    "discord": "https://discord.gg/terasology",
    "facebook": null,
    "github": null,
    "gitlab": null,
    "instagram": null,
    "linkedin": null,
    "mastodon": null,
    "medium": null,
    "reddit": null,
    "slack": null,
    "stackoverflow": null,
    "twitch": null,
    "twitter": "https://twitter.com/Terasology/",
    "youtube": null
  },
  "meta": {
    "version": 1,
    "generated_at": "2026-01-25T15:28:54.397Z"
  }
}