{
  "id": "692251ec53dd9d7326d33ef3",
  "slug": "wso2",
  "name": "WSO2",
  "category": "Other",
  "description": "Comprehensive and open source middleware platform that spans the breadth of SOA",
  "image_url": "https://lh3.googleusercontent.com/1E8AX1katjzwQ4Lu7AQVzd-V2E0y-RWFm4ZR7_eS7yct9wEagNcya2aGsZMH4TOaD0RF75iKM3uom-4enwPlyCMQ_tOXgg",
  "img_r2_url": "https://pub-268c3a1efc8b4f8a99115507a760ca14.r2.dev/wso2.webp",
  "logo_r2_url": null,
  "url": "http://wso2.com/",
  "active_years": [
    2016,
    2017
  ],
  "first_year": 2016,
  "last_year": 2017,
  "is_currently_active": false,
  "technologies": [
    "java",
    "web services",
    "middleware",
    "soa",
    "distributed computing"
  ],
  "topics": [
    "security",
    "cloud",
    "micro services",
    "data analysis",
    "iot",
    "api management"
  ],
  "total_projects": 20,
  "stats": {
    "avg_projects_per_appeared_year": 10,
    "projects_by_year": {
      "year_2016": 11,
      "year_2017": 9,
      "year_2018": null,
      "year_2019": null,
      "year_2020": null,
      "year_2021": null,
      "year_2022": null,
      "year_2023": null,
      "year_2024": null,
      "year_2025": null
    },
    "students_by_year": {
      "year_2016": 11,
      "year_2017": 9,
      "year_2018": null,
      "year_2019": null,
      "year_2020": null,
      "year_2021": null,
      "year_2022": null,
      "year_2023": null,
      "year_2024": null,
      "year_2025": null
    },
    "total_students": 20
  },
  "years": {
    "year_2016": {
      "num_projects": 11,
      "projects": [
        {
          "code_url": "https://asanthamax.github.io/mongodbuserstore/",
          "description": "<p>WSO2 Identity Server is the first Identity Server Bus in the industry which is capable of managing multiple user identities among applications, APIs, cloud, mobile, etc. One of the main components of the WSO2 Identity Server is user stores. Currently WSO2 Identity Server supports user stores related to LDAP, Microsoft Active Directory and Relational Databases such as MySQL, SQL Server, DB2 etc. With the fast growth of enterprise adoption of NoSQL databases in industry, WSO2 Identity Server needs to be expanded to support NoSQL Databases. In this project I will be implementing a user store support for WSO2 Identity Server based on MongoDB which is one of the most popular NoSQL database in industry today.</p>\n",
          "difficulty": null,
          "id": "proj_wso2_2016_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/6699632243507200/",
          "proposal_id": null,
          "short_description": "WSO2 Identity Server is the first Identity Server Bus in the industry which is capable of managing multiple user identities among applications, APIs,...",
          "slug": "document-based-nosql-support-for-wso2-identity-server-database",
          "status": "completed",
          "student_name": "Asantha Thilina",
          "student_profile": null,
          "tags": [
            "mobile",
            "api",
            "ai",
            "database",
            "cloud"
          ],
          "title": "Document Based NoSQL Support for  WSO2 Identity Server Database"
        },
        {
          "code_url": "http://velozit.blogspot.com/2016/08/gsoc-2016-saml-assertion-queryrequest.html",
          "description": "<p>Security Assertion Markup Language (SAML) is an XML based security token which is used to exchange authentication and authorization data between two entities.  It is one of the most widely used open standards to perform brokered authentication and web browser based single-sign-on. \"Assertion Query/Request Profile\" defines a protocol for requesting dynamic or existing assertions by reference or by querying on the basis of a subject and additional statement-specific criteria. Assertion Query/Request Profile defines five major request/query message types which can be used to request assertions from SAML authority.</p>\n<ol>\n<li>AssertionIDRequest</li>\n<li>SubjectQuery</li>\n<li>AuthnQuery</li>\n<li>AttributeQuery</li>\n<li>AuthzDecisionQuery</li>\n</ol>\n",
          "difficulty": null,
          "id": "proj_wso2_2016_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/4965600132595712/",
          "proposal_id": null,
          "short_description": "Security Assertion Markup Language (SAML) is an XML based security token which is used to exchange authentication and authorization data between two...",
          "slug": "saml-assertion-queryrequest-profile-support-for-wso2-identity-server",
          "status": "completed",
          "student_name": "Gayan Liyanaarachchi",
          "student_profile": null,
          "tags": [
            "web",
            "ml"
          ],
          "title": "SAML Assertion Query/Request Profile support for WSO2 Identity Server"
        },
        {
          "code_url": "https://gist.github.com/heshanjse/25e727ce17e8b76619f70fbb91b4226f",
          "description": "<p>Business Process Model and Notation (BPMN) is a standard way of representing business processes in graphical representation.The purpose of this project is to implement Web based BPMN editor to construct business processes diagrams, which can be exported as a BPMN-2.0 compatible XML format . This BPMN diagrams can be built using components like tasks, events and gateways etc. Users can implement their BPMN diagrams by dragging, dropping, positioning, resizing, deleting and adding more details to the attributes. Constructed BPMN diagrams can be then exported as png/jpeg or a process definition XML file(BPMN 2.0 standard).BPMN editor also supports the inverted process, which is uploading of a standard BPMN model in XML format to generate a  BPMN process diagrams.</p>\n<p>This piece of software has the capability to build complete Business process diagrams and is also extensible to allow the construction of flow charts, chevron charts and other graph-based diagrams.</p>\n",
          "difficulty": null,
          "id": "proj_wso2_2016_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5551141345558528/",
          "proposal_id": null,
          "short_description": "Business Process Model and Notation (BPMN) is a standard way of representing business processes in graphical representation.The purpose of this...",
          "slug": "web-javascript-d3-based-bpmn-editor-to-support-a-subset-of-commonly-used-bpmn-constructs",
          "status": "completed",
          "student_name": "Heshan Jayasinghe",
          "student_profile": null,
          "tags": [
            "java",
            "javascript",
            "web",
            "ml",
            "ai"
          ],
          "title": "Web (Javascript / D3) based BPMN editor to support a subset of commonly used BPMN constructs"
        },
        {
          "code_url": "https://dananjayamahesh.github.io/",
          "description": "<p>Machine Learning algorithms for data analysis makes new areas such as Big Data analysis. Emerging data analysis with the streaming data is one of the most paramount areas that will be pioneered the businesses in the future.  WSO2 ML (Machine Learner) is one of the main platforms which building some intelligent and predictive data analysis based on the machine learning algorithms to support modern data transactions. Even though they have ML which is build upon the well known Apache Spark MLLib, WSO2 ML still could not support  streaming data. Even though the Spark MLLib has streaming support for k mean clustering and generalized linear regression  (GLR) , it developed with a Scala API. Purpose of this project is to develop a Java API to support streaming k mean clustering and GLR with the mini batch sampling techniques to support streaming data without using Spark streaming. Therefore design include a way to acquire streaming data and break those data streams into mini batches which can be used this batches to retrain the models periodically with some optimization techniques such as Stochastic gradient descent algorithms.</p>\n",
          "difficulty": null,
          "id": "proj_wso2_2016_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5573732336664576/",
          "proposal_id": null,
          "short_description": "Machine Learning algorithms for data analysis makes new areas such as Big Data analysis. Emerging data analysis with the streaming data is one of the...",
          "slug": "predictive-analytics-with-online-data-for-wso2-machine-learner",
          "status": "completed",
          "student_name": "mahesh dananjaya",
          "student_profile": null,
          "tags": [
            "java",
            "api",
            "ml",
            "ai",
            "ui"
          ],
          "title": "PREDICTIVE ANALYTICS WITH ONLINE DATA FOR WSO2 MACHINE LEARNER"
        },
        {
          "code_url": "https://github.com/abhishek0198/wso2dockerfiles-test-framework/commits/master",
          "description": "<p>WSO2 Dockerfiles project contains the Dockerfiles for all the WSO2 products and allows users to build and run Docker images of these products. The Dockerfiles for all the WSO2 products follow a standard structure and can also be customized to cater to specific requirements from various WSO2 projects. The WSO2 Dockerfiles project is still under development; changes are constantly being applied to the codebase by multiple developers of WSO2 community. In order to ensure the availability and robustness of WSO Dockerfiles, we propose to design and implement a general purpose integration test framework for Dockerfiles, which provides features to write and execute integration tests in an effective manner.</p>\n<p>Developers will also be able to locally execute all the tests in the integration test suite in order to ensure that their latest change did not break any existing functionalities and there are no regressions. The integration test suite should also be extensible to work in conjunction with continuous integration tools (eg Jenkins), where these tests will be executed as a result of a recent check-in or pull request.</p>\n",
          "difficulty": null,
          "id": "proj_wso2_2016_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/4811368393867264/",
          "proposal_id": null,
          "short_description": "WSO2 Dockerfiles project contains the Dockerfiles for all the WSO2 products and allows users to build and run Docker images of these products. The...",
          "slug": "integration-test-framework-for-wso2-dockerfiles",
          "status": "completed",
          "student_name": "Abhishek Tiwari",
          "student_profile": null,
          "tags": [
            "ai",
            "docker",
            "ui"
          ],
          "title": "Integration Test Framework for WSO2 Dockerfiles"
        },
        {
          "code_url": "http://dinanjanagunaratne.blogspot.com/2016/08/during-past-3-months-i-was-engaged-in.html",
          "description": "<p>WSO2 Enterprise Service Bus is a lightweight, high performance, and comprehensive ESB. The WSO2 ESB effectively addresses integration standards and supports all integration patterns, enabling interoperability among various heterogeneous systems and business applications.\nWhen ESB crashes, to investigate the reason developers may want to get several details from the server instance. Currently developers required to perform above task manually. It can lead to complications and sometimes developers may not get their hands on relevant details.The JVM can be monitored through JMC or JConsole. But this is not a sophisticated solution for the ESB. In this project we are developing a stand alone tool to monitor and report such catastrophic event of a WSO2 ESB</p>\n",
          "difficulty": null,
          "id": "proj_wso2_2016_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/6479129159401472/",
          "proposal_id": null,
          "short_description": "WSO2 Enterprise Service Bus is a lightweight, high performance, and comprehensive ESB. The WSO2 ESB effectively addresses integration standards and...",
          "slug": "improve-production-system-debugging-capabilities-of-wso2-esb-esb-flight-recorder",
          "status": "completed",
          "student_name": "Dinanjana",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Improve production system debugging capabilities of WSO2 ESB (ESB Flight Recorder)"
        },
        {
          "code_url": "https://lakini.github.io/carbon-ml/",
          "description": "<p>From Visual(Deep) Neural Network Builder, users can drag and drop layers and other computational units and they can create neural networks as they wish. They can test,train the networks and this builder will be integrating with WSO2 Machine Learner.This will be the front end for the WSO2 Machine Learner.</p>\n",
          "difficulty": null,
          "id": "proj_wso2_2016_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/6077824863567872/",
          "proposal_id": null,
          "short_description": "From Visual(Deep) Neural Network Builder, users can drag and drop layers and other computational units and they can create neural networks as they...",
          "slug": "mlvisualdeep-neural-network-builder",
          "status": "completed",
          "student_name": "Lakini Senanayaka",
          "student_profile": null,
          "tags": [
            "ml",
            "ai",
            "ui"
          ],
          "title": "[ML]Visual(Deep) Neural Network Builder"
        },
        {
          "code_url": "http://manzzup.blogspot.com/2016/08/gsoc-2016-rest-implementation-for-wso2.html",
          "description": "<p>The Identity Server currently supports SOAP as the service medium in between its PDP (Policy Decision point) and any PEP (Policy Enforcement Point) accessing it. Authorization requests from PEP should be sent to PDP to be evaluated through a SOAP service. In the scope of the project, a RESTful service is implemented along with the SOAP service.</p>\n",
          "difficulty": "medium",
          "id": "proj_wso2_2016_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/6112004750180352/",
          "proposal_id": null,
          "short_description": "The Identity Server currently supports SOAP as the service medium in between its PDP (Policy Decision point) and any PEP (Policy Enforcement Point)...",
          "slug": "restful-fine-grained-authorization-as-a-service-azaas-for-the-wso2-identity-server",
          "status": "completed",
          "student_name": "Manujith",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "RESTful Fine Grained Authorization-as-a-Service (AZaaS)  for the WSO2 Identity Server"
        },
        {
          "code_url": "http://nathiesha.blogspot.com/2016/08/contact-development-team-feature-in.html",
          "description": "<p>Currently Developer Studio users contact the development team via wso2 web support portal (Jira), so the\nusers have to put additional effort to send error logs, metadata etc. The project goal is to develop a new plugin for users to be able to contact development team within the IDE\nitself. This plugin can be used to capture and report errors to Development team (WSO2).</p>\n",
          "difficulty": null,
          "id": "proj_wso2_2016_009",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/4942423683760128/",
          "proposal_id": null,
          "short_description": "Currently Developer Studio users contact the development team via wso2 web support portal (Jira), so the\nusers have to put additional effort to send...",
          "slug": "contact-development-team-feature-in-devstudio",
          "status": "completed",
          "student_name": "Nathiesha",
          "student_profile": null,
          "tags": [
            "web"
          ],
          "title": "Contact Development Team feature in DevStudio"
        },
        {
          "code_url": "https://venkat2811.blogspot.in/2016/08/http-load-balancer-on-top-of-wso2.html",
          "description": "<p>HTTP Load balancer is a software application capable of distributing HTTP traffic to backend servers according to the specified scheduling policy.</p>\n<p>WSO2 Gateway is a high performance, lightweight, low-latency messaging gateway based on standard gateway pattern. Its Netty based non-blocking IO and Disruptor (ringbuffer) architecture makes it the fastest open-source gateway available.  Benchmarks shows that the performance of gateway is very high when compared to other solutions and is close to the direct netty based backend (without any intermediate gateway).</p>\n<p>The following features will be implemented:</p>\n<ul>\n<li>Support for different Load Balancing Algorithms</li>\n<li>Full Compliance with HTTP specification</li>\n<li>Support for SSL </li>\n<li>Session Persistence</li>\n<li>Health Checking and Redirection</li>\n</ul>\n<p>This Load Balancer will a pluggable component.  It will be able to achieve even load distribution through highly efficient, lightweight and low latency messaging. Thus, the performance will also be able to compete with existing load balancers.</p>\n",
          "difficulty": "medium",
          "id": "proj_wso2_2016_010",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5891422477615104/",
          "proposal_id": null,
          "short_description": "HTTP Load balancer is a software application capable of distributing HTTP traffic to backend servers according to the specified scheduling policy....",
          "slug": "http-load-balancer-on-top-of-wso2-gateway",
          "status": "completed",
          "student_name": "Venkat",
          "student_profile": null,
          "tags": [
            "ai",
            "backend"
          ],
          "title": "HTTP Load Balancer On Top Of WSO2 Gateway"
        },
        {
          "code_url": "https://docs.google.com/document/d/1bpTMiSciOqt7vfDgYglSBQucQReDs-btEa5xFjBZkDU/edit?usp=sharing",
          "description": "<p>Ensemble methods combine predictions of base models in order to improve performance or generalizability over a single model. To this end, there are many approaches that either use averaging or voting over base model predictions.\nThe main objective is to integrate ensemble support for the existing flow of the WSO2 Machine Learner.\nImplementation will include following tasks:\nImplement an ensemble method(s), to combine multiple algorithms (particularly Stacking, Boosting and Bagging)\nCreate a UI to include the end to end flow of training the algorithm.\nIntegrate it to the WSO2 Machine Learner.</p>\n",
          "difficulty": null,
          "id": "proj_wso2_2016_011",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2016/projects/5221888615776256/",
          "proposal_id": null,
          "short_description": "Ensemble methods combine predictions of base models in order to improve performance or generalizability over a single model. To this end, there are...",
          "slug": "ensemble-methods-support-for-wso2-machine-learner",
          "status": "completed",
          "student_name": "Misgana",
          "student_profile": null,
          "tags": [
            "ai",
            "ui"
          ],
          "title": "Ensemble Methods Support for WSO2 Machine Learner"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2016/organizations/5243158099132416/"
    },
    "year_2017": {
      "num_projects": 9,
      "projects": [
        {
          "code_url": "https://gist.github.com/hasithajayasundara/c73bc15a522f2e0059aa1f6254c964c1",
          "description": "<p>Currently with WSO2 Enterprise Service Bus recommended way to connect to IBM MQ is using JMS transport. But this has limitations and sometimes gives issues when integrating.Identifying limitations and provide a better solution is part of this project.</p>\n",
          "difficulty": null,
          "id": "proj_wso2_2017_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6370003167215616/",
          "proposal_id": null,
          "short_description": "Currently with WSO2 Enterprise Service Bus recommended way to connect to IBM MQ is using JMS transport. But this has limitations and sometimes gives...",
          "slug": "native-inbound-and-connector-for-ibm-mq-80",
          "status": "completed",
          "student_name": "Hasitha Jayasundara",
          "student_profile": null,
          "tags": [],
          "title": "Native inbound and connector for IBM MQ 8.0"
        },
        {
          "code_url": "https://medium.com/@lgobinath/gsoc-siddhi-pattern-to-detect-absence-of-events-8b267bd173fe",
          "description": "<p>Siddhi provides an elegant solution to detect patterns among the events that happened. However, it cannot identify the absence of events using the pattern implementation. Instead, an alternative solution using Windows is suggested in the official document which is more complex than the regular patterns and less memory efficient when it comes to one-time pattern detection. The solution I propose here provides a native implementation for patterns to identify the events that do not arrive.</p>\n",
          "difficulty": "advanced",
          "id": "proj_wso2_2017_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5690015891849216/",
          "proposal_id": null,
          "short_description": "Siddhi provides an elegant solution to detect patterns among the events that happened. However, it cannot identify the absence of events using the...",
          "slug": "non-occurrence-of-events-for-siddhi-patterns",
          "status": "completed",
          "student_name": "Gobinath Loganathan",
          "student_profile": null,
          "tags": [],
          "title": "Non-Occurrence of Events for Siddhi Patterns"
        },
        {
          "code_url": "https://medium.com/@abilashini/oauth-2-0-dcrm-protocol-support-for-wso2-identity-server-gsoc-2017-96b89fbfc74b",
          "description": "<p>OAuth 2.0 Dynamic Client Registration Management Protocol specification defines  a set of rules to manage the OAuth 2.0 Dynamic Client Registration which is already supported by the WSO2 IS. OAuth 2.0 Dynamic Client Registration Protocol describes how a client dynamically registered in the authorization server. But there can be situations where client needs to modify the registered data or check the current registration data or delete the data from the authorization server. So OAuth 2.0 Dynamic Client Registration Management Protocol came up with methods to enable the above functionalities. The primary scope of this project is to implement the OAuth 2.0 Dynamic Client Registration Management Protocol in the WSO2 Identity Server.</p>\n",
          "difficulty": null,
          "id": "proj_wso2_2017_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/4557915662843904/",
          "proposal_id": null,
          "short_description": "OAuth 2.0 Dynamic Client Registration Management Protocol specification defines  a set of rules to manage the OAuth 2.0 Dynamic Client Registration...",
          "slug": "oauth-20-dynamic-client-registration-management-protocol-support-for-wso2-identity-server",
          "status": "completed",
          "student_name": "Abilashini Thiyagarajah",
          "student_profile": null,
          "tags": [],
          "title": "OAuth 2.0 Dynamic Client Registration Management Protocol support for WSO2 Identity Server"
        },
        {
          "code_url": "https://medium.com/@vindulajayawardana/scim-2-0-compliance-test-suite-737fd4ace3cc",
          "description": "<p>The proposal is on implementing the SCIM 2.0 compliance test suite which can be run on both the cloud and on premise by eliminating the limitations that can be seen in SCIM 1.1 compliance test suite. In the proposed test suite, it is expected to validate the supportability of a provided service provider, in terms of the SCIM 2.0 core specification and protocol specification.</p>\n<p>The test suite should be able to generate a detailed analysis view and comprehensive report upon providing the server’s SCIM endpoint. The report should include the test results indicating the coverage percentage of each specification and a detailed view of the results of each test including requests sent by the test suite, expected response and the server response along with the indication whether a particular test is passed or not.</p>\n<p>Apart from that the test suite should be run against WSO2 Identity Server to identify any gaps between the SCIM 2.0 specifications and Identity Server and provide improvements to the product.</p>\n",
          "difficulty": null,
          "id": "proj_wso2_2017_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/4713460856258560/",
          "proposal_id": null,
          "short_description": "The proposal is on implementing the SCIM 2.0 compliance test suite which can be run on both the cloud and on premise by eliminating the limitations...",
          "slug": "scim-20-compliance-test-suite",
          "status": "completed",
          "student_name": "Vindula Jayawardana",
          "student_profile": null,
          "tags": [
            "ai",
            "cloud",
            "ui"
          ],
          "title": "SCIM 2.0 Compliance Test Suite"
        },
        {
          "code_url": "https://github.com/IsurangaPerera/identity-inbound-auth-sts",
          "description": "<p>WS-Trust is a WS-* specification that provides extensions to the WS-Security specification. WS-Security provides the basic framework for message level security in web services. WS-Trust builds on that base to specify a framework for broker trust across different security domains. It specifically deals with the issuing, renewing, and validating of security tokens, as well as with ways to establish, assess the presence of, and broker trust relationships between participants in a secure message exchange.\nThis project focuses on implementing the WS-Trust specification for the WSO2 Identity Server 6.0.0 by simply integrating with Apache CXF.</p>\n",
          "difficulty": null,
          "id": "proj_wso2_2017_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/6040323088187392/",
          "proposal_id": null,
          "short_description": "WS-Trust is a WS-* specification that provides extensions to the WS-Security specification. WS-Security provides the basic framework for message...",
          "slug": "is-ws-trust-implementation-for-is-600-using-apache-cxf-library",
          "status": "completed",
          "student_name": "Isuranga Perera",
          "student_profile": null,
          "tags": [
            "web",
            "ai",
            "ui"
          ],
          "title": "[IS] WS-Trust Implementation for IS 6.0.0 using Apache CXF Library"
        },
        {
          "code_url": "https://medium.com/@sewwandikaus.13/gsoc-2017-eclipse-plugin-for-siddhi-documentation-c4d82e8089cb",
          "description": "<p>WSO2 Complex Event Processor(WSO2 CEP) is real-time  and it has a quick response time in identifying patterns in incoming stream of events/large data feeds with minimum storage.  WSO2 CEP is popular among community since it’s simple and easy to use as well as since it is free and open source. The core of WSO2 CEP is Siddhi which is a SQL-like query language that is used for complex queries.  An Eclipse plugin for Siddhi is a valuable approach for the developer community since eclipse IDE is a widely used IDE among developers. Eclipse plugin for Siddhi will comprise syntax highlighting, auto completion, error reporting, running and debugging support for Siddhi based on Siddhi grammar using Xtext and Java.</p>\n",
          "difficulty": "beginner",
          "id": "proj_wso2_2017_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5862266360561664/",
          "proposal_id": null,
          "short_description": "WSO2 Complex Event Processor(WSO2 CEP) is real-time  and it has a quick response time in identifying patterns in incoming stream of events/large data...",
          "slug": "eclipse-plugin-for-siddhi",
          "status": "completed",
          "student_name": "Udeshika Sewwandi",
          "student_profile": null,
          "tags": [
            "java",
            "ui"
          ],
          "title": "Eclipse plugin for Siddhi"
        },
        {
          "code_url": "https://gist.github.com/nadundesilva/abeac5279468c8c5f37fbd0f8c2d2091",
          "description": "<p>This project consists of two main parts of the automated generation of documentation for Siddhi Complex Event Processing Engine.</p>\n<ol>\n<li>a maven plugin for automated documentation generation for a single extension module or the siddhi core. The metadata annotated using the @Extension annotation are retrieved using the ClassIndex library which is already used by siddhi for indexing the annotated processor classes. Afterwards, documentation is generated using the metadata using a template engine.</li>\n<li>Creating an index of the Siddhi Extension Repositories.</li>\n<li>Adding and committing the <code>docs/</code> directory content and the <code>mkdocs.yml</code> file to Git. Pushing the changes in the <code>docs/</code> directory content and the <code>mkdocs.yml</code> file to <code>origin master</code>. Automatically deploying documentation in each new release of Siddhi.</li>\n</ol>\n",
          "difficulty": "advanced",
          "id": "proj_wso2_2017_007",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5957128497922048/",
          "proposal_id": null,
          "short_description": "This project consists of two main parts of the automated generation of documentation for Siddhi Complex Event Processing Engine.\n\na maven plugin for...",
          "slug": "siddhi-extension-doc-auto-generation",
          "status": "completed",
          "student_name": "Nadun De Silva",
          "student_profile": null,
          "tags": [
            "ml",
            "ai"
          ],
          "title": "Siddhi Extension Doc Auto Generation"
        },
        {
          "code_url": "https://gist.github.com/madhawav/195b7dc601d94c40958d88be1d56e705",
          "description": "<p>The scope of this project is to develop a <strong>Python API for Siddhi CEP Java Library</strong>. Additionally, the developed Python API would be able to directly interact with WSO2 Data Analytics Server through REST API in order to simulate events and manage Siddhi Apps.</p>\n<ul>\n<li>A Python API for Siddhi CEP would allow rapid prototyping, letting users realize the power of Siddhi with less time and effort. </li>\n<li>Advent of Python would make Siddhi CEP an attractive tool for Machine Learning and Scientific Research. </li>\n<li>Interfacing with WSO2 Analytics Platform would allow users of WSO2 Analytics platform to model portions of their problems using Python Scripts. </li>\n<li>Python API would allow automated re-configuration of Siddhi Apps in WSO2 DAS using Python Scripts.</li>\n</ul>\n<p>The proposed solution would be compatible with Python 2.7 and 3.x. It would be ready for easy deployment via PyPI by the end of GSoC Coding Period.</p>\n",
          "difficulty": "beginner",
          "id": "proj_wso2_2017_008",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5985493804122112/",
          "proposal_id": null,
          "short_description": "The scope of this project is to develop a Python API for Siddhi CEP Java Library. Additionally, the developed Python API would be able to directly...",
          "slug": "python-api-for-siddhi-cep",
          "status": "completed",
          "student_name": "Madhawa Vidanapathirana",
          "student_profile": null,
          "tags": [
            "python",
            "java",
            "api"
          ],
          "title": "Python API for Siddhi CEP"
        },
        {
          "code_url": "http://ravindublog.tk/gsoc-2017-environment-support-for-wso2-api-manager/",
          "description": "<p>Building capability in the user interfaces of WSO2 API Manager version 3.0.0 (SNAPSHOT version as of now) to switch between different environments for performing user operations.</p>\n",
          "difficulty": null,
          "id": "proj_wso2_2017_009",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2017/projects/5145140502986752/",
          "proposal_id": null,
          "short_description": "Building capability in the user interfaces of WSO2 API Manager version 3.0.0 (SNAPSHOT version as of now) to switch between different environments...",
          "slug": "environment-support-for-api-manager",
          "status": "completed",
          "student_name": "Ravindu Perera",
          "student_profile": null,
          "tags": [
            "api",
            "ui"
          ],
          "title": "Environment Support for API Manager"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2017/organizations/6070843662663680/"
    },
    "year_2018": null,
    "year_2019": null,
    "year_2020": null,
    "year_2021": null,
    "year_2022": null,
    "year_2023": null,
    "year_2024": null,
    "year_2025": null
  },
  "first_time": false,
  "contact": {
    "email": "discuss-oss@wso2.org",
    "guide_url": null,
    "ideas_url": null,
    "irc_channel": "https://freenode.net/",
    "mailing_list": "http://wso2.com/mail/"
  },
  "social": {
    "blog": "http://wso2.com/blogs/thesource/",
    "discord": null,
    "facebook": null,
    "github": null,
    "gitlab": null,
    "instagram": null,
    "linkedin": null,
    "mastodon": null,
    "medium": null,
    "reddit": null,
    "slack": null,
    "stackoverflow": null,
    "twitch": null,
    "twitter": "https://twitter.com/wso2",
    "youtube": null
  },
  "meta": {
    "version": 1,
    "generated_at": "2026-01-25T15:28:54.437Z"
  }
}