{
  "id": "692251ed53dd9d7326d33f03",
  "slug": "zendalona",
  "name": "Zendalona",
  "category": "End user applications",
  "description": "FOSS accessibility solutions for visually impaired",
  "image_url": "https://summerofcode.withgoogle.com/media/org/zendalona/tqduj6nsxnnw3vpy-360.png",
  "img_r2_url": "https://pub-268c3a1efc8b4f8a99115507a760ca14.r2.dev/zendalona.webp",
  "logo_r2_url": null,
  "url": "https://zendalona.com/",
  "active_years": [
    2024,
    2025
  ],
  "first_year": 2024,
  "last_year": 2025,
  "is_currently_active": true,
  "technologies": [
    "python",
    "javascript",
    "android",
    "gtk",
    "qt"
  ],
  "topics": [
    "web",
    "accessibility",
    "braille",
    "gaming",
    "AGI"
  ],
  "total_projects": 10,
  "stats": {
    "avg_projects_per_appeared_year": 5,
    "projects_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": null,
      "year_2019": null,
      "year_2020": null,
      "year_2021": null,
      "year_2022": null,
      "year_2023": null,
      "year_2024": 4,
      "year_2025": 6
    },
    "students_by_year": {
      "year_2016": null,
      "year_2017": null,
      "year_2018": null,
      "year_2019": null,
      "year_2020": null,
      "year_2021": null,
      "year_2022": null,
      "year_2023": null,
      "year_2024": 4,
      "year_2025": 6
    },
    "total_students": 10
  },
  "years": {
    "year_2016": null,
    "year_2017": null,
    "year_2018": null,
    "year_2019": null,
    "year_2020": null,
    "year_2021": null,
    "year_2022": null,
    "year_2023": null,
    "year_2024": {
      "num_projects": 4,
      "projects": [
        {
          "code_url": "https://github.com/ayush27prasad/MathMantra-v1",
          "description": "The proposal aims to develop an innovative, accessible mobile application to address the specific challenges faced by visually impaired students in their learning process. The app goes beyond traditional resources by utilising sound, touch, device sensors, and interactive elements to create a multi-sensory learning experience. This approach aims to improve engagement, understanding, and retention of key mathematical concepts. \nThe proposal highlights my strong interest in accessibility software solutions, a relevant background in Android development, and a desire to use technology to make a positive social impact. Through my research, I have demonstrated the use of existing accessibility tools and outlined a comprehensive project plan that includes:\n1.)Interactive modules: Lessons on basic arithmetic, cardinal directions, trigonometry, geometry, metric systems, and more. The modules thoughtfully leverage device features like magnetometers, gyroscopes, and accelerometers.\n2.)Story-based learning: A story mode with auto-generated MCQs potentially using TensorFlow Lite for comprehension and assessment.\n3.)Accessibility focus: Thorough consideration of screen reader compatibility, audio and haptic feedback, and support for Braille displays and switch access.\n4.)Iterative development: A detailed timeline with a community bonding period, regular milestones, testing, and a phase for incorporating user feedback.\nThe idea of this proposal aligns closely with Zendalona's mission.",
          "difficulty": null,
          "id": "proj_zendalona_2024_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/dNOYctqw/",
          "proposal_id": null,
          "short_description": "The proposal aims to develop an innovative, accessible mobile application to address the specific challenges faced by visually impaired students in...",
          "slug": "zenmatics",
          "status": "completed",
          "student_name": "Ayush Prasad",
          "student_profile": null,
          "tags": [
            "android",
            "mobile",
            "ai"
          ],
          "title": "ZenMatics"
        },
        {
          "code_url": "https://docs.google.com/document/d/14eOcAiAV1u7L2UIBHnunXJiAsYKZZBGZ/edit#heading=h.gjdgxs",
          "description": "I propose to update the Math-Tutor App by leveraging Qt to design a more modern\r\nand elegant interface which would result in a heightened user experience and greater\r\nadoption over time. Specifically, I plan to implement multiple features into the Math Tutor\r\nApp which has been requested by Zendalona. This includes the addition of options to\r\nwiden the subjects that are currently supported, a more personalized software which\r\nstores and reflects the scores and progress of each user and an app that’s more accessible\r\nto the end-user.",
          "difficulty": null,
          "id": "proj_zendalona_2024_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/Q0ctBiAh/",
          "proposal_id": null,
          "short_description": "I propose to update the Math-Tutor App by leveraging Qt to design a more modern and elegant interface which would result in a heightened user...",
          "slug": "maths-tutor-qt-version-and-enhancement",
          "status": "completed",
          "student_name": "Ronak kumbhat",
          "student_profile": null,
          "tags": [],
          "title": "Maths-Tutor QT Version and Enhancement"
        },
        {
          "code_url": "https://blog.animaregem.me/posts/the-gsoc-summary/",
          "description": "The project aims to enhance the open-source ticketing system Trudesk by integrating critical accessibility features and advanced functionalities. The primary goal is to make Trudesk more inclusive and efficient for all users, including those with disabilities.\n\nThe main problems addressed are:\n1. Lack of accessibility in existing ticketing systems, making them difficult to use for people with disabilities.\n2. Inefficient ticket management due to manual tagging and sorting processes.\n3. Absence of community support features like public forums.\n4. Inflexibility to cater to organization-specific needs.\n\nTo solve these problems, the project proposes the following solutions:\n\n1. Accessibility Enhancements: Optimize Trudesk for screen readers and assistive technologies, ensuring full accessibility for users with disabilities.\n\n2. Advanced Functionalities: Implement auto-tagging, auto-categorization, and voice input capabilities to streamline ticket management.\n\n3. Public Forums Integration: Create public forums within Trudesk, enabling users to collaborate and share knowledge.\n\n4. Organization-Specific Enhancements: Develop automatic documentation suggestions and customizable knowledge bases tailored to frequent queries.\n\nThe key deliverables of the project include:\n\n- Accessibility patches for Trudesk to ensure compliance with accessibility standards.\n- Public question polling interface and public forums for community engagement.\n- Efficient question searching, answer polling, and thread merging features.\n- Knowledge base creation and FAQ generation based on user queries.\n- Document suggestion system and voice-based query creation (stretch goal).\n- Integration of private ticket tracking and public forums.\n- Comprehensive testing and documentation.",
          "difficulty": "advanced",
          "id": "proj_zendalona_2024_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/IMXwpDEG/",
          "proposal_id": null,
          "short_description": "The project aims to enhance the open-source ticketing system Trudesk by integrating critical accessibility features and advanced functionalities. The...",
          "slug": "user-query-management-software",
          "status": "completed",
          "student_name": "Anima Regem",
          "student_profile": null,
          "tags": [
            "ml",
            "ai"
          ],
          "title": "User Query Management Software"
        },
        {
          "code_url": "https://github.com/jriyyya/liblouis-table-editor",
          "description": "Aim to develop a GUI application for the task of table creation and editing of Liblouis tables. This task is currently tedious and time consuming and a GUI application will streamline this task. \nThe application will include features like but not limited to:\n1) Displaying characters with Unicode Code Points,\n2) Braille Editor,\n3) Dropdown Menu for Opcodes Selection,\n4) Operand Insertion with Validity Checks,\n5) Forward and Back-Translation Testing,\n6) Modification of Unicode Character Equivalents,\n7) Duplicate Entry Indicators,\n8) Accessibility for Visually Challenged Individuals,\n9) Adding a color configuration method.\n\nIf time permits, I will also create a Webapp for this application for more ease.",
          "difficulty": null,
          "id": "proj_zendalona_2024_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/archive/2024/projects/nk99BJtU/",
          "proposal_id": null,
          "short_description": "Aim to develop a GUI application for the task of table creation and editing of Liblouis tables. This task is currently tedious and time consuming and...",
          "slug": "liblouis-table-editor",
          "status": "completed",
          "student_name": "Jriyyya",
          "student_profile": null,
          "tags": [
            "web",
            "ml",
            "ai",
            "ui"
          ],
          "title": "Liblouis table editor"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/archive/2024/organizations/zendalona/"
    },
    "year_2025": {
      "num_projects": 6,
      "projects": [
        {
          "code_url": null,
          "description": "This project aims to make the Ubuntu Desktop Provision installer fully accessible to visually impaired users by addressing key accessibility issues in its Flutter-based interface. Currently, the installer lacks proper screen reader support, suffers from poor keyboard navigation, and fails to provide audio feedback, making it unusable for blind and low-vision users, especially those relying on Accessible-Coconut, a Ubuntu-based distribution developed by Zendalona.\n\nThe solution involves fixing both architectural and UI-level problems in how Flutter components interact with Linux accessibility frameworks (AT-SPI). It will include:\n- Implementing semantic accessibility wrappers\n- Ensuring proper focus and navigation flow\n- Enhancing screen reader feedback using Orca\n- Improving the accessibility of complex UI components, such as partitioning\n- Conducting extensive user testing and providing detailed documentation\n\nDeliverables\n- A fully accessible Ubuntu installer with complete screen reader compatibility\n- Keyboard-navigable UI with audio cues and meaningful semantic labels\n- Documentation and developer guidelines for future accessibility improvements\n- Tested integration with Accessible-Coconut 24.04\n\nThis project will enable independent system installation for visually impaired users and contribute long-term value to Flutter-Linux accessibility efforts and the broader open-source community.",
          "difficulty": "advanced",
          "id": "proj_zendalona_2025_001",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/WRFeuRPW",
          "proposal_id": "DQwExLHp",
          "short_description": "This project aims to make the Ubuntu Desktop Provision installer fully accessible to visually impaired users by addressing key accessibility issues...",
          "slug": "accessibility-in-the-ubuntu-installer-for-visually-impaired-users-support-accessible-coconut-2404",
          "status": "in-progress",
          "student_name": "Akshay Waghmare",
          "student_profile": null,
          "tags": [
            "ai",
            "ui",
            "ux"
          ],
          "title": "Accessibility in the Ubuntu Installer for Visually Impaired Users - Support Accessible-Coconut 24.04"
        },
        {
          "code_url": null,
          "description": "I will build an accessible AI support agent for Zendalona product.. This project addresses a critical gap in accessibility support by creating a conversational interface that seamlessly accepts both voice and text input, allowing users to interact naturally with Zendalona's product ecosystem.\nThe technical architecture employs an Agentic Retrieval-Augmented Generation (RAG) approach using LlamaIndex. This system will methodically index all Zendalona product information, documentation, and support materials in a vector database (ChromaDB or FAISS). When users submit queries, the system retrieves contextually relevant information and passes it to a large language model alongside the query, enabling precise, helpful responses based on accurate product knowledge.\nThe implementation follows a three-tier approach: First, a comprehensive data ingestion pipeline that processes, cleans, and vectorizes Zendalona's product information. Second, a robust Python backend built with FastAPI that handles query processing, context retrieval, and response generation through integration with STT/TTS services and LLM APIs. Third, a fully accessible React-based multimodal chat interface featuring high-contrast text, complete keyboard navigation, ARIA attributes, and seamless screen reader compatibility, particularly with Orca.\nKey deliverables include a modular, containerized system with separate frontend and backend Docker containers orchestrated via Docker Compose, comprehensive API documentation, extensive accessibility testing results, and detailed user guides. The solution prioritizes WCAG 2.2 compliance, minimal latency, data privacy, and security throughout the architecture. The final product will provide visually impaired users with an intuitive, conversational way to access product support that works effectively with their existing assistive technologies.",
          "difficulty": null,
          "id": "proj_zendalona_2025_002",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/GMl3b6RZ",
          "proposal_id": "3wfUCgu7",
          "short_description": "I will build an accessible AI support agent for Zendalona product.. This project addresses a critical gap in accessibility support by creating a...",
          "slug": "ai-powered-agent-to-provide-support-for-zendalona-products",
          "status": "in-progress",
          "student_name": "Ashish Baghel",
          "student_profile": null,
          "tags": [
            "react",
            "python",
            "api",
            "ml",
            "ai"
          ],
          "title": "AI-Powered Agent to provide support for Zendalona products"
        },
        {
          "code_url": null,
          "description": "In the current accessible bluff game, users often have to wait for other players to take their turn, which can be tedious and boring. To solve this, I propose an AI Bluff Bot that allows users to play anytime against the bot and adjust the difficulty based on their experience. The bot will use the Monte Carlo Simulation and Q-Learning algorithms to decide its moves and adapt to the player's strategy. Web Workers will be utilized to ensure smooth performance, even with multiple bots in the game. Additionally, the AI Mentor feature will provide real-time hints based on past moves, with players earning more hints as they play well. All bot actions and AI Mentor features will be fully accessible to ensure an inclusive gaming experience.",
          "difficulty": null,
          "id": "proj_zendalona_2025_003",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/5PRtUndn",
          "proposal_id": "21yUtJzG",
          "short_description": "In the current accessible bluff game, users often have to wait for other players to take their turn, which can be tedious and boring. To solve this,...",
          "slug": "accessible-bluff-bot",
          "status": "in-progress",
          "student_name": "Faisal Majeed",
          "student_profile": null,
          "tags": [
            "web",
            "ai"
          ],
          "title": "Accessible-Bluff Bot"
        },
        {
          "code_url": null,
          "description": "Summary:\nThe goal of this project is to improve the Linux-Intelligent OCR Solution (LIOS), an open-source tool for text extraction from images, scanned documents, and PDFs using Tesseract and Cuneiform OCR engines. The primary focus will be on enhancing usability, accessibility, and performance, particularly for visually impaired users, while also addressing several existing issues.\n\nProblem:\nLIOS is a powerful tool, but there are several issues that hinder its usability and accessibility. These include problems with the UI/UX design, scanner compatibility, OCR integration, and the lack of proper error handling, which often leads to crashes. Additionally, there are several other bugs that need attention, such as issues with text focus, icon display, and preview functionality.\n\nSolution:\nThe project will focus on addressing these issues and improving the overall user experience:\n\nUI/UX Improvements: Simplify the interface and improve accessibility, particularly for low-vision users.\n\nBug Fixes & Code Refinements: Address the following specific issues:\n\nText Focus: Ensure the textview regains focus after using Goto Line and Goto Page.\n\nTab Focus: Improve tab focus handling for better navigation.\n\nIcon Display: Fix the larger icon issue in the icon view for consistent UI presentation.\n\nPrint Preview: Fix the Print Preview functionality, which currently isn’t working as expected.\n\nError Handling: Implement proper error handling to prevent crashes and unexpected behavior.\n\nImage Rotation: Resolve the automatic deletion issue when rotating selected areas of the image.\n\nFind/Replace Accessibility: Ensure the Find and Find & Replace features are fully accessible and functional.\n\nScanner Compatibility: Improve compatibility with various scanner models, ensuring better cross-platform support.\n\nTesseract Integration: Enhance the detection of Tesseract data paths for more accurate OCR functionality.",
          "difficulty": null,
          "id": "proj_zendalona_2025_004",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/17ibgYz9",
          "proposal_id": "6NbyfqXq",
          "short_description": "Summary: The goal of this project is to improve the Linux-Intelligent OCR Solution (LIOS), an open-source tool for text extraction from images,...",
          "slug": "linux-intelligence-ocr-solutionlios-enhancement",
          "status": "in-progress",
          "student_name": "Nihal_Rodge",
          "student_profile": null,
          "tags": [
            "ios",
            "ai",
            "ui",
            "ux"
          ],
          "title": "Linux-Intelligence-OCR-Solution(LIOS) - Enhancement"
        },
        {
          "code_url": null,
          "description": "Liblouis Table Editor, a tool that helps users create and edit braille translation tables used by screen readers and braille devices. Editing these tables manually is difficult, especially when working with Unicode code points and special rules. I will add important missing features like forward and backward translation testing, fix existing bugs, improve the interface. I will also create easy-to-use installers for Linux and Windows.",
          "difficulty": "beginner",
          "id": "proj_zendalona_2025_005",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/1id80PNv",
          "proposal_id": "PaTuP05Z",
          "short_description": "Liblouis Table Editor, a tool that helps users create and edit braille translation tables used by screen readers and braille devices. Editing these...",
          "slug": "liblouis-table-editor-enhancement",
          "status": "in-progress",
          "student_name": "SahilRakhaiya05",
          "student_profile": null,
          "tags": [
            "ai",
            "ui",
            "ux"
          ],
          "title": "Liblouis table editor - Enhancement"
        },
        {
          "code_url": null,
          "description": "This project aims to enhance Maths-Mantra, an educational app designed for visually impaired primary school students (up to Grade 5), by addressing accessibility and engagement challenges in mathematics learning. Existing limitations include insufficient math-specific screen reader support, lack of multi-sensory learning, underutilized device sensors, and restricted input methods. To solve these, we will develop custom accessibility services with gesture-based navigation and audio-tactile feedback, introduce gamified learning modes covering time, currency, and spatial concepts, integrate sensors like the gyroscope and  multi-touch support for geometry exploration.",
          "difficulty": null,
          "id": "proj_zendalona_2025_006",
          "mentor_names": [],
          "project_url": "https://summerofcode.withgoogle.com/programs/2025/projects/SL9ZcwNI",
          "proposal_id": "cXlttnyA",
          "short_description": "This project aims to enhance Maths-Mantra, an educational app designed for visually impaired primary school students (up to Grade 5), by addressing...",
          "slug": "maths-mantra-enhancement",
          "status": "in-progress",
          "student_name": "SHADIL AM",
          "student_profile": null,
          "tags": [
            "ai"
          ],
          "title": "Maths-Mantra Enhancement"
        }
      ],
      "projects_url": "https://summerofcode.withgoogle.com/programs/2025/organizations/zendalona"
    }
  },
  "first_time": false,
  "contact": {
    "email": "zendalona@gmail.com",
    "guide_url": "https://zendalona.com/gsoc/",
    "ideas_url": "https://docs.google.com/document/d/1HshVGE-oQq_xx09zG2LfqfVYWRhyrASteXzabCV9eIQ/edit?usp=sharing",
    "irc_channel": "https://telegram.me/zendalona_gsoc",
    "mailing_list": "https://groups.google.com/g/zendalona_gsoc_2024"
  },
  "social": {
    "blog": "https://groups.google.com/g/zendalona_gsoc_2024",
    "discord": null,
    "facebook": null,
    "github": null,
    "gitlab": null,
    "instagram": null,
    "linkedin": null,
    "mastodon": null,
    "medium": null,
    "reddit": null,
    "slack": null,
    "stackoverflow": null,
    "twitch": null,
    "twitter": null,
    "youtube": null
  },
  "meta": {
    "version": 1,
    "generated_at": "2026-01-25T15:28:54.488Z"
  }
}